[
  {
    "published": "Wed, 19 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      18,
      0,
      0,
      2,
      323,
      0
    ],
    "title": "FACC AG increases revenue in Q3 2025, anticipates €1 billion by year-end",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FACC AG increases revenue in Q3 2025, anticipates €1 billion by year-end"
    },
    "summary": "Revenue is up 8.6% compared to the same period in 2024, and the highest FACC has seen since its founding. Cost reduction operations and efficiency enhancement programs continue to maintain the company&rsquo;s efficiency.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Revenue is up 8.6% compared to the same period in 2024, and the highest FACC has seen since its founding. Cost reduction operations and efficiency enhancement programs continue to maintain the company&rsquo;s efficiency."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-facc-quality-workmanship-general-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"FACC Academy student.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-facc-quality-workmanship-general-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Highly qualified employees perform quality work at FACC. In the FACC Academy, the company focuses on comprehensive training and further education of the crew. Source |&nbsp;FACC/Gortana</p>\n</div>\n\n<p>In the first 9 months of the 2025 financial year,&nbsp;<a href=\"https://www.facc.com/en/\" target=\"_blank\">FACC</a>&nbsp;(Ried im Innkreis, Austria) reports that it&nbsp;achieved revenue growth of 8.6%, reaching&nbsp;&euro;697.6 million. Reported earnings (EBIT) amounted to &euro;21.5 million in the reporting period (comparable period 2024: &euro;21.8 million) and continue to be impacted by disruptions in international supply chains and material cost increases.</p>\n\n<p>The aviation industry continued its long-standing and constant growth course of recent years in Q3 2025. Due to long-term contracts with all major manufacturers, FACC AG was able to benefit from this development in Q3 as well. The company&rsquo;s achieved revenue is the highest in this period since FACC was founded (1989). The goal of the entire aviation industry is to continue on this growth course and to support the demand of airlines with a continuous ramp-up of production rates.</p>\n\n<p>FACC&rsquo;s cost-cutting and efficiency-enhancing program, which has been in place since autumn 2024, is showing initial success. In FACC Academy, <a href=\"https://www.compositesworld.com/news/facc-academy-launches-begins-training-and-onboarding-operations\" target=\"_blank\">which was&nbsp;established in 2024</a>, more than 2,700 participants have taken&nbsp;part in a total of 257 courses and production training. As a result of these trainings, the number of employees at FACC was&nbsp;kept almost the same as in the same period of the previous year (+76 FTE),&nbsp;while increasing revenue.</p>\n\n<p>Targeted implementation of the cost reduction and efficiency enhancement program continues to be the top priority of FACC&rsquo;s management team, with a focus on further increasing efficiency in operations, compensating for global inflation effects and restructuring the supply chain to reduce the sharp rise in material costs, especially in Europe. In addition, despite increased revenue, there are first sustainable positive effects in the reduction of safety inventories and thus an improvement in cash flow, FACC AG reports.</p>\n\n<p>Based on current customer forecasts, FACC management expects revenue for the 2025 financial year to be around &euro;1 billion, which corresponds to a growth target of more than 10%. The operating result (EBIT) will continue to increase as planned and will be between 4-5% at group level (EBIT margin). The forecast for the financial year is based on the premise that there will be no change in the currently known global conditions.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/facc-ag-increases-revenue-in-q3-2025-anticipates-1-billion-by-year-end"
      }
    ],
    "link": "https://www.compositesworld.com/news/facc-ag-increases-revenue-in-q3-2025-anticipates-1-billion-by-year-end"
  },
  {
    "published": "Wed, 19 Nov 2025 12:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      17,
      30,
      0,
      2,
      323,
      0
    ],
    "title": "OCSiAl to develop Luxembourg graphene nanotube hub",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "OCSiAl to develop Luxembourg graphene nanotube hub"
    },
    "summary": "Aiming to make it the largest in the world, the $300 million flagship facility will serve as a scalable, energy-efficient manufacturing center for European advanced materials.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Aiming to make it the largest in the world, the $300 million flagship facility will serve as a scalable, energy-efficient manufacturing center for European advanced materials."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ocsial.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ocsial.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | OCSiAl LLC</p>\n</div>\n\n<p>Deep-tech company <a href=\"https://www.compositesworld.com/suppliers/ocsial\" target=\"_blank\">OCSiAl&nbsp;LCC</a> (Leudelange,&nbsp;Luxembourg) has signed a&nbsp;land lease launching the development of its&nbsp;flagship graphene nanotube production center in&nbsp;Differdange, Luxembourg, which will become what the company plans to be the &ldquo;world&rsquo;s largest&rdquo;&nbsp;graphene nanotube production facility.</p>\n\n<p>This official announcement&nbsp;is&nbsp;a&nbsp;culmination of a years-long effort by the company and the Luxembourg government, including an&nbsp;investment round&nbsp;raised&nbsp;from a &ldquo;club&rdquo; of&nbsp;Luxembourg-based&nbsp;investors&nbsp;and the&nbsp;signing&nbsp;with the state of Luxembourg&nbsp;of a long-term land lease for a 3.63-hectare site&nbsp;in Differdange.</p>\n\n<p>Founded in 2010, OCSiAl is a large producer of graphene nanotubes,&nbsp;ideal for enhancing the mechanical, electrical, optical&nbsp;and thermal properties of<strong>&nbsp;</strong>fiber-reinforced composites. OCSiAl&rsquo;s nanotubes, currently produced only in Serbia, where the company is increasing production capacity fourfold, are already used in more than 10% of smartphones sold today and in more than one million electric vehicles worldwide.&nbsp;</p>\n\n<p>&ldquo;Graphene nanotubes can improve over half of the materials we use every day, from safer batteries to longer-lasting tires and ultralight protective equipment,&rdquo; says&nbsp;Alain Kinsch,&nbsp;a member&nbsp;of the&nbsp;OCSiAl board of directors. &ldquo;We thank the Luxembourg government for enabling this project through the land lease and for fostering an environment where innovation and industrial ambition can thrive.&rdquo;</p>\n\n<p>With a planned investment of $300 million and creation of more than 300 new jobs, the facility, to be launched in stages from 2028-2030, will strengthen Europe&rsquo;s role in the global advanced materials value chain and serve as a development hub for engineers and scientists.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ocsial-to-develop-luxembourg-graphene-nanotube-hub"
      }
    ],
    "link": "https://www.compositesworld.com/news/ocsial-to-develop-luxembourg-graphene-nanotube-hub"
  },
  {
    "published": "Wed, 19 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      17,
      0,
      0,
      2,
      323,
      0
    ],
    "title": "Joby eVTOL moves toward final stages of certification, builds global AAM framework",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Joby eVTOL moves toward final stages of certification, builds global AAM framework"
    },
    "summary": "Propeller blade manufacturing in Dayton facility, final stages of&nbsp;FAA type certification and the creation&nbsp;of Middle Eastern air taxis services.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Propeller blade manufacturing in Dayton facility, final stages of&nbsp;FAA type certification and the creation&nbsp;of Middle Eastern air taxis services."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-joby-propeller-blade-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-joby-propeller-blade-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>A propeller blade for Joby&rsquo;s aircraft in the manufacturing process at its Dayton, Ohio facility. Layers of high strength carbon fiber are applied to achieve precise design specifications. Source | Joby Aviation</p>\n</div>\n\n<p>Since <em>CW</em>&rsquo;s last report on electric vertical takeoff and landing (eVTOL) aircraft manufacturer <a href=\"https://www.jobyaviation.com/\" target=\"_blank\">Joby Aviation</a> (Santa Cruz, Calif., U.S.) in August 2025, the company has continued to rapidly lay the groundwork for the start of commercial flights in early 2026 (specifically in Dubai). Milestones include beginning power-on testing of its first conforming S4 aircraft on Nov. 5, and new commitments with the Middle East, including plans for an&nbsp;air taxi service in Saudi Arabia and updates to Dubai&rsquo;s aircraft network development (Joby received exclusive rights <a href=\"https://www.compositesworld.com/news/joby-to-launch-evtol-aircraft-service-in-the-uae\" target=\"_blank\">to fly in Dubai</a> in 2024), joining the U.S., the U.K., Japan and South Korea.</p>\n\n<h3>Propeller manufacturing begins</h3>\n\n<p>At the end of October 2025, Joby began&nbsp;manufacturing propeller blades <a href=\"https://www.compositesworld.com/news/joby-expands-california-and-ohio-manufacturing-capacity-adds-new-aircraft-to-fleet\" target=\"_blank\">at its Dayton, Ohio facility</a>, which further supports eVTOL&nbsp;aircraft production ahead of commercial launch.&nbsp;&ldquo;Joby&rsquo;s propeller blades are a key part of what makes our aircraft special &mdash;&nbsp;central to its low acoustic profile and the result of a decade of complex engineering,&rdquo; says Eric Allison, chief production officer at Joby.&nbsp;</p>\n\n<p>Designed for quiet flight and built with extreme precision, the propeller blades require complex carbon fiber manufacturing processes and a highly skilled workforce, both available in Dayton. With five blades per propeller and 30 per aircraft, production could reach up to 15,000 blades a year as part of Joby&rsquo;s plan to scale in Ohio. Conforming blades &mdash;&nbsp;those meeting all requirements for FAA inspection and certification &mdash;&nbsp;are expected to be completed this&nbsp;month, with installation on flight test aircraft targeted for 2026.</p>\n\n<p>Over time, Joby&rsquo;s Dayton footprint is expected to be able to support production of up to 500 aircraft a year, making this facility a strategic site for the mass production of its aircraft components.</p>\n\n<h3>Path to commercialization</h3>\n\n<p>On Nov. 5, Joby began power-on testing of the first of several Federal Aviation Administration (FAA)-conforming aircraft&nbsp;to be built for type inspection authorization (TIA). This enables the company to begin conducting&nbsp;thousands of hardware and software integration tests in preparation for &ldquo;for credit&rdquo; flight testing with FAA test pilots operating the aircraft. TIA testing is part of the final stage of the FAA type certification (TC) process &mdash; with&nbsp;flight testing by Joby pilots expected to start later in 2025, ahead of FAA pilots taking the controls in 2026.</p>\n\n<p>During TIA testing, Joby will be working side-by-side with the FAA to ensure the aircraft meets all safety and performance requirements. The testing includes performance validation, control and handling, and maintenance and operations. Data collected&nbsp;during these TIA tests will be used by the FAA to make its final determination on issuing a TC&nbsp;for Joby&rsquo;s aircraft.</p>\n\n<h3>Building services in Saudi Arabia</h3>\n\n<p>On Nov. 12, Joby and the&nbsp;General Authority of Civil Aviation (GACA, Riyadh) of the Kingdom of Saudi Arabia announced a memorandum of understanding (MOU) that will use FAA&nbsp;certification standards as a foundation to create a streamlined approval process for Joby&rsquo;s aircraft in Saudi Arabia.</p>\n\n<p>To support the development of the Kingdom&rsquo;s&nbsp;air taxi regulatory framework, Joby and GACA will focus on three core initiatives based on Joby&rsquo;s FAA certification efforts:</p>\n\n<ul>\n\t<li>Provide technical expertise across type design, production&nbsp;and operational domains to inform the development of a comprehensive regulatory framework that ensures the safe, efficient&nbsp;and scalable deployment of advanced air mobility (AAM) aircraft within the Kingdom.</li>\n\t<li>Collaboration on airworthiness standards, ensuring an efficient validation process of the FAA TC.</li>\n\t<li>Development and harmonization of key regulations to enable the initial phase of operations, including pilot licensing, maintenance&nbsp;and airspace integration frameworks.</li>\n</ul>\n\n<p>Joby&rsquo;s broader commercialization strategy in Saudi Arabia includes key partnerships with&nbsp;Abdul Latif Jameel, which is exploring delivery of up to 200 Joby aircraft valued at approximately $1 billion, and&nbsp;Aloula&nbsp;Aviation (formerly&nbsp;Mukamalah Aviation), the aviation subsidiary of Saudi Aramco. The announcement also builds on the renewed economic partnership between the U.S. administration and the Saudi government.</p>\n\n<h3>Dubai air taxi network takes flight</h3>\n\n<p>On Nov. 17, the&nbsp;next three vertiports to be added to Dubai&rsquo;s&nbsp;electric air taxi network, alongside Dubai&rsquo;s Road and Transport Authority (RTA) and Skyports Infrastructure, were announced.&nbsp;The sites &mdash;&nbsp;at the American University of Dubai, Atlantis the Royal and the Dubai Mall&nbsp;&mdash;&nbsp;will enable Joby to deliver high-speed, emissions-free connections between some of Dubai&rsquo;s most high-profile destinations, as part of its 6-year exclusive agreement with the RTA to establish air taxi services in the Emirate.&nbsp;</p>\n\n<p>The news came&nbsp;as Joby successfully completed a landmark flight test in the UAE on Nov. 9. Joby landed its aircraft at Al Maktoum International Airport (DWC) following a 17-minute piloted flight from its test facility in Margham, underscoring Joby&rsquo;s commercial market readiness and ability to operate in shared airspace.</p>\n\n<p>Alongside the vertiport at Dubai International Airport, which is set to be completed in Q1 2026, these sites will make up the initial vertiport network for Joby&rsquo;s air taxi service in Dubai, which is set to launch in 2026.&nbsp;</p>\n\n<div class=\"article_sidebar\">\n<h3>Joby Q3 2025 financial highlights</h3>\n\n<p><strong>Final stage of certification.</strong>&nbsp;Joby has begun power-on testing of the first of several FAA-conforming aircraft to be built for TIA.</p>\n\n<p><strong>Maturing flight operations.</strong>&nbsp;The company&nbsp;has already conducted more than&nbsp;600 flights in 2025, along with thousands of ground-based tests.&nbsp;</p>\n\n<p><strong>U.S. administrative support for the eVTOL.&nbsp;</strong>The eVTOL Integration Pilot Program (eIPP) is designed to allow mature aircraft designs to demonstrate eVTOL use cases ahead of achieving TC. Joby is actively engaged with a wide range of state and local governments across the country who are submitting applications for eIPP projects.</p>\n\n<p><strong>Scaling production capacity.&nbsp;</strong>Joby added more than 100 manufacturing roles and has now begun production of propeller blades at its facility in Dayton, Ohio, marking the first phase of its scaled production strategy. The company has already produced 15 times more type design conforming parts than it did in all of 2024.</p>\n\n<p><strong>Commercial readiness.&nbsp;</strong>The <a href=\"https://www.compositesworld.com/news/joby-preps-conforming-aircraft-for-tia-flight-testing-acquires-blade-air-mobility\" target=\"_blank\">recently-acquired Blade passenger service</a> transported approximately 40,000 passengers during Q3. Joby also expanded its global partnership with Uber to incorporate Blade&rsquo;s services directly into the Uber app.</p>\n\n<p><strong>Future technology platform.</strong>&nbsp;Just 3 months after announcing its partnership with L3Harris, Joby began <a href=\"https://www.jobyaviation.com/news/joby-celebrates-first-flight-of-turbine-electric-demonstrator-aircraft/\" target=\"_blank\">ground testing the hybrid-electric autonomous aircraf</a>t it is developing for U.S. defense purposes. Joby also successfully demonstrated its autonomous flight technology, Superpilot, during a major defense exercise over the Pacific Ocean.&nbsp;</p>\n\n<p><strong>Strong balance sheet.&nbsp;</strong>Joby ended the quarter with $978.1 million in cash, cash equivalents&nbsp;and investments in marketable securities. Additionally, in October 2025, the company completed an underwritten equity offering. Net proceeds from the offering were approximately $576 million and are expected to be used to support certification and manufacturing efforts, prepare for commercial operations&nbsp;and provide general working capital and other corporate purposes.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/joby-evtol-moves-toward-final-stages-of-certification-builds-global-aam-framework"
      }
    ],
    "link": "https://www.compositesworld.com/news/joby-evtol-moves-toward-final-stages-of-certification-builds-global-aam-framework"
  },
  {
    "published": "Wed, 19 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      17,
      0,
      0,
      2,
      323,
      0
    ],
    "title": "ILCA, Greenboats chart environmentally responsible one-design dinghy racing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ILCA, Greenboats chart environmentally responsible one-design dinghy racing"
    },
    "summary": "Organization ILCA is pairing up with natural fiber innovators like Greenboats to reduce environmental footprint while maintaining the class&rsquo; strict one-design principles.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Organization ILCA is pairing up with natural fiber innovators like Greenboats to reduce environmental footprint while maintaining the class&rsquo; strict one-design principles."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-greenboats-icla.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-greenboats-icla.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Greenboats</p>\n</div>\n\n<p>The <a href=\"https://ilcasailing.org/\" target=\"_blank\">International Laser Class Association</a> (ILCA, Austin, Texas, U.S.), a&nbsp;World Sailing Olympic Class organization that coordinates and oversees the ILCA dinghy activities worldwide,&nbsp;and natural fiber composites company <a href=\"https://www.green-boats.com/\" target=\"_blank\">Greenboats GmbH</a> (Bremen, Germany) have announced an&nbsp;ongoing strategic partnership to explore and develop environmentally responsible innovation within ILCA dinghy&rsquo;s production. This collaboration builds on the <a href=\"https://www.compositesworld.com/articles/evolving-natural-fiber-technology-to-meet-industry-sustainability-needs\" target=\"_blank\">long- standing sustainability work</a> of both organizations and reflects a shared objective: to reduce the ILCA dinghy&rsquo;s environmental footprint while maintaining the fairness, integrity and legacy of ILCA one-design racing.</p>\n\n<p>Sailing is intrinsically connected to nature, yet the industry and equipment rely heavily on petroleum-based composites with significant carbon impacts. Builders, sailors&nbsp;and regulators are increasingly seeking sustainable solutions; yet innovation must preserve the class&rsquo;s strict one-design principles to protect fairness and performance while leveraging on the power of the long established legacy of the class.</p>\n\n<p>Together, ILCA and Greenboats are launching a two-track initiative:</p>\n\n<ul>\n\t<li>1.&nbsp;<strong>Long-term vision.</strong>&nbsp;Develop a low-emission ILCA concept that reimagines dinghy construction for the future.</li>\n\t<li>2.&nbsp;<strong>Incremental innovation.</strong>&nbsp;In the near term, trial sustainable materials on isolated areas of the boat or on smaller components of the equipment with a vision of adopting innovation in a stepped approach.</li>\n</ul>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ilca2024.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ilca2024.jpg;maxWidth=385\" /></a></div>\n\n<p>ILCA 7 Mens World Championship 2024. Source | Down Under Sail</p>\n</div>\n\n<p>Greenboats will lead technical research, supply chain&nbsp;and co-manufacture of prototypes, while ILCA will ensure rigorous life cycle assessments, compliance with&nbsp;the relevant authorities and alignment with class governance as well as ILCA-approved builders and suppliers. The key functioning pillars for this partnership are:</p>\n\n<p><strong>Collaboration.</strong>&nbsp;ILCA and Greenboats teams will work together to identify, evaluate, engineer and develop solutions and implementation roadmaps for various material replacement initiatives with the ultimate aim to reduce the net emissions of an ILCA dinghy,&nbsp;part by part. This work will expand on what has been researched and documented by masters student Lucca Günther on his Greenboats- and ILCA-supported Masters thesis project delivered earlier in 2025.</p>\n\n<p><strong>Governance alignment.</strong>&nbsp;Any proposed innovations will be reviewed to ensure compliance with the ILCA Build Manual and Class Rules and undergo the Class&rsquo; Approval Processes engaging with its Builders and World Sailing.</p>\n\n<p><strong>Stakeholder engagement:</strong>&nbsp;Builders, sailors, material suppliers&nbsp;and regulators will be included through initiatives, dedicated stakeholder forums and&nbsp;feedback protocols to gather real feedback and ensures innovation is relevant and impactful where it really matters. Both ILCA and&nbsp;Greenboats will keep stakeholders informed via newsletters and appearances at key events.</p>\n\n<p><strong>Collaboration network.</strong>&nbsp;Greenboats will leverage its supplier base and 15 years of biocomposites innovation, while ILCA ensures class-wide coordination and transparency.</p>\n\n<p>ILCA members and the global sailing community are invited to follow progress, share feedback&nbsp;and participate in upcoming sustainability webinars. Material suppliers with innovative bio-based solutions are encouraged to contact ILCA or Greenboats for potential collaboration. Initial findings will be presented at upcoming industry events and webinars.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ilca-greenboats-chart-environmentally-responsible-one-design-dinghy-racing"
      }
    ],
    "link": "https://www.compositesworld.com/news/ilca-greenboats-chart-environmentally-responsible-one-design-dinghy-racing"
  },
  {
    "published": "Wed, 19 Nov 2025 11:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      16,
      30,
      0,
      2,
      323,
      0
    ],
    "title": "Boeing South Carolina breaks ground on 787 site expansion",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Boeing South Carolina breaks ground on 787 site expansion"
    },
    "summary": "Home to the 787 Dreamliner&nbsp;program, the S.C. site&rsquo;s expanded footprint will support future 787 production increases as global demand grows.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Home to the 787 Dreamliner&nbsp;program, the S.C. site&rsquo;s expanded footprint will support future 787 production increases as global demand grows."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-boeing-final-assembly-building-rendering.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"A rendering of Boeing’s second 787 final assembly building when complete. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-boeing-final-assembly-building-rendering.jpg;maxWidth=720\" /> </a></div>\n\n<p>A rendering of Boeing&rsquo;s second 787 final assembly building when complete. Source | Boeing</p>\n</div>\n\n<p>In early November 2025,&nbsp;<a href=\"https://www.boeing.com/\" target=\"_blank\">Boeing</a>&nbsp;(Arlington, Va., U.S.) marked the groundbreaking of its Boeing South Carolina (BSC) site expansion. Home of the 787 <em>Dreamliner</em> program, BSC is set to increase production to a rate of 10 airplanes/month in 2026. The expansion will enable the site to support higher 787 production rates given strong market demand.</p>\n\n<p>In late 2024, Boeing announced plans to expand and upgrade its site near Charleston&nbsp;International Airport and a second campus. The company is investing more than&nbsp;$1 billion&nbsp;in this infrastructure program and plans to create more than 1,000 new jobs over the next 5 years. The expansion will include:</p>\n\n<ul>\n\t<li>A new final assembly building similar in size to the current final assembly building, which is roughly 1.2 million square feet. It will include airplane production positions, production support and office space.</li>\n\t<li>A parts preparation area facility, a vertical fin paint facility, Flight Line stalls and more at the airport campus.</li>\n\t<li>Additions to the Interiors Responsibility Center, where many of the 787&rsquo;s interior components are made.</li>\n</ul>\n\n<p>Ninety customers from around the world have placed more than 2,250 orders for the 787 <em>Dreamliner</em> family. After more than 1,200 deliveries, the 787 backlog stands at nearly 1,000 airplanes, including more than 300 orders added just in 2025. In all, the commercial aviation industry is expected to need more than 7,800 new widebody airplanes over the next two decades, according to Boeing&rsquo;s Commercial Market Outlook.</p>\n\n<p>&ldquo;We continue to see strong demand for the 787 <em>Dreamliner</em> family and its efficiency and versatility. We are making this significant investment to ensure Boeing is ready to meet its customer&rsquo;s needs in the years and decades ahead,&rdquo; says Stephanie Pope, president and CEO of Boeing Commercial Airplanes.</p>\n\n<p>For more than a decade, BSC has been the home of the full 787 <em>Dreamliner</em> production cycle. Teammates fabricate, assemble and deliver the three Dreamliner models &mdash;&nbsp;787-8, 787-9 and 787-10 &mdash;&nbsp;to customers globally. The company established operations in&nbsp;South Carolina&nbsp;in 2009 and currently employs more than 8,200 people across its campuses in&nbsp;North Charleston&nbsp;and in&nbsp;Orangeburg.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/boeing-south-carolina-breaks-ground-on-787-site-expansion"
      }
    ],
    "link": "https://www.compositesworld.com/news/boeing-south-carolina-breaks-ground-on-787-site-expansion"
  },
  {
    "published": "Wed, 19 Nov 2025 11:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      16,
      0,
      0,
      2,
      323,
      0
    ],
    "title": "Hycco, H3 Dynamics to form joint venture targeting long-range electric flight",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hycco, H3 Dynamics to form joint venture targeting long-range electric flight"
    },
    "summary": "H3 Dynamics&rsquo; hydrogen-electric hybrid systems and Hycco&rsquo;s&nbsp;composite hydrogen fuel cell stacks will&nbsp;build European aerospace, defense 100% electric aircraft sovereignty.&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "H3 Dynamics&rsquo; hydrogen-electric hybrid systems and Hycco&rsquo;s&nbsp;composite hydrogen fuel cell stacks will&nbsp;build European aerospace, defense 100% electric aircraft sovereignty.&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-hyccoh3d.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </a></div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-h3dynamics-hycco.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"H3 Dynamics and Hycco general graphic.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-h3dynamics-hycco.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Hycco</p>\n</div>\n\n<p><a href=\"https://www.h3dynamics.com\" target=\"_blank\">H3 Dynamics</a> (Toulouse), a French manufacturer of hydrogen-electric<br />\nhybrid systems for aerospace and defense, and <a href=\"https://www.hycco.fr\" target=\"_blank\">Hycco</a>&nbsp;(Toulouse), designer of a new generation of ultra-thin composite materials used in hydrogen fuel cell stacks, have&nbsp;announced a strategic alliance.</p>\n\n<p>Under this agreement, the two companies are preparing the creation of a joint venture that will combine know-how, equipment&nbsp;and expertise to produce the world&rsquo;s highest-performance hydrogen fuel cell stacks, meeting the strictest regulatory and operational requirements of aerospace and defense &mdash;&nbsp;sectors that are cornerstones of European sovereignty.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>Hycco&nbsp;develops advanced materials based on ultra-thin carbon fiber composites for high-performance<br />\nelectrochemical cells. Used as bipolar plates in fuel cells, they enable a doubling of power density compared to current fuel cell technologies. Read &ldquo;<a href=\"https://www.compositesworld.com/articles/composite-bipolar-plates-provide-81-improvement-to-hydrogen-fuel-cell-power-density\" target=\"_blank\">Composite bipolar plates provide 81% improvement to hydrogen fuel cell power density</a>&rdquo; for more info.</p>\n</div>\n</div>\n\n<p>For civil aviation, the electrification of flight paves the way for the sector&rsquo;s concrete decarbonization. Hydrogen-electric hybrid systems enables long-range flights for a wide variety of 100% electric aircraft: light aviation, VTOLs, helicopters, business jets, seaplanes, airships&nbsp;and, at a later stage, commercial aircraft.</p>\n\n<p>At the same time, European armed forces aim to conduct long-range drone missions (air, sea, land); electric propulsion significantly reduces thermal and acoustic signatures. Through the integration of hydrogen technologies, a generation of 100% electric drones &mdash; small, lightweight, low-cost, scalable and&nbsp;rapidly deployable &mdash; will be able to&nbsp;carry out missions spanning hundreds or even thousands of kilometers.</p>\n\n<p>Through&nbsp;this alliance, the French ecosystem is bridging&nbsp;the gap between deep-tech innovations born in France and international application markets. Already, H3 Dynamics is initiating a broad movement that brings together leading players to design, improve&nbsp;and industrialize high-performance, certifiable aerospace equipment. The company is also developing downstream&nbsp;partnerships in light aerial, ground&nbsp;and maritime robotics.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hycco-h3-dynamics-to-form-joint-venture-targeting-long-range-electric-flight"
      }
    ],
    "link": "https://www.compositesworld.com/news/hycco-h3-dynamics-to-form-joint-venture-targeting-long-range-electric-flight"
  },
  {
    "published": "Wed, 19 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      15,
      0,
      0,
      2,
      323,
      0
    ],
    "title": "Global 8000 business jet is awarded Transport Canada type certification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Global 8000 business jet is awarded Transport Canada type certification"
    },
    "summary": "Bombardier four-zone business jet&nbsp;on track for entry into service in 2025 exceeds original cabin altitude targets, confirms&nbsp;Mach 0.95 speed and 8,000-nautical mile range.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Bombardier four-zone business jet&nbsp;on track for entry into service in 2025 exceeds original cabin altitude targets, confirms&nbsp;Mach 0.95 speed and 8,000-nautical mile range."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-bombardier-inflight-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Global 8000 jet in flight.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-bombardier-inflight-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Bombardier</p>\n</div>\n\n<p>Earlier this month,&nbsp;<a href=\"https://bombardier.com/en\" target=\"_blank\">Bombardier</a>&rsquo;s (Montreal, Canada) <em>Global 8000</em> business aircraft was&nbsp;awarded Transport Canada type certification (TC), paving the way for entry into service (&ldquo;read &ldquo;<a href=\"https://www.compositesworld.com/news/bombardier-begins-manufacture-of-global-8000-business-jet\" target=\"_blank\">Bombardier begins manufacture of Global 8000 business jet</a>&rdquo;). Federal Aviation Administration (FAA) and European Aviation Safety Agency (EASA) certification will follow, aligned with delivery requirements.</p>\n\n<p>This accomplishment marks the latest in a series of monumental achievements for the&nbsp;<em>Global 8000</em><sup>&nbsp;</sup><em>&nbsp;</em>business jet, which went supersonic in testing, completed its inaugural first production flight in May 2025 and recently announced a new top speed of Mach 0.95. The&nbsp;aircraft has also completed its TC&nbsp;with a new industry benchmark for cabin altitude &mdash;&nbsp;2,691 feet&nbsp;at 41,000 feet, the best of any business aircraft in production&nbsp;Bombardier reports.</p>\n\n<p>&ldquo;Bombardier has worked rigorously and collaboratively with Transport Canada toward certification for the&nbsp;<em>Global 8000</em>,&rdquo; says Stephen McCullough, senior vice president, engineering and product development, Bombardier. &ldquo;This milestone is a testament to the talent and dedication of our engineering, test and production teams.&rdquo;</p>\n\n<p>With a low cabin altitude at 2,691 feet, customers will &ldquo;feel like they are standing atop the Burj Khalifa&rdquo; as they cruise at 41,000 feet.&nbsp;This&nbsp;reduced cabin altitude minimizes the physiological stress typically associated with high-altitude travel, helping passengers arrive feeling refreshed, alert&nbsp;and ready to perform.&nbsp;Combined with its luxurious interior, signature smooth ride and high performance capabilities, the&nbsp;<em>Global 8000&nbsp;</em>is meant to be a clear choice for discerning owners and operators who prioritize speed, comfort, convenience and productivity.&nbsp;</p>\n\n<p>The&nbsp;<em>Global 8000</em>, adds Bombardier&nbsp;is also &ldquo;the only four-zone business jet&rdquo; to offer a range of 8,000 nautical miles, enabling nonstop travel between more city pairs than ever before. In addition to its long-range capabilities, the aircraft remains remarkably agile, with takeoff and landing performance comparable to that of a light jet. Its advanced wing design featuring leading-edge slats enable customers to master 30% more airports than its closest rival.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/global-8000-business-jet-is-awarded-transport-canada-type-certification"
      }
    ],
    "link": "https://www.compositesworld.com/news/global-8000-business-jet-is-awarded-transport-canada-type-certification"
  },
  {
    "published": "Tue, 18 Nov 2025 09:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      18,
      14,
      0,
      0,
      1,
      322,
      0
    ],
    "title": "Exel Composites, De Angeli Prodotti sign multiyear agreement for composite conductor cores supply",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Exel Composites, De Angeli Prodotti sign multiyear agreement for composite conductor cores supply"
    },
    "summary": "A&nbsp;&euro;25 million&nbsp;minimum volume commitment starting Q1 2026 will fulfill&nbsp;global power transmission infrastructure modernization.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A&nbsp;&euro;25 million&nbsp;minimum volume commitment starting Q1 2026 will fulfill&nbsp;global power transmission infrastructure modernization."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Exel-DeAngeli-power-transmission-line.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Power transmission lines. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Exel-DeAngeli-power-transmission-line.jpg;maxWidth=720\" /> </a></div>\n\n<p>Power transmission lines. Source | Exel Composites</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/exel-composites-plc\" target=\"_blank\">Exel Composites</a>&nbsp;(Vantaa, Finland) has signed a multiyear frame agreement with Italian conductor specialist <a href=\"https://www.deangeliprodotti.com/\" target=\"_blank\">De Angeli Prodotti</a>&nbsp;(Bagnoli di Sopra) for supply of composite conductor cores. The agreement covers deliveries spanning 4 years and includes a minimum volume commitment of &euro;25 million to Exel during the contract period. Deliveries under the agreement are scheduled to begin in Q1 2026.</p>\n\n<p>&ldquo;De Angeli Prodotti is a respected innovator in overhead conductors, and we value our long-standing collaboration with Dr. Luca Mora and his team,&rdquo; says Paul Sohlberg, president and CEO of Exel Composites. &ldquo;The energy transition, electrification&nbsp;and sustainability requirements are driving growth in this space and composite core conductors are a perfect fit with Exel&rsquo;s strategy in the long term.&rdquo;</p>\n\n<p>According to Luca Mora, president of De Angeli Prodotti, &ldquo;This frame agreement secures solid fundamentals to guarantee a high level of service and capacity for our customers as they plan and deliver grid upgrades.&rdquo;</p>\n\n<p>Composite conductor cores are the central strength member of an overhead transmission conductor and are a growing application for carbon fiber composites as they offer optimal properties compared to traditional materials. Composite cores allow overhead power lines to carry more current, waste less energy and sag less while achieving longer spans, enabling utilities to add capacity on existing lines without rebuilding.</p>\n\n<p>Exel will manufacture the cores using continuous pultrusion and quality-controlled processes that deliver consistent mechanical performance. The orders will be fulfilled from Exel&rsquo;s global manufacturing network according to project schedules agreed with De Angeli Prodotti.</p>\n\n<p>Read the case study about the successful partnership of Exel Composites and De Angeli Prodotti <a href=\"https://exelcomposites.com/case-studies/composite-conductor-core-de-angeli/\" target=\"_blank\">here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/exel-composites-de-angeli-prodotti-sign-multiyear-agreement-for-composite-conductor-cores-supply"
      }
    ],
    "link": "https://www.compositesworld.com/news/exel-composites-de-angeli-prodotti-sign-multiyear-agreement-for-composite-conductor-cores-supply"
  },
  {
    "published": "Tue, 18 Nov 2025 08:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      18,
      13,
      0,
      0,
      1,
      322,
      0
    ],
    "title": "Aptera Motors initiates validation line for BinC solar electric vehicle",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aptera Motors initiates validation line for BinC solar electric vehicle"
    },
    "summary": "Next step toward scaled, repeatable&nbsp;manufacturing will support everything from materials handling to final fit and finish.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Next step toward scaled, repeatable&nbsp;manufacturing will support everything from materials handling to final fit and finish."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-aptera-binc.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Assembly of the BinC vehicle.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-aptera-binc.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Aptera</p>\n</div>\n\n<p>Solar mobility company <a href=\"https://aptera.us/\" target=\"_blank\">Aptera Motors Corp</a><em><a href=\"https://aptera.us/\" target=\"_blank\">.</a> </em>(Carlsbad, Calif., U.S.)<strong>&nbsp;</strong>has begun building out its solar electric (sEV) validation vehicle assembly line, a critical step that lays the foundation for its future low-volume production line at the company&rsquo;s Southern California assembly facility.&nbsp;</p>\n\n<p>The new line&nbsp;represents&nbsp;a tangible move from prototype builds to a structured, repeatable assembly process. Engineers and technicians are now refining the systems, tools&nbsp;and procedures that will guide Aptera&rsquo;s transition into scalable manufacturing.&nbsp;</p>\n\n<p>&ldquo;This marks an important moment in Aptera&rsquo;s journey,&rdquo; says&nbsp;Chris Anthony, Co-CEO of Aptera. &ldquo;For the first time, our technicians&nbsp;will be&nbsp;assembling vehicles along a defined sequence of stations, using processes developed hand-in-hand with the engineers who designed them.&rdquo;&nbsp;</p>\n\n<p>At the heart of the new setup is a large-scale precision assembly fixture that enables Aptera&rsquo;s Body in Carbon (BinC) to be built with high dimensional accuracy. The fixture enhances throughput, ensures consistency and&nbsp;establishes&nbsp;a technical baseline for Aptera&rsquo;s future expansion into low-volume assembly.</p>\n\n<blockquote>\n<p>Read &ldquo;<a href=\"https://www.compositesworld.com/articles/smc-composites-progress-binc-solar-electric-vehicles-\">SMC composites progress BinC solar electric vehicles</a>.&rdquo;</p>\n</blockquote>\n\n<p>Aptera has expanded its operations team and continues to hire engineers and assembly line technicians to support the buildout.&nbsp;With BinC components and chassis assemblies now arriving from supply chain partners, the company has begun assembling validation vehicles through this repeatable process.&nbsp;</p>\n\n<p>&ldquo;Seeing this line come to life signals the next phase for Aptera,&rdquo; adds&nbsp;Steve Fambro, Co-CEO. &ldquo;It&rsquo;s the bridge between our&nbsp;prototype&nbsp;builds and the&nbsp;preproduction and series&nbsp;production systems&nbsp;that&nbsp;we&nbsp;aim&nbsp;to&nbsp;one day&nbsp;use to&nbsp;deliver solar mobility at scale.&rdquo;</p>\n\n<p>The validation&nbsp;assembly&nbsp;process will enable Aptera to&nbsp;optimize&nbsp;every stage of&nbsp;low-volume&nbsp;vehicle assembly, from materials handling to final fit and finish, in preparation for customer-ready production.&nbsp;To&nbsp;advance through this stage&nbsp;and&nbsp;initiate&nbsp;low-volume production,&nbsp;the cestimates&nbsp;it&nbsp;will require&nbsp;$65 million in funding,&nbsp;consistent with its previously disclosed plans.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aptera-motors-initiates-validation-line-for-binc-solar-electric-vehicle"
      }
    ],
    "link": "https://www.compositesworld.com/news/aptera-motors-initiates-validation-line-for-binc-solar-electric-vehicle"
  },
  {
    "published": "Mon, 17 Nov 2025 23:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      18,
      4,
      0,
      0,
      1,
      322,
      0
    ],
    "title": "Airbus ships fourth European Service Module for Artemis IV",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus ships fourth European Service Module for Artemis IV"
    },
    "summary": "Composites-intensive ESMs gives&nbsp;the Orion spacecraft&nbsp;power, propulsion and life support but also provide&nbsp;a vital gateway for the first lunar space station, Gateway.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Composites-intensive ESMs gives&nbsp;the Orion spacecraft&nbsp;power, propulsion and life support but also provide&nbsp;a vital gateway for the first lunar space station, Gateway."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airbus-esm-infographic.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ESM and Orion infographic.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airbus-esm-infographic.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | <a href=\"https://www.airbus.com/en/products-services/space/space-exploration/moon-missions/orion-european-service-module\" target=\"_blank\">Airbus</a></p>\n</div>\n\n<p dir=\"ltr\">The fourth European Service Module (ESM-4) is ready to leave <a href=\"https://www.airbus.com/en\" target=\"_blank\">Airbus</a>&rsquo; facilities in Bremen, Germany, and be shipped to NASA&rsquo;s Kennedy Space Center in Florida. On arrival it will be tested and integrated with the <em>Orion</em> Crew Module ready for the next stage of NASA&rsquo;s Artemis program.</p>\n\n<p dir=\"ltr\">Built by Airbus under contract to the European Space Agency (ESA), ESM-4 will be a vital part of the Artemis IV mission which envisages astronauts going to live and work in humanity&rsquo;s first lunar space station, Gateway, which will enable new opportunities for science and preparation for human missions to Mars. Each ESM&rsquo;s primary structure&nbsp;<a href=\"https://www.compositesworld.com/news/airbus-delivers-second-composites-intensive-european-service-module-for-nasas-orion-spacecraft\" target=\"_blank\">is highly composites-intensive</a>.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"European Service Module (ESM) in the background.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airbus-esm-preview.jpg;maxWidth=385\" />European Service Module (ESM). Source | Airbus</div>\n\n<div>&nbsp;</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-esa-gateway-concept-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Lunar Gateway concept.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-esa-gateway-concept-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>The lunar Gateway is to be the first international space station around the Moon and will support the most distant human space missions ever attempted. Source | ESA</p>\n</div>\n</div>\n\n<p dir=\"ltr\">&ldquo;Delivering the fourth ESM takes us one step closer to a new space era with a lunar space station and increased opportunities for deep space scientific research,&rdquo; says Ralf Zimmerman, head of space exploration at Airbus. &ldquo;Europe&rsquo;s role, through ESA, is crucial in this pioneering NASA-led program.&rdquo;</p>\n\n<p dir=\"ltr\">ESM-4 will play a key role as the Artemis IV mission is due to deliver the International Habitation Module (Lunar I-Hab) of the Lunar Gateway space station. This state-of-the-art hardware is developed by Airbus Defence and Space and its subcontractors across Europe.</p>\n\n<p dir=\"ltr\">The ESM modules provide engines, power, thermal control&nbsp;and supply astronauts with water and oxygen. The ESM is installed underneath the crew module &mdash; together they form the <em>Orion</em> spacecraft. Thales Alenia Space Italia provides the&nbsp; thermal control system to keep the <em>Orion</em> crew modules between 18-24&deg;C by radiating excess heat out of the ship but also keeping the cold at bay.</p>\n\n<p dir=\"ltr\">The four solar arrays on <em>Orion</em> generate 11.2 kilowatts&nbsp;of electricity, enough to power two four-person households on Earth. Only about 10% of the power is needed for the ESM, with the remaining 90% going to the batteries and equipment in the crew module. The Artemis I mission showed the solar panels were able to produce a little more power than expected and this additional energy will be of use as the Artemis program&nbsp;evolves.</p>\n\n<p dir=\"ltr\">The energy stored in the batteries of the Crew Module is key as it ensures that the <em>Orion</em> spacecraft has power even when the Sun is obscured. The batteries also provide power for a safe return when the ESM separates from the crew module at the end of the mission. Moreover, to enable astronauts to concentrate on important tasks, the electronics onboard the ESM, controlled by the Crew Module, provide a very high level of autonomy, such as temperature regulation and solar wing rotation to track the Sun.</p>\n\n<p dir=\"ltr\">Orion has 33 engines onboard the ESM to provide thrust and maneuvering capabilities. The main engine, a repurposed Space Shuttle orbital maneuvering system engine (OMS-E) provided by NASA, generates 26.5 kilonewtons of thrust. This provides enough force to escape Earth&rsquo;s gravitational field and perform the translunar injection burn, and to get into the Moon&rsquo;s orbit. Eight auxiliary thrusters act as back-ups to the OMS-E and for orbital corrections. There are also 24 smaller engines for attitude control in space, enabling the spacecraft to rotate or change its angle during docking manoeuvres.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-ships-fourth-european-service-module-for-artemis-iv"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-ships-fourth-european-service-module-for-artemis-iv"
  }
]