[
  {
    "published": "Mon, 4 Aug 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      18,
      0,
      0,
      0,
      216,
      0
    ],
    "title": "CARBOWAVE studies microwave and plasma-induced carbonization for carbon fiber production",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CARBOWAVE studies microwave and plasma-induced carbonization for carbon fiber production"
    },
    "summary": "The European research consortium is holistically exploring the process&rsquo; improvement and commercialization for more energy-efficient, affordable materials manufacturing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The European research consortium is holistically exploring the process&rsquo; improvement and commercialization for more energy-efficient, affordable materials manufacturing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-carbowave-stabilization-furnace-pan.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Stabilization furnace for the oxidation of PAN fibers.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-carbowave-stabilization-furnace-pan.jpg;maxWidth=720\" /> </a></div>\n\n<p>Stabilization furnace for the oxidation of PAN fibers. Source | DITF</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://www.ditf.de/en/index/ditf.html\" target=\"_blank\">German Institutes of Textile and Fiber Research Denkendorf</a>&nbsp;(DITF), as part of the European CARBOWAVE research consortium, highlights a novel technology using microwaves and plasma heating to produce carbon fibers in an energy-efficient manner, which also results in more affordable production.</p>\n\n<p>Carbon fiber production is complex and energy-intensive.&nbsp;Stabilization and carbonization of the fibers, which are often made from petroleum-based polyacrylonitrile (PAN), requires slow process control in high-temperature furnaces. Despite the considerable energy input, a low material yield is achieved due to the long dwell time in the ovens.</p>\n\n<p>CARBOWAVE&rsquo;s&nbsp;solution replaces the stabilization and carbonization process. Energy is only induced into the fibers locally, thereby minimizing energy loss. This process also shortens the production time of carbon fibers, enabling higher production volumes with lower energy consumption.</p>\n\n<blockquote>\n<p>Read &ldquo;<a href=\"https://www.compositesworld.com/news/carbowave-project-finds-alternative-to-pan-conversion-with-up-to-70-less-energy-consumption\" target=\"_blank\">CARBOWAVE&nbsp;project finds alternative&nbsp;to PAN conversion with up to 70% less energy consumption</a>&rdquo;</p>\n</blockquote>\n\n<p>Their specific research objectives are to develop an optimal coating for PAN fibers that improves microwave adsorption, to develop a plasma heating system for the oxidative stabilization of PAN fibers&nbsp;and to advance microwave and plasma technology for continuous processes.</p>\n\n<p>The DITF&nbsp;is&nbsp;responsible for implementing these processes in continuous production and on pilot lines in a pilot plant. The DITF&rsquo;s central task is the stabilization of the precursor fibers with plasma technology. This involves combining plasma and low-pressure technology to reduce energy consumption in the stabilization process.</p>\n\n<p>The CARBOWAVE&nbsp;project includes recycling of carbon fibers. Partners believe that the new process will also enable&nbsp;microwave-assisted decomposition of carbon fiber composites.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/carbowave-studies-microwave-and-plasma-induced-carbonization-for-carbon-fiber-production"
      }
    ],
    "link": "https://www.compositesworld.com/news/carbowave-studies-microwave-and-plasma-induced-carbonization-for-carbon-fiber-production"
  },
  {
    "published": "Mon, 4 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      17,
      0,
      0,
      0,
      216,
      0
    ],
    "title": "IACMI’s Chad Duty presents SPE ACCE 2025 third keynote",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "IACMI’s Chad Duty presents SPE ACCE 2025 third keynote"
    },
    "summary": "Duty will share the ways in which IACMI, over its 10-year history, has led to successful and commercialized composites technologies in the automotive industry.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Duty will share the ways in which IACMI, over its 10-year history, has led to successful and commercialized composites technologies in the automotive industry."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2022-cw/1122-cw-news-chad-duty-iacmi-ceo1.jpeg;maxWidth=385\" /></div>\n\n<p>Source | IACMI</p>\n</div>\n\n<p>The SPE Automotive Division&rsquo;s (Troy, Mich., U.S.) executive planning committee has announced SPE ACCE 2025&rsquo;s third keynote speaker, Chad Duty, the CEO of&nbsp;the <a href=\"https://www.compositesworld.com/suppliers/institutef\" target=\"_blank\">Institute for Advanced Composites Manufacturing Innovation</a> (IACMI, Knoxville, Tenn., U.S.), or IACMI &ndash; The Composites Institute.</p>\n\n<p>Duty will presenting a &ldquo;Decade of Innovation: IACMI&rsquo;s Impact,&rdquo; outlining the pivotal&nbsp;role IACMI has played in accelerating advanced composites design, manufacturing, technical innovation and workforce solutions since its establishment&nbsp;by the U.S. Department of Energy (DOE)&nbsp;in 2015. IACMI celebrated its 10<sup>th</sup> anniversary on June 17, 2025. The organization leads composites technology innovation and workforce development solutions through public-private collaboration, funding projects, workforce development programs and more.</p>\n\n<p>IACMI automotive projects have led to commercialized products and technologies used in today&rsquo;s automotive industry.&nbsp;A key example is an IACMI-led project creating a compression molded composite liftgate for the Volkswagen <em>Atlas</em>, reducing weight by 35% and recurring cost by 9% versus the steel baseline.&nbsp;&nbsp;</p>\n\n<p>&ldquo;For 10 years, IACMI has harnessed the power of public-private partnerships to improve products, processes and people&rsquo;s lives through composites innovation and workforce solutions that secure America as a global leader in advanced manufacturing,&rdquo; says Duty. &ldquo;With steadfast investment and support from industry and government partners, notably the DOE and the Department of Defense, IACMI has empowered domestic manufacturers to accelerate design and commercialization, fostering a more reliable, secure and competitive U.S. economy.&rdquo;</p>\n\n<p>Duty assumed his role as IACMI CEO&nbsp;in April 2023. A professor in the Mechanical, Aerospace &amp; Biomedical Engineering Department at the University of Tennessee (UT), he also holds a joint faculty appointment with the Oak Ridge National Laboratory (ORNL).</p>\n\n<p>He has more than 20 years of research experience in advanced manufacturing &mdash;&nbsp;spanning technologies in thin film processing, printed electronics, solar energy&nbsp;and additive manufacturing of polymer composites. Before joining UT in 2015, Duty&nbsp;served as a research scientist and group leader at ORNL beginning in 2004 and helped to establish the DOE&rsquo;s Manufacturing Demonstration Facility at ORNL. Duty began his career as a senior aeronautical engineer at Lockheed Martin.</p>\n\n<p>He has a doctorate in mechanical engineering from Georgia Tech and bachelor&rsquo;s degree in mechanical engineering from Virginia Tech.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/iacmis-chad-duty-presents-spe-acce-2025-third-keynote"
      }
    ],
    "link": "https://www.compositesworld.com/news/iacmis-chad-duty-presents-spe-acce-2025-third-keynote"
  },
  {
    "published": "Mon, 4 Aug 2025 11:52:19 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      15,
      52,
      19,
      0,
      216,
      0
    ],
    "title": "Zoltek celebrates 50 years serving the carbon fiber industry",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Zoltek celebrates 50 years serving the carbon fiber industry"
    },
    "summary": "Since its founding in 1957 by Zsolt Rumy, Zoltek has grown its global carbon fiber capacity into what it is today, and is looking ahead to the five decades under Toray leadership.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Since its founding in 1957 by Zsolt Rumy, Zoltek has grown its global carbon fiber capacity into what it is today, and is looking ahead to the five decades under Toray leadership."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-zoltek-mexico-facility.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerial vehicle of Mexico facility.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-zoltek-mexico-facility.jpg;maxWidth=720\" /> </a></div>\n\n<p>Zoltek Mexico facility. Source | Zoltek</p>\n</div>\n\n<p>Industrial-grade carbon fibers company&nbsp;<a href=\"https://www.compositesworld.com/suppliers/zoltek\" target=\"_blank\">Zoltek</a>&nbsp;(St. Louis, Miss., U.S.) is celebrating&nbsp;the company&rsquo;s 50<sup>th</sup> anniversary since its founding in July 1975. Zoltek began as a small industrial distributor launched by Zsolt Rumy, a Hungarian-born engineer who came to the U.S. as a refugee in 1957.</p>\n\n<p>Rumy started Zoltek with just $8,000 and a vision to serve the chemical industry, later growing&nbsp;the company into its current position in the carbon fiber industry. His bold pivot into carbon fiber manufacturing in 1988 aided the beginning of the&nbsp;democratization of carbon fiber and laid the foundation for the company&rsquo;s global success. In 2014, Zoltek was acquired by Toray Group (Tokyo, Japan).</p>\n\n<p>&ldquo;This anniversary is a celebration of our industrial roots and a recommitment to our future,&rdquo; says&nbsp;Dave Purcell, CEO of Zoltek. &ldquo;We&rsquo;re honoring <a href=\"https://www.compositesworld.com/news/zoltek-founder-and-carbon-fiber-visionary-zsolt-rumy-passes-away-at-81\" target=\"_blank\">the legacy of Zsolt</a> with an eye on the next 50 years of innovation together now as part of the Toray Group.&rdquo;</p>\n\n<p>Zoltek&rsquo;s facilities in the U.S., Mexico&nbsp;and Hungary produce carbon fiber materials that enable lightweight solutions for wind turbine blades, aircraft, energy storage&nbsp;and a host of other industrial applications. Now with&nbsp;the support of Toray, the company is poised to enable new applications with material innovations for the next 50 years.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/zoltek-celebrates-50-years-serving-the-carbon-fiber-industry"
      }
    ],
    "link": "https://www.compositesworld.com/news/zoltek-celebrates-50-years-serving-the-carbon-fiber-industry"
  },
  {
    "published": "Mon, 4 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      15,
      0,
      0,
      0,
      216,
      0
    ],
    "title": "Airbus completes A350F freight horizontal stabilizer in Spain",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus completes A350F freight horizontal stabilizer in Spain"
    },
    "summary": "Like other parts of the large cargo aircraft, the HTP is composite, to be fitted to the first A350F aircraft for 2026-2027 flight tests.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Like other parts of the large cargo aircraft, the HTP is composite, to be fitted to the first A350F aircraft for 2026-2027 flight tests."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"A350F horizontal stabilizer.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-airbus-a350f-horizontal-stabilizer.jpg;maxWidth=385\" /></div>\n\n<p>Source | Airbus</p>\n</div>\n\n<p dir=\"ltr\">Airbus (Toulouse, France) has completed manufacturing the first horizontal stabilizer (HTP) for the A350F freighter at its plants in Spain. The C&aacute;diz facility manufactured the HTP parts, which were sent to the Getafe facility for&nbsp;assembly and outfitting.</p>\n\n<p dir=\"ltr\">The A350F is derived from the A350, which is a&nbsp;highly composites-intensive aircraft, largely made of carbon fiber-reinforced polymer&nbsp;(CFRP) materials. This includes the A350F&rsquo;s wings (Airbus completed its <a href=\"https://www.compositesworld.com/news/airbus-completes-first-a350f-wingset-in-broughton\" target=\"_blank\">first wingset</a>) and the HTP. In a June 2024 <a href=\"https://www.compositesworld.com/articles/plant-tour-aernnova-composites-toledo-and-illescas-spain\" target=\"_blank\">Aernnova Composites plant tour</a>, <em>CW</em>&rsquo;s Ginger Gardiner reports how &ldquo;Aernnova Illescas &hellip; uses automated tape laying (ATL) and fiber placement (AFP)&nbsp;to produce the CFRP&nbsp;leading edge (LE) and other components&nbsp;for the Airbus A350 horizontal tail plane.&rdquo;</p>\n\n<p dir=\"ltr\">The&nbsp;completed A350F HTP will be shipped to the Airbus Final Assembly Line (FAL) in Toulouse in the coming weeks to be joined with the fuselage of the first test aircraft. Airbus is manufacturing two A350F aircraft for flight testing in 2026 and 2027.</p>\n\n<p dir=\"ltr\">The A350F HTP can be manufactured in the same production line as the passenger version, delivering operational and industrial advantages and improvements.</p>\n\n<p dir=\"ltr\">&ldquo;The A350F will offer a clean sheet, specifically designed solution for air freight transport, bringing more efficiency and versatility to the cargo market,&rdquo; says Ricardo Rojas, president of Airbus&rsquo; Commercial Aircraft business in Spain. &ldquo;With more than 1,400 orders for the A350, including 66 A350Fs, Spain plays a key role in this program&nbsp;that presents the future in air cargo transportation.&rdquo;</p>\n\n<p dir=\"ltr\">All in all, the HTP, rear fuselage (section 19) and lower wing covers for both the A350 and A350F are manufactured in Spain. In addition, the A350F's main deck cargo door, said to be the largest in the industry, will also be manufactured in&nbsp;Spain. Made from composites, it has a 4.3-meter opening, making&nbsp;loading and unloading easier, faster and safer.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-completes-a350f-freight-horizontal-stabilizer-in-spain"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-completes-a350f-freight-horizontal-stabilizer-in-spain"
  },
  {
    "published": "Mon, 4 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      14,
      0,
      0,
      0,
      216,
      0
    ],
    "title": "Carbon fiber boosts dry-processed battery performance",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Carbon fiber boosts dry-processed battery performance"
    },
    "summary": "ORNL researchers have found that dry-processed films incorporating long carbon fibers&nbsp;improves strength and conductivity for more affordable lithium-ion battery electrodes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ORNL researchers have found that dry-processed films incorporating long carbon fibers&nbsp;improves strength and conductivity for more affordable lithium-ion battery electrodes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-ornl-carbon-fiber-snippets.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Carbon fiber snippets.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-ornl-carbon-fiber-snippets.jpg;maxWidth=720\" /> </a></div>\n\n<p>Although they barely cover a fingertip, these carbon fiber snippets are the longest to be incorporated into a battery film, enabling faster transfer of electrons. Source | Carlos Jones/ORNL, U.S. Department&nbsp;of Energy</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/oak-ridge-national-laboratory\" target=\"_blank\">Oak Ridge National Laboratory</a> (ORNL, Tenn., U.S.) researchers have overcome a barrier to using a more affordable, dry process &mdash; incorporating composite materials&nbsp;&mdash; for manufacturing lithium-ion batteries used in vehicles and electronic devices. The resulting batteries have been found to provide greater electricity flow and reduced risk of overheating.</p>\n\n<p>Dry processing is a method for making electrode films that eliminates the need for wet organic solvents that require increased factory floor space, time, energy, waste disposal and startup expenses. However, dry-processed films tear easily. So ORNL researchers&nbsp;<a href=\"https://www.ornl.gov/technology/202405686\" target=\"_blank\">incorporated long carbon fibers</a>, then tested coin cell batteries made from the material. They found the films were stronger&nbsp;and more flexible. The long fibers improved the mechanical strength of the material while transferring electrons further for faster charging and discharging rates.</p>\n\n<p>While others have experimented with nanoscale carbon fibers, ORNL is the first to use long carbon fibers, says&nbsp;scientist Jaswinder Sharma. The chemical cost savings would exceed the price of the fiber, which constitutes only 1% of the weight.&nbsp;</p>\n\n<p>&ldquo;We think this is the next step in bringing dry-processed electrodes near to widespread use,&rdquo; Sharma adds. &ldquo;By eliminating expensive solvents and simplifying manufacturing, this method could help U.S. battery producers compete more effectively in the global market.&rdquo;</p>\n\n<p>The ORNL project is funded by the Department of Energy&rsquo;s Advanced Materials and Manufacturing Technologies Office.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/carbon-fiber-boosts-dry-processed-battery-performance"
      }
    ],
    "link": "https://www.compositesworld.com/news/carbon-fiber-boosts-dry-processed-battery-performance"
  },
  {
    "published": "Fri, 1 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      17,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "NASA contract enables Firefly Blue Ghost Mission 4 in 2029",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "NASA contract enables Firefly Blue Ghost Mission 4 in 2029"
    },
    "summary": "The company&rsquo;s fourth lunar mission and fifth NASA CLPS award will use the Elytra orbital vehicle and Blue Ghost lunar lander to operate two rovers and three scientific instruments on the Moon&rsquo;s south pole.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company&rsquo;s fourth lunar mission and fifth NASA CLPS award will use the Elytra orbital vehicle and Blue Ghost lunar lander to operate two rovers and three scientific instruments on the Moon&rsquo;s south pole."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-firefly-blueghost-lunar.png\" target=\"_blank\"><img alt=\"Blue Ghost landed on the moon.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-firefly-blueghost-lunar.png;maxWidth=385\" /></a></div>\n\n<p>Source | Firefly Aerospace</p>\n</div>\n\n<p>On July 29,&nbsp;<a href=\"https://fireflyspace.com/\" target=\"_blank\">Firefly Aerospace</a>&nbsp;(Cedar Park, Texas, U.S.) was awarded a&nbsp;$176.7 million NASA Commercial Lunar Payload Services (CLPS) contract to deliver five NASA-sponsored payloads to the Moon&rsquo;s south pole in 2029. The mission will use Firefly&rsquo;s composites-intensive Elytra orbital vehicle and <em>Blue Ghost</em> lunar lander to enable payload operations that include evaluating the Moon&rsquo;s south pole resources, such as hydrogen, water&nbsp;and other minerals, and studying the radiation and thermal environment that could affect future astronauts and lunar infrastructure.</p>\n\n<p>During&nbsp;Blue Ghost Mission 4&nbsp;operations, Firefly&rsquo;s&nbsp;Elytra <em>Dark</em>&nbsp;transfer vehicle will first deploy the&nbsp;<em>Blue Ghost</em>&nbsp;lander into lunar orbit and remain on orbit to provide a long-haul communications relay for the mission. <em>Blue Ghost</em> will then land in the Moon&rsquo;s south pole region, deploy the rovers&nbsp;and enable payloads operations with data, power&nbsp;and communications services for more than 12 days on the lunar surface.</p>\n\n<p>The NASA-sponsored payloads onboard <em>Blue Ghost</em> include two rovers &mdash; the MoonRanger rover and a Canadian Space Agency rover &mdash;&nbsp;as well as a laser ablation ionization mass spectrometer (LIMS), a laser retroreflector&nbsp;array (LRA)&nbsp;and the stereo cameras for lunar plume surface studies (SCALPSS), which also flew on&nbsp;<a href=\"https://fireflyspace.com/missions/blue-ghost-mission-1/\" target=\"_blank\">Blue Ghost Mission 1</a>. These payloads will help uncover the composition and resources available at the Moon&rsquo;s south pole, advance lunar navigation, evaluate the chemical composition of lunar regolith&nbsp;and further study the effects of a lander&rsquo;s plume on the Moon&rsquo;s surface during landings.</p>\n\n<p>Following Blue Ghost Mission 4 operations, Elytra <em>Dark</em> will remain operational in lunar orbit for more than 5&nbsp;years in support of Firefly&rsquo;s&nbsp;Ocula lunar imaging service. The mission enables a third Elytra <em>Dark</em> in Firefly&rsquo;s growing constellation to provide customers with faster revisit times for lunar mapping, mission planning,&nbsp;situational awareness&nbsp;and mineral detection services. The first two Elytra <em>Dark</em> vehicles will launch as part of&nbsp;<a href=\"https://fireflyspace.com/missions/blue-ghost-mission-2/\" target=\"_blank\">Blue Ghost Mission 2</a>&nbsp;to the far side of the Moon in 2026 and&nbsp;<a href=\"https://fireflyspace.com/missions/blue-ghost-mission-3/\" target=\"_blank\">Blue Ghost Mission 3</a>&nbsp;to the Gruithuisen Domes in 2028.</p>\n\n<p>&ldquo;Firefly&rsquo;s Elytra <em>Dark</em> spacecraft are companions for <em>Blue Ghost</em> &mdash;&nbsp;they&rsquo;re highly maneuverable vehicles built with the same flight-proven components and propulsion system that successfully landed <em>Blue Ghost</em> on the Moon,&rdquo; says Chris&nbsp;Clark, VP of spacecraft. &ldquo;As our Elytra constellation continues to grow in lunar orbit, Firefly is in a position to provide lunar imaging services and a communications relay for missions anywhere on the Moon&rsquo;s surface. And with extra payload capacity on both Elytra and <em>Blue Ghost</em>, we invite additional government and commercial customers <a href=\"https://fireflyspace.com/missions/blue-ghost-mission-4/\" target=\"_blank\">to join our fourth mission</a>.&rdquo;</p>\n\n<p><em>Want to learn more about Firefly&rsquo;s developments? Take a look at these <a href=\"https://www.compositesworld.com/search?q=Firefly%20Aerospace\" target=\"_blank\">recent announcements</a>.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/nasa-contract-enables-firefly-blue-ghost-mission-4-in-2029"
      }
    ],
    "link": "https://www.compositesworld.com/news/nasa-contract-enables-firefly-blue-ghost-mission-4-in-2029"
  },
  {
    "published": "Fri, 1 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      17,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "Aimplas launches NEOCOMP and REFUGI projects",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aimplas launches NEOCOMP and REFUGI projects"
    },
    "summary": "The Spanish center is focusing on the development of sustainable, flame-retardant coatings and composites to enhance safety in construction and mobility.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Spanish center is focusing on the development of sustainable, flame-retardant coatings and composites to enhance safety in construction and mobility."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-aimplas-neocomp.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"NEOCOMP project filaments.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-aimplas-neocomp.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | Aimplas</p>\n</div>\n\n<p>There is growing concern about the environmental impact generated by key industrial sectors, especially in areas such as construction and mobility, where achieving materials with good mechanical performance, lighter weight&nbsp;and greater fire resistance plays a crucial role. In this context, <a href=\"https://www.aimplas.net/\" target=\"_blank\">Aimplas</a>, the Plastics Technology Centre (Valencia, Spain)&nbsp;is working on two projects &mdash; REFUGI and NEOCOMP&nbsp;&mdash;&nbsp;funded by the Valencian Institute for Competitiveness and Innovation (IVACE+i), with support from the European Regional Development Fund (ERDF), to sustainably develop new flame-retardant coatings and composite materials that enhance safety in homes and transportation.</p>\n\n<p>The NEOCOMP project, in collaboration with Ziur Composites and IT3D, focuses on developing high-performance, flame-retardant composite materials using advanced manufacturing technologies. This involves producing various parts through industrial processes such as dry fiber placement (DFP) and additive manufacturing. These composite materials must not only offer high performance in terms of mechanical strength, durability and flame resistance but also significantly contribute to reducing the environmental impact in construction and mobility.</p>\n\n<p>Specifically, NEOCOMP will develop flame-retardant thermoplastic binders for dry fiber, unidirectional dry fiber tapes for DFP&nbsp;and continuously reinforced 3D filaments. According to Aimplas, these&nbsp;new manufacturing approaches will enable&nbsp;the efficient production of preforms with complex geometries and also the production of customized composite parts with improved mechanical properties, greater fatigue resistance&nbsp;and optimal&nbsp;fire resistance. This will open new opportunities in sectors such as construction, automotive&nbsp;and aerospace.&nbsp;</p>\n\n<p>The main objective of the REFUGI project is to develop phosphorus-based flame retardants using mechanochemical processes, representing a step toward more environmentally friendly methods. These flame retardants are being integrated into varnish formulations specifically designed for use on wood. This strategy aims to improve the fire-resistant properties of coatings used in the construction sector.</p>\n\n<p>&ldquo;The use of flame-retardant varnishes has increased in recent years, as they offer a finish virtually identical to any wood coating, with the added benefit of greater fire resistance, delaying its spread and effects in the event of a fire,&rdquo; explain Carolina Acosta, lead researcher in mechanochemistry and reactive extrusion at Aimplas. &ldquo;We are focusing on exploring different material sources to produce these flame retardants, prioritizing those that are renewable and recyclable.&rdquo;</p>\n\n<p>This research, carried out in collaboration with Omar Coatings and Decomader, aims not only to improve the efficiency of flame-retardant production, but also to reduce the environmental impact associated with their manufacture and application.</p>\n\n<p>Both projects are part of the IVACE+i grant program for non-economic R&amp;D projects carried out in collaboration with companies by technology centers in the Valencian Community for 2024, funded by the European Union&rsquo;s ERDF under the 2021&ndash;2027 Operational Program.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aimplas-launches-neocomp-and-refugi-projects"
      }
    ],
    "link": "https://www.compositesworld.com/news/aimplas-launches-neocomp-and-refugi-projects"
  },
  {
    "published": "Fri, 1 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      16,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "Horizon Europe projects present webinar for advancing aviation digitalization, composite technologies",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Horizon Europe projects present webinar for advancing aviation digitalization, composite technologies"
    },
    "summary": "Free webinar on Sept. 24, 2025, brings together members from&nbsp;DEMOQUAS, GENEX and TOSCA to delve into how these projects are contributing to safer, more efficient and&nbsp;environmentally responsible aviation technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Free webinar on Sept. 24, 2025, brings together members from&nbsp;DEMOQUAS, GENEX and TOSCA to delve into how these projects are contributing to safer, more efficient and&nbsp;environmentally responsible aviation technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-genex-herwingt-webinar.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-genex-herwingt-webinar.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Horizon Europe</p>\n</div>\n\n<p>In a step toward the future of aerospace innovation, three European projects &mdash;&nbsp;<a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.demoquas.eu%2F&amp;data=05%7C02%7CGNehls%40gardnerweb.com%7C544b7da6c2644ccbcb2c08ddcf36f479%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638894557145321652%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=QxkmTTCWSVRs%2BHmkf%2FdlaJcqvSP9FJh96Oza1jK2qho%3D&amp;reserved=0\" target=\"_blank\">DEMOQUAS</a>, <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fgenex-project.eu%2F&amp;data=05%7C02%7CGNehls%40gardnerweb.com%7C544b7da6c2644ccbcb2c08ddcf36f479%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638894557145349762%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=nMMlf2Lzeaj9uXLiLsCEbsXTHRDuyJF2%2BFQIuJa3Be8%3D&amp;reserved=0\" target=\"_blank\">GENEX</a>&nbsp;and <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.tosca-project.eu%2F&amp;data=05%7C02%7CGNehls%40gardnerweb.com%7C544b7da6c2644ccbcb2c08ddcf36f479%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638894557145364829%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=so2HZds7xDBhGxFI%2Bmi3H6aLJ%2BOzdoQaEEse1ht1ggE%3D&amp;reserved=0\" target=\"_blank\">TOSCA</a>&nbsp;(more on these below)<strong>&nbsp;</strong>&mdash; are joining forces to present a webinar titled &ldquo;Advancing Digitalization and Composite Technologies for Safer, More Sustainable Aviation.&rdquo; The free and exclusive online event takes place&nbsp;on Sept. 24, 2025 from 11:00 &ndash;&nbsp;12:00 p.m. CET. Interested parties can <a href=\"https://events.teams.microsoft.com/event/077e4b5d-f88a-45bb-892e-21796196b7eb@1fc902d5-ed41-4d28-943d-4941726de980\" target=\"_blank\">register here</a>.</p>\n\n<p>This collaborative event brings together leading minds and cutting-edge research to explore how digital transformation and advanced materials are reshaping the aviation industry.</p>\n\n<p>At the forefront of this transformation is GENEX, a project redefining aerospace manufacturing through its eco-efficient composites and intelligent production systems. Central to GENEX&rsquo;s innovation is an out-of-autoclave process using 3R resin &mdash; thermoplastic developed for recyclability, repairability and reprocessability (hence the name 3R). At the heart of GENEX innovation is Health and Usage Monitoring and&nbsp;Management, promoting real-time diagnostics and predictive analytics. By enabling data-driven maintenance, it enhances safety, boosts efficiency&nbsp;and extends asset life &mdash;ensuring mission readiness with sustainable precision.</p>\n\n<p>The webinar will delve into how these advancements, alongside the contributions of DEMOQUAS and TOSCA, are converging to create safer, more efficient&nbsp;and environmentally responsible aviation technologies. Attendees will gain insights into the integration of digital tools, sensor technologies&nbsp;and sustainable composite materials &mdash; key enablers to&nbsp;the aerospace sector&rsquo;s green transition.</p>\n\n<p>Notably, this event is not just a showcase of technological progress &mdash; it is a call to action for stakeholders across the aerospace value chain to embrace innovation and collaboration in pursuit of a cleaner, smarter future in flight.&nbsp;It also promises to be of great interest to aerospace professionals, engineers, researchers, digital twin experts&nbsp;and sustainability advocates alike, offering valuable insights and opportunities for engagement.</p>\n\n<p><em>Note: The webinar will be recorded and later uploaded to the official </em><a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.youtube.com%2F%40GENEXPROJECT&amp;data=05%7C02%7CGNehls%40gardnerweb.com%7C544b7da6c2644ccbcb2c08ddcf36f479%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638894557145422490%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=W2jL2szIAZxKcCQybDLfkFgAooH1%2BcuQUhiebvj1TqQ%3D&amp;reserved=0\" target=\"_blank\"><em>GENEX YouTube channel</em></a><em> for wider dissemination.</em></p>\n\n<div class=\"article_sidebar\">\n<h2>Horizon Europe projects</h2>\n\n<h3>DEMOQUAS</h3>\n\n<p>&ldquo;DEsigning, Manufacturing and Operating Quantification of Uncertainties to increase Aviation Safety&rdquo; (DEMOQUAS) is a 36-month Horizon Europe project launched on May 1, 2024. It is coordinated by AUTH and aims to strengthen aviation safety for future propulsion technologies by advancing uncertainty quantification (UQ) methodologies across the full life cycle of aircraft and engine components. The project develops an integrated, UQ-enabled framework based on digital threads and digital twins, applied to six industrially relevant test cases. DEMOQUAS focuses on the multiscale and multi-fidelity representation and propagation of uncertainties in design, manufacturing&nbsp;and operations.</p>\n\n<h3>GENEX&nbsp;</h3>\n\n<p>&ldquo;Next end-to-end digital framework for optimized manufacturing and maintenance of next-generation aircraft composite structures&rdquo; (GENEX)&nbsp; is a 42-month Horizon Europe project launched on Sept. 1, 2022. GENEX is led by ITA and commits to work toward&nbsp;EU goals by developing three pioneering technological assets which, through integration, will lead to a multidisciplinary digital twin of the component throughout its life cycle for next-generation&nbsp;aircraft composite structures. The project objectives have been achieved via the development of three main&nbsp;technological asset blocks.</p>\n\n<h3>TOSCA</h3>\n\n<p>The &ldquo;Manufacturing Processes and Digital&nbsp;Tools for more Sustainable Composite Aerostructures&rdquo; (TOSCA) project aims to develop the manufacturing&nbsp;processes of future aerostructures using a new type of vitrimer resin. Processes such as automated fiber&nbsp;placement, quality control, welding and repair will be analyzed and adapted to the new type of resin. Example parts include components from future eVTOL vehicles. The processes will be supported by a digital twin, that collects relevant information about the part throughout its lifetime. The project is coordinated by Profactor GmbH and started in January 2025.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/horizon-europe-projects-present-webinar-for-advancing-aviation-digitalization-composite-technologies"
      }
    ],
    "link": "https://www.compositesworld.com/news/horizon-europe-projects-present-webinar-for-advancing-aviation-digitalization-composite-technologies"
  },
  {
    "published": "Fri, 1 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      15,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "Clean Aviation's regional aircraft technology testbed #2 demonstrates advances with composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Clean Aviation's regional aircraft technology testbed #2 demonstrates advances with composites"
    },
    "summary": "European project advances OOA outer wing box using resin infusion and thermoplastic composite technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "European project advances OOA outer wing box using resin infusion and thermoplastic composite technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-cleanaviation-ftb2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"C295 Flight Test Bed 2 for Clean Aviation Green Regional Aircraft program\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-cleanaviation-ftb2.jpg;maxWidth=720\" /> </a></div>\n\n<p>The Airbus C295 Flight Test Bed 2 (FTB#2) successfully performed its flight campaign,&nbsp;testing a new semi-morphing wing, as well as&nbsp;on-ground structural tests of a novel composite outer wing box. Source | Clean Aviation, Airbus Defence and Space</p>\n</div>\n\n<p>As reported by the <a href=\"https://www.clean-aviation.eu/revolutionising-regional-aviation-airbus-c295-ftb2-takes-flight\" target=\"_blank\">Clean Aviation</a> program, the Green Regional Aircraft (GRA) program&rsquo;s&nbsp;Flight Test Bed 2 (FTB#2) &mdash; a modified version of the Airbus C295 &mdash; has successfully completed its flight test campaign. Marking a significant milestone in progressing next-gen&nbsp;technologies for sustainable aviation, the aircraft integrates advanced aerodynamics, innovative flight controls and new composite technologies to enhance efficiency and reduce emissions including:</p>\n\n<ul>\n\t<li>Up to 43% CO<sub>2</sub> and 70% NOx emissions reductions in regional aircraft multi-mission scenarios, alongside a 45% noise reduction during takeoff.</li>\n\t<li>A semi-morphing wing, dynamic winglets&nbsp;and an advanced flight control system were successfully tested to optimize aerodynamic performance.</li>\n\t<li>Innovative manufacturing processes&nbsp;&mdash;&nbsp;including additive manufacturing and one-shot composite assembly&nbsp;&mdash;&nbsp;to improve production efficiency.</li>\n</ul>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3><strong>Read <em>CW</em>&rsquo;s coverage of this project:</strong></h3>\n\n<ul>\n\t<li><a href=\"https://www.compositesworld.com/news/clean-sky-2-outer-wing-box-demonstrator-validates-ooa-lri-shimless-assembly-and-shm\" target=\"_blank\">Clean Sky 2 outer wing box demonstrator validates OOA LRI, shimless assemly and SHM</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/advancing-thermoplastic-composite-primary-structure-and-morphing-wings\" target=\"_blank\">Advancing thermoplastic composite primary structure and morphing wings</a></li>\n\t<li><a href=\"https://www.compositesworld.com/news/clean-sky-2-outcome-project-demonstrates-peek-thermoplastic-composite-wingbox-cover\" target=\"_blank\">Clean Sky 2 OUTCOME project demonstrates PEEK thermoplastic composite wingbox cover</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/advancing-the-ooa-infused-wing-box\" target=\"_blank\">Advancing the OOA infused wing box</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/the-path-to-ooa-wings-with-minimal-fasteners\" target=\"_blank\">The path to OOA wings with minimal fasteners</a></li>\n</ul>\n</div>\n</div>\n\n<p>These combined achievements are timely in the context of mounting global pressure to curb aviation&rsquo;s environmental impacts. Stricter regulations on carbon emissions, coupled with society&rsquo;s increasing demand for sustainability, are driving the need for greener air travel. The FTB#2 demonstrator&rsquo;s successful flight highlights Europe&rsquo;s leadership in sustainable aviation and reinforces the importance of the Clean Sky 2, now Clean Aviation, initiative in pioneering these essential advancements.</p>\n\n<p>The success of the flight test activities was made possible through a combination of these design/fabrication elements in conjunction with other aerodynamic enhancements to the C295 flight demonstrator aircraft, such as lightweight composite materials and a more efficient propulsion system. Altogether these modifications optimize fuel consumption while maintaining the aircraft&rsquo;s reliability and versatility. Data collected during the flight provides valuable insights into real-world performance, confirming the effectiveness of these innovations.</p>\n\n<h3><strong>FTB#2 multi-mission platform testing</strong></h3>\n\n<p>As explained by Clean Aviation project officer, Costin-Ciprian Miglan, FTB#2 is a multi-mission platform that can support multiple configurations for a range of roles. &ldquo;For example, it can be used to carry passengers, transport supplies or humanitarian aid, or the aircraft can also be equipped with fire-retardant substances and used to combat wildfires,&rdquo; says Miglan.</p>\n\n<p>The flight test campaign involved 12 successful flights conducted over 17 flight hours, with all planned test points fully achieved. The results were highly satisfactory, confirming the maturity of key technologies tested on board. These included innovations in a composite external outer wing box and morphing control surfaces.</p>\n\n<h3><strong>Advances composites use</strong></h3>\n\n<p>This flight campaign was complemented by a ground-based demonstrations of an out-of-autoclave (OOA) cured carbon fiber-reinforced plastic (CFRP) outer wing box based on a highly integrated design that minimizes components using two different materials and manufacturing processes. The first is liquid resin infusion (LRI), which was used for the lower skin to integrate the spars, stringers and main structure into a one-shot infused part. The second was in situ consolidation (ISC) using automated fiber placement (AFP) to produce a thermoplastic composite (TPC) upper skin with integrated stringers. Together, this resulted in a weight reduction of 5.6% compared with equivalent conventional components.</p>\n\n<p>A highly integrated composite winglet based on a one-shot multi-spar torsion box (which saves 20% weight compared to conventional architecture) was also put through a comprehensive structural test campaign from detail to full-scale. This improved winglet also reduces cost due to reduced riveting during manufacture.</p>\n\n<p>Commenting on the stepped processes of flight and ground testing, Clean Aviation&rsquo;s Miglan explains that &ldquo;<strong>Step one</strong> was the flight test; <strong>step two</strong> involved further maturing other technologies, but only on the ground &mdash; such as the outer wing box and actuation systems for the movable surfaces. The flight test was a major milestone for Clean Sky 2. During this campaign, the entire outer wing, from the engine to the wingtip, was completely replaced. This achievement was the result of multiple &lsquo;Core Partner&rsquo;&nbsp;and &lsquo;Call for Proposals&rsquo;&nbsp;projects under the airframe and regional platforms, all integrated by Airbus Defence and Space.&rdquo;&nbsp;</p>\n\n<p>See <a href=\"https://www.clean-aviation.eu/clean-sky-2/programme-overview-and-structure/clean-sky-2-structure/regional-aircraft\" target=\"_blank\">Clean Aviation Regional Aircraft</a> for more details on FTB#1 and #2 as well as the flight and ground test programs.</p>\n\n<h3><strong>Overcoming challenges in development</strong></h3>\n\n<p>Developing the C295 demonstrator was no easy feat. The project faced several challenges that had to be addressed to achieve success.</p>\n\n<p>&ldquo;Merging multiple advanced systems into an existing aircraft while ensuring compliance with safety regulations required precise integration strategies,&rdquo; emphasizes.&nbsp;Miglan. &ldquo;Engineering challenges associated with new aerodynamic designs, composite materials&nbsp;and propulsion technologies had to be overcome through rigorous testing and iteration. Aligning efforts among various European partners &mdash; each contributing specialized expertise&nbsp;&mdash; demanded&nbsp;strong coordination and communication. Meeting stringent aviation certification standards was another crucial factor in ensuring that all new technologies were safe and viable for future applications.&rdquo;</p>\n\n<p>Despite these challenges, the project&rsquo;s success underscores the strength of collaborative innovation in advancing sustainable aviation. Looking forward, Airbus Defence and Space will continue to contribute to Clean Aviation&rsquo;s next phases. The experience gained from the C295 demonstrator will inform future projects, ensuring continued progress in aviation sustainability. The project has generated valuable insights that could lead to further technological innovations and commercial applications.</p>\n\n<h3><strong>Environmental benefits</strong></h3>\n\n<p>The FTB#2 demonstrator sets a new standard for environmentally responsible regional aircraft operations. The incorporation of advanced materials, innovative technologies and aerodynamic improvements aimed at reducing noise, CO<sub>2</sub> and NOx emissions has surpassed initial expectations.</p>\n\n<p>&ldquo;During a typical search and rescue mission, we estimate that these innovations could achieve up to a 43% reduction in CO<sub>2</sub> emissions and a 70% decrease in NOx emissions during a typical 400-nautical-mile search and rescue mission, along with a 45% reduction in noise during takeoff,&rdquo; says Luis Ben&iacute;tez Monta&ntilde;&eacute;s, formerly the chief engineer in the Clean Sky 2 program for Airbus Defence and Space, who led the Airbus side of the FTB#2 project. &ldquo;These improvements not only support Airbus&rsquo;s sustainability goals but also pave the way for more eco-friendly air travel options worldwide.&rdquo;</p>\n\n<div class=\"article_sidebar\">\n<p>This project ran from 2014 to 2024, with development, refinement and integration of the C295 demonstrator&rsquo;s technologies made possible by a consortium of more than 60 research and academic institutions, industrial partners and technology providers across 12 countries.</p>\n\n<p>Airbus Defence and Space (formerly EADS-CASA) led the integration and testing of new technologies. The total budget for the C295 demonstrator was &euro;102.5 million, comprising &euro;55.4 million dedicated to the Clean Sky 2 AIRFRAME program and &euro;47.1 million allocated to the regional aircraft (REG) Innovative Airframe Technology Demonstrator&nbsp;(IATD)&nbsp;program. The EU contribution associated with the FTB#2 in AIRFRAME was &euro;27.7 million, with an additional &euro;23.55 million toward&nbsp;the REG IATD, for a total of &euro;51.25 million.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/clean-aviations-regional-aircraft-technology-testbed-2-demonstrates-advances-with-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/clean-aviations-regional-aircraft-technology-testbed-2-demonstrates-advances-with-composites"
  },
  {
    "published": "Fri, 1 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      14,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "Strohm completes first 13 thermoplastic composite jumpers for ExxonMobil",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Strohm completes first 13 thermoplastic composite jumpers for ExxonMobil"
    },
    "summary": "The thermoplastic composite pipe (TCP) jumpers were fabricated as part of the company&rsquo;s Jumper on Demand concept aimed at flexible, high-volume part manufacture.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The thermoplastic composite pipe (TCP) jumpers were fabricated as part of the company&rsquo;s Jumper on Demand concept aimed at flexible, high-volume part manufacture."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-strohm-11.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Strohm thermoplastic composite jumper\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-strohm-11.jpg;maxWidth=720\" /> </a></div>\n\n<p>Strohm&rsquo;s thermoplastic composite pipe jumpers. Source | Strohm&nbsp;</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/strohm\" target=\"_blank\">Strohm</a>&nbsp;(IJmuiden, Netherlands) announces that it has completed fabrication of the first 13 water alternating gas injection thermoplastic composite pipe (TCP) jumpers as part of its Jumper on Demand concept, for ExxonMobil&rsquo;s Yellowtail field offshore Guyana.</p>\n\n<p>Strohm says that its&nbsp;Jumper on Demand concept allows multiple pipe lengths to be spooled from a delivery reel of continuous pipe and cut into discrete jumper lengths onsite. The individual jumpers are then fabricated in parallel by the company&rsquo;s Field Service Group, a team of specialists which are trained in pipe handling and termination of TCP.</p>\n\n<p>This approach is said to provide a safe, efficient and flexible method to produce large volumes of jumpers faster.</p>\n\n<p>The first two TCP jumpers were integrated with vertical connections, pressure tested and installed subsea at depths of more than 1,700 meters in early July. The jumpers, installed by spreader bar, were locked in and back seal tested successfully by the client&rsquo;s installation contractor.</p>\n\n<p>Gavin Leiper, VP of the Americas and Global Field Services Group at Strohm, says, &ldquo;This first Jumper on Demand campaign for ExxonMobil applies a high-volume fabrication method, proving that on-site fabrication of TCP jumpers has the flexibility to scale up or down as the installation schedule demands. As a manufacturer of disruptive technology, we are especially appreciative of ExxonMobil&rsquo;s continued confidence and support to deploy TCP on their assets. The campaign was completed on time, under budget and with zero safety incidents or observations, a fact that was globally commended by the client within their organization. We look forward to collaborating again with ExxonMobil during the next fabrication campaign in 2026.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/strohm-completes-first-13-thermoplastic-composite-jumpers-for-exxonmobil"
      }
    ],
    "link": "https://www.compositesworld.com/news/strohm-completes-first-13-thermoplastic-composite-jumpers-for-exxonmobil"
  }
]