[
  {
    "published": "Fri, 2 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      17,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "Generative Orthoses project to reshape orthopedic care",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Generative Orthoses project to reshape orthopedic care"
    },
    "summary": "CRP Technology, MHOX and&nbsp;Istituto Ortopedico Rizzoli, one of the winners of the WORTH Partnership Project II, have developed&nbsp;bespoke orthoses using generative design, Windform GT fiberglass materials and PBF.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "CRP Technology, MHOX and&nbsp;Istituto Ortopedico Rizzoli, one of the winners of the WORTH Partnership Project II, have developed&nbsp;bespoke orthoses using generative design, Windform GT fiberglass materials and PBF."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-crp-customized-ankle-foot-orthoses.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orthosis solution.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-crp-customized-ankle-foot-orthoses.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | CRP Technology</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/crp-technology\" target=\"_blank\">CRP Technology</a> (Modena, Italy) and <a href=\"http://mhoxdesign.com/\" target=\"_blank\">MHOX Design</a>, a design research group with a focus on generative design and 3D&nbsp;printing, in collaboration with <a href=\"https://www.ior.it/\" rel=\"noopener\" target=\"_blank\">Istituto Ortopedico Rizzoli</a> (IOR, Bologna, Italy), are one of 69 winning projects under the WORTH Partnership Project II 3rd Call. The project, Generative Orthoses,&nbsp;was awarded for its use of additive technologies and high-performance composite materials to reshape orthopedic care.</p>\n\n<p>The&nbsp;WORTH II 3rd Call&nbsp;saw record-breaking participation, with&nbsp;142 applications&nbsp;and&nbsp;320 applicants&nbsp;from&nbsp;34 EU-COSME-associated countries. After a rigorous evaluation process,&nbsp;69 projects&nbsp;were selected for funding, featuring&nbsp;158 partners&nbsp;from&nbsp;25 countries&nbsp;across Europe.&nbsp;</p>\n\n<p>Over the past 8&nbsp;years, MHOX, CRP Technology, and Istituto Ortopedico Rizzoli have worked together to develop&nbsp;high-performance bespoke orthoses using body scanning, 3D digital design, CRP Technology&rsquo;s glass fiber-reinforced Windform GT composite material and the additive powder bed fusion (PBF) process.&nbsp;The project incorporates&nbsp;biomimetic design&nbsp;and advanced manufacturing techniques, improving both form and function while providing essential&nbsp;support, rehabilitation&nbsp;and postural correction.</p>\n\n<p>Using 3D printing in generative orthotics&nbsp;involves several major phases:</p>\n\n<ul>\n\t<li>Scanning of the patient&rsquo;s limb</li>\n\t<li>Generating the 3D model of the orthosis</li>\n\t<li>Construction of the orthosis using Windform&nbsp;materials and additive manufacturing.</li>\n</ul>\n\n<p>MHOX Design&nbsp;handled&nbsp;the first two stages by developing and using software designed for the automated management of systems for mass product customization.</p>\n\n<p>The procedure requires the digital uploading of the patient&rsquo;s limb that the orthosis is to fit, using scanning processes based mainly on infrared technology or structured light. The scanning process takes place directly at the doctor, thanks to the portability of the sensor and its plug-and-play features.</p>\n\n<p>Notably, generative design techniques and its simulation of&nbsp;biological phenomena make it possible to reproduce the shape of the orthosis and customize it to fit the patient&rsquo;s body for&nbsp;subsequent 3D printing. This has led to cost and time reduction, MHOX notes, and the final result mirrors the affected limb&nbsp;without the need for invasive medical examinations.</p>\n\n<p>CRP Technology&nbsp;used&nbsp;Windform&nbsp;GT, a&nbsp;glass fiber-reinforced polyamide for orthoses production. Its elasticity,&nbsp;impermeability and durability, as well as its ability to flex for extended period of time without the risk of damage made it ideal for this type of application. In addition, Windform GT&rsquo;s strength-to-weight ratio and dimensional stability ebsure that the orthotic devices remain lightweight and dirable while&nbsp;also being suitable for&nbsp;direct contact with the skin, as it is a&nbsp;skin-proof material.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-cfrp-mhox-orthoses.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-cfrp-mhox-orthoses.jpg;maxWidth=720\" /> </a></div>\n\n<p>3D printed generative and bespoke orthoses made in collaboration with MHOX.</p>\n</div>\n\n<p>CRP notes that the use of PBF is also significant, not just in terms of production speed, product performance and fit, and customization, but also regarding aesthetics for the user.</p>\n\n<p>All developed orthosis solutions have been&nbsp;subjected to a series of tests to assess their performance. The experimentation stage studied static mode, static mode applied to the patient and dynamic mode on the patient. The results have confirmed this new application for Windform&nbsp;materials and technology.</p>\n\n<p>CRP Technology&rsquo;s research into the manufacturing of generative orthotics has been met with great interest by industry professionals. The same method of construction can be used to make orthoses for upper and lower limbs, plaster casts and prosthetic fairings. CRP Technology and MHOX Design are working alongside professional physical therapists and rehabilitation specialists to investigate the construction of solutions for patients with peroneal nerve dysfunction, resulting in drop foot further to injury, leading to a &ldquo;slapping&rdquo; gait.</p>\n\n<p>Looking forward,&nbsp;CRP Technology,&nbsp;MHOX&nbsp;and Istituto Ortopedico Rizzoli continue to&nbsp;refine and automate the&nbsp;design processes, ensuring that the production of&nbsp;fully customized orthotic devices&nbsp;becomes scalable and market-ready for a broader patient base.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/generative-orthoses-project-to-reshape-orthopedic-care"
      }
    ],
    "link": "https://www.compositesworld.com/news/generative-orthoses-project-to-reshape-orthopedic-care"
  },
  {
    "published": "Fri, 2 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      17,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "Rocket Lab awarded HASTE launch contract for U.S. DOD",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Rocket Lab awarded HASTE launch contract for U.S. DOD"
    },
    "summary": "Under the MACH-TB 2,0 program led by Kratos, Rocket Lab will launch its&nbsp;full-scale HASTE rocket, a suborbital version of the Electron, to expand testing of hypersonic technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Under the MACH-TB 2,0 program led by Kratos, Rocket Lab will launch its&nbsp;full-scale HASTE rocket, a suborbital version of the Electron, to expand testing of hypersonic technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-rocketlab-kratos-haste-launch.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"HASTE rocket launch.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-rocketlab-kratos-haste-launch.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Rocket Lab USA Inc.</p>\n</div>\n\n<p>Global launch services and space systems company&nbsp;<a href=\"https://www.rocketlabusa.com/\" target=\"_blank\">Rocket Lab USA&nbsp;Inc.</a>&nbsp;(Long Beach, Calif., U.S.) has been selected by Kratos&nbsp;Defense (San Diego, Calif., U.S.) to launch a full-scale hypersonic test flight for the Department of Defense (DOD) under the Multi-Service Advanced Capability Hypersonic Test Bed (MACH-TB) 2.0 program. The mission will launch on Rocket Lab&rsquo;s HASTE rocket from Rocket Lab Launch Complex 2 on Wallops Island, Virginia, no earlier than Q1&nbsp;2026.</p>\n\n<p>The launch agreement is the first full-scale flight test to be awarded by Kratos under the MACH-TB 2.0 contract, a $1.45 billion program designed to rapidly expand the number and frequency of opportunities to test hypersonic technologies for the U.S.&nbsp;Rocket Lab was selected to join the Kratos-led team of subcontractors for MACH-TB 2.0&nbsp;in January 2025 after previously delivering multiple successful hypersonic test launches for the first iteration of the MACH-TB program from 2023. Successful missions to date include three launches for the DOD &mdash;&nbsp;including twice within just 21 days &mdash;&nbsp;from Rocket Lab&rsquo;s Launch Complex 2 in Virginia.</p>\n\n<p>A suborbital variant of the&nbsp;<a href=\"https://www.compositesworld.com/articles/rocket-lab-all-composite-electron-launch-vehicle\" target=\"_blank\"><em>Electron </em>orbital rocket</a>,<em> </em>HASTE includes much of the same innovative technology as <em>Electron</em>, including carbon fiber composite structures and 3D printed rocket engines, but has a modified upper kick stage tailored for hypersonic technology tests and a larger payload capacity of up to 700 kilograms. According to Rocket Lab,&nbsp;HASTE can deploy technologies at speeds of more than 7.5 kilometers per second to test air-breathing, glide and ballistic payloads, as well as technologies to re-enter Earth&rsquo;s atmosphere from space. Combined, Rocket Lab&rsquo;s HASTE and <em>Electron</em> launch vehicles have deployed 200-plus&nbsp;payloads to date.</p>\n\n<p>&ldquo;In less than two years since its first launch, HASTE has quickly emerged as a leading commercial test platform of hypersonic systems,&rdquo; says Sir Peter Beck, Rocket Lab founder and CEO. &ldquo;With our operational speed and cadence, and the ability to serve multiple mission profiles all in one platform, HASTE is helping to move the needle on hypersonic innovation.&rdquo;</p>\n\n<p>The mission is the latest to join an increasing manifest of HASTE launches for 2025 and 2026. Upcoming flight tests with HASTE include a mission for the Defense Innovation Unit to deploy a scram-jet powered vehicle at hypersonic speed; continuation of a multi-launch contract with Leidos to deploy five missions in total for the first iteration of the MACH-TB program; and a hypersonic test flight for a confidential customer.</p>\n\n<p>In addition to MACH-TB, HASTE has recently been onboarded to two significant defense initiatives. In the U.S., HASTE is now part of the $46 billion Enterprise-Wide Agile Acquisition Contract (EWAAC) under the U.S. Air Force. This inclusion enables Rocket Lab to compete to provide launch services and engineering expertise to support the development of new capabilities. In the U.K., HASTE has been added to the Ministry of Defence&rsquo;s&nbsp;Hypersonic Technologies &amp; Capability Development Framework (HTCDF), a &pound;1 billion (~$1.3 billion) program aimed at rapidly advancing the nation&rsquo;s hypersonic capabilities.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rocket-lab-awarded-haste-launch-contract-for-us-dod"
      }
    ],
    "link": "https://www.compositesworld.com/news/rocket-lab-awarded-haste-launch-contract-for-us-dod"
  },
  {
    "published": "Fri, 2 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      16,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "Airbus Q1 2025 demonstrates production progress despite headwinds",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus Q1 2025 demonstrates production progress despite headwinds"
    },
    "summary": "The company sticks to its full-year 2025 forecasts that exclude U.S. tariffs, including&nbsp;delivery of around 820 aircraft and production ramp-up targets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company sticks to its full-year 2025 forecasts that exclude U.S. tariffs, including&nbsp;delivery of around 820 aircraft and production ramp-up targets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-airbus-a320-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airbus A320.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-airbus-a320-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p dir=\"ltr\">Airbus SE (Amsterdam, Netherlands) has reported consolidated financial results for the&nbsp;first quarter (Q1) of 2025, ended March 31. In that time, Airbus says that 136 commercial aircraft were delivered and revenues of&nbsp;&euro;13.5 billion were reached, with an&nbsp;&euro;0.6 billion EBIT Adjusted.</p>\n\n<p dir=\"ltr\">&ldquo;Our Q1 results demonstrate the progress we are making on our priorities across the business. We are ramping up production in line with our plan but the delivery profile will be backloaded, reflecting the specific supply chain challenges we are facing this year,&rdquo; says&nbsp;Guillaume Faury, Airbus CEO. &ldquo;We maintain the guidance that excludes tariffs which are adding complexity and remain uncertain in terms of implementation, scope and duration. We are closely monitoring and assessing the situation, but it is too early to quantify the impact today. When it comes to our defense activities, we support the recent approach to strengthen the European defense industry and we stand ready with our broad portfolio of products and solutions to respond to our customers&rsquo; requirements.&quot;</p>\n\n<p dir=\"ltr\">Gross commercial aircraft orders totaled 280 (Q1 2024: 170 aircraft) with net orders of 204 aircraft after cancellations (Q1 2024: 170 aircraft). The order backlog amounted to 8,726 commercial aircraft at the end of March 2025. Airbus Helicopters registered 100 net orders (Q1 2024: 63 units), which were well spread across the product range. Order intake by value at Airbus Defence and Space increased to &euro;2.6 billion (Q1 2024: &euro;2.0 billion), reflecting good momentum across its business lines for both platforms and services.</p>\n\n<p dir=\"ltr\">Consolidated<strong>&nbsp;revenues&nbsp;</strong>increased 6% year-on-year to &euro;13.5 billion (Q1 2024: &euro;12.8 billion). A total of 136 commercial aircraft were delivered (Q1 2024: 142 aircraft), comprising 17 A220s, 106 A320 Family, 4 A330s<sup>&nbsp;</sup>and 9 A350s. Revenues generated by Airbus&rsquo; commercial aircraft activities increased 4% to &euro;9.5 billion, mainly reflecting a more favorable foreign exchange environment which was partially offset by the lower number of deliveries.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-airbus-q125-consolidated-chart.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-airbus-q125-consolidated-chart.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Airbus</p>\n</div>\n\n<p dir=\"ltr\">Airbus Helicopters&rsquo; revenues increased by 10% to &euro;1.6 billion, reflecting a solid performance from programs and growth in services. Helicopter deliveries totaled 51 units (Q1 2024: 50 units). Revenue&nbsp;at Airbus Defence and Space increased 11% year-on-year to &euro;2.7 billion, driven by higher volumes across its business lines.&nbsp;</p>\n\n<p dir=\"ltr\">Consolidated<strong>&nbsp;EBIT Adjusted&nbsp;</strong>totaled &euro;624 million (Q1 2024: &euro;577 million). EBIT&nbsp;Adjusted related to Airbus&rsquo;&nbsp;commercial aircraft activities was stable at &euro;494 million (Q1 2024: &euro;507 million), with the decrease in deliveries offset by the favorable hedge rate and lower R&amp;D expenses.</p>\n\n<p dir=\"ltr\">According to Airbus, the A320 Family program&nbsp;continues to ramp up toward a rate of 75 aircraft/month in 2027. The company is stabilizing the A330 monthly production rate at around four aircraft. Specific supply chain challenges, <a href=\"https://www.compositesworld.com/news/spirit-aerosystems-signs-divestiture-agreement-with-airbus\" target=\"_blank\">notably with Spirit AeroSystems</a>, are currently putting pressure on the ramp-up of the A350 and the A220. Airbus&nbsp;continues to target rate 12 for the A350 in 2028 and a monthly A220 production rate of 14 aircraft in 2026.</p>\n\n<blockquote>\n<p dir=\"ltr\">Read &ldquo;<a href=\"https://www.compositesworld.com/articles/composites-end-markets-aviation-and-advanced-air-mobility-(2025)\">Composites end markets: Aviation and advanced air mobility (2025)</a>&rdquo;</p>\n</blockquote>\n\n<p dir=\"ltr\">Airbus Helicopters&rsquo; EBIT Adjusted increased to &euro;78 million (Q1 2024: &euro;71 million), reflecting the solid performance in programs and services growth. In March, the new <a href=\"https://www.compositesworld.com/news/airbus-helicopters-introduces-light-twin-h140-with-2028-eic\" target=\"_blank\">H140 multi-mission helicopter</a> was introduced and received its first orders and commitments.&nbsp;&nbsp;</p>\n\n<p dir=\"ltr\">EBIT Adjusted at Airbus Defence and Space amounted to &euro;77 million (Q1 2024: &euro;-9 million), reflecting higher volumes and improved profitability mainly for Air Power services and Connected Intelligence. On the A400M program, the company remains in constructive discussions with the launch nations and OCCAR on the production plan. In light of uncertainties regarding the level of aircraft orders, Airbus continues to assess the potential impact on the program&rsquo;s manufacturing activities. Risks on the qualification of technical capabilities and associated costs remain stable.</p>\n\n<p dir=\"ltr\">Consolidated<strong>&nbsp;self-financed R&amp;D</strong>&nbsp;<strong>expenses&nbsp;</strong>totaled &euro;673 million (Q1 2024: &euro;743 million). Consolidated<strong>&nbsp;EBIT<sup>&nbsp;</sup>(reported)</strong>&nbsp;amounted to &euro;473 million (Q1 2024: &euro;609 million), including net adjustments of &euro;-151 million.</p>\n\n<p dir=\"ltr\">The financial result was &euro;621 million (Q1 2024: &euro;229 million), mainly reflecting the revaluation of certain equity investments, partially offset by the evolution of the U.S. dollar and the revaluation of financial instruments. Consolidated&nbsp;<strong>net income</strong>&nbsp;was &euro;793 million (Q1 2024: &euro;595 million) with consolidated reported&nbsp;<strong>earnings per share&nbsp;</strong>of &euro;1.01 (Q1 2024: &euro;0.76).</p>\n\n<p dir=\"ltr\">Consolidated<strong>&nbsp;free cash flow</strong>&nbsp;before customer financing&nbsp;was &euro;-310 million (Q1 2024: &euro;-1,791 million), reflecting the planned inventory buildup to support the ramp-up and the commercial momentum across the company. Consolidated&nbsp;<strong>free cash flow</strong>&nbsp;totaled &euro;-296 million (Q1 2024: &euro;-1,799 million). The&nbsp;<strong>gross cash position</strong>&nbsp;stood at &euro;26.1 billion at the end of March 2025 (year-end 2024: &euro;26.9 billion), with a consolidated&nbsp;<strong>net cash position</strong>&nbsp;of &euro;11.0 billion (year-end 2024: &euro;11.8 billion).</p>\n\n<h3>Outlook</h3>\n\n<p dir=\"ltr\">As the basis for its 2025 guidance, Airbus excludes the impact of tariffs on its business. The company&rsquo;s 2025 guidance includes the impact of the integration of certain Spirit AeroSystems work packages based on preliminary estimates and an assumed closing in the third quarter of 2025. The company assumes no additional disruptions to global trade or the world economy, air traffic, the supply chain, its internal operations and ability to deliver products and services. On that basis, Airbus targets to achieve in 2025:</p>\n\n<ul>\n\t<li>Around 820 commercial aircraft deliveries;</li>\n\t<li>EBIT Adjusted of around &euro;7.0 billion;</li>\n\t<li>Free cash flow before customer financing of around &euro; 4.5 billion.</li>\n</ul>\n\n<p dir=\"ltr\">The anticipated impact of the integration of certain Spirit AeroSystems work packages on the company&rsquo;s guidance remains in line with previous estimates.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-q1-2025-demonstrates-production-progress-despite-headwinds"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-q1-2025-demonstrates-production-progress-despite-headwinds"
  },
  {
    "published": "Fri, 2 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      16,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "Henkel, Synthomer partner to cut carbon emissions in adhesives",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Henkel, Synthomer partner to cut carbon emissions in adhesives"
    },
    "summary": "Integration of Synthomer Clima resins into Henkel Technomelt hot-melt adhesive portfolio targets&nbsp;significant Scope 3 GHG emissions reductions for electronics, automotive, comsumer and composites customers.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Integration of Synthomer Clima resins into Henkel Technomelt hot-melt adhesive portfolio targets&nbsp;significant Scope 3 GHG emissions reductions for electronics, automotive, comsumer and composites customers."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-henkel-hotmelt-adhesives.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Adhesive particles.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-henkel-hotmelt-adhesives.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Henkel Corp.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/henkel\" target=\"_blank\">Henkel Corp.</a> (Madison Heights, Mich., U.S.)&nbsp;a global adhesives, sealants and functional coatings supplier, and highly specialized polymers and ingredients supplier <a href=\"https://www.synthomer.com/\" target=\"_blank\">Synthomer</a> (Roebuck, S.C., U.S.) have formed a strategic partnership and supply agreement focused on enabling carbon emission reductions in Henkel&rsquo;s Technomelt&nbsp;hot melt adhesive product portfolio for the European, Indian, Middle Eastern and African markets. This collaboration highlights both companies&rsquo; leadership in advancing sustainable adhesives through innovative collaborations along the value chain.</p>\n\n<p>The&nbsp;partnership follows Synthomer&rsquo;s recent launch of Clima-branded products. Products with this designation, like the company&rsquo;s Regalite&nbsp;line, deliver at least a 20% reduction cradle-to-gate in the product carbon footprint by using renewable energy in the production process. Henkel and Synthomer have jointly developed a framework that links renewable energy use directly to specific adhesive products, enabling measurable reductions in carbon emissions.</p>\n\n<div class=\"article_sidebar\">\n<p>Hot-melt adhesives are used in a variety of industries and applications from packaging and consumer goods to electronics and automotive. They can also be a&nbsp;suitable option for some composite applications, offering benefits like fast cure times and easy application, particularly for bonding porous substrates.&nbsp;</p>\n\n<p>Technomelt adhesives are one of many solution options Henkel offers. Adhesives, sealants and surface treatment portfolios are available for composite applications, including those for repair, bonding&nbsp;and reinforcement.</p>\n</div>\n\n<p>Henkel and Synthomer&rsquo;s partnership is built on a mutual commitment to sustainability. Henkel aims to reduce absolute Scope 3 greenhouse gas (GHG) emissions by 30%&nbsp;by 2030 (base year 2021), with the goal of becoming net zero by 2045. To support this, it is incorporating raw materials with reduced process emissions footprint into adhesive formulations, lowering Scope 3 emissions while maintaining high-quality performance. Synthomer is contributing by reducing emissions from manufacturing operations, with a goal to cut absolute Scope 1 and 2 GHG&nbsp;emissions 47%&nbsp;by 2030, using 2019 as the base year in line with its Science-Based Target&nbsp;goals</p>\n\n<p>Synthomer&rsquo;s improved manufacturing approach leverages renewable electricity, biogas and process optimization to significantly reduce the carbon footprint of its products. These carbon reductions are measured through product carbon footprint (PCF) reporting, which follows ISO14067 standards and the Together for Sustainability (TfS) guidelines. The PCF methodology used in this collaboration is being externally validated by T&Uuml;V S&Uuml;D, adding a layer of verification and credibility.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/henkel-synthomer-partner-to-cut-carbon-emissions-in-adhesives"
      }
    ],
    "link": "https://www.compositesworld.com/news/henkel-synthomer-partner-to-cut-carbon-emissions-in-adhesives"
  },
  {
    "published": "Fri, 2 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      15,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "UTComp NDT inspection prepares FRP Class 40 racing sailboat",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "UTComp NDT inspection prepares FRP Class 40 racing sailboat"
    },
    "summary": "Ahead of the competitive Globe40 competition in September, UTComp&rsquo;s ultrasonic capabilities were used to test the viability of the craft&rsquo;s carbon fiber mast, boom and bowsprit on the water.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Ahead of the competitive Globe40 competition in September, UTComp&rsquo;s ultrasonic capabilities were used to test the viability of the craft&rsquo;s carbon fiber mast, boom and bowsprit on the water."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-utcomp-boat-ndt.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-utcomp-boat-ndt.jpg;maxWidth=385\" /></a></div>\n\n<p>Rob Kohli, UTComp engineering analyst, is conducting the inspection of <em>Whiskey Jack</em>. Source | Melodie Schaffer</p>\n</div>\n\n<p>Canadian composites inspection and engineering firm&nbsp;<a href=\"https://urldefense.com/v3/__http:/link.mediaoutreach.meltwater.com/ls/click?upn=7Ut9p2MRymDeJ6Cfb59TXXjdL4yxxMmYQn-2FcFc-2B-2Fdo4-3Dhn1y_62zRP68w1WV-2Bk4-2BaOruLEJ9-2BV2-2FR0sT81xH-2B9ylFc1J3sl9wM3bzHdUAugLkHuY5QfTLE-2FKpui8AmhkblZ31yOs714yoR57NqHZmMQCivO7lvDnlo8roG5nDSCdkkq7X70tFpHAt6Xka9VF5o-2FuY8cEU6tn59ixti1JJDNM829hFcUZ7fKARV6rB8quC2g4Rrq1uZD-2BupfXyU-2F-2BOaVoVO-2BSiJxeDoIgSCRXf7wLfwbyyvNuZIyX5cj7CX4TvHiSCRVFUaw2d0izQhH3p9tKr-2FdSUykluvUL3lZKbdfmAwETv5XcAU-2FhFOx-2BNU66JAxDps3nSKb2tuVtkyJNnb5fs6C-2BVC2DrWHFfBs76qQKaSjBE-2BWHFlJXB-2Fe-2B1RvtCCIn9Q-2FxSiXTXyFjWghoru64Ouw-3D-3D__;!!KeUdynatPK5p!7OAEOnpN1XwPZ2WoLrdDNcZ8mkuJORKiFBGO-VU2eXPyGy05j4I6fwS1PJmL1E_yi8r--82jFEF4W_CNvA$\" target=\"_blank\">UTComp</a>&nbsp;(Cambridge, Ontario) has achieved its first mechanical integrity inspection of a Class 40 racing sailboat ahead of the Globe40 around-the-world race. It began when UTComp&rsquo;s expertise in nondestructive assessment of fiber-reinforced polymer (FRP) industrial equipment prompted blue water sailboat racer, Melodie Schaffer, to reach out.</p>\n\n<p>&ldquo;Melodie approached us to see if we could nondestructively test the carbon fiber mast, boom and bowsprit of <em>Whiskey Jack</em>, her Class 40 offshore racing sailboat,&rdquo; explains&nbsp;Jo Anne Watton, CEO of UTComp. &ldquo;We were&nbsp;excited to provide this support &mdash;&nbsp;this project was a first for us!&rdquo;</p>\n\n<p>Schaffer is preparing the vessel for the second edition of&nbsp;<a href=\"https://www.globe40.com/en/\" target=\"_blank\">the&nbsp;Globe40</a>, a sailing race&nbsp;organized by Sirius Events.&nbsp;The first leg in the 8-month, 30,000 nautical mile event will be underway in Cadiz, Spain, starting in September 2025. It will be Schaffer&rsquo;s&nbsp;second attempt at the challenging double-handed race in which a crew of two manages all aspects of sailing, from navigation and sail handling to cooking and cleaning.</p>\n\n<p>Watton and UTComp CTO Geoff Clarkson met with Schaffer and co-skipper Jeff Engholm in Toronto in March 2025 for an up-close look at <em>Whiskey Jack</em> to start developing an UltraAnalytix inspection plan.</p>\n\n<p>Carbon fiber sailing masts and booms experience tremendous stresses and strains, especially on open water, including:</p>\n\n<ul>\n\t<li>Compression from rigging tension</li>\n\t<li>Bending from sail loads</li>\n\t<li>Local stresses at the gooseneck, which connects the boom to the mast</li>\n\t<li>Compression and shear forces at the mast step, where the base of the mast is secured to the deck or keel of the boat.</li>\n</ul>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-utcomp-whiskey-jack.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-utcomp-whiskey-jack.png;maxWidth=385\" /></a></div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-UTComp-Melodie.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-UTComp-Melodie.png;maxWidth=720\" /> </a></div>\n</div>\n\n<p>From left to right: Jo Anne Watton, CEO of UTComp; Tom Shewfelt, director of sales and business development, UTComp; Geoff Clarkson, CTO of&nbsp;UTComp; Melodie Schaffer and Jeff Engholm, co-skippers of <em>Whiskey Jack</em>. Sources |&nbsp;UTComp.&nbsp;</p>\n</div>\n\n<p>It&rsquo;s not uncommon for a mast to break or fall over during a race, which is also&nbsp;devastating and potentially life-threatening for the racers.</p>\n\n<p>According to UTComp, ultrasonic&nbsp;inspection offers&nbsp;several key advantages over other nondestructive methods for assessing the condition of composite marine equipment. For example, ultrasound can be used&nbsp;to measure the thickness of the mast wall and identify voids, porosity, inclusions in the laminate and other defects in the material; flaws in the material, whether due to manufacturing defects or damage from corrosion and mechanical stresses, can result in failures.</p>\n\n<p>The UTComp inspection took place in April.</p>\n\n<p>&ldquo;In its basic form, a mast is simply a beam and our engineers are well trained to analyze and assess beams,&rdquo; Clarkson says. &ldquo;We checked every location where forces were applied to the mast to measure the effect of the forces on the polymer that holds the carbon fibers in place. We did not have details of the carbon fiber orientation and layup so we used a conservative approach that has been developed for Fitness for Service assessments of pressure vessels.&rdquo;</p>\n\n<p>The evaluation, which involves analyzing the ultrasound data using UTComp&rsquo;s proprietary algorithm,&nbsp;confirmed <em>Whiskey Jack</em> is fit for service.</p>\n\n<p>&ldquo;One more important step is complete to make sure <em>Whiskey Jack</em> is ready to race around the world,&rdquo; reports&nbsp;Schaffer on the <a href=\"https://www.instagram.com/p/DI49umSuhNB/?utm_source=ig_web_copy_link&amp;igsh=MzRlODBiNWFlZA==\" target=\"_blank\"><em>Whiskey Jack</em> 128&nbsp;Instagram page</a>.</p>\n\n<p>&ldquo;UTComp is proud to sponsor the <em>Whiskey Jack</em> crew by donating our inspection services,&rdquo; adds Watton. &ldquo;We wish them fair winds and good fortune in the Globe 40 race.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/utcomp-ndt-inspection-prepares-frp-class-40-racing-sailboat"
      }
    ],
    "link": "https://www.compositesworld.com/news/utcomp-ndt-inspection-prepares-frp-class-40-racing-sailboat"
  },
  {
    "published": "Fri, 2 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      14,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "SPE Thermoset Topcon 2025 highlights thermoset technology opportunities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SPE Thermoset Topcon 2025 highlights thermoset technology opportunities"
    },
    "summary": "Industry is encouraged to attend this in-person May event which educates, promotes and recognizes technical advancements in thermosets across multiple industries. OEMs are invited to register for free.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Industry is encouraged to attend this in-person May event which educates, promotes and recognizes technical advancements in thermosets across multiple industries. OEMs are invited to register for free."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Tradeshow carpet.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-tradeshow-floor-GettyImages1.jpg;maxWidth=720\" /> </div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>The organizing committee for SPE&nbsp;Thermoset TopCon invites all thermoset industry professionals to register to attend the thermoset technology conference and&nbsp;expo&nbsp;<a href=\"https://spethermosets.org/topcon/\" target=\"_blank\">SPE Thermoset TopCon Conference</a> at the Monona Terrace Community &amp; Convention Center in Madison, Wisconsin from&nbsp;May 13-14, 2025.</p>\n\n<p>The SPE Thermoset Topcon 2025 event will feature technical presentations and exhibits highlighting advances in materials, processes&nbsp;and equipment for thermoset technologies in electrical, automotive, off-highway, appliance, aerospace, building and construction, oil and gas, and other industries. A list of 2025 event speakers and topics <a href=\"https://spethermosets.org/wp-content/uploads/2025/04/TOPCON25Speakers-1.pdf\" target=\"_blank\">is available here</a>.</p>\n\n<p>OEMS&nbsp;who manufacture finished products available for sale using thermoset technologies are invited to attend for FREE. To register, OEMs should select the OEM registration option. OEM companies can include the manufacture of vehicles and equipment in:</p>\n\n<ul>\n\t<li>Automotive</li>\n\t<li>Aerospace</li>\n\t<li>Military</li>\n\t<li>Heavy truck</li>\n\t<li>Lawn and garden</li>\n\t<li>Medical</li>\n\t<li>Oil and gas</li>\n\t<li>Construction</li>\n\t<li>Marine (ships, boats, etc.)</li>\n\t<li>Appliance</li>\n\t<li>Kitchen, bath and plumbing</li>\n\t<li>Electrical</li>\n\t<li>Power tools</li>\n\t<li>Doors and decks</li>\n\t<li>Recreational vehicles</li>\n\t<li>Manufactured housing</li>\n\t<li>Sports and leisure.</li>\n</ul>\n\n<p><a href=\"https://spethermosets.org/wp-content/uploads/2024/04/TOPCONSaveDate-8.pdf\" target=\"_blank\">Sponsorship opportunities are still available.</a> Contact Teri Chouinard at <a href=\"mailto:intuitgroup@gmai.com\" target=\"_blank\">intuitgroup@gmail.com</a> with inquiries.</p>\n\n<p>The SPE&rsquo;s mission is to promote scientific and engineering knowledge relating to plastics/polymers worldwide and to educate industry, academia and the public about technological advances.&nbsp;The <a href=\"https://www.compositesworld.com/suppliers/society-of-plastics-engineers-thermoset-division\" target=\"_blank\">SPE Thermoset Division</a>, a specialized technical division of SPE,&nbsp;is active in educating, promoting, recognizing&nbsp;and communicating technical advancements in thermoset technology in multiple industries.</p>\n\n<p>Thermosets offer the opportunity to consolidate complex parts, reduce weight and eliminate secondary operations&nbsp;while improving end-use performance and cost.&nbsp;They are injection, compression, and transfer moldable providing design freedom as well as a full range of properties, colors and high quality finishes.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spe-thermoset-topcon-2025-highlights-thermoset-technology-opportunities"
      }
    ],
    "link": "https://www.compositesworld.com/news/spe-thermoset-topcon-2025-highlights-thermoset-technology-opportunities"
  },
  {
    "published": "Wed, 30 Apr 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      4,
      30,
      18,
      0,
      0,
      2,
      120,
      0
    ],
    "title": "Bcomp, Siux bring natural fiber composites to padel tennis",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Bcomp, Siux bring natural fiber composites to padel tennis"
    },
    "summary": "Flax fibers enter the court through Siux&rsquo;s GEA padel racquets, delivering high-performance, well-balance sports equipment to a rapidly growing sports market.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Flax fibers enter the court through Siux&rsquo;s GEA padel racquets, delivering high-performance, well-balance sports equipment to a rapidly growing sports market."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-bcomp-siux-padel.jpg\" target=\"_blank\"><img alt=\"GEA padel leaning against a tree.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-bcomp-siux-padel.jpg;maxWidth=385\" /></a></div>\n\n<p>GEA padel. Source | Siux</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a><a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\"> Ltd.</a> (Fribourg, Switzerland) has collaborated with&nbsp;Spanish padel brand Siux Padel (Madrid) to delop the GEA racquet,&nbsp;an advanced-level padel&nbsp;integrating Bcomp&rsquo;s ampliTex&nbsp;natural fiber reinforcement. The delivery of enhanced precision provides&nbsp;better game control and playability to players of all levels while reducing environmental impact.</p>\n\n<p>Padel &mdash; also known as padel tennis&nbsp;&mdash; is currently one of the fastest-growing sports globally, with about 30 million active players in more than 140 countries around the world. Contributing to its popularity are its highly interactive and social nature, since it is generally played in doubles, making it accessible to people of all skill levels. Easy-to-use, stringless rackets made from composite materials with a perforated hitting surface is the main equipment used in this sport. Both companies believe that this exponential growth gives an&nbsp;opportunity to bring bio-based materials to the wider padel market.</p>\n\n<p>The launch of the GEA marks the inaugural racket series from Siux as a fully independent brand, a significant step in 2024 after its dissociation from Padel Nuestro. This launch underscores Siux&rsquo;s commitment to advancing padel as a sport through technical excellence and responsible design, setting the standard for the padel industry. With an energetic identity and playful feel, the GEA racket is engineered for precision, offering a broader optimized spot, enhanced power, and a medium touch that supports balanced, controlled gameplay.</p>\n\n<p>At the heart of GEA&rsquo;s performance lies ampliTex&nbsp;flax fabrics, used on both the front and back of the racket. Developed by Bcomp, the natural fiber reinforcement offers optimal&nbsp;mechanical properties with minimal environmental impact. Moreover, the fibers&rsquo;s structure provides strong resistance to breakage, damping properties to reduce vibration for a better ball control, and a lightweight yet durable composition, ideal for high-performance sports equipment.</p>\n\n<p>Following the GEA padel, Siux plans to expand the use of natural fiber composites across its product lineup.&nbsp;&ldquo;As padel continues its rapid rise, we see a unique opportunity, and a responsibility, to lead with purpose,&rdquo; says Stefano Barbero, product director at Siux. &ldquo;With GEA, we set out to prove that performance and sustainability can go hand in hand. It&rsquo;s a reflection of our commitment to doing things differently: grounded in nature, driven by precision and built for the future of the sport.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/bcomp-siux-bring-natural-fiber-composites-to-padel-tennis"
      }
    ],
    "link": "https://www.compositesworld.com/news/bcomp-siux-bring-natural-fiber-composites-to-padel-tennis"
  },
  {
    "published": "Wed, 30 Apr 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      4,
      30,
      17,
      0,
      0,
      2,
      120,
      0
    ],
    "title": "RWC delivers composite frac plugs for downhole environments",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "RWC delivers composite frac plugs for downhole environments"
    },
    "summary": "Filament-wound fiberglass/epoxy frac plug billets, developed as part of a contract with an oilfield service company, address the very demanding performance needs of oil and gas.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Filament-wound fiberglass/epoxy frac plug billets, developed as part of a contract with an oilfield service company, address the very demanding performance needs of oil and gas."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-rwc-flac-plug-billets.jpg\" target=\"_blank\"><img alt=\"Stack of ultra-high performance frac plug billets\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-rwc-flac-plug-billets.jpg;maxWidth=385\" /></a></div>\n\n<p>Ultra-high performance frac plug billets. Source (All Images) | Rock West Composites (RWC)</p>\n</div>\n\n<p>On April 28,&nbsp;<a href=\"https://www.compositesworld.com/suppliers/rock-west-composites\" target=\"_blank\">Rock West Composites</a> (RWC, San Diego, Calif., U.S.) says that it begins delivery of ultra-high-performance frac plug billets to an oilfield service company that is a major&nbsp;supplier to the hydraulic fracturing market. RWC has developed a composite material for frac plugs that can withstand cyclical testing at 12,000 psi and 250&deg;F without failure.&nbsp;</p>\n\n<p>This ultra-high-performance frac plug material has been in development for more than&nbsp;a year, RWC reports. It is made of filament-wound fiberglass composite with a custom epoxy resin. The plugs have passed rigorous testing in RWC&rsquo;s laboratory and the customer&rsquo;s in situ downhole environments. Each lot is proof tested to guarantee performance for these extreme applications.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-rwc-frac-filament-winding-operations.jpg\" target=\"_blank\"><img alt=\"Frac plug filament winding process.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-rwc-frac-filament-winding-operations.jpg;maxWidth=385\" /></a></div>\n\n<p>Frac plug filament winding process.</p>\n</div>\n\n<p>RWC manufactures and tests the plug billets at its facility in West Jordan, Utah, the location of its filament winding center. This facility has 27 spindles across multiple winders and the capacity to manufacture up to 6,000 billet tubes per month. RWC anticipates significant market demand for this product due to the increasing challenges oilfield service companies face with downhole operations.</p>\n\n<p>&ldquo;We brought our filament winding expertise to the table. Our engineering team works on highly demanding applications, including space and aerospace, so we took that knowledge of material performance downhole,&rdquo; says Adam Creer, commercial segment director. &ldquo;We are glad to have partnered with our customer to meet their very demanding requirements and develop our own technology that solves an industry-wide challenge.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rwc-delivers-composite-frac-plugs-for-downhole-environments"
      }
    ],
    "link": "https://www.compositesworld.com/news/rwc-delivers-composite-frac-plugs-for-downhole-environments"
  },
  {
    "published": "Wed, 30 Apr 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      4,
      30,
      16,
      0,
      0,
      2,
      120,
      0
    ],
    "title": "Aimen contributes to OVERLEAF 3D printed cryogenic tank",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aimen contributes to OVERLEAF 3D printed cryogenic tank"
    },
    "summary": "Dual thermoplastic composite system, developed to&nbsp;withstand temperatures below -250&deg;C, demonstrates aviation decarbonization strategies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Dual thermoplastic composite system, developed to&nbsp;withstand temperatures below -250&deg;C, demonstrates aviation decarbonization strategies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-aimen-overleaf-tank-inside.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Half of the cryogenic tank.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-aimen-overleaf-tank-inside.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | Aimen Technology Centre</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://www.aimen.es/\" target=\"_blank\">Aimen&nbsp;Technology Centre</a>&nbsp;(O Porri&ntilde;o, Spain) announces a milestone achieved in the 3D manufacture of a cryogenic tank demonstrator as part of the OVERLEAF project. The project, led by Spanish aeronautics company Aciturri, seeks to develop future liquid hydrogen (LH<sub>2</sub>) storage tanks for future aircraft (<a href=\"https://www.compositesworld.com/news/overleaf-webinars-share-composite-lh2-innovations-results\" target=\"_blank\">learn more about the project&rsquo;s innovations</a>).</p>\n\n<p>The designed solution consists of a dual system: an inner tank made of thermoplastic, responsible for maintaining LH<sub>2</sub> at extreme temperatures, and an outer carbon fiber structure that provides strength and structural safety. Aimen&nbsp;was responsible for manufacturing the inner tank, using high-precision, large-format additive manufacturing (AM).</p>\n\n<p>&ldquo;This is a technological solution that will mark a before and after in the manufacturing of components for sustainable aviation,&rdquo;&nbsp;explains Pablo Romero, team leader of the Additive Manufacturing of Composites R&amp;D group and coordinator of the OVERLEAF project at Aimen. &ldquo;We have applied all of our knowledge in robotics, AM&nbsp;and process design to address a highly technical challenge.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-aimen-overleaf-cryogenic-tank.jpeg\" target=\"_blank\"><img alt=\"Completed 3D printed tank.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-aimen-overleaf-cryogenic-tank.jpeg;maxWidth=385\" /></a></div>\n</div>\n\n<p>The 1.5-meter-diameter tank was manufactured in a robotic cell developed by&nbsp;Aimen, equipped with high-performance 3D printing systems and infrared heating systems to ensure proper adhesion between layers. The process required more than 100 uninterrupted hours of printing and was monitored in real time using thermal cameras.</p>\n\n<p>In addition to its technological contribution, Aimen&nbsp;has worked with the French center Canoe&nbsp;to develop a new sustainable material, based on a bio-based thermoplastic reinforced with natural fibers, which enables&nbsp;the printing of strong, lightweight&nbsp;and environmentally friendly structures.</p>\n\n<p>&ldquo;This project demonstrates how technology can respond to the major challenges of decarbonization. Investing in hydrogen as an energy vector also means transforming the systems that make it viable, and Aimen&nbsp;has a lot to contribute to this,&rdquo;&nbsp;adds Xabier P&eacute;rez, researcher in the Additive Manufacturing of Composites R&amp;D group and head of the tank&rsquo;s additive manufacturing activities at Aimen.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aimen-contributes-to-overleaf-3d-printed-cryogenic-tank"
      }
    ],
    "link": "https://www.compositesworld.com/news/aimen-contributes-to-overleaf-3d-printed-cryogenic-tank"
  },
  {
    "published": "Wed, 30 Apr 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      4,
      30,
      15,
      0,
      0,
      2,
      120,
      0
    ],
    "title": "Royal3D uses large-scale 3D printing for aquatic drone production",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Royal3D uses large-scale 3D printing for aquatic drone production"
    },
    "summary": "ShearWater aquatic drone, manufactured with fiberglass-reinforced recycled PETG, demonstrates precision 3D printing capabilities, sustainability focus and design innovation for maritime and heavy-duty applications.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ShearWater aquatic drone, manufactured with fiberglass-reinforced recycled PETG, demonstrates precision 3D printing capabilities, sustainability focus and design innovation for maritime and heavy-duty applications."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-roya3d-shearwater-drone.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </a></div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-royal3d-drone.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ShearWater aquatic drone.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-royal3d-drone.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | Royal3D</p>\n</div>\n\n<p><a href=\"https://www.royal3d.nl/\" target=\"_blank\">Royal3D</a> (Rotterdam, Netherlands) highlights its&nbsp;large-scale additive manufacturing (LSAM) capabilities through the&nbsp;ShearWater aquatic drone, a recent project partly subsidized by the ER CrossRoads program meant to redefine surveillance, data gathering&nbsp;and risk reduction in maritime environments.</p>\n\n<p>According to Royal3D, the <a href=\"https://www.royal3d.nl/posts/royal3d-launches-the-shearwater-aquatic-drone-a-new-era-in-maritime-innovation\" target=\"_blank\">autonomous aquatic drone</a> &mdash; integrating maritime AI-driven technology and 3D printing&nbsp;&mdash;&nbsp;could be used as a&nbsp;prototype for startups developing their own autonomous system. The&nbsp;ShearWater drone was printed via Royal3D&rsquo;s ABB Robotic Arm 3D printer and a CEAD (Delft, Netherlands) LFAM printer&nbsp;using recycled PETG reinforced with 19% short glass fibers. Not only does this achieve light weight and impact resistance, but Royal3D can additionally recycle the drone&rsquo;s 3D printed hull.</p>\n\n<p>At the heart of the ShearWater&rsquo;s design is&nbsp;Royal3D&rsquo;s IP knowledge, which enables precise control over layer adhesion during the 3D printing process using InfraRed cameras coupled with the company&rsquo;s AM techniques.&nbsp;</p>\n\n<p>&ldquo;What sets Royal3D apart is our ability to adapt advanced 3D printing technologies for industries like maritime and heavy-duty manufacturing, where the demands on strength and durability are unparalleled,&rdquo; says Fulko Roos, founder of Royal3D and Royal Roos. &ldquo;At the same time, our expertise in urban design and architectural applications continues to deliver innovative solutions across diverse sectors.&rdquo;</p>\n\n<p>Royal3D has more than 10 years of industry experience.&nbsp;The company specializes in producing large-scale, high-performance components such as transport cradles, structural elements&nbsp;and customized industrial parts, owning what it says are two of the largest printers in Europe. Additionally, Royal3D is committed to sustainability, using recycled and recyclable materials to reduce environmental impact and promote a more sustainable approach to manufacturing.</p>\n\n<p>While Royal3D remains a trusted partner for interior and exterior design and urban applications, the ShearWater drone exemplifies the company&rsquo;s renewed focus on&nbsp;maritime and industrial manufacturing. It continues to expand its&nbsp;capacity for large-scale printing in order to reshape&nbsp;how industries approach production, material efficiency and design capabilities.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/royal3d-uses-large-scale-3d-printing-for-aquatic-drone-production"
      }
    ],
    "link": "https://www.compositesworld.com/news/royal3d-uses-large-scale-3d-printing-for-aquatic-drone-production"
  }
]