[
  {
    "published": "Fri, 14 Nov 2025 13:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      18,
      30,
      0,
      4,
      318,
      0
    ],
    "title": "Aria Composites Technologies subsidiary launches with focus on composites for transportation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aria Composites Technologies subsidiary launches with focus on composites for transportation"
    },
    "summary": "Aria Group&rsquo;s more than 30 years of composites expertise builds the foundation of this standalone company and its first composite chassis program.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Aria Group&rsquo;s more than 30 years of composites expertise builds the foundation of this standalone company and its first composite chassis program."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ariagroup-exafuse.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ariagroup-exafuse.png;maxWidth=720\" /> </a></div>\n\n<p>Composite chassis project using ExaFuse. Source | Aria Composite Technologies</p>\n</div>\n\n<p><a href=\"https://www.aria-group.com/\" target=\"_blank\">Aria Group Inc.</a> (Irvine, Calif., U.S.), a company with full-range design, engineering,&nbsp;prototype development and advanced manufacturing solutions for the transportation industry, announces the launch of its new subsidiary: <a href=\"https://www.aria-ct.com\" target=\"_blank\">Aria Composites Technologies</a> (ACT, Irvine, U.S.).</p>\n\n<p>ACT brings more than&nbsp;30 years of composite design, analysis, development and manufacturing expertise from Aria Group into a focused, standalone company dedicated to advancing composite technologies. The team&rsquo;s deep experience spans carbon fiber and traditional methods including prepreg, infusion, resin transfer molding (RTM) and ICS using a wide range of resin systems and reinforcements.</p>\n\n<p>This milestone coincides with the release of ACT&rsquo;s first composite chassis program, demonstrating Aria Group&rsquo;s proprietary ExaFuse process which combines&nbsp;ultra-low viscosity resins with dry fabric preforms, enabling precise shaping and assembly through highly automated, textile-based manufacturing. This approach delivers:</p>\n\n<ul>\n\t<li>Industrial-scale production</li>\n\t<li>Rapid takt times</li>\n\t<li>\n\t<p>Significant reductions in bill of materials (BOM), capital expenditure and per-part cost.</p>\n\t</li>\n</ul>\n\n<p>Engineered features are directly molded into the structure, eliminating secondary components. This streamlines production, lowers cost&nbsp;and boosts performance. Partnering with Meyers Manx (Irvine, Calif., U.S.), a company that has developed the reincarnation of the&nbsp;dune buggy, ACT demonstrated how the ExaFuse&nbsp;process enhances both the performance and profitability of the flagship Manx 2.0 electric vehicle (EV)&nbsp;chassis.</p>\n\n<p>To accelerate innovation and expand capabilities, ACT works closely with leading material suppliers, equipment manufacturers&nbsp;and research institutions. Key partners include Proxxima&nbsp;by ExxonMobil (Houston, Texas, U.S.). These collaborations ensure ACT remains at the forefront of composites innovation, delivering tailored solutions that meet demanding performance and production requirements.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aria-composites-technologies-subsidiary-launches-with-focus-on-composites-for-transportation"
      }
    ],
    "link": "https://www.compositesworld.com/news/aria-composites-technologies-subsidiary-launches-with-focus-on-composites-for-transportation"
  },
  {
    "published": "Fri, 14 Nov 2025 13:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      18,
      30,
      0,
      4,
      318,
      0
    ],
    "title": "Twisted acquires carbon fiber specialist KS Composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Twisted acquires carbon fiber specialist KS Composites"
    },
    "summary": "The deal marks a major step forward in Twisted&rsquo;s long-term growth strategy, which is to strengthen its position in the premium automotive and marine sectors.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The deal marks a major step forward in Twisted&rsquo;s long-term growth strategy, which is to strengthen its position in the premium automotive and marine sectors."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-kscomposites.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composites layup.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-kscomposites.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | KS Composites</p>\n</div>\n\n<p><a href=\"https://twisted.co/\" target=\"_blank\">Twisted</a>&nbsp;(Thirsk, U.K.) &mdash;&nbsp;made up of Twisted Automotive and Twisted Marine &mdash; has acquired <a href=\"https://www.kscomposites.com/\" target=\"_blank\">KS Composites</a>&nbsp;(Melton Mowbray, U.K.), an&nbsp;engineering and advanced composites specialist.</p>\n\n<p>The acquisition brings world-class carbon fiber capability into the Twisted group, strengthening its engineering solutions, accelerating innovation&nbsp;and securing supply for the next generation of Twisted vehicles and marine products.</p>\n\n<p>It has been a significant 5 years for the Yorkshire company, best known for its classic Land Rover Defender restomods. Twisted has entered the premium marine sector, established a Special Projects division, expanded internationally&nbsp;and in 2025 launched the T-Bug &mdash; a modern recreation of the classic Baja Bug. The addition of KS Composites is the latest step in its&nbsp;phase of growth.</p>\n\n<p>KS Composites brings more than&nbsp;40 years of expertise as a&nbsp;manufacturer of advanced composite components. For its existing OEM and niche clients, continuity and support are assured. All 120 members of the workforce remain in post, ensuring stability, trusted relationships&nbsp;and the same uncompromising quality of service. The acquisition complements KS Composites&rsquo; existing markets and client base, allowing the business to continue operating independently while benefiting from the additional resources and strategic opportunities afforded by Twisted.</p>\n\n<p>Managing director Jamie Smith continues to lead KS Composites and has also joined the Twisted board of directors. &ldquo;As Twisted prepares for global growth, including increased activity in the U.S., it requires carbon fiber&nbsp;engineering expertise and production capability that provides a genuine competitive advantage,&rdquo; says Smith. &ldquo;KS Composites delivers that capability, and I am delighted to play a part in expanding what Twisted can design, build and deliver.&rdquo;</p>\n\n<p>Jake Cronk, Twisted&rsquo;s COO, notes that the company is strengthening its British engineering expertise while unlocking the next chapter as a global business.</p>\n\n<p>KS Composites is now part of the Twisted family. Alongside its existing operations, it will support Twisted&rsquo;s product development and manufacturing plans, contributing to new automotive builds, marine applications&nbsp;and future advanced engineering projects. Both companies have grown from humble beginnings into respected British engineering names, sharing a deep commitment to craftsmanship, innovation, quality&nbsp;and investing in talented people.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/twisted-acquires-carbon-fiber-specialist-ks-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/twisted-acquires-carbon-fiber-specialist-ks-composites"
  },
  {
    "published": "Fri, 14 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      18,
      0,
      0,
      4,
      318,
      0
    ],
    "title": "Orbex makes part setup 900% faster for key composite parts ahead of inaugural rocket launch",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Orbex makes part setup 900% faster for key composite parts ahead of inaugural rocket launch"
    },
    "summary": "The introduction of MSP metrology products have ensured&nbsp;right-first-time machining for Orbex as it ramps up production of its carbon fiber Payload Avionic Module.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The introduction of MSP metrology products have ensured&nbsp;right-first-time machining for Orbex as it ramps up production of its carbon fiber Payload Avionic Module."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Orbex-rocket-launch.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orbex rocket on launch pad.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Orbex-rocket-launch.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | MSP</p>\n</div>\n\n<p>Ahead of its inaugural rocket launch, orbital launch services company <a href=\"https://orbex.space/\" target=\"_blank\">Orbex</a> (Forres, Scotland and London, U.K.) has significantly boosted production for its carbon fiber&nbsp;Payload Avionic Module (PAM)&nbsp;using <a href=\"https://mspltd.com/\" target=\"_blank\">Metrology Software Products</a>&rsquo;&nbsp;(MSP, Northumberland, U.K.) PerfectPart&nbsp;CNC metrology solution to&nbsp;overcome challenges with part distortion and cut part setup time from 5 hours to 30 minutes, making the process 900% faster per part.&nbsp;</p>\n\n<p>The introduction of these solutions has also halved overall production time, simplified fixturing processes and given Orbex the confidence parts will be machined right-first-time. As the company looks to increase production, MSP has been critical in providing Orbex with a repeatable and scalable process which uses its existing equipment.&nbsp;</p>\n\n<p>Heavily restricted by traditional alignment methods, Orbex sought out a solution to ensure quick and accurate CNC machining of PAM.&nbsp;&ldquo;The PAM is a large, composite thin-walled part, and the layup is delicate in places,&rdquo; explains Gavin Belton, Orbex CNC operator specialist. &ldquo;The risk of distortion makes it difficult to know exactly where to machine.&rdquo;&nbsp;It was taking a minimum of 5 hours to align each part and the inability to account for distortion had caused windows and pockets to be machined to incorrect sizes, leading to issues in assembly and causing rework. &ldquo;The parts are worth tens of thousands of pounds and take around 6 weeks to produce so if we lose one it&rsquo;s time, money and material we can&rsquo;t get back,&rdquo; adds Belton.</p>\n\n<p>Due to the importance for right-first-time machining,&nbsp;MSP PerfectPart&nbsp;was deemed essential. In addition to providing Orbex with a solution for creating accurate alignments, the metrology suite would also ensure any errors &mdash;&nbsp;within probe setup and calibration and within the CNC machine &mdash; would be accounted for.&nbsp;</p>\n\n<p>The error removal routine starts with&nbsp;AutoClock&nbsp;and&nbsp;NC-Checker. Together, the products remove human error from the probe calibration process and NC-Checker then assesses the geometric performance of the CNC machine tool to confirm it is capable of machining a part to within tolerance.</p>\n\n<p>&ldquo;Immediately an issue was flagged in the C- and B-axis which could have caused holes on the outside diameter to have been misaligned,&rdquo; says Belton. &ldquo;The 30-minute check helped the machine tool vendor work out what the error was likely to be and rectify this before machining began.&rdquo;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Orbex-mfg.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Orbex-mfg.jpg;maxWidth=720\" /> </a></div>\n\n<p>Orbex manufactures the carbon fiber&nbsp;structures for its launch vehicles using its CMS Ares machine.</p>\n</div>\n\n<p>To solve Orbex&rsquo;s part alignment challenges, MSP&rsquo;s NC-PartLocator product was&nbsp;introduced, well-suited to aligning complex, distorted or thin-walled parts. The software measures the part using five-axis probing and automatically generates a best fit alignment in six degrees of freedom. The software compensates for discrepancies between the physical part location and the nominal machining program, for example, when distortion has occurred. The updated alignment is automatically uploaded to the controller, no additional machining program edits necessary&nbsp;and any misalignment errors are automatically removed.</p>\n\n<p>&ldquo;When you press the Go button, you can see the alignment coming through and know you&rsquo;re going to get out exactly what you expect,&rdquo; Belton adds. &ldquo;And the speed with which everything is set up &mdash;&nbsp;it has&nbsp;made life easier.&rdquo;</p>\n\n<p>The results are evident of this. Orbex has cut its variable 5-hour part setup time to a stable 30 minutes, making setup 900% faster. In addition, overall production time has been halved from 2 days to 1 day.&nbsp;</p>\n\n<p>Orbex&rsquo;s fixturing routine has also been improved. Belton says,&nbsp;&ldquo;Rather than having to dowel everything down and constrain the part, we&rsquo;ve been able to produce a simpler fixture. We don&rsquo;t have to skim the fixture each time, we can use it as it is, and the MSP Best Fit alignment will come in and work out what it should be. The whole package is a no brainer. The risk reduction when machining such a high-value part cannot be understated.&rdquo;</p>\n\n<p>As Orbex&rsquo;s launch date looms, MSP PerfectPart&nbsp;will play a big part in the ramping up of production. &ldquo;We currently only have one CMS [Ares] machine, so because we&rsquo;ve essentially increased its capacity, it&rsquo;ll ease any bottlenecks,&rdquo; says Belton. &ldquo;When we do decide to buy more, the simplicity of the MSP package means we&rsquo;ll be able to drag and drop that process onto another machine so we can transition into production easily, keep quality high&nbsp;and hit the ground running.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/orbex-makes-part-setup-900-faster-for-key-composite-parts-ahead-of-inaugural-rocket-launch"
      }
    ],
    "link": "https://www.compositesworld.com/news/orbex-makes-part-setup-900-faster-for-key-composite-parts-ahead-of-inaugural-rocket-launch"
  },
  {
    "published": "Fri, 14 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      17,
      0,
      0,
      4,
      318,
      0
    ],
    "title": "Airbus Helicopters France adopts Airborne composites automation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus Helicopters France adopts Airborne composites automation"
    },
    "summary": "Automated ply placement (APP) and Kit by Light (KBL) will be applied to ramp up&nbsp;productivity of the factory&rsquo;s composite helicopter blades and hub structures for Airbus helicopter models.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Automated ply placement (APP) and Kit by Light (KBL) will be applied to ramp up&nbsp;productivity of the factory&rsquo;s composite helicopter blades and hub structures for Airbus helicopter models."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airborne-airbus-app.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Automated ply placement.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airborne-airbus-app.jpg;maxWidth=720\" /> </a></div>\n\n<p>Automated ply placement (APP). Source (All Images) | Airborne</p>\n</div>\n\n<p>At Airbus headquarters in Toulouse, France, and in the presence of King Willem-Alexander and Queen M&aacute;xima of the Netherlands, <a href=\"https://www.airbus.com/en/products-services/helicopters\" target=\"_blank\">Airbus Helicopters</a> has signed a letter of intent (LOI)&nbsp;to adopt <a href=\"https://www.compositesworld.com/suppliers/airborne\" target=\"_blank\">Airborne</a>&rsquo;s (The Hague, Netherlands) digital automation technologies for its&nbsp;factory in Le Bourget, France. The goal is to optimize manufacturing efficiency and output of composite rotor hubs and helicopter blades through implementation of both Airborne&rsquo;s main software and automation systems, automated ply placement (APP) and Kit&nbsp;by Light (KBL),&nbsp;respectively.</p>\n\n<p>The focus will be on new automation and software to boost productivity and efficiency.&nbsp;Airbus&rsquo;&nbsp;Le Bourget factory makes all composite helicopter blades and hub structures for all Airbus helicopter models, both military and civil. &ldquo;It's a high-mix production environment, ramping up to meet increasing demand, and Airborne&rsquo;s industrialization technologies are an excellent fit,&rdquo; says Marcus Kremers, CTO of Airborne.&nbsp;</p>\n\n<p>APP is already used by Airbus Commercial for the A350 program. It automates the layup process from cutter to laminate and can be used for prepreg and dry fiber, both of which are processed in Le Bourget (read &ldquo;<a href=\"https://www.compositesworld.com/articles/modular-robotic-cells-enable-high-rate-rtm-using-any-material-format\">Modular, robotic cells enable high-rate RTM using any material format</a>&rdquo;). In this project, new features regarding part size, layup and quality inspection are planned to be added.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Airborne-Airbus-KBL-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Kit by Light (KBL) in action.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Airborne-Airbus-KBL-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Kit by Light (KBL).</p>\n</div>\n\n<p>KBL is already in use at Airbus Helicopters&rsquo;&nbsp;sister plant in Donauw&ouml;rth, Germany, where it supports operators in the cutting room with software that significantly accelerates kitting. Building on that experience, plans are to implement the system in the Le Bourget factory to reduce material waste and increase output.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-helicopters-france-adopts-airborne-composites-automation"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-helicopters-france-adopts-airborne-composites-automation"
  },
  {
    "published": "Fri, 14 Nov 2025 11:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      16,
      30,
      0,
      4,
      318,
      0
    ],
    "title": "Exel Composites adopts bio-based UPR resin at commercial scale",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Exel Composites adopts bio-based UPR resin at commercial scale"
    },
    "summary": "Purchase of Polynt&nbsp;bio-based resin delivers 20% cut in CO2 footprint for composites manufacturers,&nbsp;builds Exel&rsquo;s efforts to give customers more sustainable options.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Purchase of Polynt&nbsp;bio-based resin delivers 20% cut in CO2 footprint for composites manufacturers,&nbsp;builds Exel&rsquo;s efforts to give customers more sustainable options."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-exel-ravenna-mfg-plant.jpg\" target=\"_blank\"><img alt=\"Ravenna manufacturing plant. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-exel-ravenna-mfg-plant.jpg;maxWidth=385\" /></a></div>\n\n<p>Ravenna manufacturing plant. Source | Exel Composites</p>\n</div>\n\n<p>Pultruded and pull-wound composites manufacturing company <a href=\"https://www.compositesworld.com/suppliers/exel-composites-plc\" target=\"_blank\">Exel Composites</a> (Vantaa, Finland) has&nbsp;entered into a new purchasing agreement with global resin specialist&nbsp;<a href=\"https://www.compositesworld.com/suppliers/polynt-composites\" target=\"_blank\">Polynt</a>&nbsp;<br />\n(Scanzorosciate, Italy) to purchase hundreds of tonnes of its bio-based unsaturated polyester resin (UPR). The collaboration represents another step in Exel Composites&rsquo;&nbsp;transition toward lower-carbon composites manufacturing, with the resin now available for European customers&nbsp;orders.</p>\n\n<p>With the introduction of a renewable monomer, the&nbsp;UPR resin, developed by Polynt, contains about 20%&nbsp;bio-based content. The Italian producer sources this monomer from second- and third-generation biomass &mdash;&nbsp;feedstocks that do not compete with food crops. This sustainable material offers a drop-in replacement for traditional fossil-based resins, ensuring full compatibility with Exel&rsquo;s existing pultrusion processes.</p>\n\n<p>Compared with conventional UPR, independent life cycle analyses (LCAs) show that the bio-based formulation delivers a 20% reduction in carbon footprint according to Ecoinvent v3.11. Polynt sources the monomer in Europe and produces most of the raw materials in its Italian plants. The resin is produced in Polynt&rsquo;s production facilities in Poland and France, and Exel plans to use it in its European plants. This ensures minimal transportation-related emissions throughout the entire supply chain.</p>\n\n<p>&ldquo;Our internal testing shows no measurable difference in performance between this bio-based resin and the fossil-based equivalent,&rdquo; says&nbsp;Kim Sj&ouml;dahl, SVP of technology and sustainability at Exel Composites. &ldquo;Mechanical properties, processing characteristics and durability are all identical. This means our customers can choose a more sustainable option without compromising quality or reliability.&rdquo;</p>\n\n<p>Exel and Polynt share a similar global footprint, with multiple production sites across the world. This regionalized structure enables both companies to supply customers locally, reducing delivery times and logistics-related emissions.</p>\n\n<p>&ldquo;This partnership builds on more than 30 years of collaboration between our companies,&rdquo; adds&nbsp;Lorenzo Grazia, EU technical service manager UPR/GC at Polynt Group. &ldquo;Polynt is committed to helping customers like Exel reduce their environmental impact through practical, scalable solutions. Introducing bio-based building blocks into high-volume resin systems is one of the most effective ways to move our industry toward lower emissions.&rdquo;</p>\n\n<p>Exel&rsquo;s customers will have the choice of adopting this resin as part of their product specification.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/exel-composites-adopts-bio-based-upr-resin-at-commercial-scale-"
      }
    ],
    "link": "https://www.compositesworld.com/news/exel-composites-adopts-bio-based-upr-resin-at-commercial-scale-"
  },
  {
    "published": "Fri, 14 Nov 2025 11:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      16,
      0,
      0,
      4,
      318,
      0
    ],
    "title": "Regen Fiber earns 2025 Excellence in Concrete Award",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Regen Fiber earns 2025 Excellence in Concrete Award"
    },
    "summary": "The composites recycler was recognized at the&nbsp;Iowa Better Concrete Conference for its sustainable practice of applying recycled fibers as partial replacement in concrete.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The composites recycler was recognized at the&nbsp;Iowa Better Concrete Conference for its sustainable practice of applying recycled fibers as partial replacement in concrete."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-RegenFiber-concrete.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Concrete being laid.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-RegenFiber-concrete.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | Regen Fiber</p>\n</div>\n\n<p><a href=\"https://protect-usb.mimecast.com/s/KXVyCjAWYPFAp2niW7zFh?domain=regenfiber.com/\" target=\"_blank\">Regen Fiber</a>&nbsp;(Fairfax, Iowa, U.S.) announces that it received an award at the Iowa Better Concrete Conference in early November by the Iowa Ready Mixed Concrete Association (IRMCA, Ankeny, Iowa, U.S.) and American Concrete Institute (ACI) Iowa Chapter for sustainable practices in a project that explored the use of Regen Fiber recycled fibers in concrete.</p>\n\n<p>The Excellence in Concrete Awards recognize outstanding projects from throughout the state. Entries were judged on the following criteria: architectural design, engineering and construction challenges, complexity of project, uniqueness of project, workmanship, finished impression&nbsp;and diverse application of ready&nbsp;mixed concrete.&nbsp;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-RegenFiber-award.JPEG\" target=\"_blank\"><img alt=\"Regen Fiber team poses with award.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-RegenFiber-award.JPEG;maxWidth=385\" /></a></div>\n</div>\n\n<p>Regen Fiber&rsquo;s project supported&nbsp;Bryant Mente Shop and Drive in Marengo, Iowa. The&nbsp;fibers were sourced from decommissioned wind turbine blades. The blades are mechanically processed to extract the durable fibers, which are then incorporated into the concrete mix as a partial replacement for traditional reinforcement methods. Used on both the shop floor and drive areas, the mix with these Regen Fiber fibers was evaluated for its long-term durability, resistance to cracking&nbsp;and performance under freeze-thaw cycles. Aligning with LEED and other green-building certification goals, this application enhances the project&rsquo;s appeal for sustainability.&nbsp;</p>\n\n<p>The project was further supported by ready mix concrete producer Manatt&rsquo;s Inc. (Brooklyn) and concrete subtractor Fiser Construction (Marengo).</p>\n\n<p>&ldquo;We&rsquo;re proud to see Regen&nbsp;Fiber play a role in this award-winning project,&rdquo; says Jeff Woods, director of business development, Regen Fiber. &ldquo;By transforming retired wind turbine blades into high-performance reinforcement fibers, we&rsquo;re helping contractors and producers achieve durability, finishability and reduce early stage curling and cracking &mdash;&nbsp;all while advancing sustainable practices in concrete. This recognition highlights what&rsquo;s possible when innovation and collaboration come together to reduce the carbon footprint in construction.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/regen-fiber-earns-2025-excellence-in-concrete-award"
      }
    ],
    "link": "https://www.compositesworld.com/news/regen-fiber-earns-2025-excellence-in-concrete-award"
  },
  {
    "published": "Fri, 14 Nov 2025 10:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      15,
      30,
      0,
      4,
      318,
      0
    ],
    "title": "Creative Composites Group adds FRP pipe pile sizes to StormStrong offerings",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Creative Composites Group adds FRP pipe pile sizes to StormStrong offerings"
    },
    "summary": "FRP pipe piles give engineers more design flexibility to meet the&nbsp;needs of increasing infrastructure activity and government initiatives for sustainable construction.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "FRP pipe piles give engineers more design flexibility to meet the&nbsp;needs of increasing infrastructure activity and government initiatives for sustainable construction."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-ccg-stormstrong-pipe-piles.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"StormStrong FRP pipe piles application.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-ccg-stormstrong-pipe-piles.jpg;maxWidth=720\" /> </a></div>\n\n<p>Creative Composite Group&rsquo;s (CCG) StormStrong FRP pipe pile sizes are suited to heavy load bearing applications yet are lightweight and easy to install. Source | CCG</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/creative-composites-group\" target=\"_blank\">Creative Composites Group</a> (CCG, Alum Bank, Pa., U.S.) has added new sizes to its broad lineup of StormStrong fiber-reinforced polymer (FRP) pipe piles. Design engineers now have the option to choose 8-,14-&nbsp;or 18-inch-diameter piles. A robust alternative to traditional timber, steel or concrete products, StormStrong pipe piles are being sourced to meet the needs of increasing infrastructure activity and government initiatives for sustainable construction practices. The video below offers a brief overview of the applications.</p>\n\n<p>Public port authorities and their private tenants have earmarked $163 billion in capital investments for landside and waterside infrastructure improvements through 2025. Engineered with low-modulus, high-strength properties, the eco-friendly composite pipe piles are suited to heavy load-bearing applications and can be customized. StormStrong&rsquo;s lightweight pipe piles are also easy to transport and install. Costly setups are eliminated and the potential for expensive repairs and replacements reduced. FRP piles are prefabricated, tested and inspected to ensure optimal performance.</p>\n\n<div style=\"text-align: center;\"></div>\n\n<p>&ldquo;For dock projects, the new sizes enable contractors and engineers to span longer distances with a product that will also give them a longer service life,&rdquo; says Corey Sechler, vice president of sales for civil infrastructure at CCG. &ldquo;For fender systems, more sizes give engineers the ability to optimize fender performance while keeping costs down. You want piles that are strong enough to do the job without having to overdesign them.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/creative-composites-group-adds-frp-pipe-pile-sizes-to-stormstrong-offerings"
      }
    ],
    "link": "https://www.compositesworld.com/news/creative-composites-group-adds-frp-pipe-pile-sizes-to-stormstrong-offerings"
  },
  {
    "published": "Fri, 14 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      15,
      0,
      0,
      4,
      318,
      0
    ],
    "title": "ZeroAvia is selected for €21 million EU grant application to deliver H2 aircraft network in Norway",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ZeroAvia is selected for €21 million EU grant application to deliver H2 aircraft network in Norway"
    },
    "summary": "Cessna Caravan aircraft retrofitted with ZA600 powertrains&nbsp;and established supporting&nbsp;airport hydrogen fuel technologies will introduce zero-emissions aircraft to the European Economic Area in 2028.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Cessna Caravan aircraft retrofitted with ZA600 powertrains&nbsp;and established supporting&nbsp;airport hydrogen fuel technologies will introduce zero-emissions aircraft to the European Economic Area in 2028."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-zeroavia-za600-engine-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ZA600 engine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-zeroavia-za600-engine-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>ZeroAvia&rsquo;s&nbsp;ZA600 hydrogen-electric engine. Source | ZeroAvia</p>\n</div>\n\n<p>On Nov. 6,&nbsp;<a href=\"https://www.zeroavia.com/\" target=\"_blank\">ZeroAvia</a>&nbsp;(Kemble, U.K. and Everett, Wash., U.S.)&nbsp;announced that its application to the&nbsp;Innovation Fund&nbsp;for a &euro;21.4 million&nbsp;grant to support the introduction of hydrogen-electric aircraft has been selected for grant agreement preparation. The project will support the retrofit of 15 Cessna <em>Caravan</em> aircraft with ZeroAvia&rsquo;s ZA600 hydrogen-electric engines and the establishment of the supporting airport hydrogen fuel technologies, with operations planned to commence in 2028.&nbsp;</p>\n\n<p>These zero-emission aircraft are planned to replace conventional kerosene-fueled turboprops on cargo routes and expected to see in excess of 95% reduction in greenhouse gas (GHG) emissions. The project will also work to deliver hydrogen refueling and storage&nbsp;​infrastructure at 15 airports in Norway, establishing what ZeroAvia says will be the world&rsquo;s&nbsp;largest network of zero-emission commercial flights. The air operators for the network will be announced in due course.</p>\n\n<p>The Operations to Decarbonize Interconnectivity in Norway (ODIN) project aims&nbsp;to validate the technical performance and economic case for utilizing hydrogen-electric aircraft in commercial operations, with a view to catalyzing further adoption in Norway, across the European Union (EU)&nbsp;and further afield.&nbsp;&nbsp;</p>\n\n<p>The project proposal was found to contribute to the objectives of the EU initiative &ldquo;Strategic Technologies for Europe Platform (STEP)&rdquo; and meets the requirements to receive the STEP Seal. The STEP Seal is a quality label awarded by the European Commission dedicated to boosting investment in critical technologies in Europe. ​&nbsp;</p>\n\n<p>ZeroAvia&rsquo;s ZA600 powertrain &mdash; the company&nbsp;see the future for composites<a href=\"https://www.compositesworld.com/articles/composites-end-markets-pressure-vessels-2025\" target=\"_blank\"> in this application</a>&nbsp;&mdash; uses fuel cells to generate electricity from hydrogen fuel without reliance on combustion, meaning that the only emission is low-temperature water vapor. ZeroAvia has already flight tested a prototype of this system, is now ground testing its final design for certification&nbsp;and is concurrently working with the UK Civil Aviation Authority and U.S. Federal Aviation Administration on certification programs related to the engine.&nbsp;&nbsp;</p>\n\n<p>&ldquo;The EU Innovation Fund is notoriously competitive with applications needing to pass through rigorous assessment and&nbsp;demonstrate&nbsp;compelling evidence for near-term&nbsp;GHG reductions,&rdquo; notes Val Miftakhov, founder and CEO of ZeroAvia. &ldquo;This project will set an example by introducing a scaled network of&nbsp;hydrogen-electric aircraft operations across Norway&nbsp;without&nbsp;the typical associated environmental damage.&rdquo;&nbsp;</p>\n\n<p>The Innovation Fund, financed by EU Emissions Trading System revenues, is one of the world&rsquo;s largest funding&nbsp;programs&nbsp;for the demonstration of innovative low-carbon technologies. The Fund focuses on highly innovative clean technologies and big flagship projects with European added value that can bring significant&nbsp;emission&nbsp;and GHG reductions.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/zeroavia-is-selected-for-21-million-eu-grant-application-to-deliver-hydrogen-aircraft-network-in-norway"
      }
    ],
    "link": "https://www.compositesworld.com/news/zeroavia-is-selected-for-21-million-eu-grant-application-to-deliver-hydrogen-aircraft-network-in-norway"
  },
  {
    "published": "Fri, 14 Nov 2025 08:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      13,
      0,
      0,
      4,
      318,
      0
    ],
    "title": "REFRESH project successfully produces wind blade section from recovered fibers",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "REFRESH project successfully produces wind blade section from recovered fibers"
    },
    "summary": "Laboratory testing has shifted to a&nbsp;real component, which partly consists of recovered glass fibers recovered from other EOL wind blades.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Laboratory testing has shifted to a&nbsp;real component, which partly consists of recovered glass fibers recovered from other EOL wind blades."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-gjenkraft-refresh-project-blade-joint-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Novel wind blade made from partly recycled fibers.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-gjenkraft-refresh-project-blade-joint-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;Gjenkraft AS</p>\n</div>\n\n<p>On Nov. 11, the European <a href=\"https://refresh-project.eu/\" target=\"_blank\">REFRESH project</a> consortium announced a milestone has been reached, where&nbsp;<a href=\"https://www.compositesworld.com/suppliers/cetma\" target=\"_blank\">CETMA</a>&nbsp;(Brindisi, Italy)&nbsp;and <a href=\"https://gjenkraft.com/\" target=\"_blank\">Gjenkraft AS</a>&nbsp; (H&oslash;yanger, Norway) have collaborated to produce a wind turbine blade section partly made from recycled materials recovered from end-of-life (EOL) blades.</p>\n\n<p>The blade section was manufactured by <a href=\"https://www.compositesworld.com/suppliers/eirecomposites-teo-irish-composites\" target=\"_blank\">&Eacute;ireComposites</a> (Galway, Ireland) and includes a nonwoven mat made from pyrolyzed glass fibers recovered from Gjenkraft&rsquo;s pyrolysis process developed in H&oslash;yanger.&nbsp;</p>\n\n<p>&ldquo;This is tangible proof that full circularity for wind energy is possible. We have now moved from laboratory testing to a real component that demonstrates how recycled fibers can be used in new wind blades,&rdquo; says Marcin Rusin, CEO of Gjenkraft AS. &ldquo;It demonstrates the power of European collaboration &mdash;&nbsp;where technology, innovation&nbsp;and sustainability come together.&rdquo;</p>\n\n<blockquote>\n<p>Read &ldquo;<a href=\"https://www.compositesworld.com/news/refresh-wind-blade-recycling-data-shows-promising-environmental-benefits\" target=\"_blank\">REFRESH wind blade recycling data shows promising environmental benefits</a>&rdquo;</p>\n</blockquote>\n\n<p><a href=\"https://www.compositesworld.com/products/wind-blade-recycling-project-presents-objectives-progress\" target=\"_blank\">The REFRESH project</a>, funded by the EU Horizon Europe program, brings together 11 partners to develop and demonstrate novel solutions for recycling and reusing composite materials from wind turbine blades. Gjenkraft&rsquo;s role is to provide its technology, which enables almost 100% recovery of blade materials &mdash;&nbsp;including glass and carbon fibers, oil and gas &mdash; turning waste into valuable raw materials.</p>\n\n<p>&ldquo;The fact that materials from&nbsp;EOL&nbsp;wind turbines are now being reused in new blades shows that the industry is shifting from linear to circular production,&rdquo; adds Arvid L&oslash;nne, Chairman of the Board at Gjenkraft. &ldquo;This is a milestone for both Gjenkraft and the entire wind energy industry.&rdquo;</p>\n\n<p>Gjenkraft AS develops and operates technology for recycling composite waste, with a primary focus on wind turbine blades. For related content, read &ldquo;<a href=\"https://www.compositesworld.com/news/gjenkraft-owens-corning-bolster-use-of-post-industrial-fiberglass-waste-\">Gjenkraft, Owens Corning bolster&nbsp;use of post-industrial fiberglass waste&nbsp;</a>&rdquo; and &ldquo;...<a href=\"https://www.compositesworld.com/news/gjenkraft-to-build-pyrolysis-based-commercial-recycling-plant\">&nbsp;to build pyrolysis-based commercial recycling plant</a>.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/refresh-project-successfully-produces-wind-blade-section-from-recovered-fibers-"
      }
    ],
    "link": "https://www.compositesworld.com/news/refresh-project-successfully-produces-wind-blade-section-from-recovered-fibers-"
  },
  {
    "published": "Thu, 13 Nov 2025 09:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      13,
      14,
      0,
      0,
      3,
      317,
      0
    ],
    "title": "AZL JPP initiative to benchmark composite rotor sleeve materials, manufacturing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AZL JPP initiative to benchmark composite rotor sleeve materials, manufacturing"
    },
    "summary": "Wet filament, towpreg&nbsp;and laser-assisted tape winding under&nbsp;real-world test conditions aim&nbsp;to&nbsp;identify optimal design and production routes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Wet filament, towpreg&nbsp;and laser-assisted tape winding under&nbsp;real-world test conditions aim&nbsp;to&nbsp;identify optimal design and production routes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-azl-rotorsleeves-infographic.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-azl-rotorsleeves-infographic.png;maxWidth=720\" /> </a></div>\n\n<p>Work packages within the Joint Partner Project (JPP). Source | AZL Aachen GmbH</p>\n</div>\n\n<p>Following the successful completion of its comprehensive market and technology study <a href=\"https://www.compositesworld.com/news/azl-composite-rotor-sleeves-project-is-completed-presents-findings-at-upcoming-web-meeting\" target=\"_blank\">on composite rotor sleeves</a>, <a href=\"https://www.compositesworld.com/suppliers/azl-aachen-gmbh\" target=\"_blank\">AZL Aachen GmbH</a> (Germany)&nbsp;is taking the next step with a new cross-industry collaboration,&nbsp;&ldquo;Composite Rotor Sleeves &ndash; Experimental Testing &amp; Benchmarking.&rdquo; Building on insights generated with a consortium of 15 partner companies, this Joint Partner Project (JPP) moves from theoretical comparison to applied experimental validation. Its aim is to benchmark composite rotor sleeve materials and manufacturing technologies under application-oriented test conditions &mdash; offering participants decision-ready data on performance and cost efficiency.&nbsp;</p>\n\n<p>Within this project, AZL&rsquo;s engineering team will systematically investigate how different sleeve materials and manufacturing routes perform under realistic mechanical and thermal loads. The project will include wet filament winding, towpreg winding&nbsp;and laser-assisted thermoplastic tape winding technologies, focusing on both press-fit and direct-wound rotor sleeve concepts. Comparative benchmarking will evaluate structural integrity, pre-stress behavior&nbsp;and temperature-dependent performance, while also quantifying production efficiency and cost-related key performance indicators (KPIs).</p>\n\n<p>The initiative leverages AZL&rsquo;s infrastructure, combining design, manufacturing&nbsp;and testing capabilities in one location on the RWTH Aachen Campus. Using specially developed testing setups &mdash; including a radial-load test rig and pre-stress analysis fixtures &mdash; the AZL team will replicate real-world operating conditions without the need for rotation. Static, cyclic&nbsp;and creep tests at elevated temperatures will deliver deep insights into material and structural performance. Alongside the technical evaluation, the project includes a technological and economic assessment to identify the most efficient material and process combinations for industrial application.</p>\n\n<p>The project&rsquo;s collaborative setup enables companies from the entire composite and e-mobility value chain to jointly address key design and manufacturing challenges. &ldquo;As a high-volume manufacturer in the field of rotor sleeves, Schunk considers it essential to actively shape innovation,&rdquo; notes Fabian K&ouml;ster, development engineer composites at Schunk Kohlenstofftechnik GmbH, a project participant. &ldquo;Participation in the accomplished AZL project underlines our belief that future viability and competitiveness can only be secured through early involvement in technological developments. The AZL information event offers OEMs and partners across the entire value chain an opportunity to exchange insights on the current state of rotor sleeve technologies, explore emerging trends&nbsp;and jointly develop solutions for tomorrow&rsquo;s challenges.&rdquo;</p>\n\n<p>According to Philipp Fr&ouml;hlig, head of industrial services at AZL Aachen GmbH, there is additional, broader value behind the JPP approach:&nbsp;&ldquo;We translate peak trend topics discussed within the various forums of the AZL<br />\npartnership into concrete, cross-industry collaboration. By bringing together partners from across the composite value chain and using the extensive know-how&nbsp;and infrastructure available within AZL and its ecosystem, we enable efficient, targeted innovation on all aspects of composite technologies, from design and process validation to mechanical testing and industrial implementation.&rdquo;</p>\n\n<div class=\"article_sidebar\">\n<h3>Free webinars and project kick-off</h3>\n\n<p>To provide insights into rotor sleeve technologies and introduce the new JPP, AZL will host two free webinars on:</p>\n\n<ul>\n\t<li>Nov. 17, 2025, at 11:00 a.m. CET</li>\n\t<li>Nov.&nbsp;20, 2025, at 11:00 a.m.&nbsp;CET</li>\n</ul>\n\n<p>The project itself will officially start with a kick-off meeting at the end of November, where all participating companies will have the opportunity to present their focus areas and jointly define project priorities.</p>\n\n<p>Companies interested in joining the consortium or learning more about the project are invited to contact AZL&rsquo;s Industrial Services team for detailed information and consultation <a href=\"https://www.azl-aachen-gmbh.de/joint-partner-projects/\" target=\"_blank\">found here</a>.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/azl-jpp-initiative-to-benchmark-composite-rotor-sleeve-materials-manufacturing"
      }
    ],
    "link": "https://www.compositesworld.com/news/azl-jpp-initiative-to-benchmark-composite-rotor-sleeve-materials-manufacturing"
  }
]