[
  {
    "published": "Mon, 28 Jul 2025 13:30:00 -0400",
    "published_parsed": [
      2025,
      7,
      28,
      17,
      30,
      0,
      0,
      209,
      0
    ],
    "title": "DLR HAP-alpha solar aircraft demonstrator passes key ground tests",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DLR HAP-alpha solar aircraft demonstrator passes key ground tests"
    },
    "summary": "The CFRP uncrewed aircraft platform, designed as a sustainable alternative to satellites, completed ground vibration testing, leading up to flight trials in 2026.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The CFRP uncrewed aircraft platform, designed as a sustainable alternative to satellites, completed ground vibration testing, leading up to flight trials in 2026."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-hap-alpha-render.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"HAP-alpha rendering.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-hap-alpha-render.jpeg;maxWidth=720\" /> </a></div>\n\n<p>The plan is for HAP-alpha to gradually reach an altitude of up to 20 kilometers. Source (All Images) |&nbsp;DLR (CC BY-NC-ND 3.0)</p>\n</div>\n\n<p>The <a href=\"https://www.compositesworld.com/suppliers/dlr---german-aerospace-center\" target=\"_blank\">German Aerospace Center &ndash; DLR</a> (Cologne) announces that its high-altitude solar aircraft,&nbsp;HAP-alpha, has completed ground vibration testing (GVT),&nbsp;a key milestone in flight readiness, at its National Experimental Test Center in Cochstedt.&nbsp;Further tests will follow and the first low-altitude flight trial is planned for 2026, subject to ideal weather conditions.</p>\n\n<p>HAP-alpha is&nbsp;highly elastic, solar-powered uncrewed aircraft platform designed to operate in Earth&rsquo;s lower stratosphere for&nbsp;extended periods, performing a wide range of observation and communications tasks&nbsp;from monitoring shipping lanes and supporting disaster response to providing internet access. The structure, weighing only&nbsp;138 kilograms&nbsp;and with a 27-meter&nbsp;wingspan,&nbsp;is made entirely of carbon fiber-reinforced polymer (CFRP) &mdash; specifically, the DLR uses wound round CFRP spars and ribs made from a CFRP sandwich material.</p>\n\n<p>&ldquo;With HAP-alpha, DLR is demonstrating its comprehensive systems expertise in the complete design, development and operation of a new and innovative aircraft, incorporating all disciplines,&rdquo;&nbsp;explains DLR executive board member for aeronautics, Markus Fischer. &ldquo;This illustrates our engagement in an important field of innovation, to strengthen Germany as a location for technology and business and to open up new perspectives for our public stakeholders in collaboration and knowledge exchange.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-haps-gvt.jpeg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-haps-gvt.jpeg;maxWidth=385\" /></a></div>\n\n<p>A particular challenge of the GVT&nbsp;was the HAP-alpha&rsquo;s lightweight and therefore highly flexible design. HAP-alpha&rsquo;s wings are not yet covered for the tests, so the supporting structures are visible in this image. Source |&nbsp;<a href=\"https://www.dlr.de/en/service/imprint\" target=\"_blank\">&copy; DLR</a></p>\n</div>\n\n<p>The now completed GVT is an important milestone for investigating the vibration behavior of an aircraft. The goal is to identify critical vibrations that can occur during flight, takeoff and landing. This determines whether an aircraft is safe and thus airworthy. For HAP-alpha, the successful GVT marks a key step on the way to first flight tests next year, which will involve basic flight maneuvers at low altitude.</p>\n\n<p>During the GVT, numerous sensors were used to record the dynamic properties of the platform, which was fitted with electromechanical vibrators so that its vibration characteristics could be identified. A particular challenge of the GVT on HAP-alpha was its very lightweight and therefore very flexible design.</p>\n\n<p>The acquired data will now be used to update simulation models and predict flight behavior even more precisely,&nbsp;especially during maneuvers, turbulence and gusts of wind. &ldquo;This allows the project team to focus on the upcoming complete system tests, which will mark the completion of ground testing and enable subsequent flight testing,&rdquo;&nbsp;says HAP project leader Florian Nikodem from the DLR Institute of Flight Systems.</p>\n\n<div class=\"article_sidebar\">\n<h3>HAP-alpha project</h3>\n\n<p>Under the leadership of the Institute of Flight Systems, the DLR aims to build comprehensive expertise for the development of high-performance, high-altitude solar-powered aircraft. HAP-alpha will also serve as a carrier platform for testing sensor systems and system technologies under realistic operating conditions in the lower stratosphere at an altitude of approximately 20 kilometers. In addition to the platform itself, DLR is developing two sensor systems for use on HAP-alpha, as well as optimized evaluation methods.</p>\n\n<p>The HAP-alpha project was launched in 2018, with the DLR pooling a wide range of expertise from the fields of aeronautics, space and security with a <a href=\"https://www.dlr.de/en/latest/news/2025/uncrewed-high-flying-solar-aircraft-hap-alpha-passes-key-ground-tests\" target=\"_blank\">total of 16 participating institutes</a>.</p>\n\n<p>First test flights with the technology demonstrator&nbsp;are planned for 2025, with the first flights initially planned at low altitude at the National Test Center for Unmanned Aircraft Systems. Along the way, the project will pass through several review gates at which the status of the project and the feasibility of achieving the objectives will be assessed with the involvement of external experts.</p>\n\n<p>Once the aircraft has been sufficiently tested and the ground crew&rsquo;s procedures have been properly established, expansion stages of HAP-alpha will successively fly at altitudes of up to 20 kilometers. Extensive demonstration flights with the developed payload systems will then be carried out at high altitudes. In order to realize the high-altitude flights, the team is in talks with suitable flight test facilities around the world that have the necessary wide-ranging ground and air exclusion zones up to high altitudes.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dlr-hap-alpha-solar-aircraft-demonstrator-passes-key-ground-tests"
      }
    ],
    "link": "https://www.compositesworld.com/news/dlr-hap-alpha-solar-aircraft-demonstrator-passes-key-ground-tests"
  },
  {
    "published": "Mon, 28 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      28,
      17,
      0,
      0,
      0,
      209,
      0
    ],
    "title": "Advanced Carbons Council announces graphene ISO technical specification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Advanced Carbons Council announces graphene ISO technical specification"
    },
    "summary": "ISO/TS 9651:2025&nbsp;provides a classification framework for nanomaterials, specifying&nbsp;the characteristics of graphene-related 2D materials&nbsp;and their respective measurement methods.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ISO/TS 9651:2025&nbsp;provides a classification framework for nanomaterials, specifying&nbsp;the characteristics of graphene-related 2D materials&nbsp;and their respective measurement methods."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-graphene-cnt-gettyimages1.jpg\" target=\"_blank\"><img alt=\"Carbon nanotubes abstract.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-graphene-cnt-gettyimages1.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://www.advmat.org/\" target=\"_blank\">Advanced Carbons Council</a>&nbsp;(ACC, Zug, Switzerland) announces that over several years of work and input from&nbsp;more than 100 subject matter experts, the Graphene Classification Framework has now been officially published as an ISO technical specification.</p>\n\n<p>Nanomaterials, like graphene, carbon nanotubes (CNT) and related carbon materials, are increasing being used as fillers in composites to improve properties, reduce weight and drive sustainability. As relatively new materials, few international standards have been developed.</p>\n\n<p><a href=\"https://www.iso.org/standard/84232.html?browse=tc\" target=\"_blank\">ISO/TS 9651:2025</a>, &ldquo;Nanotechnologies &mdash; Classification framework for graphene‐related 2D materials,&rdquo; is a document that specifies the characteristics of graphene-related 2D materials&nbsp;and their respective measurement methods in sheet and particle forms for commercial applications.</p>\n\n<p>The classification framework includes:</p>\n\n<ul>\n\t<li>Relevant material characteristics for commercial use</li>\n\t<li>Identification of applicable measurement methods</li>\n\t<li>A range of the characteristic measured values when applicable</li>\n\t<li>Syntax to guide consistent naming and descriptions</li>\n\t<li>An applicable technical data sheet template.</li>\n</ul>\n\n<p>The Graphene Council (now the ACC) started this initiative as it felt it was a necessary&nbsp;and critical step toward the widespread commercialization of graphene and related 2D materials. The Graphene Classification Framework helps to create transparency in the market and to provide confidence to end users and buyers of graphene materials from producers that follow this technical specification, and that have had their materials tested and characterized properly.</p>\n\n<p>What are next steps? Proving its ability to establish a global standard for advanced materials, the ACC is now aiming to establish task force groups for more mature materials like CNTs and carbon fiber to achieve the same goal.&nbsp;</p>\n\n<p>Visit the <a href=\"https://advancedcarbonscouncil.org/\" target=\"_blank\">ACC website</a> to learn how to participate in standards setting or learn more about advanced carbon materials.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/advanced-carbons-council-announces-graphene-iso-technical-specification"
      }
    ],
    "link": "https://www.compositesworld.com/news/advanced-carbons-council-announces-graphene-iso-technical-specification"
  },
  {
    "published": "Mon, 28 Jul 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      7,
      28,
      16,
      30,
      0,
      0,
      209,
      0
    ],
    "title": "Hartzell AAM propeller gains FAA Part 35 type certification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hartzell AAM propeller gains FAA Part 35 type certification"
    },
    "summary": "Certification testing of Hartzell&rsquo;s&nbsp;five-bladed composite propeller was conducted exclusively on Beta Technologies&rsquo;&nbsp;electric propulsion systems for the Alia VTOL and CTOL, with the goal&nbsp;that the design will serve similar AAM architectures in future.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Certification testing of Hartzell&rsquo;s&nbsp;five-bladed composite propeller was conducted exclusively on Beta Technologies&rsquo;&nbsp;electric propulsion systems for the Alia VTOL and CTOL, with the goal&nbsp;that the design will serve similar AAM architectures in future."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-hartzell-beta.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hartzell propeller installed on eVTOL.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-hartzell-beta.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Hartzell Propellers</p>\n</div>\n\n<p>On July 21,&nbsp;<a href=\"https://hartzellprop.com/\" target=\"_blank\">Hartzell Propeller</a>&nbsp;(Piqua, Ohio, U.S.) announced that it has received Federal Aviation Administration (FAA)&nbsp;Part 35 type certification for its first composite propeller designed specifically for advanced air mobility (AAM) aircraft. The company worked with aerospace company <a href=\"http://beta.team/\" target=\"_blank\">Beta Technologies</a> (South Burlington, Vt., U.S.) to&nbsp;achieve this landmark, conducting all testing of its propeller on Beta&rsquo;s&nbsp;electric propulsion systems (electric engines), which are designed and manufactured in-house by Beta.</p>\n\n<p>Hartzell says this milestone signifies the maturity, certifiability&nbsp;and commercialization of the AAM industry, and next-generation electric aviation. It is also a practical step forward in the industry&rsquo;s collective ability to support the growing demand for safe, low-cost, and efficient urban and regional air transport.</p>\n\n<p>With this certification, Hartzell&rsquo;s propeller is the first to earn FAA type certification specifically for integration with electric propulsion systems. These systems, like Beta&rsquo;s, are capable of managing a wide range of different loads and conditions &mdash; from regenerative braking to startup &mdash; all of which Hartzell&rsquo;s propellers are&nbsp;designed to support. The approval comes after thousands of hours of ground and flight testing over 4&nbsp;years, and verifies that the propeller exceeds the rigorous performance and safety standards of FAA Part 35.</p>\n\n<p>Hartzell&rsquo;s design is a five bladed, carbon fiber, ground-adjustable fixed-pitch propeller. Both companies have worked on the propeller development since 2021, from initial aerodynamic modeling and design to full-scale testing and validation. The result is a high-performance, low-noise propeller tailored specifically for electric engines. Beta&nbsp;will use Hartzell&rsquo;s propeller to optimize the performance and safety profile of both its Alia&nbsp;VTOL and Alia CTOL aircraft.&nbsp;The propeller is also built to serve all AAM aircraft that use&nbsp;similar electric propulsion systems.</p>\n\n<p>&ldquo;With its decades of experience across all types of aircraft, Hartzell Propeller has understood from the beginning the unique challenges and opportunities of electric aviation,&rdquo;<strong>&nbsp;</strong>says&nbsp;Kyle Clark, Founder and CEO of Beta&nbsp;Technologies. &ldquo;Their engineering precision and deep certification experience have assisted us as we bring this aircraft to market and walk through our own certification steps. We&nbsp;look forward to getting this certified propeller in the air as we continue the process of certifying our electric engines, as well as our Alia CTOL and VTOL.&rdquo;</p>\n\n<p>Beta&nbsp;has been flying its Alia&nbsp;CTOL and VTOL aircraft with Hartzell&rsquo;s propellers for more than 4&nbsp;years &mdash;&nbsp;including completion of a&nbsp;crewed transition of an eVTOL, and several long-range flights with its fixed-wing, including a coast-to-coast trip across the U.S., and now a grand tour of Europe.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hartzell-aam-propeller-gains-faa-part-35-type-certification"
      }
    ],
    "link": "https://www.compositesworld.com/news/hartzell-aam-propeller-gains-faa-part-35-type-certification"
  },
  {
    "published": "Mon, 28 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      28,
      15,
      0,
      0,
      0,
      209,
      0
    ],
    "title": "Mangohojden acquires Slingsby Advanced Composites Ltd.",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Mangohojden acquires Slingsby Advanced Composites Ltd."
    },
    "summary": "Swedish company seeks to develop a group of specialist aerospace and defense businesses to&nbsp;improve and enable investments needed to meet European industry demand.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Swedish company seeks to develop a group of specialist aerospace and defense businesses to&nbsp;improve and enable investments needed to meet European industry demand."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-slingsby-autoclaves.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Two blue autoclaves.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-slingsby-autoclaves.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Slingsby <a href=\"https://www.linkedin.com/company/slingsby-advanced-composites/posts/?feedView=all\" target=\"_blank\">LinkedIn</a></p>\n</div>\n\n<p>Mangohojden AB, a privately held Swedish company seeking to develop a group of specialist aerospace and defense businesses, has acquired <a href=\"https://www.linkedin.com/company/slingsby-advanced-composites/posts/?feedView=all\" target=\"_blank\">Slingsby Advanced&nbsp;Composites Ltd</a>.&nbsp;(North Yorkshire, U.K.) from <a href=\"https://marshallgroup.com/en-us\" target=\"_blank\">Marshall Group</a>&nbsp;(Cambridge, U.K.).</p>\n\n<p>Established in 1931 and acquired by the Marshall Group in 2010, Slingsby Advanced Composites is a premier complex composite structures and assembly service providers operating across land, air and sea defense platforms. Slingsby recently announced it has expanded&nbsp;capacity with investment, commission and installation&nbsp;of&nbsp;a fourth autoclave to meet growing demand, optimizing its capacity to achieve customer needs.&nbsp;</p>\n\n<p>Marshall Group is a globally respected provider of advanced structures and complex subsystems that meet stringent engineering requirements across civil and military applications. Building on decades of experience, the company&nbsp;develops and delivers durable and robust structures and complex subsystems for extreme land-based and maritime environments, considering both current and future mission requirements.</p>\n\n<p>&ldquo;Slingsby Advanced Composites is well-positioned to support the U.K. and European defense industry as it adapts to the new reality with increased investments and reliance on domestic supply,&rdquo; says&nbsp;Torbj&ouml;rn Johansson<br />\nMangohojden board member.&nbsp;&ldquo;Our ambition with Mangohojden is to establish a group of European companies in the defense and aerospace industry. As the industry is entering a transformational phase, we see an opportunity to create a group of niche companies. By combining with other successful companies, access to capital will improve and enable investments needed to meet industry demand in the coming years.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/mangohojden-acquires-slingsby-advanced-composites-ltd"
      }
    ],
    "link": "https://www.compositesworld.com/news/mangohojden-acquires-slingsby-advanced-composites-ltd"
  },
  {
    "published": "Mon, 28 Jul 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      28,
      14,
      0,
      0,
      0,
      209,
      0
    ],
    "title": "HTMS joins Mobilise accelerator program to advance its CMC materials",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "HTMS joins Mobilise accelerator program to advance its CMC materials"
    },
    "summary": "High Temperature Material Systems has developed low-temperature cure prepregs for ceramic matrix composite (CMC) parts offering lightweight and thermal/fire protection up to 1000&deg;C.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "High Temperature Material Systems has developed low-temperature cure prepregs for ceramic matrix composite (CMC) parts offering lightweight and thermal/fire protection up to 1000&deg;C."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-htms-mobilise.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"HTMS EV battery box made using its CMC prepregs\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-htms-mobilise.jpg;maxWidth=720\" /> </a></div>\n\n<p>HTMS exhibits an electric vehicle (EV) battery box made using its ceramic matrix composite (CMC)&nbsp;prepregs. Source | High Temperature Material Systems</p>\n</div>\n\n<p><a href=\"https://htms.tech/\" target=\"_blank\">High Temperature Material Systems</a> (HTMS, Bristol, U.K.) has been selected to join <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.apcuk.co.uk%2Ffunding%2Fmobilise%2F&amp;data=05%7C02%7Cggardiner%40compositesworld.com%7Cb4604376413a44a23cda08ddc9f3d32d%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638888771276105447%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=%2BS%2BYUgWUtlB9lGTFjNJXsevuNT1xxhfyLpE5NJ8pAxQ%3D&amp;reserved=0\" target=\"_blank\">Mobilise</a>, an early stage accelerator program focused on supporting innovative, zero-emission and connected and automated mobility (CAM) technologies. It is a joint initiative by the <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.apcuk.co.uk%2F&amp;data=05%7C02%7Cggardiner%40compositesworld.com%7Cb4604376413a44a23cda08ddc9f3d32d%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638888771276123409%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=7nt00wljBQqsaByXsBFU62qjYBfrx11zdtp29jv2m5Y%3D&amp;reserved=0\" target=\"_blank\">Advanced Propulsion Centre UK</a> (APC, University of Warwick, Coventry) and <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fzenzic.io%2F&amp;data=05%7C02%7Cggardiner%40compositesworld.com%7Cb4604376413a44a23cda08ddc9f3d32d%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638888771276140612%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=XaaPjmrLWPMBHBtlIRdr5U8oAFLxLtoYBhdDMXnZtnU%3D&amp;reserved=0\" target=\"_blank\">Zenzic</a> (London), as part of the U.K. government&rsquo;s &pound;2.5 billion DRIVE35 initiative.</p>\n\n<p>Mobilise is an 18-month innovation accelerator supporting the U.K.&rsquo;s most forward-thinking clean mobility companies and designed to keep Britain at the forefront of zero-emission vehicle technologies and automotive leadership. As part of the program, HTMS will:</p>\n\n<ul>\n\t<li>Accelerate development of its CMC battery enclosure systems for electric vehicles (EVs)</li>\n\t<li>Receive expert mentoring, funding and technical validation</li>\n\t<li>Make EVs lighter, safer and more affordable using a U.K.-focused supply chain.</li>\n</ul>\n\n<p>&ldquo;This opportunity marks a pivotal milestone as we bring our next-generation high-temperature composite solutions to market and support a cleaner, greener automotive future,&rdquo; says Will Larkin, COO of HTMS. &ldquo;We&rsquo;re excited to join Mobilise and collaborate with an exceptional group of clean mobility pioneers. This is an opportunity to fast-track our high-temperature composite technology with expert support, and to play a meaningful role in shaping the U.K.&rsquo;s zero-emission future.&rdquo;</p>\n\n<p>HTMS prepregs enable parts that can serve long-term up to 1000&deg;C and withstand EV battery heat and flame tests for 30-60 minutes. Using commodity fibers and a novel matrix chemistry, HTMS products Ignishield (basalt fiber), ThermaLite (alumina fiber) and Carbonite X (carbon fiber) handle and cure like polymer prepregs, but the 180-200&deg;C cure cycle is then followed by a freestanding post-cure in a furnace, resulting in CMC performance.</p>\n\n<p>&ldquo;Our goal is to enable the existing composites supply chain in the U.K to produce affordable, lightweight, high-temperature parts for a variety of applications,&rdquo; says Dr. Richard Grainger, CTO of HTMS. It is working with companies in defense, motorsports and high-performance cars to demonstrate thermal protection systems, heat shields, exhaust components and brake ducts.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/htms-joins-mobilise-accelerator-program-to-advance-its-cmc-materials"
      }
    ],
    "link": "https://www.compositesworld.com/news/htms-joins-mobilise-accelerator-program-to-advance-its-cmc-materials"
  },
  {
    "published": "Fri, 25 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      17,
      0,
      0,
      4,
      206,
      0
    ],
    "title": "DLR study considers cast PA6 molds for in situ AFP composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DLR study considers cast PA6 molds for in situ AFP composites"
    },
    "summary": "3D printed thermoplastic mold was analyzed as alternative to expensive, time-consuming metallic molds and for suitability in&nbsp;aerospace-grade composite structure&nbsp;fabrication.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "3D printed thermoplastic mold was analyzed as alternative to expensive, time-consuming metallic molds and for suitability in&nbsp;aerospace-grade composite structure&nbsp;fabrication."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-pa6-molds-publication.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-pa6-molds-publication.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;<a href=\"https://www.linkedin.com/posts/dlr-bt_thermoplastic-dlrbt-dlr-activity-7353053768017399808-a7-G/?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAN4sCoBEnrOaN1_kOmfslSmxd1f5UfO6WM\" target=\"_blank\">&copy; DLR</a></p>\n</div>\n\n<p>In a recent research paper released by&nbsp;<a href=\"https://www.compositesworld.com/suppliers/dlr---german-aerospace-center\" target=\"_blank\">The German Aerospace Center &mdash; DLR</a>&nbsp;(Cologne), the organization explores how thermoplastic composite (TPC) molds, specifically those made&nbsp;from polyamide 6 (PA6), perform compared to conventional metal tooling in the in situ automated fiber placement (AFP) process.</p>\n\n<p>Traditional tooling is expensive and time-consuming, which is why the industry is increasingly looking to 3D printed tools as cost-effective and flexible alternatives. The DLR&nbsp;investigated the difference in mechanical and morphological characteristics of laminates produced on metallic and polymeric molds. First, carbon fiber-reinforced LMPAEK&nbsp;laminates for both mold types were produced and their&nbsp;tensile strength, interlaminar shear strength&nbsp;and morphological characteristics analyzed&nbsp;using scanning electron microscopy (SEM) and differential scanning calorimetry (DSC). Despite differences in stiffness and thermal conductivity between the materials, the DLR found no statistically significant differences in the mechanical or crystalline properties of the laminates.</p>\n\n<p>Findings indicate that&nbsp;PA6&nbsp;in its cast form is a viable, low-cost option for nonheated AFP tooling. The DLR expects to extend this research into its 3D printing activities to open up new possibilities for efficient and flexible composites manufacturing.</p>\n\n<p><a href=\"https://www.mdpi.com/2504-477X/9/7/367\" target=\"_blank\">Read the complete study here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dlr-study-considers-cast-pa6-molds-for-in-situ-afp-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/dlr-study-considers-cast-pa6-molds-for-in-situ-afp-composites"
  },
  {
    "published": "Fri, 25 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      17,
      0,
      0,
      4,
      206,
      0
    ],
    "title": "Seoul National University VABS to design UAM, rotorcraft blades",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Seoul National University VABS to design UAM, rotorcraft blades"
    },
    "summary": "University conducts research to establish conceptual and detailed design methodologies applicable to composite UAM systems and to develop digital twin technologies that can be used in aerospace.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "University conducts research to establish conceptual and detailed design methodologies applicable to composite UAM systems and to develop digital twin technologies that can be used in aerospace."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-vabs-snu1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-vabs-snu1.png;maxWidth=720\" /> </a></div>\n\n<p>Blade section design and fan plot examples for analyzing the vibration characteristics of UAM (blade + graph) and overall UAM design and iterative flow chart. Sources | AnalySwift, SNU</p>\n</div>\n\n<p><a href=\"https://en.snu.ac.kr/\" target=\"_blank\">Seoul National University</a> (SNU, South Korea) has been participating in <a href=\"https://www.compositesworld.com/suppliers/analyswift\" target=\"_blank\">AnalySwift</a>&nbsp;(West Lafayette, Ind., U.S.)&nbsp;Academic Partner Program (APP), using its VABS simulation software to analyze urban air mobility (UAM)&nbsp;and other rotorcraft rotor blades.</p>\n\n<p>The work is&nbsp;part of the Active Aeroelasticity and Rotorcraft Laboratory (AARL) in the Department of Aerospace Engineering at SNU&nbsp;and the SNU-UAM Center, a research center dedicated to developing the core technologies for UAM. The APP offers participating universities no-cost licenses of engineering software programs VABS and SwiftComp&nbsp;so students, researchers&nbsp;and faculty can leverage the tools in their academic research.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>The VABS program is a general-purpose cross-sectional analysis tool for predicting structural beam properties and recovering 3D stresses, strains&nbsp;and strengths of slender composite<br />\nstructures. The tool models composite rotorcraft (helicopter, air mobility,<br />\nunmanned aerial vehicles) and wind turbine rotor blades, as well as other slender composite structures.</p>\n\n<p>VABS delivers high-fidelity results early on to help computationally resolve engineering challenges, reduce trial and errors&nbsp;and arrive at the best solution quickly.</p>\n</div>\n</div>\n\n<p>&ldquo;The SNU-UAM Center brings together 12 laboratories from seven universities,&nbsp;including SNU, with the goal of securing core technologies for UAM,&rdquo; says&nbsp;professor SangJoon Shin of the Department of Aerospace Engineering at SNU.&nbsp;&ldquo;To ensure the safe operation of UAM, it will be essential to avoid ground resonance. VABS enables us to design the rotor blade cross-section that avoids resonance within the operational frequency range. We have been using the&nbsp;VABS program to perform cross-sectional design based on the given geometries and to achieve the desired vibration characteristics for the rotor blades integrated with a gimballed hub.&rdquo;</p>\n\n<p>First, the SNU team designed the blade cross-section and used VABS to obtain the corresponding stiffness matrix. Then, this result was provided into Camrad&nbsp;II, a performance analysis program for rotorcraft, to compute the vibratory response under realistic flight conditions.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/seoul-national-university-vabs-to-design-uam-rotorcraft-blades"
      }
    ],
    "link": "https://www.compositesworld.com/news/seoul-national-university-vabs-to-design-uam-rotorcraft-blades"
  },
  {
    "published": "Fri, 25 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      16,
      0,
      0,
      4,
      206,
      0
    ],
    "title": "ORGANIC project to 3D print bio-inspired structures with bio-based materials",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ORGANIC project to 3D print bio-inspired structures with bio-based materials"
    },
    "summary": "EU-funded Horizon Europe project tackles lower production cost, enhanced sustainability and first-time-right parts fabrication&nbsp;through the fusion of&nbsp;biology, additive manufacturing and AI.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "EU-funded Horizon Europe project tackles lower production cost, enhanced sustainability and first-time-right parts fabrication&nbsp;through the fusion of&nbsp;biology, additive manufacturing and AI."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-organic-project-kickoff-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-organic-project-kickoff-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Project partners from 13 organizations and eight countries at the kick-off meeting in Vigo, Spain in June 2025. Source | ORGANIC project</p>\n</div>\n\n<p>Nature&rsquo;s solutions&nbsp;have often&nbsp;been translated to economic sectors such as<br />\narchitecture or healthcare. The&nbsp;EU-funded <a href=\"https://www.linkedin.com/company/organic-project\" target=\"_blank\">ORGANIC project</a> will go one step further: It will not only 3D print bio-inspired structures with bio-based materials, but also integrate biology, engineering and information technology to create a self-learning system. This system will evolve through technologies like AI-driven cognitive&nbsp;and and evolutionary controls.&nbsp;</p>\n\n<p>Within the project, these developments will be applied to enhancing wind turbine blades. In addition, they will have the ability to be adapted to any field in manufacturing that may benefit from bio-based materials. The 4-year project, led by the&nbsp;<a href=\"https://www.aimen.es/\" target=\"_blank\">Aimen&nbsp;Technology Centre</a>&nbsp;(O Porri&ntilde;o, Spain), started on June 1, 2025. <a href=\"https://www.iconiqinnovation.com/\" target=\"_blank\">Iconiq Innovation</a>&nbsp;(Harborough, U.K.) takes&nbsp;part in this project as the work package lead for &ldquo;WP boosting bio-intelligence adoption in AM.&rdquo;</p>\n\n<p>&ldquo;Additive manufacturing [AM] is highly promising but has its challenges,&rdquo; explains Andrea Fern&aacute;ndez Mart&iacute;nez, AI researcher&nbsp;in Aimen&nbsp;and project coordinator. &ldquo;It&rsquo;s a young technology which needs to improve before it will yield first-time-right products. The bio-intelligent approach we take in ORGANIC is based on data and will give us the opportunity to create a system that will correct itself by comparing what has been produced with the ideal state towards a first-time-right fabrication.&rdquo;</p>\n\n<p>The project consortium&nbsp;has 13 partners, consisting of a Spanish wind turbine manufacturer, 3D printing&nbsp;companies for large composite parts, universities and&nbsp;research and technology organizations, as well as hardware and software&nbsp;companies, an innovation consultancy and an innovation network. It spans eight European countries and multiple disciplines.</p>\n\n<p>&ldquo;ORGANIC&rsquo;s&nbsp;highly disciplinary is ambition: We take inspiration from nature, design&nbsp;new structures using bio-based materials, develop hardware as well as software and want the result to be adaptable across different manufacturing value chains. The use case in wind energy is our starting point.&rdquo;</p>\n\n<p>The project team will work on wind turbine blades to validate their technological developments. Expressed simply, the blades consist of a three-layer sandwich structure. Most of its middle layer is currently made of PET, PVC or balsa wood core. By 3D printing a customized core from bio-based materials, the blades&nbsp;can be more easily recycled while keeping their intended functionality&nbsp;and technical requirements. The new approach could help save cost and increase sustainability.&nbsp;</p>\n\n<p>In their&nbsp;first step, project partners will define the requirements of the sandwich structure&rsquo;s new core. These requirements will influence the choice of the bio-based material as well as the AI-driven generative design of the components. A prototype of the printing head will be&nbsp;equipped with sensing technology and a self-X control system. It will be tested on&nbsp;the Aimen Laser Applications Centre&rsquo;s AM pilot line. Analyzing the results will determine which sensors will be needed in the hardware&rsquo;s second iteration.</p>\n\n<p>In addition to this work, the software part of the project will aim to develop an AI-drive cognitive and evolutionary&nbsp;control system based on digital twins, leveraging a reinforcement learning framework. Asset Administration Shell (AAS)-based digital twins will be integrated for standardization and interoperability via an ontology-based knowledge system.</p>\n\n<p><em>One of the five projects in the scope of bio-intelligent manufacturing, this project has received funding from HORIZON-CL4-2024-TWIN-TRANSITION-01-TWO-STAGE under grant agreement number 101178127. Funded by the European Union.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/organic-project-to-3d-print-bio-inspired-structures-with-bio-based-materials"
      }
    ],
    "link": "https://www.compositesworld.com/news/organic-project-to-3d-print-bio-inspired-structures-with-bio-based-materials"
  },
  {
    "published": "Fri, 25 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      15,
      0,
      0,
      4,
      206,
      0
    ],
    "title": "Spintech grows Miamisburg footprint to advance composite airframe capabilities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Spintech grows Miamisburg footprint to advance composite airframe capabilities"
    },
    "summary": "Additional 53,000 square footage, which could grow to&nbsp;250,000 square feet of operational space by 2027, will support&nbsp;complex airframe component delivery for DOD, UAS programs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Additional 53,000 square footage, which could grow to&nbsp;250,000 square feet of operational space by 2027, will support&nbsp;complex airframe component delivery for DOD, UAS programs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Spintech-expanded-building-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </a></div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-spintech-hawthorn-updated-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hawthorn Composites building exterior.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-spintech-hawthorn-updated-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Spintech Holdings</p>\n</div>\n\n<p><a href=\"https://www.spintechinc.com/\" target=\"_blank\">Spintech Holdings, Inc.</a>&nbsp;(Dayton, Ohio, U.S.) recently announced a $7 million investment that is adding 53,000 square feet of&nbsp;dedicated high-volume manufacturing space to a plant in Miamisburg previously leased by Cornerston Research Group (CRG). The facility will be in addition to its current location at 1964 Byers Road in the same area, with majority of the investment going toward&nbsp;machinery and equipment that will be used to manufacture aerospace parts for&nbsp;critical defense and commercial systems.</p>\n\n<p>Over the past 5&nbsp;years, Spintech has evolved significantly, driven by customers&rsquo;&nbsp;demand for high-quality structural airframe components at lower costs and higher production rates. Historically, Spintech operated as a tooling provider through its Smart Tooling division, which offers&nbsp;solutions for aerospace composite (carbon fiber) manufacturing. Since its commercial launch in 2010, Smart Tooling has successfully been deployed on more than 50 flight-qualified aerospace systems, including high-profile platforms such as SpaceX&rsquo;s <em>Falcon 9</em>, Boeing&rsquo;s ecoDemonstrator, General Atomics&rsquo; <em>SkyGuardian</em>&nbsp;and Bell/Boeing&rsquo;s V-22. However, as Smart Tooling products are reusable for up to 100 cycles, they generate&nbsp;limited sales volume, constraining revenue growth. To seek other growth opportunities Spintech started to explore other means to apply its composite processing knowledge.</p>\n\n<p>The U.S. Department of Defense&rsquo;s (DOD&rsquo;s) pivot toward&nbsp;low-cost unmanned systems was what initially enabled Spintech to extend its work beyond tooling, resulting in <a href=\"https://www.compositesworld.com/news/spintech-opens-new-composites-manufacturing-division-hawthorn-composites\" target=\"_blank\">the launch of Hawthorn Composites in 2021</a> to meet this demand. To this day, Hawthorn Composites delivers structural composite airframes and airframe components for unmanned aircraft, with capabilities that enable it to produce tens of complex airframe components &mdash; such as fuselages, wings, tails&nbsp;and nosecones &mdash; per day, positioning Spintech as a key supplier to DOD prime contractors and the DOD itself.</p>\n\n<p>Over the last few years, Hawthorn has secured major contracts for six key unmanned aircraft system (UAS) platforms in both the defense and commercial space, progressing from engineering concepts through low-rate initial production (LRIP)&nbsp;and transitioning to high-rate production. The U.S. DOD&rsquo;s current endeavors &mdash; ordering UAS for missions like intelligence, surveillance&nbsp;and reconnaissance (ISR), counter-unmanned aircraft systems (CUAS)&nbsp;and low-cost munitions &mdash; is further fueling Hawthorn&rsquo;s growth.&nbsp;</p>\n\n<p>Spintech&rsquo;s newest leasing, bringing its total operational space to 90,000 square feet, will&nbsp;produce up to 533 airframes per month and host a Systems Integration&nbsp;Lab (SIL) in a controlled unclassified information (CUI) environment. The SIL will enable the Air Force Research Laboratory (AFRL) and third-party partners to integrate new payloads and flight controls onto Group II and Group III UAS (small- to medium-sized drones). The SIL will house vehicles that adhere to modular open systems architecture (MOSA) and weapons open systems architecture (WOSA) standards. This compliance supports rapid deployment of new capabilities, similar to an App store-like model, reducing time to field.</p>\n\n<p>Looking ahead, Spintech anticipates adding a 60,000-square-foot&nbsp;facility and a 100,000-square-foot&nbsp;facility within 2 years to support other U.S. DOD program ramp-ups. If successful in transitioning engineered platforms to production, Spintech&rsquo;s Dayton-area footprint could reach 250,000 square feet&nbsp;by the end of 2027.</p>\n\n<p>What other growth projects is Spintech considering?<strong>&nbsp;</strong>Through its Hawthorn Composites division, Spintech is exploring strategic opportunities to drive growth over the next 12 months. Its team is&nbsp;pursuing additional composite airframe manufacturing contracts with defense and commercial UAS customers to expand its&nbsp;market presence. Spintech is also&nbsp;developing value-added services, such as enhanced manufacturing processes and integration solutions, to deliver greater value to existing customers.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spintech-grows-miamisburg-footprint-to-advance-composite-airframes-capabilities"
      }
    ],
    "link": "https://www.compositesworld.com/news/spintech-grows-miamisburg-footprint-to-advance-composite-airframes-capabilities"
  },
  {
    "published": "Fri, 25 Jul 2025 10:01:40 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      14,
      1,
      40,
      4,
      206,
      0
    ],
    "title": "HydroGraph launches Compounding Partner Program to expand graphene-enhanced thermoplastics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "HydroGraph launches Compounding Partner Program to expand graphene-enhanced thermoplastics"
    },
    "summary": "Through the establishment of a qualified network of partners,&nbsp;HydroGraph is building commercial availability of unreinforced and reinforced thermoplastic compounds that incorporate its Fractal Graphene&nbsp;material.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Through the establishment of a qualified network of partners,&nbsp;HydroGraph is building commercial availability of unreinforced and reinforced thermoplastic compounds that incorporate its Fractal Graphene&nbsp;material."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-hydrograph-tensile-testing-machines.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Tensile testing machine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-hydrograph-tensile-testing-machines.jpg;maxWidth=720\" /> </a></div>\n\n<p>HydroGraph uses tensile testing machines (pictured) to validate the effectiveness of Fractal Graphene, certify partner performance&nbsp;and provide engineering-grade proof to OEMs and manufacturers in demanding industries. Source | HydroGraph</p>\n</div>\n\n<p><a href=\"https://hydrograph.com/\" rel=\"nofollow\" target=\"_blank\" title=\"HydroGraph Clean Power Inc.\">HydroGraph Clean Power Inc.</a>&nbsp;(Vancouver, BC, Canada), producer of high-purity graphene, has announced the&nbsp;launch of the Compounding Partner Program aimed at accelerating the adoption of its high-performance Fractal Graphene&nbsp;in unreinforced and fiber-reinforced thermoplastics.</p>\n\n<p>The initiative establishes a qualified network of plastic compounders with demonstrated expertise in processing graphene-enhanced thermoplastic materials, with early partners already piloting new formulations across automotive and packaging sectors. Participants in the program will undergo a qualification process to ensure adherence to performance, quality and consistency benchmarks defined by HydroGraph&rsquo;s technical lab.</p>\n\n<p>&ldquo;Establishing a select network of certified compounders enables HydroGraph to ensure consistent processing of Fractal Graphene&nbsp;at commercial scale,&rdquo; says&nbsp;Kjirstin Breure, president and CEO of HydroGraph. &ldquo;This initiative provides end customers with a vetted supply chain for sourcing graphene-enhanced compounds with confidence.&rdquo;</p>\n\n<p>Qualified partners will receive technical support, knowledge transfer&nbsp;and business referrals for commercial opportunities. The program is designed for compounders with advanced material capabilities, strong quality control systems&nbsp;and a track record in innovative product development.</p>\n\n<p>Fractal Graphene is a turbostratic graphene material manufactured using HydroGraph&rsquo;s patented detonation synthesis technology. Characterized by its 99.8% carbon purity and consistent morphology, the material&rsquo;s&nbsp;fractal structure enables performance at addition rates 10 to 100 times lower than conventional graphene nanoplatelets, offering potential reductions in material use, cost&nbsp;and environmental impact. Unlike traditional forms of graphene, which often require high loadings that may affect processability or material properties, Fractal Graphene&nbsp;achieves mechanical and electrical enhancements at ultra-low concentrations. HydroGraph&rsquo;s production method is designed to operate with low energy and carbon intensity compared to traditional manufacturing approaches.</p>\n\n<p>HydroGraph&rsquo;s certified compounding partners will support customers across industries seeking lighter, stronger&nbsp;and more sustainable materials, including automotive, construction, packaging, agriculture&nbsp;and textiles.</p>\n\n<p>Plastic compounders interested in joining HydroGraph&rsquo;s Compounding Partner Program can contact the company at <a href=\"mailto:partners@hydrograph.com\" target=\"_blank\">partners@hydrograph.com</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hydrograph-launches-compounding-partner-program-to-expand-graphene-enhanced-thermoplastics"
      }
    ],
    "link": "https://www.compositesworld.com/news/hydrograph-launches-compounding-partner-program-to-expand-graphene-enhanced-thermoplastics"
  }
]