[
  {
    "published": "Mon, 15 Sep 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      15,
      18,
      0,
      0,
      0,
      258,
      0
    ],
    "title": "AZL composite rotor sleeves project is completed, presents findings at upcoming web meeting",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AZL composite rotor sleeves project is completed, presents findings at upcoming web meeting"
    },
    "summary": "OEMs and E-drive developers can participate in the free Sept. 25 meeting providing a strategic overview of the collaborative research report and ready-to-engage partner network for implementation projects.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "OEMs and E-drive developers can participate in the free Sept. 25 meeting providing a strategic overview of the collaborative research report and ready-to-engage partner network for implementation projects."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-rotor-sleeves-hightemps.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-rotor-sleeves-hightemps.png;maxWidth=720\" /> </a></div>\n\n<p>The effect of high temperature on rotor sleeves. Source (All Images) | AZL Aachen GmbH&nbsp;</p>\n</div>\n\n<p>Following 9 months of collaborative research, <a href=\"#Consortium members\" target=\"_self\">a consortium of 15 companies</a> has completed a comprehensive analysis and benchmarking project on composite-based rotor sleeves led by <a href=\"https://www.compositesworld.com/suppliers/azl-aachen-gmbh\" target=\"_blank\">AZL Aachen GmbH</a> (Germany). The project systematically analyzed the state-of-the art, comparing&nbsp;materials, design strategies&nbsp;and processing methods for rotor sleeves made from thermoset and thermoplastic carbon fiber composites. The result is a comprehensive market and technology analysis, documented in a 384-page final report that&nbsp;is&nbsp;ready to be implemented into other cooperations.&nbsp;</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3><a name=\"Consortium members\">Consortium members</a></h3>\n\n<ul>\n\t<li>Arkema Group</li>\n\t<li>Covenstro Deutschland AG</li>\n\t<li>DOMO Engineering Plastics Europe S.p.A.,</li>\n\t<li>Hexcel Composites SASU</li>\n\t<li>Huntsman Advanced Materials</li>\n\t<li>Hutchinson SA CRI</li>\n\t<li>K&uuml;mpers GmbH</li>\n\t<li>LG Electronics Deutschland GmbH</li>\n\t<li>Maru Hachi Corp.</li>\n\t<li>Rassini Supensiones S.A. de C.V.</li>\n\t<li>Schunk Kohlenstofftechnik GmbH</li>\n\t<li>Swancore Netherlands B.V.</li>\n\t<li>Syensqo</li>\n\t<li>Toray Carbon Fibers&nbsp;Europe S.A.</li>\n\t<li>Toyota Motor Europe N.V./S.A.</li>\n</ul>\n</div>\n</div>\n\n<p>To support OEMs and motor developers in leveraging these findings, AZL is now hosting a dedicated web meeting on Sept. 25 designed specifically to demonstrate the practical relevance, supply chain maturity&nbsp;and technology details of composite rotor sleeves for electric drives. Participation is free of charge.</p>\n\n<p>The event will provide a strategic overview of the technology&rsquo;s capabilities and will highlight the concrete potential for integration into series production. It starts with an introduction to the current state of the technology and its role in enabling the next generation of electric motors. AZL will then present the consolidated results from the project&rsquo;s work packages. Key insights include comparisons of rotor sleeve designs (press-fit versus direct-wound), material classes (thermoplastic and thermoset carbon fiber composites), mechanical and thermal performance benchmarks and production KPIs.&nbsp;</p>\n\n<p>In the second part of the meeting, participants will get the opportunity to meet the consortium behind the recently finished project &mdash;&nbsp;from composite material suppliers and machine manufacturers to rotor sleeve producers. Each partner will briefly pitch their expertise and offerings, helping OEMs identify reliable contacts for implementation projects.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-tight-fitting-requirement.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-tight-fitting-requirement.png;maxWidth=385\" /></a></div>\n\n<p>Tight fitting requirements.&nbsp;</p>\n</div>\n\n<p>&ldquo;As a&nbsp;high-volume manufacturer in the field of rotor sleeves, Schunk considers it essential to actively shape innovation,&rdquo; says Fabian&nbsp;K&ouml;ster, development engineer composites at&nbsp;Schunk Kohlenstofftechnik GmbH, one of the consortium members. &ldquo;Our participation in the AZL project reflects our strong belief that future viability and competitiveness can only be secured through early involvement in technological developments. The AZL info event offers OEMs and partners across the entire value chain a valuable opportunity to exchange insights on the current state of rotor sleeve technologies, explore emerging trends&nbsp;and collaboratively develop solutions for tomorrow&rsquo;s challenges.&rdquo;</p>\n\n<p>For OEMs, this event provides not only an update on emerging technology, it also offers direct access to a ready-to-engage partner network. It also marks the official launch of a follow-up experimental project.</p>\n\n<p>This follow-up initiative will shift from theoretical analysis to experimental validation. Its goal is to benchmark the performance of different material and process combinations under real-world production and operating conditions. The&nbsp;follow-up&nbsp;project includes four work packages:</p>\n\n<ul>\n\t<li>The <strong>first work package</strong> will define the production concepts and materials to be tested experimentally, including the design of test methods and auxiliary equipment for press fit operations.</li>\n\t<li>The <strong>second work package</strong> is targeting a production process consisting of separate winding and press fitting on the rotor. It includes manufacturing of sleeves using wet winding, towpreg winding and thermoplastic tape winding. Strength testing of the sleeves will consider different prestress levels, while also the quality of the laminate will be evaluated.</li>\n\t<li>The <strong>third work package</strong> will do the same, but in this case for a process, directly winding on the rotor. Evaluation will also include high-temperature testing and long-term durability.</li>\n\t<li>Finally, in the <strong>fourth work package</strong>, all process and strength test results will be evaluated on cost, quality&nbsp;and performance, leading to benchmarking of various materials, and clear recommendations for cost-efficient rotor sleeves.</li>\n</ul>\n\n<p>The web meeting, hosted on Sept., 25, is open to OEMs, motor developers, innovation managers&nbsp;and system integrators seeking to accelerate their next electric powertrain generation. A registration link will be provided for all interested participants. Contract <a href=\"https://philipp.froehlig@azl-aachen-gmbh.de\" target=\"_blank\">Phillip Fr&ouml;hlig</a>&nbsp;for more info.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/azl-composite-rotor-sleeves-project-is-completed-presents-findings-at-upcoming-web-meeting"
      }
    ],
    "link": "https://www.compositesworld.com/news/azl-composite-rotor-sleeves-project-is-completed-presents-findings-at-upcoming-web-meeting"
  },
  {
    "published": "Mon, 15 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      15,
      16,
      0,
      0,
      0,
      258,
      0
    ],
    "title": "MaruHachi Corp. to develop CFRTP cryogenic rocket fuel tank",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "MaruHachi Corp. to develop CFRTP cryogenic rocket fuel tank"
    },
    "summary": "MaruHachi is selected by the Japanese government&rsquo;s&nbsp;Space Strategic Fund, commencing&nbsp;joint development with&nbsp;University of Tokyo and Kanazawa Institute of Technology/ICC.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "MaruHachi is selected by the Japanese government&rsquo;s&nbsp;Space Strategic Fund, commencing&nbsp;joint development with&nbsp;University of Tokyo and Kanazawa Institute of Technology/ICC."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-space-flight-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Jet fuel from rocket launch.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-space-flight-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>In late July 2025, <a href=\"https://maruhachi.eu/\" target=\"_blank\">MaruHachi Corp.</a> (Fukui, Japan), a family-owned company specializing in composite materials, preforms and profiles, announced that its proposal, &ldquo;Advancement of Design and Manufacturing Technology for Low-Cost Thermoplastic CFRP Large Tanks Utilizing DX Technology,&rdquo;&nbsp;has been selected by the Japan Aerospace Exploration Agency (JAXA) under its Space Strategic Fund program.</p>\n\n<p>This project aims to establish the foundational technology for manufacturing propulsion fuel tanks for rockets using lightweight and low-cost carbon fiber-reinforced thermoplastics (CFRTP), a departure from conventional metal materials. This innovation will be tackled through industry-academia collaboration with the University of Tokyo and Kanazawa Institute of Technology/Innovation Composite Center (ICC).</p>\n\n<p>In the global space industry, a pressing challenge is the reduction of rocket launch costs. MaruHachi aims to contribute to a dramatic weight and cost reduction for rockets by establishing a manufacturing technology for CFRTP tanks capable of withstanding cryogenic liquid fuels. This will enhance the international competitiveness of Japan&rsquo;s space transportation business.</p>\n\n<p>&ldquo;The background of this project is the ATL technology from Fraunhofer IPT, which MaruHachi introduced through the AZL network about 8&nbsp;years ago,&rdquo; says Toshihide Sugahara, president of MaruHachi Corp. &ldquo;Building on this, MaruHachi has accumulated fundamental research on ATL molding technology and advanced its processing techniques, which led to this proposal. As MaruHachi celebrates its 88<sup>th</sup> anniversary, we are taking on the new challenge of the space domain by leveraging the composite material technologies we have cultivated. We are committed as a company to making this project a success and contributing to the development of not only Japan&rsquo;s space industry but also the global space industry and the creation of new regional industries where we are located.&rdquo;</p>\n\n<p>The primary R&amp;D initiatives behind this project include:</p>\n\n<ul>\n\t<li>Developing high-performance CFRTP tape materials that can withstand cryogenic environments.&nbsp;</li>\n\t<li>The build of a sophisticated design system using high-performance computing to streamline development.&nbsp;</li>\n\t<li>Introduction of a new, ultra-large-scale molding system for rockets to establish manufacturing technology.</li>\n\t<li>Analyzation of&nbsp;big data from in-process manufacturing through inline inspection to develop efficient quality assurance technology.</li>\n</ul>\n\n<p>This project completed its contract with JAXA in April 2025 and has commenced with R&amp;D partners Nobuhiro Yoshikawa, professor at the University of Tokyo&rsquo;s&nbsp;Institute of Industrial Science; and Kiyoshi Uzawa, director/professor of the ICC&nbsp;at&nbsp;Kanazawa Institute of Technology.</p>\n\n<p>To promote this project, MaruHachi established the Future Development Department&nbsp;in April 2025. The company strives to further expand its business through the commercialization of technology developed in the space sector and its application in the aerospace industry.&nbsp;</p>\n\n<hr />\n<p style=\"text-align: center;\"><em>This post is courtesy of the&nbsp;</em>CompositesWorld<em>&nbsp;and AZL Aachen GmbH media partnership.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/maruhachi-corp-to-develop-cfrtp-cryogenic-rocket-fuel-tank"
      }
    ],
    "link": "https://www.compositesworld.com/news/maruhachi-corp-to-develop-cfrtp-cryogenic-rocket-fuel-tank"
  },
  {
    "published": "Mon, 15 Sep 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      15,
      15,
      30,
      0,
      0,
      258,
      0
    ],
    "title": "Hexcel expands official Americas aerospace distribution network",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexcel expands official Americas aerospace distribution network"
    },
    "summary": "Broadened distribution footprint includes Composites One, Heatcon, GracoRoberts, Krayden and Pacific Coast Composites, building up&nbsp;Hexcel&rsquo;s supply chain strength and customer agility.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Broadened distribution footprint includes Composites One, Heatcon, GracoRoberts, Krayden and Pacific Coast Composites, building up&nbsp;Hexcel&rsquo;s supply chain strength and customer agility."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-camx-booth-display.jpeg\" target=\"_blank\"><img alt=\"Hexcel CAMX booth.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-camx-booth-display.jpeg;maxWidth=385\" /></a></div>\n\n<p>Source | Hexcel</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel Corp.</a> (Stamford, Conn., U.S.) has announced a significant expansion of its official Americas aerospace distribution network, now including <a href=\"https://www.compositesworld.com/suppliers/composites-one\" target=\"_blank\">Composites One</a>, <a href=\"https://www.compositesworld.com/suppliers/gracoroberts\" target=\"_blank\">GracoRoberts</a>, <a href=\"https://www.compositesworld.com/suppliers/heatcon-composite-systems\" target=\"_blank\">Heatcon</a>, <a href=\"https://www.compositesworld.com/suppliers/krayden\" target=\"_blank\">Krayden</a>&nbsp;and <a href=\"https://www.compositesworld.com/suppliers/pacific-coast-composites\" target=\"_blank\">Pacific Coast Composites</a>. This move reflects Hexcel&rsquo;s commitment to increasing agility and responsiveness across the aerospace sector, particularly for startups and fast-growing segments developing capabilities for unmanned vehicles, eVTOLs, hypersonics, and other defense and space applications.</p>\n\n<p>&ldquo;Our goal is to be as agile as the markets we serve,&rdquo; says Lyndon Smith, Hexcel&rsquo;s president of&nbsp;Americas and global fibers. &ldquo;Expanding our official distribution network enables us to deliver our aerospace materials through multiple channels, ensuring customers have access to the right products, in the right quantities, at the right time.&rdquo;</p>\n\n<p>Through this&nbsp;expanded distribution network, Hexcel&nbsp;will&nbsp;deliver its advanced composite materials more efficiently and flexibly. Customers will also benefit from broader geographic coverage, faster turnaround times&nbsp;and improved access to technical support. These distributors bring extensive infrastructure, specialized capabilities such as roll slitting and kitting&nbsp;and robust e-commerce platforms that make it easier for aerospace manufacturers to source the materials they need &mdash; whether in large volumes or small, customized quantities.</p>\n\n<p>As a vertically integrated manufacturer, Hexcel controls every stage of its production process &mdash; from fiber and resin development to prepreg manufacturing and engineered core solutions. This integration ensures consistent quality, supply chain reliability&nbsp;and technical excellence across its entire product portfolio.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexcel-expands-official-americas-aerospace-distribution-network"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexcel-expands-official-americas-aerospace-distribution-network"
  },
  {
    "published": "Mon, 15 Sep 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      15,
      15,
      0,
      0,
      0,
      258,
      0
    ],
    "title": "Kaneka Belgium reduces Type 4 tank carbon fiber needs through CSR toughening",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Kaneka Belgium reduces Type 4 tank carbon fiber needs through CSR toughening"
    },
    "summary": "The company&rsquo;s&nbsp;Kane Ace MX liquid core-shell rubber toughener has been found to increase burst strength and mechanical performance while cutting material for&nbsp;H2 pressure vessel production.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company&rsquo;s&nbsp;Kane Ace MX liquid core-shell rubber toughener has been found to increase burst strength and mechanical performance while cutting material for&nbsp;H2 pressure vessel production."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-kaneka-kanace-fig1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Burst test results.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-kaneka-kanace-fig1.jpg;maxWidth=720\" /> </a></div>\n\n<p><strong>Figure 1.&nbsp;</strong>Burst test results (BisA epoxy/reactive diluent/anhydride) (for illustration only). Source (All Figures) |&nbsp;Kaneka Belgium NV</p>\n</div>\n\n<p><a href=\"https://www.kaneka.be/\" target=\"_blank\">Kaneka Belgium NV</a>&nbsp;(Westerlo), a&nbsp;subsidiary of&nbsp;Kaneka Corp., has developed Kane Ace MX liquid core-shell rubber (CSR) toughener. This advancement in resin toughening technologies aims to remove the traditional trade-offs &mdash; between&nbsp;light weight, strength or affordability &mdash; that engineers face when constructing Type 4 hydrogen pressure vessels.</p>\n\n<p>Kane Ace&nbsp;MX features a rubber core surrounded by a polymer shell that improves mechanical performances and ensures compatibility with different matrix systems. This CSR is then pre-dispersed in resin. Because of its liquid nature, it remains&nbsp;uniformly distributed during handling, formulation and curing. This makes it straightforward to integrate into existing manufacturing processes.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-kaneka-kanace-fig2.jpg\" target=\"_blank\"><img alt=\"Burst pressure versus CFRP weight.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-kaneka-kanace-fig2.jpg;maxWidth=385\" /></a></div>\n\n<p><strong>Figure 2.&nbsp;</strong>Burst pressure versus CFRP weight (for illustration only).</p>\n</div>\n\n<p>Recent burst tests on Type 4 hydrogen vessels have shown that incorporating 7.5% Kane Ace MX CSR into a BisA epoxy/anhydride formulation can significantly increase burst strength. Separate pressure cycle tests have further confirmed the possibility of reducing carbon fiber while maintaining vessel strength as well.&nbsp;For manufacturers, this could&nbsp;translate into material savings, lower weight&nbsp;and reduced overall cost.</p>\n\n<p>Beyond pressure vessels, Kane Ace&nbsp;MX toughening technology has proven its effectiveness in different kind of composites&nbsp;and other applications such as adhesives, castings and syntactic foams. The combined benefits of extended fatigue resistance, reduced material consumption&nbsp;and weight savings also contribute to reduced overall carbon footprint, aligning with sustainability goals of future energy systems.</p>\n\n<hr />\n<p style=\"text-align: center;\"><em>This post is courtesy of the&nbsp;</em>CompositesWorld<em>&nbsp;and AZL Aachen GmbH media partnership.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/kaneka-belgium-reduces-type-4-tank-carbon-fiber-needs-through-csr-toughening"
      }
    ],
    "link": "https://www.compositesworld.com/news/kaneka-belgium-reduces-type-4-tank-carbon-fiber-needs-through-csr-toughening"
  },
  {
    "published": "Mon, 15 Sep 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      15,
      14,
      0,
      0,
      0,
      258,
      0
    ],
    "title": "Otto Aerospace develops AI model for Phantom 3500 business jet aerodynamics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Otto Aerospace develops AI model for Phantom 3500 business jet aerodynamics"
    },
    "summary": "Tailored AI model will enable&nbsp;detailed aerodynamic analysis of current and future Otto aircraft configurations, streamlining design speed, precision and informing the aircraft program&rsquo;s composite structures.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Tailored AI model will enable&nbsp;detailed aerodynamic analysis of current and future Otto aircraft configurations, streamlining design speed, precision and informing the aircraft program&rsquo;s composite structures."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-ottoaerospace-phantom3500-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Phantom 3500.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-ottoaerospace-phantom3500-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Otto Aerospace</p>\n</div>\n\n<p><a href=\"https://ottoaviation.com/\" target=\"_blank\">Otto Aerospace</a> (formerly Otto Aviation, Fort Worth, Texas, U.S.) has announced the&nbsp;development of a proprietary aerodynamic AI model designed to optimize and accelerate the configuration of next-generation laminar flow airfoils and ultra-efficient sustainable aircraft. The AI model is trained on extensive computational fluid dynamics (CFD) simulations and wind-tunnel test data. This new AI capability enables Otto to explore the aircraft design space for optimal configurations within a day, a process that previously required months or years.</p>\n\n<p>The AI model will operate on Luminary Cloud&rsquo;s (San Mateo, Calif., U.S.) GPU-accelerated Physics AI platform, enabling detailed aerodynamic analysis of current and future Otto aircraft configurations. Recognized for its SHIFT family of pre-trained physics AI models, including SHIFT-Wing for aerodynamic analysis of transonic wings, Luminary provides advanced tools to support fast and accurate design evaluations.</p>\n\n<p>&ldquo;Our <em>Phantom 3500</em> program has generated extensive high-fidelity simulation and wind-tunnel test data,&rdquo; says&nbsp;Obi K. Ndu, Ph.D., chief information and digital officer at Otto Aerospace. &ldquo;At Otto, we believe that the future of aircraft design is at the intersection of AI and first principles. Luminary&rsquo;s platform gives us the computational power and infrastructure to quickly train an AI model optimized for next-generation laminar flow aircraft and our design approach.&rdquo;</p>\n\n<p>The <em>Phantom 3500</em>&rsquo;s laminar-flow fuselage and airfoil demand precise aerodynamic modeling for ultra-low-drag and long-range efficiency. Using Luminary&rsquo;s accelerated cloud computing capabilities, Otto will significantly expedite parametric design exploration compared to traditional CFD simulation workflows, fast-tracking the current and future development of aircraft designed to burn up to 60% less fuel and achieve up to 90%&nbsp;lower emissions when operating on sustainable aviation fuel.</p>\n\n<div class=\"article_sidebar\">\n<p>The <em>Phantom 3500</em> will have a highly composites-intensive design, backed by <a href=\"https://www.compositesworld.com/news/otto-aviation-launches-phantom-3500-business-jet-with-all-composite-airframe-from-leonardo\" target=\"_blank\">Leonardo</a> (Rome, Italy) and <a href=\"https://www.compositesworld.com/news/rebuild-to-deliver-composite-control-surfaces-for-ottos-phantom-3500-jet\" target=\"_blank\">Re:Build Manufacturing</a> (Framingham, Mass., U.S.). The AI model, to inform the&nbsp;evolution of the aircraft&rsquo;s geometry and aerodynamics, will provide direct input into these composite structures.</p>\n\n<p>The business jet&nbsp;is expected to begin flight testing in 2027, with entry into service targeted for 2030.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/otto-aerospace-develops-ai-model-for-phantom-3500-business-jet-aerodynamics"
      }
    ],
    "link": "https://www.compositesworld.com/news/otto-aerospace-develops-ai-model-for-phantom-3500-business-jet-aerodynamics"
  },
  {
    "published": "Fri, 12 Sep 2025 13:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      17,
      30,
      0,
      4,
      255,
      0
    ],
    "title": "DuPont to divest Kevlar, Nomex business to Arclin",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DuPont to divest Kevlar, Nomex business to Arclin"
    },
    "summary": "The company is selling its Aramids business for $1.8 billion to the chemical manufacturer in order to streamline&nbsp;the new DuPont portfolio and improve its financial profile.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company is selling its Aramids business for $1.8 billion to the chemical manufacturer in order to streamline&nbsp;the new DuPont portfolio and improve its financial profile."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-agreement-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Contract agreement being signed.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-agreement-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/dupont-automotive-systems\" target=\"_blank\">DuPont</a> (Wilmington, Del., U.S.)&nbsp;has announced that <a href=\"http://www.arclin.com/\" target=\"_blank\">Arclin</a>&nbsp;(Alpharetta, Ga., U.S.), a portfolio company of an affiliate of TJC&nbsp;L.P. (TJC), has reached a definitive agreement to acquire DuPont&rsquo;s Aramids business (Kevlar&nbsp;and Nomex) in a transaction valuing the business at approximately $1.8 billion.</p>\n\n<p>Arclin has received fully committed financing in connection with the transaction, which is expected to close in Q1 2026, subject to customary closing conditions and regulatory approval.</p>\n\n<p>At close, DuPont will receive pre-tax cash proceeds of approximately $1.2 billion, subject to customary transaction adjustments, a note receivable of $300 million&nbsp;and a non-controlling common equity interest in the future Arclin company currently valued at $325 million, which is expected to represent an approximate 17.5% stake at the time of close.</p>\n\n<p>&ldquo;This is another important step in our continued optimization of the new DuPont portfolio,&rdquo; says Lori Koch, DuPont CEO. &ldquo;The Aramids transaction further enhances the strategic focus of our portfolio, while also increasing the growth and margin profile. The transaction is structured to maximize value for our shareholders by providing significant cash proceeds at close which will be redeployed to further drive value creation, while also allowing DuPont shareholders to participate in Arclin&rsquo;s growth potential through our retained equity interest.&rdquo;</p>\n\n<p>The addition of Kevlar&nbsp;and Nomex&nbsp;to the Arclin portfolio presents an opportunity for Arclin to increase its scale, broaden its global reach and build its application development capabilities.&nbsp;</p>\n\n<p>The Aramids business is the inventor and largest global producer of high-performance synthetic fibers that protect people, equipment and structures in high cost-of-failure applications. Aramids&rsquo; synthetic fibers, Kevlar<sup>&nbsp;</sup>and Nomex, are well-known brands globally with a longstanding reputation for quality, product performance and supply reliability. With about 1,900 employees and five manufacturing sites, the Aramids business generated net sales of $1.3 billion in 2024.</p>\n\n<p>The Aramids divestiture will not impact DuPont&rsquo;s intended separation of its electronics business (Qnity), which remains on track for a Nov. 1, 2025 spin-off.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dupont-to-divest-kevlar-nomex-business-to-arclin"
      }
    ],
    "link": "https://www.compositesworld.com/news/dupont-to-divest-kevlar-nomex-business-to-arclin"
  },
  {
    "published": "Fri, 12 Sep 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      16,
      30,
      0,
      4,
      255,
      0
    ],
    "title": "Babcock, Uplift360 to recycle composite parts from Typhoon aircraft",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Babcock, Uplift360 to recycle composite parts from Typhoon aircraft"
    },
    "summary": "Chemical recycling process will be explored for breaking down and repurposing&nbsp;Typhoon and other defense platforms, forming U.K. defense supply chain resiliency.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Chemical recycling process will be explored for breaking down and repurposing&nbsp;Typhoon and other defense platforms, forming U.K. defense supply chain resiliency."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-babcock-uplift360.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Signing of contract.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-babcock-uplift360.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Sam&nbsp;Staincliffe, co-founder and CEO&nbsp;of&nbsp;Uplift360 (left) and&nbsp;Chloe Barker, managing director for Babcock&rsquo;s UK Aviation business (right). Source | Uplift360, Babcock</p>\n</div>\n\n<p>FTSE 100 defense company <a href=\"https://www.babcockinternational.com/\" target=\"_blank\">Babcock International Group</a> (Babcock, London, U.K.) has signed a contract with&nbsp;<a href=\"https://www.uplift360.tech/\" target=\"_blank\">Uplift360</a>&nbsp;(Luxembourg and Bristol, U.K.), a company that specializes&nbsp;in the recycling of advanced materials. The partnership will explore how composite materials from a Typhoon aircraft can be broken down and repurposed, and how this process could be applied more widely across additional defense platforms.&nbsp;</p>\n\n<p>&ldquo;By combining our operational experience with Uplift360&rsquo;s specialist expertise, we&rsquo;re working together to support our customers&rsquo; sustainability ambitions,&rdquo; says Chloe Barker, managing director for Babcock&rsquo;s UK Aviation business.&nbsp;&ldquo;This partnership is focused on delivering practical solutions that contribute to more efficient use of resources and strengthen the long-term resilience of U.K.&nbsp;defense supply chains. [Moreover] this collaboration is a great example of how we can work side by side with small and medium enterprises to deliver meaningful change.&rdquo;</p>\n\n<p>Uplift360 is a cleantech company developing circular chemical recycling technologies for high-performance materials such as carbon&nbsp;and aramid fibers. The company uses its&nbsp;room-temperature chemistry to recover mission-grade composites from end-of-life waste &mdash;&nbsp;helping defense and manufacturing partners reduce waste, secure supply chains&nbsp;and meet sustainability goals. Uplift360 was established in the U.K. in 2021 with DASA funding and has expanded operations to Luxembourg.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/babcock-uplift360-to-recycle-composite-parts-from-typhoon-aircraft"
      }
    ],
    "link": "https://www.compositesworld.com/news/babcock-uplift360-to-recycle-composite-parts-from-typhoon-aircraft"
  },
  {
    "published": "Fri, 12 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      16,
      0,
      0,
      4,
      255,
      0
    ],
    "title": "SABIC composite hybrid battery cover enhances EV safety, efficiency",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SABIC composite hybrid battery cover enhances EV safety, efficiency"
    },
    "summary": "SABIC collaborated with Engel, Siebenwurst, Forward Engineering, Ensinger and Envalior to develop a thermoplastic composite EV battery cover, combining&nbsp;strong structural performance, flame retardancy&nbsp;and design efficiency.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "SABIC collaborated with Engel, Siebenwurst, Forward Engineering, Ensinger and Envalior to develop a thermoplastic composite EV battery cover, combining&nbsp;strong structural performance, flame retardancy&nbsp;and design efficiency."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/sabic-composite-hybrid-battery-cover-enhances-ev-safety-and-efficiency-2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Cover and tray with team members.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/sabic-composite-hybrid-battery-cover-enhances-ev-safety-and-efficiency-2.jpg;maxWidth=720\" /> </a></div>\n\n<p>Cover and tray with team members (left to right): Koffi Dagnon (composite specialist, SABIC), Mick Peters (injection molding technician, SABIC), Daniel Maier (business development manager, Siebenwurst), Jeroen Krijnen (predictive engineering specialist, SABIC), Bart Van Den Dries (injection molding technician, SABIC), Matthias Schmid (project manager, Siebenwurst), Fred Chag (project leader, SABIC). Source (All Images) | SABIC</p>\n</div>\n\n<p>As the electric vehicle (EV) market accelerates, the demand for lightweight, safe&nbsp;and efficient battery pack components and systems continues to grow. Global chemicals company&nbsp;<a href=\"https://www.compositesworld.com/suppliers/sabic-innovative-plastics\" target=\"_blank\">SABIC</a> (Riyadh, Saudi Arabia)&nbsp;has partnered with <a href=\"https://www.compositesworld.com/suppliers/engel-austria\" target=\"_blank\">Engel </a>(Schwertberg, Austria), and Germany-based Siebenwurt (Dietfurt), Forward Engineering (Munich), <a href=\"https://www.compositesworld.com/suppliers/ensinger-gmbh\" target=\"_blank\">Ensinger</a> (Nufringen), and Envalior (D&uuml;sseldorf) to introduce a composite hybrid&nbsp;battery cover that partners believe&nbsp;could transform the approach to EV battery enclosures.</p>\n\n<p>The solution&rsquo;s design features a hybrid sandwich architecture with two continuous fiber-reinforced thermoplastic composite laminates (organosheets) overmolded with a flame-retardant, fiber-filled thermoplastic core (Stamax 30YH570 resin). This thermoplastic composite hybrid is made possible through SABIC&rsquo;s Megamolding platform, which supports the production of large, complex parts with strong structural performance and design efficiency.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/sabic-composite-hybrid-battery-cover-enhances-ev-safety-and-efficiency-3.jpg\" target=\"_blank\"><img alt=\"EV cover and tray.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/sabic-composite-hybrid-battery-cover-enhances-ev-safety-and-efficiency-3.jpg;maxWidth=385\" /></a></div>\n\n<p>EV cover and tray.</p>\n</div>\n\n<p>The battery cover&rsquo;s manufacture incorporates Engel&rsquo;s&nbsp;turnkey production cell, which facilitates high-volume production capabilities and cost efficiency. The resulting highly integrated enclosure reduces weight while meeting the stringent safety and performance requirements of modern EV platforms.</p>\n\n<p>According to SABIC, the thermoplastic composite hybrid approach provides benefits such as reduced weight, improved cost-effectiveness&nbsp;and enhanced thermal management, making it a suitable option for EV manufacturers aiming to improve range, safety&nbsp;and overall vehicle performance. Ultimately, the collaborative effort demonstrates that&nbsp;composite hybrid solutions can be both practical and scalable. It may also serve as a model for future materials-driven partnerships in the EV space.</p>\n\n<hr />\n<p style=\"text-align: center;\"><em>This post is courtesy of the </em>CompositesWorld<em> and AZL Aachen GmbH media partnership. </em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/sabic-composite-hybrid-battery-cover-enhances-ev-safety-efficiency"
      }
    ],
    "link": "https://www.compositesworld.com/news/sabic-composite-hybrid-battery-cover-enhances-ev-safety-efficiency"
  },
  {
    "published": "Fri, 12 Sep 2025 10:55:18 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      14,
      55,
      18,
      4,
      255,
      0
    ],
    "title": "Clean Aviation third call selects 12 projects starting in 2026, delivers €945 million total funding",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Clean Aviation third call selects 12 projects starting in 2026, delivers €945 million total funding"
    },
    "summary": "New aircraft concepts and innovative propulsion tech and system initiatives target four key areas to&nbsp;advance&nbsp;sustainable aviation, including one cooperation with the EU and Canada.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New aircraft concepts and innovative propulsion tech and system initiatives target four key areas to&nbsp;advance&nbsp;sustainable aviation, including one cooperation with the EU and Canada."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-clean-aviation-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airplane flying over a flower field.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-clean-aviation-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>The Governing Board of the Clean Aviation Joint Undertaking has launched &euro;945 million to support 12 visionary projects aimed at decarbonizing aviation.&nbsp;The selected initiatives in the field of new aircraft concepts and innovative propulsion technologies and systems will complement those funded under Clean Aviation&rsquo;s first and second&nbsp;calls for proposals. Projects will start beginning of 2026 and first flight tests are planned for 2028-2029. The projects will help reduce&nbsp;net emissions of greenhouse gases&nbsp;for commercial air travel by no less than&nbsp;30%&nbsp;compared to 2020 state-of-the-art technologies, and will pave the way for cleaner aircraft by 2035.</p>\n\n<p>The results of this third call&nbsp;also mark the start of a new&nbsp;cooperation in regional aviation between the EU and Canada: Powerplant Hybrid Application for REegional Segment (PHARES), has been selected to receive &euro;69 million in EU funding. The project, which will advance hybrid-electric propulsion for regional aircraft, is coordinated by a Canadian aircraft engine manufacturer.</p>\n\n<p>&ldquo;Achieving our climate goals and advancing sustainable aviation can only be done if public and private actors work hand in hand,&rdquo; says Sabine Klauke, co-chair of the Governing Board, and Airbus&rsquo; head of digital design manufacturing and services &ldquo;Next Gen.&rdquo;&nbsp;&ldquo;By supporting the brightest minds, fostering technical excellence and encouraging novel solutions, we can accelerate the breakthroughs our industry needs. The projects selected under Clean Aviation Call 3 represent an important milestone on this journey.&rdquo;</p>\n\n<p>Overall, 12 projects will receive funding in the following areas:</p>\n\n<ul>\n\t<li>&euro;199 million&nbsp;EU funding for ultra-efficient short-medium range aircraft technologies</li>\n\t<li>&euro;144 million&nbsp;EU funding for ultra-efficient regional aircraft technologies</li>\n\t<li>&euro;20 million&nbsp;EU funding for fast-track areas&nbsp;(FTAs)</li>\n\t<li>Transversal projects dedicated to aircraft concept integration and impact assessment&nbsp;have been awarded&nbsp;&euro;15 million&nbsp;EU funding.</li>\n</ul>\n\n<p>Call 3 introduced a new initiative to advance disruptive technologies, the FTAs. FTAs are designed to de-risk alternative or complementary technical solutions offered by research centers and SMEs. They put the focus on proposals that can rapidly advance impactful technologies to the development phase and are closely connected to the short-medium range and regional aircraft coordinators. Four promising projects were selected within this realm.</p>\n\n<h3>Ultra-efficient, short-medium range aircraft</h3>\n\n<ul>\n\t<li><strong>TAKE OFF:&nbsp;Technology And Knowledge for European Open Fan Flight</strong> &mdash; <em>Safran Aircraft Engines</em></li>\n\t<li><strong>LEIA:&nbsp;Large scalE Integration demonstrator of hybrid electrical Architecture&nbsp;</strong>&mdash; <em>Airbus Operations GmbH</em></li>\n\t<li><strong>UNIFIED:&nbsp;Ultra Novel and Innovative Fully Integrated Engine Demonstrations</strong> &mdash; <em>Rolls-Royce Plc</em></li>\n</ul>\n\n<h3>Ultra-efficient regional&nbsp;aircraft</h3>\n\n<ul>\n\t<li><strong>PHARES:&nbsp;Powerplant Hybrid Application for REegional Segment</strong> &mdash; <em>Pratt &amp; Whitney Canada Corp.</em></li>\n\t<li><strong>DEMETRA: Demonstrator of an Electrified Modern Efficient Transport Regional Aircraft&nbsp;</strong>&mdash;&nbsp;<em>Avions De Transport Regional</em></li>\n\t<li><strong>OSYRYS:&nbsp;On-board SYstems Relevant for hYbridization of Regional aircraftS</strong> &mdash; <em>Safran Electrical &amp; Power</em></li>\n</ul>\n\n<h3>Fast-track areas (FDAs)</h3>\n\n<ul>\n\t<li><strong>CRYOSTAR:&nbsp;Certification Roadmap to Yield an&nbsp;Optimal and Safety methodology of&nbsp;crashworthiness for an integrated&nbsp;cryogenic Tank for liquid hydrogen&nbsp;storAge&nbsp;on board of future&nbsp;aircraft</strong> &mdash; <em>Universita Degli Studi Della Campania Luigi Vanvitelli&nbsp;</em></li>\n\t<li><strong>MODABAT:&nbsp;Modular, scalable and technology-Open Design for future Aviation&nbsp;BATteries </strong>&mdash;&nbsp;<em>Fraunhofer Gesellschaft Zur F&ouml;rderung Der Angewandten Forschung EV</em></li>\n\t<li><strong>POWER4AIR:&nbsp;Arc Fault Detection, low&nbsp;EMI and&nbsp;Reliability for&nbsp;Power Electronics in&nbsp;Electric Aircrafts</strong> &mdash;<em> Skylife Engineering SL</em></li>\n\t<li><strong>LIME:&nbsp;Lithium based Innovation for Modular Energy</strong> &mdash; <em>Ascendance Flight Technologies</em></li>\n</ul>\n\n<h3>Aircraft concept integration &amp; impact assessment</h3>\n\n<ul>\n\t<li><strong>HERACLES:&nbsp;Hybrid Electric Regional Aircraft Concept for Low EmissionS</strong> &mdash; <em>Avions De Transport Regional</em></li>\n\t<li><strong>ACI&amp;I:&nbsp;Short Medium Range - Aircraft Configuration Integration and Impact</strong> &mdash; <em>Airbus Operations GmbH.</em></li>\n</ul>\n\n<p>All selected projects are in line with the Clean Aviation Strategic Research and Innovation Agenda (SRIA).</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/clean-aviation-third-call-selects-12-projects-starting-in-2026-delivers-945-million-total-funding"
      }
    ],
    "link": "https://www.compositesworld.com/news/clean-aviation-third-call-selects-12-projects-starting-in-2026-delivers-945-million-total-funding"
  },
  {
    "published": "Fri, 12 Sep 2025 10:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      14,
      30,
      0,
      4,
      255,
      0
    ],
    "title": "Hexcel, HyPerComp debut Type 4 COPV for aerospace, space",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexcel, HyPerComp debut Type 4 COPV for aerospace, space"
    },
    "summary": "The vessel, far along the path toward certification, demonstrates optimal fiber strength&nbsp;and burst pressure performance, designed to meet demanding environment needs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The vessel, far along the path toward certification, demonstrates optimal fiber strength&nbsp;and burst pressure performance, designed to meet demanding environment needs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-copv-type4.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Type 4 COPV on display.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-copv-type4.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Type 4 COPV highlighted at Hexcel&rsquo;s booth at CAMX 2025. Source |&nbsp;<em>CW</em></p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel</a> (Stamford, Conn., U.S.) announces the debut of a Type 4 composite-overwrapped pressure vessel (COPV), engineered in collaboration with <a href=\"https://www.compositesworld.com/suppliers/hypercomp-engineering\" target=\"_blank\">HyPerComp Engineering Inc.</a> (HEI, Brigham, Utah, U.S.) and built using Hexcel&rsquo;s high-performance HexTow&nbsp;IM11-R/12K carbon fiber. According to Hexcel&rsquo;s Lyndon Smith, president, Americas and global fibers, the company&rsquo;s fiber delivers&nbsp;optimal burst pressure performance and reliability for critical aerospace and space applications.</p>\n\n<p>Type 4 COPVs are made with a polymer liner fully wrapped in continuous carbon fiber. They are lighter and more corrosion-resistant than metal pressure vessels, which make them ideal for storing gases like hydrogen, helium and nitrogen in demanding environments. Hexcel and HEI&rsquo;s design offers high&nbsp;processability during filament winding and near-perfect translation of fiber mechanical properties.&nbsp;</p>\n\n<p>&ldquo;We have a high level of collaboration with Hexcel, which is resulting in the development of Type 4&nbsp;COPVs used in extreme environments. Initial testing has shown excellent delivered fiber strengths and burst pressures,&rdquo; says&nbsp;Jake Walker, chief&nbsp;innovation officer, HyPerComp. &ldquo;The combination of Hexcel&rsquo;s advanced fiber technology and our engineering expertise has set a high standard of performance for qualifying new COPV designs used in space launch and other applications.&rdquo;</p>\n\n<p>Smith says Hexcel and&nbsp;HyPerComp are well along the path for certification. The partners&rsquo; goal is to foster a more open, innovation and competitive market, with&nbsp;applications broadening beyond aerospace.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexcel-hypercomp-debut-type-4-copv-for-aerospace-space"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexcel-hypercomp-debut-type-4-copv-for-aerospace-space"
  }
]