[
  {
    "published": "Wed, 10 Sep 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      10,
      16,
      30,
      0,
      2,
      253,
      0
    ],
    "title": "Holy Technologies selects Plataine to scale up smart composites production",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Holy Technologies selects Plataine to scale up smart composites production"
    },
    "summary": "Plataine&rsquo;s AI agents for scheduling and traceability will enable Holy Technologies to optimize serial production plans, reduce manual effort&nbsp;and build a scalable foundation for future growth.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Plataine&rsquo;s AI agents for scheduling and traceability will enable Holy Technologies to optimize serial production plans, reduce manual effort&nbsp;and build a scalable foundation for future growth."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-plataine-holytech-robotic-carbonfiber-fab.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Robotic carbon fiber fabrication layup.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-plataine-holytech-robotic-carbonfiber-fab.jpg;maxWidth=720\" /> </a></div>\n\n<p>Robotic carbon fiber fabrication. Source | Plataine, Holy Technologies</p>\n</div>\n\n<p><a href=\"https://www.holy-technologies.com/\" target=\"_blank\">Holy Technologies</a>&nbsp;(Hamburg), a fast-growing German manufacturer specializing in sustainable and high-performance carbon fiber components, has selected&nbsp;<a href=\"https://www.compositesworld.com/suppliers/plataine\" target=\"_blank\">Plataine</a>&nbsp;(Waltham, Mass., U.S.), a provider of AI-based manufacturing optimization solutions, to support its transition into serial production with enhanced scheduling, traceability&nbsp;and production control.</p>\n\n<p>Holy Technologies aims to redefine&nbsp;the future of carbon fiber manufacturing through its <a href=\"https://www.compositesworld.com/news/holy-technologies-platform-enhances-carbon-fiber-component-recyclability\" target=\"_blank\">infinite fiber placement (IFP) process</a>. IFP is a fully automated robotic system that places continuous carbon fibers along a pre-calculated path, creating components with complex geometries and tailored mechanical properties, such as strength and stiffness. The technology achieves up to 30% lower weight compared to traditional methods. Using advanced automation technologies enables the company to make carbon fiber component production fast, repeatable and scalable. This approach is particularly attractive for high-performance sectors such as automotive, aerospace, industrial machinery&nbsp;and orthopedics. These industries rely on carbon fiber components because they are&nbsp;lightweight and strong, improving efficiency, reducing fuel consumption, extending range or improving durability.</p>\n\n<p>As Holy Technologies prepared for its first serial production run, the company faced the challenge of establishing a reliable system for real-time scheduling as well as traceability of molds, tools&nbsp;and components. In addition, the team sought a digital backbone flexible enough to support both current production needs and future growth.</p>\n\n<p>To address these requirements, Holy Technologies selected Plataine&rsquo;s AI-powered&nbsp;Production Scheduler. The solution optimizes workstation loads and shift planning, enables predictive maintenance alerts for tools and molds, and delivers real-time quality monitoring to reduce rework and support compliance. Holy Technologies engineering and operations teams will now benefit from real-time visibility into production, empowering them to make data-driven decisions and streamline workflows.</p>\n\n<p>With Plataine, Holy Technologies expects to significantly reduce planning efforts, improve on-time delivery, drive better longer-term procurement and staffing decisions and enable scalable and traceable operations as volumes increase. The result is a robust digital foundation that supports both current efficiency and long-term growth.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/holy-technologies-selects-plataine-to-scale-up-smart-composites-production"
      }
    ],
    "link": "https://www.compositesworld.com/news/holy-technologies-selects-plataine-to-scale-up-smart-composites-production"
  },
  {
    "published": "Wed, 10 Sep 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      10,
      16,
      30,
      0,
      2,
      253,
      0
    ],
    "title": "TPI Composites initiates voluntary Chapter 11 proceedings",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "TPI Composites initiates voluntary Chapter 11 proceedings"
    },
    "summary": "TPI and its U.S. subsidiaries commence filed bankruptcy proceeding and pursue&nbsp;a court-approved restructuring supported by $82.5 million in financing, allowing the company to maintain normal operations and strengthen its long-term position amid industry challenges.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "TPI and its U.S. subsidiaries commence filed bankruptcy proceeding and pursue&nbsp;a court-approved restructuring supported by $82.5 million in financing, allowing the company to maintain normal operations and strengthen its long-term position amid industry challenges."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/1223-cw-news-wind-farm-GettyImages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/1223-cw-news-wind-farm-GettyImages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/tpi-composites\" target=\"_blank\">TPI Composites&nbsp;Inc.</a>&nbsp;(Scottsdale, Ariz., U.S.), together with its domestic subsidiaries, has&nbsp;commenced voluntary chapter 11 proceedings in the&nbsp;U.S. Bankruptcy Court for the Southern District of Texas&nbsp;to pursue a comprehensive restructuring of the company that will enable TPI to emerge as a stronger enterprise.</p>\n\n<p>To support the company during this process, the Bankrupty Court has approved TPI&rsquo;s first-day motions that will&nbsp;provide the company with the operational flexibility and liquidity necessary to continue normal business operations during the chapter 11 process. Key motions approved&nbsp;include interim approval for debtor-in-possession (DIP) financing from its senior secured lenders of up to&nbsp;$82.5 million, the continuation of employee wages and benefits, maintenance of cash management systems&nbsp;and the authority to pay certain prepetition obligations critical to ongoing operations.</p>\n\n<p>TPI reached this decision to file customary motions in agreement with the&nbsp;company&rsquo;s senior secured lenders comprised of funds affiliated with funds managed by&nbsp;Oaktree Capital Management&nbsp;L.P.&nbsp;for Oaktree. It is expected that the DIP financing facility will be comprised of up to&nbsp;$27.5 million&nbsp;in new money to support the company&rsquo;s day-to-day operations and up to&nbsp;$55 million&nbsp;rolled up from the company&rsquo;s existing senior secured credit facility, underscoring Oaktree&rsquo;s continued support for and confidence in the company.</p>\n\n<p>&ldquo;Over the past several months, we have implemented strategic measures to fortify our business. These deliberate steps were designed to strengthen our financial stability and ensure we remain well-positioned to provide long-term benefits to our customers, suppliers, partners&nbsp;and associates,&rdquo; says&nbsp;Bill Siwek, CEO&nbsp;of TPI. &ldquo;Despite recent progress, industry-wide pressures have created financial challenges that must be addressed. We explored a variety of alternatives to address the challenges facing the company and believe that a chapter 11 process is necessary to position TPI for success.&rdquo;</p>\n\n<p>Siwek says the company aims to reach agreement with stakeholders on the terms of a plan of reorganization for the company in order to right-size its balance sheet and go forward with the ability to compete successfully in the current economic environment. &ldquo;Doing so will provide access to new liquidity to continue our operations and invest in innovation, ensuring our customers can continue to count on TPI for leading-edge wind blade solutions.&rdquo;</p>\n\n<p>The company is grateful to its associates for&nbsp;their dedication in continuing to deliver outstanding service, and to TPI customers, suppliers, service providers and other stakeholders for their steadfast support during this restructuring.</p>\n\n<p>Throughout this process and moving forward, TPI will continue operating normally and does not expect any material operational impact from the chapter 11 proceedings. The company will continue to work closely with its customers and suppliers, including by continuing to operate its manufacturing sites and delivering blade services.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/tpi-composites-initiates-voluntary-chapter-11-proceedings-"
      }
    ],
    "link": "https://www.compositesworld.com/news/tpi-composites-initiates-voluntary-chapter-11-proceedings-"
  },
  {
    "published": "Wed, 10 Sep 2025 12:15:37 -0400",
    "published_parsed": [
      2025,
      9,
      10,
      16,
      15,
      37,
      2,
      253,
      0
    ],
    "title": "Syensqo, Teijin Carbon achieve aerospace qualification for composite resin",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Syensqo, Teijin Carbon achieve aerospace qualification for composite resin"
    },
    "summary": "Resin infusion system Prism&nbsp;EP2400 achieves NCAMP qualification with Teijin Carbon&rsquo;s advanced NCF and UD reinforcements.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Resin infusion system Prism&nbsp;EP2400 achieves NCAMP qualification with Teijin Carbon&rsquo;s advanced NCF and UD reinforcements."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-TeijinCarbon-Syensqo.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composite aerostructure.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-TeijinCarbon-Syensqo.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Syensqo</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/solvay-composite-materials\" target=\"_blank\">Syensqo</a>&nbsp;(Atlanta, Ga., U.S.) has achieved FAA-sponsored NCAMP qualification for its&nbsp;<a href=\"https://www.syensqo.com/en/product/prism-ep2400\" rel=\"noopener\" target=\"_blank\">Prism<sup>&nbsp;</sup>EP2400 epoxy resin system</a>&nbsp;in combination with <a href=\"https://www.compositesworld.com/suppliers/teijin-carbon-america\" target=\"_blank\">Teijin Carbon</a>&rsquo;s (Rockwood, Tenn., U.S.) Tenax&nbsp;IMS65 E23 24K noncrimp fabrics (NCF) and unidirectional (UD) woven&nbsp;reinforcements.</p>\n\n<p>The qualification, recognized by both the FAA and EASA and formalized under material specification NMS 241 and process specification NPS 82401, is supported by a publicly available NCAMP Material Property Data Report, providing aerospace manufacturers with certified, design-ready material data to accelerate implementation where resin infusion offers clear performance and cost advantages.</p>\n\n<p>&ldquo;This qualification fills a critical gap in publicly available aerospace material data,&rdquo; says Rob Blackburn, head of customer engineering at Syensqo. &ldquo;It&rsquo;s the first resin infusion system in the NCAMP database, giving manufacturers a validated, scalable alternative to autoclave processing for applications where resin infusion makes sense such as integrated structures.&rdquo;</p>\n\n<p>Until now, public NCAMP allowables have focused almost exclusively on prepreg systems, leaving a gap for OEMs seeking validated out-of-autoclave (OOA) resin infusion solutions.&nbsp;NCAMP qualification means faster adoption (mechanical testing and analysis are already complete), reduced cost (qualification expenses are significantly reduced) and reduced program risk.&nbsp;</p>\n\n<p>Technical benefits of Prism&nbsp;EP2400 include:</p>\n\n<ul>\n\t<li>Low-viscosity system enabling robust and repeatable resin transfer processing.</li>\n\t<li>Toughened and damage-tolerant resin for high-performance application.</li>\n\t<li>Long and stable pot life for large or complex structure infusions.</li>\n\t<li>One-part, low reactive system, developed for global shipping by sea, land&nbsp;or air.</li>\n</ul>\n\n<p>Ideal for both primary and secondary structures on commercial or defense aircraft, Syensqo reports that Prism&nbsp;EP2400 is suited for a wide variety of components, where its toughened resin system delivers higher performance than typical resin infusion systems.</p>\n\n<p>The full&nbsp;<a href=\"https://www.wichita.edu/industry_and_defense/NIAR/Research/syensqo-prism-ep2400.php\" rel=\"noopener\" target=\"_blank\">documentation package</a>&nbsp;is now publicly available via NCAMP at Wichita State University.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/syensqo-teijin-carbon-achieve-aerospace-qualification-for-composite-resin"
      }
    ],
    "link": "https://www.compositesworld.com/news/syensqo-teijin-carbon-achieve-aerospace-qualification-for-composite-resin"
  },
  {
    "published": "Wed, 10 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      10,
      16,
      0,
      0,
      2,
      253,
      0
    ],
    "title": "Hexcel, A&P collaborate with NIAR to develop FAA certification framework for overbraided structures",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexcel, A&P collaborate with NIAR to develop FAA certification framework for overbraided structures"
    },
    "summary": "Acceptable&nbsp;composite specifications, design data and methodology will enable affordable, high-rate structure manufacturing for DOD aircraft.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Acceptable&nbsp;composite specifications, design data and methodology will enable affordable, high-rate structure manufacturing for DOD aircraft."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-niar-ap-inletduct.jpeg\" target=\"_blank\"><img alt=\"Serpentine inlet duct built for MASC.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-niar-ap-inletduct.jpeg;maxWidth=385\" /></a></div>\n\n<p>Serpentine inlet duct built under the MASC program, highlighted at CAMX 2025. Source | <em>CW</em></p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel Corp.</a> (Stamford, Conn., U.S.) is strategically collaborating with <a href=\"https://www.compositesworld.com/suppliers/ap-technology\" target=\"_blank\">A&amp;P Technology</a> (Cincinnati, Ohio, U.S.) to work with the&nbsp;AFRL-funded Modeling for Affordable, Sustainable Components (MASC) research program and Wichita State University&rsquo;s <a href=\"https://www.compositesworld.com/suppliers/national-institute-for-aviation-research\" target=\"_blank\">National Institute for Aviation Research</a> (NIAR, Kan., U.S.) to develop a methodology for certification of overbraided structures using Hexcel&rsquo;s IM7 24K fiber and 1078-1 resin system</p>\n\n<p>&ldquo;Our collaboration with A&amp;P Technology represents a significant step forward in delivering critical airworthy composite preforms at high rate,&rdquo; says&nbsp;Lyndon Smith, president, Americas and&nbsp;global fibers, Hexcel. &ldquo;By combining our advanced fiber and resin technology with A&amp;P Technology&rsquo;s overbraiding expertise, we&rsquo;re enabling the next generation of high-performance military and commercial aircraft structures.&rdquo;</p>\n\n<p>A&amp;P Technology, a manufacturer of engineered braided reinforcements using its line of braiding machinery, has developed the capability to overbraid large-scale aircraft structures at high rate. Development of composite specifications, design data and a methodology for certification acceptable to the Federal Aviation Administration (FAA) will enable the adoption of this high-performance, low-cost, high-rate preform and part manufacturing by commercial airframe builders and will aid in its adoption into military platforms.</p>\n\n<blockquote>\n<p>&ldquo;Together, we are using feedback from specific aerospace primes to create preliminary design values for matrix systems, which will accelerate the process for full qualification and certification.&rdquo;</p>\n</blockquote>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/hawthorn-composites\" target=\"_blank\">Hawthorn Composites</a> (Miamisburg, Ohio, U.S.) is currently producing inlet ducts&nbsp;for the Kratos XQ-58A <em>Valkyrie</em> using this overbraid and resin infused approach. Hawthorn has manufactured full-scale wings and fuselages for the same vehicle using similar approaches under the Design for Manufacture of Attritable Aircraft Primary Structure program (DMAAPS) program that culminated with a successful full-scale ground vehicle static test conducted by the AFRL. Independent analysis conducted by the AFRL concluded that use of braiding and overbraiding techniques on these types of parts would result in 57% cost savings when compared to hand applied prepreg and autoclave cure, and a 67% reduction in touch time.</p>\n\n<p>&ldquo;Net-shape braided preforms and overbraiding are both key technologies enabling the U.S. Department of Defense&nbsp;to realize their vision of affordable mass aircraft solutions,&rdquo; notes&nbsp;Tom Margraf, CEO of&nbsp;Hawthorn Composites.</p>\n\n<p>Overbraiding creates a controlled and predictable fiber change along the length of a part, including those with complex curvatures. Changing angles create mechanical property variation, but the controlled architecture allows for prediction of property change and creation of design envelopes.</p>\n\n<p>The design of a composite combat drone inlet duct produced by NIAR, A&amp;P Technology&nbsp;and <a href=\"https://www.compositesworld.com/suppliers/fiber-dynamics\" target=\"_blank\">Fiber Dynamics</a> (Wichita, Kan., U.S.) will be used as the basis for the certification development. The complex curvature of the duct represents the types of aircraft structures that will require a path to FAA certification to take advantage of the high rate of manufacture benefits by overbraiding. A process is now in place that enables production of multiple duct preforms per shift, which opens a path to certification and adoption, according to officials from A&amp;P Technology and NIAR.</p>\n\n<p>&ldquo;The overbraided serpentine inlet duct we developed under the MASC program is an excellent example of our partners&rsquo; capabilities and shows how modern braided composite technologies can advance aerospace innovation,&rdquo; says Dr. Waruna Seneviratne, director of NIAR&rsquo;s Advanced Technology Lab for Aerospace Systems (ATLAS). &ldquo;Together, we are using feedback from specific aerospace primes to create preliminary design values for matrix systems, which will accelerate the process for full qualification and certification.&rdquo;</p>\n\n<p>&ldquo;We&rsquo;re excited to collaborate with Hexcel on this initiative,&rdquo; says Andy Head, president of A&amp;P Technology. &ldquo;Our combined technologies offer a compelling solution for OEMs looking to quickly and consistently lay down fiber on complex load paths in complex geometries. This program will validate that the resulting structures are as easy to model and certify as incumbent, rate-limiting solutions.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexcel-ap-collaborate-with-niar-to-develop-faa-certification-framework-for-overbraided-structures"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexcel-ap-collaborate-with-niar-to-develop-faa-certification-framework-for-overbraided-structures"
  },
  {
    "published": "Wed, 10 Sep 2025 10:57:48 -0400",
    "published_parsed": [
      2025,
      9,
      10,
      14,
      57,
      48,
      2,
      253,
      0
    ],
    "title": "Re:Build to deliver composite control surfaces for Otto’s Phantom 3500 jet",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Re:Build to deliver composite control surfaces for Otto’s Phantom 3500 jet"
    },
    "summary": "Leveraging its expertise in composite structures, Re:Build is enabling Otto&rsquo;s laminar flow design through tightly toleranced, low-drag control surface assemblies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Leveraging its expertise in composite structures, Re:Build is enabling Otto&rsquo;s laminar flow design through tightly toleranced, low-drag control surface assemblies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-ottoaerospace-phantom1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Phantom 3500 aircraft rendering.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-ottoaerospace-phantom1.png;maxWidth=720\" /> </a></div>\n\n<p><em>Phantom 3500</em> aircraft rendering. Source | Otto Aerospace</p>\n</div>\n\n<p>Re:Build Manufacturing (Framingham, Mass., U.S.) has been selected to work with <a href=\"https://www.ottoaerospace.com/\" target=\"_blank\">Otto Aerospace</a> (previously Otto Aviation, Fort Worth, Texas, U.S.) to design and manufacture the structural control surfaces for Otto&rsquo;s <em>Phantom 3500</em> aircraft.</p>\n\n<p>The <em>Phantom 3500</em>&rsquo;s distinctive laminar flow fuselage and high-aspect ratio wing demands precision-tooled, tight-tolerance control surfaces to support low-drag flight, enabling Otto to meet its goal of burning 60% less fuel than its super-midsize jet competitors, and reducing emissions by up to 90%&nbsp;when combined with sustainable aviation fuel. To meet these specifications, Re:Build is working closely with the Otto engineering team to produce designs that meet structural requirements while also using tooling and assembly strategies that enable the surfaces to meet the tolerance levels required to minimize aerodynamic drag dramatically.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<blockquote>\n<p>Read &ldquo;<a href=\"https://www.compositesworld.com/news/otto-aviation-launches-phantom-3500-business-jet-with-all-composite-airframe-from-leonardo\">Otto Aviation launches Phantom 3500 business jet with all-composite airframe</a>...&rdquo;</p>\n</blockquote>\n</div>\n\n<p>The <em>Phantom 3500</em> is an all-composite airframe requiring tight-tolerance structural interfaces to the wing and empennage to support the required aerodynamic profile and enable Otto&rsquo;s laminar flow concept. Re:Build&rsquo;s team of engineers and composites manufacturing experts are&nbsp;collaborating with Otto&rsquo;s internal engineering team to ensure the control surfaces will enable the critical aerodynamic requirements of the aircraft.</p>\n\n<p>&ldquo;Our goal is to engage with customers and products at the forefront of high-impact industries, where we can simultaneously solve for quality, timeliness and cost, all of which further Re:Build&rsquo;s mission of onshoring advanced manufacturing,&rdquo; says Miles Arnone, co-founder and CEO of Re:Build Manufacturing. &ldquo;Collaborating with Otto on their laminar flow design is an example of the level of engineering expertise and rigor, coupled with stringent manufacturing quality, required to enable the U.S. manufacturing ecosystem.&rdquo;</p>\n\n<p>The highly optimized aerodynamic design of the control surfaces demonstrates Re:Build&rsquo;s ability to develop and produce cutting-edge aerospace structural assemblies, seamlessly integrating them into the larger engineering teams and visions of its customers. Re:Build will leverage its aerospace structures design and analysis expertise along with its thermoset composite manufacturing capabilities for this effort. The company is collaborating with Otto on the development of the initial pre-production airframes, followed by&nbsp;scale production as the vehicle transitions from certification to production.</p>\n\n<p>The <em>Phantom 3500</em> is expected to begin flight testing in 2027, with entry into service targeted for 2030.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rebuild-to-deliver-composite-control-surfaces-for-ottos-phantom-3500-jet"
      }
    ],
    "link": "https://www.compositesworld.com/news/rebuild-to-deliver-composite-control-surfaces-for-ottos-phantom-3500-jet"
  },
  {
    "published": "Wed, 10 Sep 2025 10:00:18 -0400",
    "published_parsed": [
      2025,
      9,
      10,
      14,
      0,
      18,
      2,
      253,
      0
    ],
    "title": "Novafast wins Australian export award",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Novafast wins Australian export award"
    },
    "summary": "Glass fiber pipe manufacturer looks to&nbsp;expand its manufacturing footprint outside of Australia to meet needs in harsh&nbsp;environments.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Glass fiber pipe manufacturer looks to&nbsp;expand its manufacturing footprint outside of Australia to meet needs in harsh&nbsp;environments."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-novafast-pipes-min.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Novafast composite pipe manufacturing facility.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-novafast-pipes-min.png;maxWidth=720\" /> </a></div>\n\n<p>Novafast composite pipe manufacturing facility. Source | Novafast</p>\n</div>\n\n<p><a href=\"https://novafast.com.au/\" target=\"_blank\">Novafast</a>, a family-owned composites manufacturing business based in Kilkenny South Australia, has won the Manufacturing and Advanced Materials category for the 2025 South Australian Premier&rsquo;s Business and Export Awards.&nbsp;Through this award, Novafast is recognized for its&nbsp;significant investment in world-leading manufacturing technology and its success in expanding its export footprint into global markets. It&nbsp;also qualifies Novafast&nbsp;for the National Export Awards to be announced at Parliament House in Canberra in November.</p>\n\n<p>Using advanced filament and helical winding technologies, Novafast produces high-quality glass fiber-reinforced polymer (GFRP), glass fiber-reinforced epoxy (GRE)&nbsp;and glass fiber-reinforced vinyl ester (GRVE) products. Novafast&nbsp;says it is the only GRE pipe manufacturer and the only company in Australia certified to test composite pipes to ISO 14692:2017. The company&rsquo;s signature NovaFlo&nbsp;2000M&nbsp;GRE pipe meets ISO 14692 requirements and is available in a conductive variant, making it ideal for use in hazardous environments like LNG, oil and petrochemical plants where static charge control is essential.</p>\n\n<p>Novafast&rsquo;s products provide long-lasting solutions that directly address the challenges of corrosion in harsh environments, making them a preferred choice for sectors including defense, oil and gas, mining, and water and wastewater. The company exports its&nbsp;Australian-made solutions to North America, Southeast Asia&nbsp;and the Middle East, with plans to expand its manufacturing footprint outside of Australia.</p>\n\n<p>&ldquo;This recognition validates our strategy of leveraging cutting-edge technology to compete on the global stage while creating jobs and supporting local industry here in South Australia,&rdquo; says&nbsp;David Figallo, business and strategy manager at Novafast. &ldquo;We have invested heavily in Industry 4.0-aligned automated robotic manufacturing, which has not only increased our production speed but also positioned us as an Australian-first in composite manufacturing for the defense sector.&rdquo;</p>\n\n<p>The company&rsquo;s recent achievement of a direct vendor registration with Saudi Aramco and international Lloyds Register Approvals has been pivotal in securing major international contracts, including a recent project to supply critical piping to Vietnam.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/novafast-wins-australian-export-award"
      }
    ],
    "link": "https://www.compositesworld.com/news/novafast-wins-australian-export-award"
  },
  {
    "published": "Tue, 9 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      9,
      16,
      0,
      0,
      1,
      252,
      0
    ],
    "title": "DFS Composites acquires Mexico wind blade tooling facility, expands North American operations",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DFS Composites acquires Mexico wind blade tooling facility, expands North American operations"
    },
    "summary": "With a new 300,000-square-foot site in Ciudad Ju&aacute;rez, DFS Composites boosts its global footprint and ability to supply composite tooling for wind energy across the Americas.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "With a new 300,000-square-foot site in Ciudad Ju&aacute;rez, DFS Composites boosts its global footprint and ability to supply composite tooling for wind energy across the Americas."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-dfscomposites-wind-facility.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Acquired wind blade facility.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-dfscomposites-wind-facility.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | DFS Composites Ltd.</p>\n</div>\n\n<p><a href=\"https://dfscomposites.com/\" target=\"_blank\">DFS Composites Ltd.</a> (Fareham, U.K.), a global tooling solutions and composite part manufacturing company for aerospace, automotive, wind energy, marine&nbsp;and a wide range of industrial applications, has acquired what is said to be one of the largest and most established wind blade tooling manufacturing facilities in the region, located in Ciudad Ju&aacute;rez, Mexico. Serving major global renewable energy OEMs for more than&nbsp;a decade, this strategically positioned site &mdash; just a few miles from the U.S. border &mdash;enhances DFS Composites&rsquo; ability to deliver rapid response, efficiency and reduced lead times to the North American market.</p>\n\n<p>The facility spans approximately 300,000 square feet&nbsp;and supports advanced composites manufacturing processes, including a CNC machine (31 &times; 8 &times; 5 meters), a specialist paint booth, multiple overhead cranes, a dedicated composites and tooling center, in-house AWS-certified welders, and in-house glass fiber cutting and kitting machines.&nbsp;</p>\n\n<p>With this new acquisition and existing factories in the U.K., India&nbsp;and China, DFS Composites is now strategically positioned in key locations close to major global customers while enabling the company to meet increasing demand from the U.S., Mexico&nbsp;and South America. This geographic proximity ensures lower logistics costs, greater competitiveness&nbsp;and faster delivery times, and significantly enhances DFS Composites&rsquo; production capacity.</p>\n\n<p>This announcement comes alongside another major milestone this year: DFS Composites was selected among five companies by the Offshore Wind Growth Partnership (OWGP) as part of its inaugural Manufacturing Facility Support Programme (MFSP). The company received a portion of the &pound;1.4 million funding awarded to support the development and expansion of U.K.-based manufacturing facilities for offshore wind components &mdash; reinforcing DFS Composites&rsquo; growing role in industrial-scale renewable energy production.</p>\n\n<p>DFS Composites is exhibiting at&nbsp;CAMX 2025, where it will showcase its expanded capabilities and discuss new collaboration opportunities with North American customers and partners.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dfs-composites-acquires-mexico-wind-blade-facility-expands-north-american-operations"
      }
    ],
    "link": "https://www.compositesworld.com/news/dfs-composites-acquires-mexico-wind-blade-facility-expands-north-american-operations"
  },
  {
    "published": "Tue, 9 Sep 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      9,
      14,
      0,
      0,
      1,
      252,
      0
    ],
    "title": "Caracol opens up Texas HQ and LFAM production center",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Caracol opens up Texas HQ and LFAM production center"
    },
    "summary": "The European company fires&nbsp;up its North American manufacturing capabilities to support U.S. customers, build&nbsp;its capacity and to achieve faster, more direct innovation and delivery.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The European company fires&nbsp;up its North American manufacturing capabilities to support U.S. customers, build&nbsp;its capacity and to achieve faster, more direct innovation and delivery."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-caracol-hq-production-center.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Additive manufacturing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-caracol-hq-production-center.jpg;maxWidth=720\" /> </a></div>\n\n<p>Caracol has opened its new headquarters in Austin, Texas, more than tripling its space for systems production and application development, with capacity to produce up additive manufacturing (AM) platforms annually. Source (All Images) | Caraco</p>\n</div>\n\n<p>Global large-format additive manufacturer (LFAM) <a href=\"https://www.compositesworld.com/suppliers/caracol\" target=\"_blank\">Caracol</a> (Milan, Italy)&nbsp;has announced the opening of a new 10,000-square-foot U.S.&nbsp;headquarters and production center in Austin, Texas, more than tripling its space for systems production and application development.</p>\n\n<p>Officially inaugurated the week of Sept. 1, this expansion strengthens Caracol&rsquo;s long-term commitment to North America&rsquo;s manufacturing industry, enabling faster delivery, tailored solutions&nbsp;and deeper collaboration with local customers. With a local supply chain, short&nbsp;lead times, direct technical support and co-development opportunities, Caracol is positioning itself to be a go-to partner for advanced manufacturing solutions in the U.S.</p>\n\n<p>&ldquo;This new facility will allow us to accelerate innovation and deliver solutions tailored specifically for the North American market, where demand is growing rapidly,&rdquo; says&nbsp;Francesco De Stefano, CEO of Caracol.&nbsp;&ldquo;When we opened our first Austin office in 2023, it was about establishing a presence; now it&rsquo;s about building capability. This expansion means faster progress, closer collaboration with our customers&nbsp;and solutions designed for their unique challenges &mdash;&nbsp;not to mention supporting domestic production in the U.S.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-caracolna-office-presentation.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-caracolna-office-presentation.jpg;maxWidth=385\" /></a></div>\n\n<p>The new headquarters is built to bring advanced manufacturing closer to U.S. customers.</p>\n</div>\n\n<p>Following 224% growth in systems delivered in the past 12 months, the U.S. facility combines R&amp;D, application development&nbsp;and large-scale production under one roof. Alongside dedicated assembly, testing and delivery areas for Caracol&rsquo;s proprietary Heron AM and Vipra AM robotic platforms, it also features an application hub for developing specialist projects with local manufacturing companies, providing them direct access to Caracol&rsquo;s engineering expertise, materials and products testing. This hub is designed to accelerate co-development, enabling partners to validate new applications, optimize manufacturing processes&nbsp;and scale innovative solutions directly with Caracol&rsquo;s team.</p>\n\n<p>With capacity to produce up to 100 Heron AM and Vipra AM platforms annually, the site is built to the same ISO 9001, EN 9100&nbsp;and ISO 14001 standards as the company&rsquo;s European sites, ensuring aerospace-grade quality, environmental responsibility&nbsp;and cost-efficient production, all while cutting emissions and costs tied to overseas shipping.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/caracol-opens-up-texas-hq-and-lfam-production-center"
      }
    ],
    "link": "https://www.compositesworld.com/news/caracol-opens-up-texas-hq-and-lfam-production-center"
  },
  {
    "published": "Mon, 8 Sep 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      8,
      17,
      0,
      0,
      0,
      251,
      0
    ],
    "title": "IKV research initiative investigates resin residence time in pultrusion profiles",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "IKV research initiative investigates resin residence time in pultrusion profiles"
    },
    "summary": "Institute for Plastics Processing at RWTH Aachen University develops experimental method to measure resin residence time for improved impregnation quality and process efficiency.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Institute for Plastics Processing at RWTH Aachen University develops experimental method to measure resin residence time for improved impregnation quality and process efficiency."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-kve-white-bckgrnd.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Resin residence time infographic.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-kve-white-bckgrnd.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Institute for Plastics Processing (IKV) in Industry and Craft at RWTH Aachen University</p>\n</div>\n\n<p>The <a href=\"https://www.compositesworld.com/suppliers/instpla\" target=\"_blank\">Institute for Plastics Processing (IKV) in Industry and Craft</a> at RWTH Aachen University (Germany) is developing an experimental method to measure the resin residence time and its local variation across the cross-section of a pultrusion profile. This research aims to enhance the understanding of flow fields in injection box technology, which is increasingly replacing traditional open impregnation baths in the production of lightweight components made of fiber-reinforced plastics (FRP). According to the institute, injection boxes improve component quality and increase process productivity, particularly with highly reactive matrix systems.</p>\n\n<p>For lightweight FRP components, reinforcing fibers are continuously impregnated with a plastic matrix in processes such as pultrusion and winding. While previous research investigated geometric influences on backflow in injection boxes and derived design guidelines for the pultrusion process, it did not account for the impact of injection strategy on production speed and product quality. Additionally, the resin residence time resulting from injection box design remains unpredictable.</p>\n\n<p>In this study, IKV uses an impulsive change in the color of the matrix during the pultrusion process to indicate the flow field in the injection box. To analyze the flow field, the profile is cut at regular intervals, and the resulting cross-sections are examined. Each cross-section displays a distinct color distribution based on its temporal proximity to the color change. The temporal variation in color change for each cross-section component is calculated using digital image correlation, facilitating further investigation of the underlying flow fields.</p>\n\n<p>The study suggests that combining insights from injection box geometry, injection strategy&nbsp;and the use of semi-finished textile products offers significant potential to improve impregnation quality and process efficiency.</p>\n\n<p>The first project meeting on this topic will take place at IKV on Sept. 23, 2025. Registration is open, and interested parties are encouraged to contact the institute for further details.</p>\n\n<p>This IGF research project (01IF23502N) of the Research Association for Plastics Processing was funded through the Industrial Collective Research (IGF) program&nbsp;by the Federal Ministry for Economic Affairs and Energy (BMWi), based on a resolution of the German Bundestag. The Institute acknowledges the support of all contributing institutions.</p>\n\n<hr />\n<p style=\"text-align: center;\"><em>This post is courtesy of the </em>CompositesWorld<em> and AZL Aachen GmbH media partnership. </em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ikv-research-initiative-investigates-resin-residence-time-in-pultrusion-profiles"
      }
    ],
    "link": "https://www.compositesworld.com/news/ikv-research-initiative-investigates-resin-residence-time-in-pultrusion-profiles"
  },
  {
    "published": "Mon, 8 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      8,
      16,
      0,
      0,
      0,
      251,
      0
    ],
    "title": "SkyDrive partners with Duc Hélices for eVTOL composite rotors",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SkyDrive partners with Duc Hélices for eVTOL composite rotors"
    },
    "summary": "The Japanese eVTOL manufacturer will work with the French propeller specialist on flight-critical rotors for its SD-05, accelerating testing progress and supporting certification efforts.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Japanese eVTOL manufacturer will work with the French propeller specialist on flight-critical rotors for its SD-05, accelerating testing progress and supporting certification efforts."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-duc-rotors-composite.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Three-bladed composite rotor.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-duc-rotors-composite.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;Duc&nbsp;H&eacute;lices Propellers&nbsp;</p>\n</div>\n\n<p>Under its future vision for urban transportation in Japan,&nbsp;<a href=\"https://en.skydrive2020.com/\" target=\"_blank\">SkyDrive Inc.</a> (Toyota, Japan),&nbsp;an electric vertical takeoff and landing (eVTOL) aircraft manufacturer, has started working with&nbsp;<a href=\"https://www.duc-helices.com/en\" target=\"_blank\">Duc&nbsp;H&eacute;lices Propellers</a>&nbsp;(Frontenas, France) to develop rotors for its <em>SkyDrive</em> aircraft (SkyDrive&nbsp;Model SD-05).</p>\n\n<p>Duc H&eacute;lices Propellers specializes in high-performance carbon fiber-reinforced epoxy&nbsp;propellers and rotors for&nbsp;airplanes, helicopters and multicopters. The company uses a&nbsp;high-precision, patented Forged Carbon manufacturing process to create robust blades that are complex in shape, with smooth surfaces and&nbsp;thin trailing edges, resulting in increased power, improved efficiency&nbsp;and reduced noise. The company is globally recognized for its commitment to aviation safety, with certifications from the EASA, FAA&nbsp;and other international authorities.</p>\n\n<p>The <em>SkyDrive,&nbsp;</em>featuring a composite body and rotor frames by <a href=\"https://www.carbonmagic.com/en/\" target=\"_blank\">Toray Carbon Magic</a>&nbsp;(Shiga, Japan), is a&nbsp;multi-rotor eVTOL aircraft propelled by 12 motors and three-bladed rotors. In such multi-rotor eVTOL configurations, the rotors are critically important components that generate lift and thrust, enabling precise control of the aircraft&rsquo;s attitude and movement via individual rotor speed adjustments. This distributed propulsion system also significantly contributes to noise reduction, redundancy&nbsp;and overall flight safety.</p>\n\n<p>By developing and using flight-critical rotors in collaboration with Duc H&eacute;lices Propellers, SkyDrive will accelerate the development and testing of safe aircraft.&nbsp;</p>\n\n<p>&ldquo;Duc H&eacute;lices has already proven to be incredibly agile; leveraging their in-house expertise and partner capabilities, they delivered initial products within 4&nbsp;months,&rdquo; says Arnaud Coville, chief development officer of SkyDrive.&nbsp;&ldquo;These products have achieved strong performance on our test rigs, marking a significant milestone in advancing our aircraft development toward type certification.&rdquo;</p>\n\n<p>SkyDrive began testing eVTOL prototypes in 2014 prior to official incorporation in 2018. In 2019, SkyDrive&nbsp;flew a&nbsp;crewed eVTOL for the first time. As of 2025, SkyDrive is working with civil aviation authorities in Japan and the U.S. to acquire certification for its product. The eVTOL aircraft is being produced at a facility&nbsp;owned by Suzuki Motor Corp., SkyDrive&rsquo;s official production partner.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/skydrive-partners-with-duc-helices-for-evtol-composite-rotors"
      }
    ],
    "link": "https://www.compositesworld.com/news/skydrive-partners-with-duc-helices-for-evtol-composite-rotors"
  }
]