[
  {
    "published": "Fri, 12 Sep 2025 13:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      17,
      30,
      0,
      4,
      255,
      0
    ],
    "title": "DuPont to divest Kevlar, Nomex business to Arclin",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DuPont to divest Kevlar, Nomex business to Arclin"
    },
    "summary": "The company is selling its Aramids business for $1.8 billion to the chemical manufacturer in order to streamline&nbsp;the new DuPont portfolio and improves its financial profile.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company is selling its Aramids business for $1.8 billion to the chemical manufacturer in order to streamline&nbsp;the new DuPont portfolio and improves its financial profile."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-agreement-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Contract agreement being signed.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-agreement-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/dupont-automotive-systems\" target=\"_blank\">DuPont</a> (Wilmington, Del., U.S.)&nbsp;has announced that <a href=\"http://www.arclin.com/\" target=\"_blank\">Arclin</a>&nbsp;(Alpharetta, Ga., U.S.), a portfolio company of an affiliate of TJC&nbsp;L.P. (TJC), has reached a definitive agreement to acquire DuPont&rsquo;s Aramids business (Kevlar&nbsp;and Nomex) in a transaction valuing the business at approximately $1.8 billion.</p>\n\n<p>Arclin has received fully committed financing in connection with the transaction, which is expected to close in Q1 2026, subject to customary closing conditions and regulatory approval.</p>\n\n<p>At close, DuPont will receive pre-tax cash proceeds of approximately $1.2 billion, subject to customary transaction adjustments, a note receivable of $300 million&nbsp;and a non-controlling common equity interest in the future Arclin company currently valued at $325 million, which is expected to represent an approximate 17.5% stake at the time of close.</p>\n\n<p>&ldquo;This is another important step in our continued optimization of the new DuPont portfolio,&rdquo; says Lori Koch, DuPont CEO. &ldquo;The Aramids transaction further enhances the strategic focus of our portfolio, while also increasing the growth and margin profile. The transaction is structured to maximize value for our shareholders by providing significant cash proceeds at close which will be redeployed to further drive value creation, while also allowing DuPont shareholders to participate in Arclin&rsquo;s growth potential through our retained equity interest.&rdquo;</p>\n\n<p>The addition of Kevlar&nbsp;and Nomex&nbsp;to the Arclin portfolio presents an opportunity for Arclin to increase its scale, broaden its global reach and build its application development capabilities.&nbsp;</p>\n\n<p>The Aramids business is the inventor and largest global producer of high-performance synthetic fibers that protect people, equipment and structures in high cost-of-failure applications. Aramids&rsquo; synthetic fibers, Kevlar<sup>&nbsp;</sup>and Nomex, are well-known brands globally with a longstanding reputation for quality, product performance and supply reliability. With about 1,900 employees and five manufacturing sites, the Aramids business generated net sales of $1.3 billion in 2024.</p>\n\n<p>The Aramids divestiture will not impact DuPont&rsquo;s intended separation of its electronics business (Qnity), which remains on track for a Nov. 1, 2025 spin-off.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dupont-to-divest-kevlar-nomex-business-to-arclin"
      }
    ],
    "link": "https://www.compositesworld.com/news/dupont-to-divest-kevlar-nomex-business-to-arclin"
  },
  {
    "published": "Fri, 12 Sep 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      16,
      30,
      0,
      4,
      255,
      0
    ],
    "title": "Babcock, Uplift360 to recycle composite parts from Typhoon aircraft",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Babcock, Uplift360 to recycle composite parts from Typhoon aircraft"
    },
    "summary": "Chemical recycling process will be explored for breaking down and repurposing&nbsp;Typhoon and other defense platforms, forming U.K. defense supply chain resiliency.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Chemical recycling process will be explored for breaking down and repurposing&nbsp;Typhoon and other defense platforms, forming U.K. defense supply chain resiliency."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-babcock-uplift360.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Signing of contract.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-babcock-uplift360.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Sam&nbsp;Staincliffe, co-founder and CEO&nbsp;of&nbsp;Uplift360 (left) and&nbsp;Chloe Barker, managing director for Babcock&rsquo;s UK Aviation business (right). Source | Uplift360, Babcock</p>\n</div>\n\n<p>FTSE 100 defense company <a href=\"https://www.babcockinternational.com/\" target=\"_blank\">Babcock International Group</a> (Babcock, London, U.K.) has signed a contract with&nbsp;<a href=\"https://www.uplift360.tech/\" target=\"_blank\">Uplift360</a>&nbsp;(Luxembourg and Bristol, U.K.), a company that specializes&nbsp;in the recycling of advanced materials. The partnership will explore how composite materials from a Typhoon aircraft can be broken down and repurposed, and how this process could be applied more widely across additional defense platforms.&nbsp;</p>\n\n<p>&ldquo;By combining our operational experience with Uplift360&rsquo;s specialist expertise, we&rsquo;re working together to support our customers&rsquo; sustainability ambitions,&rdquo; says Chloe Barker, managing director for Babcock&rsquo;s UK Aviation business.&nbsp;&ldquo;This partnership is focused on delivering practical solutions that contribute to more efficient use of resources and strengthen the long-term resilience of U.K.&nbsp;defense supply chains. [Moreover] this collaboration is a great example of how we can work side by side with small and medium enterprises to deliver meaningful change.&rdquo;</p>\n\n<p>Uplift360 is a cleantech company developing circular chemical recycling technologies for high-performance materials such as carbon&nbsp;and aramid fibers. The company uses its&nbsp;room-temperature chemistry to recover mission-grade composites from end-of-life waste &mdash;&nbsp;helping defense and manufacturing partners reduce waste, secure supply chains&nbsp;and meet sustainability goals. Uplift360 was established in the U.K. in 2021 with DASA funding and has expanded operations to Luxembourg.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/babcock-uplift360-to-recycle-composite-parts-from-typhoon-aircraft"
      }
    ],
    "link": "https://www.compositesworld.com/news/babcock-uplift360-to-recycle-composite-parts-from-typhoon-aircraft"
  },
  {
    "published": "Fri, 12 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      16,
      0,
      0,
      4,
      255,
      0
    ],
    "title": "SABIC composite hybrid battery cover enhances EV safety, efficiency",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SABIC composite hybrid battery cover enhances EV safety, efficiency"
    },
    "summary": "SABIC collaborated with Engel, Siebenwurt, Forward Engineering, Ensinger and Envalior to develop a thermoplastic composite EV battery cover, combining&nbsp;strong structural performance, flame retardancy&nbsp;and design efficiency.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "SABIC collaborated with Engel, Siebenwurt, Forward Engineering, Ensinger and Envalior to develop a thermoplastic composite EV battery cover, combining&nbsp;strong structural performance, flame retardancy&nbsp;and design efficiency."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/sabic-composite-hybrid-battery-cover-enhances-ev-safety-and-efficiency-2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Cover and tray with team members.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/sabic-composite-hybrid-battery-cover-enhances-ev-safety-and-efficiency-2.jpg;maxWidth=720\" /> </a></div>\n\n<p>Cover and tray with team members (left to right): Koffi Dagnon (composite specialist, SABIC), Mick Peters (injection molding technician, SABIC), Daniel Maier (business development manager, Siebenwurst), Jeroen Krijnen (predictive engineering specialist, SABIC), Bart Van Den Dries (injection molding technician, SABIC), Matthias Schmid (project manager, Siebenwurst), Fred Chag (project leader, SABIC). Source (All Images) | SABIC</p>\n</div>\n\n<p>As the electric vehicle (EV) market accelerates, the demand for lightweight, safe&nbsp;and efficient battery pack components and systems continues to grow. Global chemicals company&nbsp;<a href=\"https://www.compositesworld.com/suppliers/sabic-innovative-plastics\" target=\"_blank\">SABIC</a> (Riyadh, Saudi Arabia)&nbsp;has partnered with <a href=\"https://www.compositesworld.com/suppliers/engel-austria\" target=\"_blank\">Engel </a>(Schwertberg, Austria), and Germany-based Siebenwurt (Dietfurt), Forward Engineering (Munich), <a href=\"https://www.compositesworld.com/suppliers/ensinger-gmbh\" target=\"_blank\">Ensinger</a> (Nufringen), and Envalior (D&uuml;sseldorf) to introduce a composite hybrid&nbsp;battery cover that partners believe&nbsp;could transform the approach to EV battery enclosures.</p>\n\n<p>The solution&rsquo;s design features a hybrid sandwich architecture with two continuous fiber-reinforced thermoplastic composite laminates (organosheets) overmolded with a flame-retardant, fiber-filled thermoplastic core (Stamax 30YH570 resin). This thermoplastic composite hybrid is made possible through SABIC&rsquo;s Megamolding platform, which supports the production of large, complex parts with strong structural performance and design efficiency.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/sabic-composite-hybrid-battery-cover-enhances-ev-safety-and-efficiency-3.jpg\" target=\"_blank\"><img alt=\"EV cover and tray.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/sabic-composite-hybrid-battery-cover-enhances-ev-safety-and-efficiency-3.jpg;maxWidth=385\" /></a></div>\n\n<p>EV cover and tray.</p>\n</div>\n\n<p>The battery cover&rsquo;s manufacture incorporates Engel&rsquo;s&nbsp;turnkey production cell, which facilitates high-volume production capabilities and cost efficiency. The resulting highly integrated enclosure reduces weight while meeting the stringent safety and performance requirements of modern EV platforms.</p>\n\n<p>According to SABIC, the thermoplastic composite hybrid approach provides benefits such as reduced weight, improved cost-effectiveness&nbsp;and enhanced thermal management, making it a suitable option for EV manufacturers aiming to improve range, safety&nbsp;and overall vehicle performance. Ultimately, the collaborative effort demonstrates that&nbsp;composite hybrid solutions can be both practical and scalable. It may also serve as a model for future materials-driven partnerships in the EV space.</p>\n\n<hr />\n<p style=\"text-align: center;\"><em>This post is courtesy of the </em>CompositesWorld<em> and AZL Aachen GmbH media partnership. </em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/sabic-composite-hybrid-battery-cover-enhances-ev-safety-efficiency"
      }
    ],
    "link": "https://www.compositesworld.com/news/sabic-composite-hybrid-battery-cover-enhances-ev-safety-efficiency"
  },
  {
    "published": "Fri, 12 Sep 2025 10:55:18 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      14,
      55,
      18,
      4,
      255,
      0
    ],
    "title": "Clean Aviation third call selects 12 projects starting in 2026, delivers €945 million total funding",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Clean Aviation third call selects 12 projects starting in 2026, delivers €945 million total funding"
    },
    "summary": "New aircraft concepts and innovative propulsion tech and system initiatives target four key areas to&nbsp;advance&nbsp;sustainable aviation, including one cooperation with the EU and Canada.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New aircraft concepts and innovative propulsion tech and system initiatives target four key areas to&nbsp;advance&nbsp;sustainable aviation, including one cooperation with the EU and Canada."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-clean-aviation-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airplane flying over a flower field.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-clean-aviation-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>The Governing Board of the Clean Aviation Joint Undertaking has launched &euro;945 million to support 12 visionary projects aimed at decarbonizing aviation.&nbsp;The selected initiatives in the field of new aircraft concepts and innovative propulsion technologies and systems will complement those funded under Clean Aviation&rsquo;s first and second&nbsp;calls for proposals. Projects will start beginning of 2026 and first flight tests are planned for 2028-2029. The projects will help reduce&nbsp;net emissions of greenhouse gases&nbsp;for commercial air travel by no less than&nbsp;30%&nbsp;compared to 2020 state-of-the-art technologies, and will pave the way for cleaner aircraft by 2035.</p>\n\n<p>The results of this third call&nbsp;also mark the start of a new&nbsp;cooperation in regional aviation between the EU and Canada: Powerplant Hybrid Application for REegional Segment (PHARES), has been selected to receive &euro;69 million in EU funding. The project, which will advance hybrid-electric propulsion for regional aircraft, is coordinated by a Canadian aircraft engine manufacturer.</p>\n\n<p>&ldquo;Achieving our climate goals and advancing sustainable aviation can only be done if public and private actors work hand in hand,&rdquo; says Sabine Klauke, co-chair of the Governing Board, and Airbus&rsquo; head of digital design manufacturing and services &ldquo;Next Gen.&rdquo;&nbsp;&ldquo;By supporting the brightest minds, fostering technical excellence and encouraging novel solutions, we can accelerate the breakthroughs our industry needs. The projects selected under Clean Aviation Call 3 represent an important milestone on this journey.&rdquo;</p>\n\n<p>Overall, 12 projects will receive funding in the following areas:</p>\n\n<ul>\n\t<li>&euro;199 million&nbsp;EU funding for ultra-efficient short-medium range aircraft technologies</li>\n\t<li>&euro;144 million&nbsp;EU funding for ultra-efficient regional aircraft technologies</li>\n\t<li>&euro;20 million&nbsp;EU funding for fast-track areas&nbsp;(FTAs)</li>\n\t<li>Transversal projects dedicated to aircraft concept integration and impact assessment&nbsp;have been awarded&nbsp;&euro;15 million&nbsp;EU funding.</li>\n</ul>\n\n<p>Call 3 introduced a new initiative to advance disruptive technologies, the FTAs. FTAs are designed to de-risk alternative or complementary technical solutions offered by research centers and SMEs. They put the focus on proposals that can rapidly advance impactful technologies to the development phase and are closely connected to the short-medium range and regional aircraft coordinators. Four promising projects were selected within this realm.</p>\n\n<h3>Ultra-efficient, short-medium range aircraft</h3>\n\n<ul>\n\t<li><strong>TAKE OFF:&nbsp;Technology And Knowledge for European Open Fan Flight</strong> &mdash; <em>Safran Aircraft Engines</em></li>\n\t<li><strong>LEIA:&nbsp;Large scalE Integration demonstrator of hybrid electrical Architecture&nbsp;</strong>&mdash; <em>Airbus Operations GmbH</em></li>\n\t<li><strong>UNIFIED:&nbsp;Ultra Novel and Innovative Fully Integrated Engine Demonstrations</strong> &mdash; <em>Rolls-Royce Plc</em></li>\n</ul>\n\n<h3>Ultra-efficient regional&nbsp;aircraft</h3>\n\n<ul>\n\t<li><strong>PHARES:&nbsp;Powerplant Hybrid Application for REegional Segment</strong> &mdash; <em>Pratt &amp; Whitney Canada Corp.</em></li>\n\t<li><strong>DEMETRA: Demonstrator of an Electrified Modern Efficient Transport Regional Aircraft&nbsp;</strong>&mdash;&nbsp;<em>Avions De Transport Regional</em></li>\n\t<li><strong>OSYRYS:&nbsp;On-board SYstems Relevant for hYbridization of Regional aircraftS</strong> &mdash; <em>Safran Electrical &amp; Power</em></li>\n</ul>\n\n<h3>Fast-track areas (FDAs)</h3>\n\n<ul>\n\t<li><strong>CRYOSTAR:&nbsp;Certification Roadmap to Yield an&nbsp;Optimal and Safety methodology of&nbsp;crashworthiness for an integrated&nbsp;cryogenic Tank for liquid hydrogen&nbsp;storAge&nbsp;on board of future&nbsp;aircraft</strong> &mdash; <em>Universita Degli Studi Della Campania Luigi Vanvitelli&nbsp;</em></li>\n\t<li><strong>MODABAT:&nbsp;Modular, scalable and technology-Open Design for future Aviation&nbsp;BATteries </strong>&mdash;&nbsp;<em>Fraunhofer Gesellschaft Zur F&ouml;rderung Der Angewandten Forschung EV</em></li>\n\t<li><strong>POWER4AIR:&nbsp;Arc Fault Detection, low&nbsp;EMI and&nbsp;Reliability for&nbsp;Power Electronics in&nbsp;Electric Aircrafts</strong> &mdash;<em> Skylife Engineering SL</em></li>\n\t<li><strong>LIME:&nbsp;Lithium based Innovation for Modular Energy</strong> &mdash; <em>Ascendance Flight Technologies</em></li>\n</ul>\n\n<h3>Aircraft concept integration &amp; impact assessment</h3>\n\n<ul>\n\t<li><strong>HERACLES:&nbsp;Hybrid Electric Regional Aircraft Concept for Low EmissionS</strong> &mdash; <em>Avions De Transport Regional</em></li>\n\t<li><strong>ACI&amp;I:&nbsp;Short Medium Range - Aircraft Configuration Integration and Impact</strong> &mdash; <em>Airbus Operations GmbH.</em></li>\n</ul>\n\n<p>All selected projects are in line with the Clean Aviation Strategic Research and Innovation Agenda (SRIA).</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/clean-aviation-third-call-selects-12-projects-starting-in-2026-delivers-945-million-total-funding"
      }
    ],
    "link": "https://www.compositesworld.com/news/clean-aviation-third-call-selects-12-projects-starting-in-2026-delivers-945-million-total-funding"
  },
  {
    "published": "Fri, 12 Sep 2025 10:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      14,
      30,
      0,
      4,
      255,
      0
    ],
    "title": "Hexcel, HyPerComp debut Type 4 COPV for aerospace, space",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexcel, HyPerComp debut Type 4 COPV for aerospace, space"
    },
    "summary": "The vessel, far along the path toward certification, demonstrates optimal fiber strength&nbsp;and burst pressure performance, designed to meet demanding environment needs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The vessel, far along the path toward certification, demonstrates optimal fiber strength&nbsp;and burst pressure performance, designed to meet demanding environment needs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-copv-type4.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Type 4 COPV on display.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-copv-type4.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Type 4 COPV highlighted at Hexcel&rsquo;s booth at CAMX 2025. Source |&nbsp;<em>CW</em></p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel</a> (Stamford, Conn., U.S.) announces the debut of a Type 4 composite-overwrapped pressure vessel (COPV), engineered in collaboration with <a href=\"https://www.compositesworld.com/suppliers/hypercomp-engineering\" target=\"_blank\">HyPerComp Engineering Inc.</a> (HEI, Brigham, Utah, U.S.) and built using Hexcel&rsquo;s high-performance HexTow&nbsp;IM11-R/12K carbon fiber. According to Hexcel&rsquo;s Lyndon Smith, president, Americas and global fibers, the company&rsquo;s fiber delivers&nbsp;optimal burst pressure performance and reliability for critical aerospace and space applications.</p>\n\n<p>Type 4 COPVs are made with a polymer liner fully wrapped in continuous carbon fiber. They are lighter and more corrosion-resistant than metal pressure vessels, which make them ideal for storing gases like hydrogen, helium and nitrogen in demanding environments. Hexcel and HEI&rsquo;s design offers high&nbsp;processability during filament winding and near-perfect translation of fiber mechanical properties.&nbsp;</p>\n\n<p>&ldquo;We have a high level of collaboration with Hexcel, which is resulting in the development of Type 4&nbsp;COPVs used in extreme environments. Initial testing has shown excellent delivered fiber strengths and burst pressures,&rdquo; says&nbsp;Jake Walker, chief&nbsp;innovation officer, HyPerComp. &ldquo;The combination of Hexcel&rsquo;s advanced fiber technology and our engineering expertise has set a high standard of performance for qualifying new COPV designs used in space launch and other applications.&rdquo;</p>\n\n<p>Smith says Hexcel and&nbsp;HyPerComp are well along the path for certification. The partners&rsquo; goal is to foster a more open, innovation and competitive market, with&nbsp;applications broadening beyond aerospace.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexcel-hypercomp-debut-type-4-copv-for-aerospace-space"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexcel-hypercomp-debut-type-4-copv-for-aerospace-space"
  },
  {
    "published": "Fri, 12 Sep 2025 10:02:00 -0400",
    "published_parsed": [
      2025,
      9,
      12,
      14,
      2,
      0,
      4,
      255,
      0
    ],
    "title": "Startup Akvotransiro trials Wind2Water catamaran built from discarded wind turbine blades",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Startup Akvotransiro trials Wind2Water catamaran built from discarded wind turbine blades"
    },
    "summary": "Four-person prototype is one of many in-development hulls, floating docks and pontoons&nbsp;comprising bamboo composites and EOL wind blades&nbsp;re-engineered into reliable, environmentally conscious&nbsp;water vessels.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Four-person prototype is one of many in-development hulls, floating docks and pontoons&nbsp;comprising bamboo composites and EOL wind blades&nbsp;re-engineered into reliable, environmentally conscious&nbsp;water vessels."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-akvotransiro-windblade-boats.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"EOL wind turbine catamaran on the water.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-akvotransiro-windblade-boats.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;Akvotransiro Tech</p>\n</div>\n\n<p>Under the Wind2Water project, India&rsquo;s green vessel startup <a href=\"https://www.akvotransiro.co.in/?i=1\" target=\"_blank\">Akvotransiro Tech&nbsp;Pvt. Ltd.</a>&nbsp;(Guwahati) has trialed a patent-pending catamaran built from discarded wind turbine blades as a solution for the&nbsp;circular economy. With more than 43 million metric tons of wind blade waste expected globally by 2050&nbsp;according to research from Cambridge University &mdash; India alone is projected to generate 25,000-30,000 tons annually by 2030&nbsp;&mdash;&nbsp;the company&rsquo;s Wind2Water technology re-engineers end-of-life (EOL) blades into modular hulls, pontoons&nbsp;and docks. The approach reduces landfill disposal costs for wind firms while creating affordable, low-maintenance vessels for inland and coastal transport.</p>\n\n<p>Extensively tested on Deepor Beel, near Guwahati, the four-person prototype has proven stable, maneuverable&nbsp;and robust &mdash; offering what the company believes is a direct pathway to converting a mounting waste stream into safe, affordable vessels for the global south and environmentally conscious buyers worldwide. The hulls of this vessel are repurposed from the tip section of a wind blade, while the frames and the deck are comprised of bamboo composites.</p>\n\n<p>&ldquo;Every wind turbine blade is an environmental disposal headache in the waiting,&rdquo; says&nbsp;Ravi Jyoti Deka, founder of Akvotransiro. &ldquo;We have shown they can be re-engineered into reliable working boats that not only address waste, but also provide the water transport solutions that developing countries urgently need. This is not a concept note;&nbsp;it is a working vessel ready to scale.&rdquo;</p>\n\n<p>Founded in 2020 and supported by the Technology Innovation Hub at IIT Guwahati, Akvotransiro is reported to be India&rsquo;s first startup dedicated to green, affordable water transport solutions. The company has developed BamBateau bamboo composite boats, creating unsinkable flood-rescue craft, lightweight fishing canoes and an 18-passenger river trimaran. Its bamboo composite process is a proven, production-ready sustainable boatbuilding technology. Wind2Water extends this legacy, demonstrating how EOL blades can be transformed into modular hulls, floating docks&nbsp;and pontoons.</p>\n\n<p>According to Akvotransiro, the Wind2Water project extends the working life of discarded blades by 10-15 years, without energy-intensive recycling. It addresses a pressing waste challenge while creating safe, affordable vessels that could revolutionize inland and coastal transport worldwide. The Wind2Water proposal was a finalist in the EU&rsquo;s Horizon 2020 EIC program, but could not advance due to country restrictions. Now, with full-scale trials in India, the concept has moved decisively from theory to practice. End products in development include:</p>\n\n<ul>\n\t<li>24-36-meter multipurpose catamarans (up to 25 tons displacement) for inland and coastal transport</li>\n\t<li>10-12-meter&nbsp;catamarans, pontoon boats&nbsp;and trimarans built from blade sections</li>\n\t<li>Low-carbon floating docks and jetties derived from turbine blade stems.</li>\n</ul>\n\n<p>Akvotransiro&rsquo;s solutions target wind energy companies,&nbsp;which are currently paying&nbsp;up to &euro;18,000 per 10-metric ton&nbsp;blade for co-processing in cement plants&nbsp;or &euro;5,000 for landfill disposal. They are also well suited for inland water transport operators in developing nations, where blade-derived hulls can be built at one-third to one-quarter the cost of conventional vessels and shipped worldwide for on-site assembly.</p>\n\n<p>The company is currently seeking global partners across the wind energy sector to advance to the next stage: Building a full-scale 12-38-meter multipurpose catamarans and scaling its Wind2Water technology internationally.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/startup-akvotransiro-trials-wind2water-catamaran-built-from-discarded-wind-turbine-blades"
      }
    ],
    "link": "https://www.compositesworld.com/news/startup-akvotransiro-trials-wind2water-catamaran-built-from-discarded-wind-turbine-blades"
  },
  {
    "published": "Thu, 11 Sep 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      11,
      18,
      0,
      0,
      3,
      254,
      0
    ],
    "title": "Composite Integration, Atech Composites deliver workshops in Taiwan focused on composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composite Integration, Atech Composites deliver workshops in Taiwan focused on composites"
    },
    "summary": "From marine to aerospace to automotive, the global collaboration continues to engage customers across&nbsp;Taiwan and Southeast Asia, showcasing various fabrication and processing methods like RTM and LRI.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "From marine to aerospace to automotive, the global collaboration continues to engage customers across&nbsp;Taiwan and Southeast Asia, showcasing various fabrication and processing methods like RTM and LRI."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<h3>&nbsp;</h3>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-compositeintegration-atech-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Boat infusion.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-compositeintegration-atech-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Two-day training course. Source | Composite Integration, Atech Composites&nbsp;</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/composite-integration\" target=\"_blank\">Composite Integration Ltd.</a> (Saltash, U.K.)&nbsp;partnered with Atech Composites Co. Ltd. (Kaohsiung City, Taiwan), part of the global <a href=\"https://www.horizonyacht.com/\" target=\"_blank\">Horizon Group</a>&nbsp;of superyacht builders, to deliver a 2-day composites workshop in Taiwan. The event brought together more than 50 professionals from the marine, aerospace, automotive&nbsp;and offshore wind industries for hands-on sessions, live demonstrations and technical training.</p>\n\n<p>The program&nbsp;focused on vacuum infusion, resin transfer molding (RTM)&nbsp;and reusable vacuum bagging, with practical insights into how these processes can be adapted to meet the performance and quality demands of different applications.</p>\n\n<p>&ldquo;Our aim is to share expertise openly and support manufacturers across industries in finding the most efficient and effective composite processing solutions,&rdquo; says&nbsp;Richard Bland, technical director, Composite Integration. &ldquo;Workshops like this are a fantastic opportunity to exchange ideas, explore challenges&nbsp;and help drive the industry forward.&rdquo;</p>\n\n<p>Following the workshop, the Composite Integration team is continuing engagement with aerospace customers across Taiwan and Southeast Asia. Discussions have centered on the company&rsquo;s latest advancements in liquid resin processing (LRI) and the role these technologies play in producing next-generation aerospace structures.&nbsp;By collaborating with global aerospace suppliers, Composite Integration is helping to develop lighter, stronger&nbsp;and more sustainable composite components that meet the stringent requirements of future aircraft platforms.</p>\n\n<p>Alongside aerospace, Composite Integration also partners with global yacht manufacturers, supporting the Horizon Group and other superyacht builders to develop composite solutions across the full vessel, from hulls and decks to interior furnishings. These collaborations underline the adaptability of resin infusion and RTM technologies, ensuring high quality whether in marine, aerospace&nbsp;or automotive applications.</p>\n\n<p>&ldquo;We are proud to represent Composite Integration across Taiwan and Southeast Asia,&rdquo; says&nbsp;Chris Chen, general manager, Atech Composites, Horizon Group. &ldquo;The workshop was very valuable, and we received positive feedback, with attendees commending both the presentation and the demonstration content. Together, we are helping customers adopt advanced composite technologies that will shape the future of marine design&nbsp;and beyond.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/composite-integration-atech-composites-deliver-workshops-in-taiwan-focused-on-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/composite-integration-atech-composites-deliver-workshops-in-taiwan-focused-on-composites"
  },
  {
    "published": "Thu, 11 Sep 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      11,
      17,
      0,
      0,
      3,
      254,
      0
    ],
    "title": "CompositesWorld announces 2025 CW Top Shops honorees",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CompositesWorld announces 2025 CW Top Shops honorees"
    },
    "summary": "CW recognizes&nbsp;high-performing fabricators who participated in the 2025 benchmarking survey program, and highlights findings in this year&rsquo;s data.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "CW recognizes&nbsp;high-performing fabricators who participated in the 2025 benchmarking survey program, and highlights findings in this year&rsquo;s data."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2022-cw/0122-cw-news-topshops--cw-logo1.png\" target=\"_blank\"><img alt=\"CW Top Shops logo\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2022-cw/0122-cw-news-topshops--cw-logo1.png;maxWidth=385\" /></a></div>\n</div>\n\n<p><em>CW </em>is pleased announce the latest lineup of <a href=\"https://www.compositesworld.com/articles/top-shops-benchmarking-survey-faqs-2\" target=\"_blank\"><em>CW</em> Top Shops</a> honorees.</p>\n\n<p><em>CW</em> Top Shops is a survey-based benchmarking program run annually by <em>CW </em>in collaboration with <a href=\"https://www.compositesworld.com/suppliers/gardner-business-intelligence\" target=\"_blank\">Gardner Intelligence</a>, the research division of <a href=\"https://www.compositesworld.com/suppliers/gardner-business-media\" target=\"_blank\">Gardner Business Media</a> (Cincinnati, Ohio, U.S.). Every year, composites fabricators worldwide are invited to participate by taking a survey designed to measure a variety of metrics to help identify optimal practices and improve business operations and procedures. High-performing facilities across the survey&rsquo;s metrics earn the distinction of qualifying as a <em>CW </em>Top Shop for that year.</p>\n\n<p>Thirteen companies earned the <em>CW </em>Top Shops distinction this year:</p>\n\n<ul>\n\t<li><a href=\"https://www.bt-composites.gr/\" target=\"_blank\">B&amp;T Composites</a> (Florina, Greece)</li>\n\t<li><a href=\"https://www.compositesworld.com/suppliers/champion-fiberglass\" target=\"_blank\">Champion Fiberglass Inc.</a> (Spring, Texas, U.S.)</li>\n\t<li><a href=\"https://compotechinc.com/\" target=\"_blank\">Compotech Inc.</a> (Brewer, Maine, U.S.)</li>\n\t<li><a href=\"https://in.linkedin.com/company/coroseal\" target=\"_blank\">Coroseal Chemical Equipment Co.</a> (Navi Mumbai, India)</li>\n\t<li><a href=\"https://www.eppcomposites.com/\" target=\"_blank\">EPP Composites Pvt. Ltd.</a> (Rajkot, India)</li>\n\t<li><a href=\"https://gsedynamics.com/\" target=\"_blank\">GSE Dynamics Inc.</a> (Hauppauge, N.Y., U.S.)</li>\n\t<li><a href=\"https://www.compositesworld.com/suppliers/nammo-composite-solutions\" target=\"_blank\">Nammo Composite Solutions Inc.</a> (Salt Lake City, Utah, U.S.)</li>\n\t<li><a href=\"https://www.origenmfg.com/\" target=\"_blank\">Origen Manufacturing LLC</a> (Pleasant View, Utah, U.S.)</li>\n\t<li><a href=\"https://www.compositesworld.com/suppliers/phoenix-composite-solutions\" target=\"_blank\">Phoenix Composites Solutions LLC</a> (Oscoda, Mich., U.S.)</li>\n\t<li><a href=\"https://performancecomposites.com/\" target=\"_blank\">Precision Composites Technologies LLC</a> (Scappoose, Ore., U.S.)</li>\n\t<li><a href=\"https://www.compositesworld.com/suppliers/rock-west-composites\" target=\"_blank\">Rock West Composites</a> (San Diego, Calif., U.S.)</li>\n\t<li><a href=\"https://www.compositesworld.com/suppliers/smart-tooling\" target=\"_blank\">Spintech Holdings Inc.</a> (Miamisburg, Ohio, U.S.)</li>\n\t<li><a href=\"https://www.compositesworld.com/suppliers/mras-usa\" target=\"_blank\">ST Engineering MRAS</a> (Baltimore, Md., U.S.)</li>\n</ul>\n\n<p>The <em>CompositesWorld </em>team would like to congratulate all of the honorees!</p>\n\n<h2>High-performing facilities: Machine efficiency, supply chain management, automation and more</h2>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-topshops-2.png\" target=\"_blank\"><img alt=\"CW Top Shops 2025 machine uptime data\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-topshops-2.png;maxWidth=385\" /></a></div>\n\n<p><strong>Figure 1.&nbsp;</strong>The blue dots represent the responses of shops &shy;&shy;&shy; &mdash; the darker the blue, the more responses that were close to that value.&nbsp;The gray shaded area marks the middle 50%, and the break in the shading represents the median for that group. The red line indicates the median overall value among all shops combined. Source | Gardner Intelligence&nbsp;</p>\n</div>\n\n<p>What makes &ldquo;Top Shops&rdquo; stand out? According to Gardner Intelligence&rsquo;s analysis, Top Shops excel across multiple metrics measured in the benchmarking program:</p>\n\n<ul>\n\t<li>Median machine uptime is 95% for Top Shops compared to 65% for others (see Fig. 1 at right).</li>\n\t<li>Median capacity utilization is 80% for Top Shops compared to 65% for others.</li>\n\t<li>Top Shops seem to demonstrate higher efficiency and productivity.</li>\n\t<li>Top Shops have increased output and reduced costs, leading to higher profitability.</li>\n\t<li>Top Shops are actively engaging in high-impact methodologies like Lean, 5S, Kaizen and TQM, leading to better quality, lower costs, faster delivery and stronger competitive positioning.</li>\n</ul>\n\n<h3>Superior supply chain management</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-topshops-3.png\" target=\"_blank\"><img alt=\"CW Top Shops 2025 supply chain data\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-topshops-3.png;maxWidth=385\" /></a></div>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<p><strong>Figure 2. </strong>Top Shops (orange) demonstrated more supply chain best practices than other survey participants.&nbsp;Source | Gardner Intelligence&nbsp;</p>\n</div>\n</div>\n\n<p>One area where Top Shops demonstrate best practices in nearly all aspects is supply chain management. For example, the table in Fig. 2 shows forecast sharing, supplier certifications and customer satisfaction surveys as three practices used much more widely by Top Shops than others surveyed.</p>\n\n<p>&ldquo;These practices are associated with greater efficiency, higher customer satisfaction, lower costs&nbsp;and better collaboration with suppliers and customers,&rdquo; says Amy Schaub, market research associate at Gardner Intelligence.<strong> </strong>&ldquo;Top Shops have adopted comprehensive supply chain strategies. These practices contribute directly to improved responsiveness, cost savings&nbsp;and customer value which are all crucial for competitive advantage.&rdquo;</p>\n\n<h3>Adopting automation</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-topshops-1.png\" target=\"_blank\"><img alt=\"CW Top Shops 2025 automation data\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-topshops-1.png;maxWidth=385\" /></a></div>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<p><strong>Figure&nbsp;3. </strong>Top Shops (orange) demonstrated more uses of automation overall than other survey participants, especially regarding automated cutting/kitting. Source | Gardner Intelligence&nbsp;</p>\n</div>\n</div>\n\n<p>This year&rsquo;s data shows that Top Shops outperformed other facilities in all areas of automation as well.</p>\n\n<p>The table to the right (Fig. 3) shows the percentages of Top Shops versus others surveyed using various automation technologies common to composites manufacturing.</p>\n\n<p>In general, Top Shops used automation more than other shops. In particular, &ldquo;cutting and kitting processes have become more automated due to advanced robotics, integrated software and digital technologies,&rdquo; Schaub says. &ldquo;This resulted in increased efficiency, cost reduction and sustainability.&rdquo;</p>\n\n<p>Top Shops scored a median of 70% compared to 42% for other shops in automated cutting/kitting.</p>\n\n<p>Interested in learning more about <em>CW</em> Top Shops? Find out more information on the Top Shops program at <a href=\"https://www.gardnerintelligence.com/report/top-shops-benchmarking\" target=\"_blank\">gardnerintelligence.com/report/top-shops-benchmarking</a>, and keep an eye on <em>CW</em>&rsquo;s news and social channels for next year&rsquo;s survey early in 2026.</p>\n\n<div class=\"article_sidebar\">\n<h3>Learn more about the 2025 <em>CW </em>Top Shops</h3>\n\n<p>See past <em>CW </em>reporting featuring several of this year&rsquo;s qualifying facilities:</p>\n\n<ul>\n\t<li>\n\t<p>B&amp;T Composites: <a href=\"https://www.compositesworld.com/articles/beyond-filament-winding-fabricator-expands-into-sensor-technology-hydrogen-tanks-and-more\" target=\"_blank\">&ldquo;Beyond filament winding: Fabricator expands into sensor technology, hydrogen tanks and more&rdquo;</a></p>\n\t</li>\n\t<li>\n\t<p>Champion Fiberglass: <a href=\"https://www.compositesworld.com/articles/fiberglass-conduit-manufacturer-grows-into-new-products-infrastructure-applications\" target=\"_blank\">&ldquo;Fiberglass conduit manufacturer grows into new products, infrastructure applications&rdquo;</a></p>\n\t</li>\n\t<li>\n\t<p>Compotech Inc.: <a href=\"https://www.compositesworld.com/articles/ballistic-protection-panels-manufacturer-relies-on-automation-for-high-throughput-efficiency\" target=\"_blank\">&ldquo;Ballistic protection panels manufacturer relies on automation for high throughput, efficiency&rdquo; </a></p>\n\t</li>\n\t<li>\n\t<p>EPP Composites: <a href=\"https://www.compositesworld.com/articles/industrial-equipment-manufacturer-expands-global-footprint-reaches-into-new-markets\" target=\"_blank\">&ldquo;Industrial equipment manufacturer expands global footprint, reaches into new markets&rdquo; </a>&nbsp;</p>\n\t</li>\n\t<li>\n\t<p>GSE Dynamics: <a href=\"https://www.compositesworld.com/articles/defense-manufacturer-reflects-on-growth-opportunity-in-complex-composite-structures-\" target=\"_blank\">&ldquo;Defense manufacturer reflects on growth, opportunity in complex composite structures&rdquo;</a></p>\n\t</li>\n\t<li>\n\t<p>Rock West Composites: <a href=\"https://www.compositesworld.com/articles/composites-business-growth-through-diversification-innovation\" target=\"_blank\">&ldquo;Composites business growth through diversification, innovation&rdquo;</a></p>\n\t</li>\n\t<li>\n\t<p>Spintech: <a href=\"https://www.compositesworld.com/articles/braided-preforms-and-resin-infusion-for-next-generation-aerocomposites\" target=\"_blank\">&ldquo;Braided preforms and resin infusion for next-generation aerocomposites&rdquo;</a> and <a href=\"https://www.compositesworld.com/articles/rtm-dry-braided-fabric-enable-faster-cost-effective-manufacture-for-hydrokinetic-turbine-components\" target=\"_blank\">&ldquo;RTM, dry braided fabric enable faster, cost-effective manufacture for hydrokinetic turbine components&rdquo;</a></p>\n\t</li>\n\t<li>\n\t<p>ST Engineering MRAS: <a href=\"https://www.compositesworld.com/articles/plant-tour-middle-river-aerostructure-systems-baltimore-md-us\" target=\"_blank\">&ldquo;Plant tour: Middle River Aerostructure Systems, Baltimore, Md., U.S.&rdquo;</a></p>\n\t</li>\n</ul>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/compositesworld-announces-2025-cw-top-shops-honorees"
      }
    ],
    "link": "https://www.compositesworld.com/news/compositesworld-announces-2025-cw-top-shops-honorees"
  },
  {
    "published": "Wed, 10 Sep 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      10,
      16,
      30,
      0,
      2,
      253,
      0
    ],
    "title": "Holy Technologies selects Plataine to scale up smart composites production",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Holy Technologies selects Plataine to scale up smart composites production"
    },
    "summary": "Plataine&rsquo;s AI agents for scheduling and traceability will enable Holy Technologies to optimize serial production plans, reduce manual effort&nbsp;and build a scalable foundation for future growth.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Plataine&rsquo;s AI agents for scheduling and traceability will enable Holy Technologies to optimize serial production plans, reduce manual effort&nbsp;and build a scalable foundation for future growth."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-plataine-holytech-robotic-carbonfiber-fab.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Robotic carbon fiber fabrication layup.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-plataine-holytech-robotic-carbonfiber-fab.jpg;maxWidth=720\" /> </a></div>\n\n<p>Robotic carbon fiber fabrication. Source | Plataine, Holy Technologies</p>\n</div>\n\n<p><a href=\"https://www.holy-technologies.com/\" target=\"_blank\">Holy Technologies</a>&nbsp;(Hamburg), a fast-growing German manufacturer specializing in sustainable and high-performance carbon fiber components, has selected&nbsp;<a href=\"https://www.compositesworld.com/suppliers/plataine\" target=\"_blank\">Plataine</a>&nbsp;(Waltham, Mass., U.S.), a provider of AI-based manufacturing optimization solutions, to support its transition into serial production with enhanced scheduling, traceability&nbsp;and production control.</p>\n\n<p>Holy Technologies aims to redefine&nbsp;the future of carbon fiber manufacturing through its <a href=\"https://www.compositesworld.com/news/holy-technologies-platform-enhances-carbon-fiber-component-recyclability\" target=\"_blank\">infinite fiber placement (IFP) process</a>. IFP is a fully automated robotic system that places continuous carbon fibers along a pre-calculated path, creating components with complex geometries and tailored mechanical properties, such as strength and stiffness. The technology achieves up to 30% lower weight compared to traditional methods. Using advanced automation technologies enables the company to make carbon fiber component production fast, repeatable and scalable. This approach is particularly attractive for high-performance sectors such as automotive, aerospace, industrial machinery&nbsp;and orthopedics. These industries rely on carbon fiber components because they are&nbsp;lightweight and strong, improving efficiency, reducing fuel consumption, extending range or improving durability.</p>\n\n<p>As Holy Technologies prepared for its first serial production run, the company faced the challenge of establishing a reliable system for real-time scheduling as well as traceability of molds, tools&nbsp;and components. In addition, the team sought a digital backbone flexible enough to support both current production needs and future growth.</p>\n\n<p>To address these requirements, Holy Technologies selected Plataine&rsquo;s AI-powered&nbsp;Production Scheduler. The solution optimizes workstation loads and shift planning, enables predictive maintenance alerts for tools and molds, and delivers real-time quality monitoring to reduce rework and support compliance. Holy Technologies engineering and operations teams will now benefit from real-time visibility into production, empowering them to make data-driven decisions and streamline workflows.</p>\n\n<p>With Plataine, Holy Technologies expects to significantly reduce planning efforts, improve on-time delivery, drive better longer-term procurement and staffing decisions and enable scalable and traceable operations as volumes increase. The result is a robust digital foundation that supports both current efficiency and long-term growth.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/holy-technologies-selects-plataine-to-scale-up-smart-composites-production"
      }
    ],
    "link": "https://www.compositesworld.com/news/holy-technologies-selects-plataine-to-scale-up-smart-composites-production"
  },
  {
    "published": "Wed, 10 Sep 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      10,
      16,
      30,
      0,
      2,
      253,
      0
    ],
    "title": "TPI Composites initiates voluntary Chapter 11 proceedings",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "TPI Composites initiates voluntary Chapter 11 proceedings"
    },
    "summary": "TPI and its U.S. subsidiaries commence filed bankruptcy proceeding and pursue&nbsp;a court-approved restructuring supported by $82.5 million in financing, allowing the company to maintain normal operations and strengthen its long-term position amid industry challenges.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "TPI and its U.S. subsidiaries commence filed bankruptcy proceeding and pursue&nbsp;a court-approved restructuring supported by $82.5 million in financing, allowing the company to maintain normal operations and strengthen its long-term position amid industry challenges."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/1223-cw-news-wind-farm-GettyImages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/1223-cw-news-wind-farm-GettyImages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/tpi-composites\" target=\"_blank\">TPI Composites&nbsp;Inc.</a>&nbsp;(Scottsdale, Ariz., U.S.), together with its domestic subsidiaries, has&nbsp;commenced voluntary chapter 11 proceedings in the&nbsp;U.S. Bankruptcy Court for the Southern District of Texas&nbsp;to pursue a comprehensive restructuring of the company that will enable TPI to emerge as a stronger enterprise.</p>\n\n<p>To support the company during this process, the Bankrupty Court has approved TPI&rsquo;s first-day motions that will&nbsp;provide the company with the operational flexibility and liquidity necessary to continue normal business operations during the chapter 11 process. Key motions approved&nbsp;include interim approval for debtor-in-possession (DIP) financing from its senior secured lenders of up to&nbsp;$82.5 million, the continuation of employee wages and benefits, maintenance of cash management systems&nbsp;and the authority to pay certain prepetition obligations critical to ongoing operations.</p>\n\n<p>TPI reached this decision to file customary motions in agreement with the&nbsp;company&rsquo;s senior secured lenders comprised of funds affiliated with funds managed by&nbsp;Oaktree Capital Management&nbsp;L.P.&nbsp;for Oaktree. It is expected that the DIP financing facility will be comprised of up to&nbsp;$27.5 million&nbsp;in new money to support the company&rsquo;s day-to-day operations and up to&nbsp;$55 million&nbsp;rolled up from the company&rsquo;s existing senior secured credit facility, underscoring Oaktree&rsquo;s continued support for and confidence in the company.</p>\n\n<p>&ldquo;Over the past several months, we have implemented strategic measures to fortify our business. These deliberate steps were designed to strengthen our financial stability and ensure we remain well-positioned to provide long-term benefits to our customers, suppliers, partners&nbsp;and associates,&rdquo; says&nbsp;Bill Siwek, CEO&nbsp;of TPI. &ldquo;Despite recent progress, industry-wide pressures have created financial challenges that must be addressed. We explored a variety of alternatives to address the challenges facing the company and believe that a chapter 11 process is necessary to position TPI for success.&rdquo;</p>\n\n<p>Siwek says the company aims to reach agreement with stakeholders on the terms of a plan of reorganization for the company in order to right-size its balance sheet and go forward with the ability to compete successfully in the current economic environment. &ldquo;Doing so will provide access to new liquidity to continue our operations and invest in innovation, ensuring our customers can continue to count on TPI for leading-edge wind blade solutions.&rdquo;</p>\n\n<p>The company is grateful to its associates for&nbsp;their dedication in continuing to deliver outstanding service, and to TPI customers, suppliers, service providers and other stakeholders for their steadfast support during this restructuring.</p>\n\n<p>Throughout this process and moving forward, TPI will continue operating normally and does not expect any material operational impact from the chapter 11 proceedings. The company will continue to work closely with its customers and suppliers, including by continuing to operate its manufacturing sites and delivering blade services.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/tpi-composites-initiates-voluntary-chapter-11-proceedings-"
      }
    ],
    "link": "https://www.compositesworld.com/news/tpi-composites-initiates-voluntary-chapter-11-proceedings-"
  }
]