[
  {
    "published": "Fri, 26 Sep 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      26,
      17,
      0,
      0,
      4,
      269,
      0
    ],
    "title": "BladeBridge repurposes Energia Group decommissioned wind blade into practical site amenity",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "BladeBridge repurposes Energia Group decommissioned wind blade into practical site amenity"
    },
    "summary": "Collaborative effort turns EOL blade into a&nbsp;rest area and memorial along the Meenadreen Wind Farm&rsquo;s&nbsp;Leghowney Loop trail, blending sustainable design and functionality.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaborative effort turns EOL blade into a&nbsp;rest area and memorial along the Meenadreen Wind Farm&rsquo;s&nbsp;Leghowney Loop trail, blending sustainable design and functionality."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bladebridge-energiagroup.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Repurposed wind blade.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bladebridge-energiagroup.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Energia Group</p>\n</div>\n\n<p>Energy utility company <a href=\"https://energiagroup.com/\" target=\"_blank\">Energia Renewables</a>&nbsp;(Dublin, Ireland and Belfast, Northern Ireland) has&nbsp;found a new use for a decommissioned turbine blade, which was replaced on the Meenadreen Wind Farm back in 2020.&nbsp;Working with <a href=\"https://bladebridge.ie/\" target=\"_blank\">BladeBridge</a>&nbsp;(Cork, Ireland), a startup formed from the U.S. academic project Re-Wind Network, the groups have transformed the end-of-life (EOL) wind blade into a new&nbsp;site amenity in the form of a shelter and seating area on the Leghowney Loop,&nbsp;a popular trail which passes through the wind farm.&nbsp;</p>\n\n<p>Design companies like BladeBridge are helping to repurpose decommissioned blades and turn them into functional street furniture, bus shelters and even pedestrian bridges. The company works with wind farm operators with redundant blades and public bodies&nbsp;looking for low-carbon options for pedestrian bridges, bus shelters, public benches and other solutions.</p>\n\n<p>The Meenadreen blade is the first time BladeBridge has worked on a wind farm amenity project, where the blade will return to its original home to continue its working life in a new form. Aligned to the UN Sustainability Development Goals, and with sustainability at the core of everything it does, Energia commissioned&nbsp;BladeBridge&nbsp;in an effort to enhance the site for walkers on the Leghowney Loop trail, promote the circular economy and raise public awareness of the possibilities and need to repurpose waste materials through sustainable resource management.&nbsp;</p>\n\n<div style=\"text-align: center;\"></div>\n\n<p>The completed blade project consists of an eye-catching shelter, stylish picnic table structure with seating and standalone benches.&nbsp;Simon Dennehy from Perch Design, BladeBridge&rsquo;s creative director, says he believes in the importance of highlighting blade engineering features in any new form. &ldquo;These&nbsp;blades are amazing, organic, undulating and asymmetric structures and I want to preserve these design aspects so that people will know that they are sitting on, or standing under, something that was once part of a wind turbine, which will now last for many more decades.&rdquo;</p>\n\n<p>The centerpiece of the walkers&rsquo; rest area is the shelter, which is dedicated to one of the engineers who worked on the site,&nbsp;Jimmy Kelly from Carrowbeg in Co. Mayo, who was an Irish wind energy pioneer.&nbsp;</p>\n\n<p>&ldquo;Jimmy was a renewable energy expert and enthusiast,&rdquo; says&nbsp;Brian Mullen, head of Energia Renewables Operations. &ldquo;He generated his own electricity at home, was an organic farmer and even made his own Mayo wine. An expert in too many fields to list, Jimmy would no doubt accuse us of making a fuss. However, he&rsquo;d be blown away to see a blade he&rsquo;d worked on transformed and still in use.&rdquo;&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/bladebridge-repurposes-energia-group-decommissioned-wind-blade-into-practical-site-amenity"
      }
    ],
    "link": "https://www.compositesworld.com/news/bladebridge-repurposes-energia-group-decommissioned-wind-blade-into-practical-site-amenity"
  },
  {
    "published": "Fri, 26 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      26,
      16,
      0,
      0,
      4,
      269,
      0
    ],
    "title": "Brunswick Boat Group to consolidate fiberglass boat manufacturing operations",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Brunswick Boat Group to consolidate fiberglass boat manufacturing operations"
    },
    "summary": "Brunswick Corp. will close its Reynosa, Mexico, and Flagler Beach, Florida, boat manufacturing facilities, shifting production to high-performing U.S. plants to align with a streamlined product portfolio and evolving market demand.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Brunswick Corp. will close its Reynosa, Mexico, and Flagler Beach, Florida, boat manufacturing facilities, shifting production to high-performing U.S. plants to align with a streamlined product portfolio and evolving market demand."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-yacht-view-GettyImages1.jpg\" target=\"_blank\"><img alt=\"Bow of boat.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-yacht-view-GettyImages1.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>Marine technology company <a href=\"https://www.brunswick.com/\" target=\"_blank\">Brunswick Corp.</a> (Mettawa, Ill., U.S.) is consolidating its global fiberglass boat manufacturing footprint in order to reduce fixed costs and unlock greater productivity and efficiency while maintaining the necessary capacity and flexibility for the company&rsquo;s future growth.</p>\n\n<p>As part of this footprint rationalization, Brunswick will close its Reynosa, Mexico, fiberglass boat manufacturing facility, transitioning production of models currently manufactured in the facility into two of its high-performing U.S.-based manufacturing centers in Vonore, Tennessee, and Merritt Island, Florida. In addition, its Flagler Beach, Florida, production facility will be closed and production of models currently manufactured at that facility will be consolidated into the Edgewater, Florida, operation.</p>\n\n<p>&ldquo;The decision to transition production out of Reynosa, Mexico &mdash; which is primarily dedicated to manufacturing of our small, value fiberglass boats &mdash; follows our announcement that we have rationalized our value boat model portfolio, and reflects evolving market dynamics that are impacting industry-wide volumes of value fiberglass products,&rdquo; explains&nbsp;Brenna Preisser, president of Brunswick Boat Group. &ldquo;The Reynosa facility and team members have played an important role in our business for many years, and we are committed to supporting their transition. We anticipate the transition will be fully completed by summer 2026.&rdquo;</p>\n\n<p>Reinforcing its broader integration and expansion effort, Brunswick is investing $5 million in capital improvements across its Tennessee and Florida facilities, further strengthening their capabilities as multi-brand production hubs. This investment underscores Brunswick&rsquo;s commitment to leveraging its scale to drive operational synergies. These moves will result in the creation of more than 200 U.S. manufacturing jobs over the next several years.</p>\n\n<p>&ldquo;Brunswick&rsquo;s Boat Group has sufficient capacity within our manufacturing footprint to absorb volume, support future market rebounds and capture share gains from an aggressive product development roadmap,&rdquo; Preisser confirms.&nbsp; &ldquo;With these and other actions taken to streamline our portfolio and improve productivity, the group will achieve a better structural cost profile and accelerate improved profitability.&rdquo;</p>\n\n<p>Brunswick is collaborating closely with local government agencies and economic development partners to support a seamless transition. As Boston Whaler consolidates its production operations in Florida, team members from the Flagler Beach facility will be offered opportunities to transfer to the Edgewater location. In addition, the company will soon launch recruitment efforts to fill new positions across production, logistics, engineering&nbsp;and operations management.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/brunswick-boat-group-to-consolidate-fiberglass-boat-manufacturing-operations"
      }
    ],
    "link": "https://www.compositesworld.com/news/brunswick-boat-group-to-consolidate-fiberglass-boat-manufacturing-operations"
  },
  {
    "published": "Fri, 26 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      26,
      16,
      0,
      0,
      4,
      269,
      0
    ],
    "title": "Hybrid eVTOL orders builds Plana’s FAA certification, U.S. relocation momentum",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hybrid eVTOL orders builds Plana’s FAA certification, U.S. relocation momentum"
    },
    "summary": "Korean AAM company Vonaer will purchase a total of 20 eVTOL aircraft, ramping up Plana&rsquo;s&nbsp;certification, capital raising&nbsp;and market entry goals.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Korean AAM company Vonaer will purchase a total of 20 eVTOL aircraft, ramping up Plana&rsquo;s&nbsp;certification, capital raising&nbsp;and market entry goals."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-plana-hybrid-evtol-concept.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-plana-hybrid-evtol-concept.jpg;maxWidth=720\" /> </a></div>\n\n<p>Hybrid eVTOL aircraft concept for regional air travel. Source | Plana US Inc.</p>\n</div>\n\n<p><a href=\"https://plana.aero/\" target=\"_blank\">Plana US Inc.</a>&nbsp;has signed a letter of intent to deliver 20 hybrid electric vertical takeoff and landing (eVTOL) aircraft to Vonaer&nbsp;(Seoul), a South Korean-based air mobility service provider. This milestone is part of a larger strategic move as Plana prepares to relocate headquarters to the U.S., and actively purses Federal Aviation Administration (FAA) certification, capital raising and market entry for its eVTOL aircraft platform.</p>\n\n<p>Under the agreement, Plana will supply Vonaer&nbsp;with five&nbsp;certified aircraft by 2033 and an additional 15 by 2040, a value of $664 million. Throughout this contract, Plana has secured pre-orders for a total of 127 aircraft.</p>\n\n<p>Plana&rsquo;s hybrid eVTOL&nbsp;will use carbon fiber-reinforced polymer (CFRP) composites for the aircraft airframe and <a href=\"https://www.compositesworld.com/news/plana-duc-helices-propellers-to-develop-propellers-for-aam\" target=\"_blank\">prop system</a>. It is equipped with a hybrid power management system that simultaneously operates a certified turbogenerator and a battery system. It can carry up to six passengers and is operated by a single pilot, leveraging instrument flight rule (IFR) and simplified vehicle operation (SVO) technology.</p>\n\n<p>The aircraft has a service range of more than&nbsp;300 miles on a single refueling, with a maximum speed of over 350 kilometers per hour. Its all-electric propulsion system reduces noise to 1/100<sup>th</sup> the level of a helicopter, Plana reports,&nbsp;maximizing social acceptance. As a hybrid aircraft, it also has the advantage of being able to use existing infrastructure like helicopter pads.</p>\n\n<p>FAA certification is targeted for end of 2031, with first commercial launch schedued for 2032.</p>\n\n<p>&ldquo;Our company, which was launched in South Korea, has now completed the establishment of a Delaware corporation in the U.S. and plans to finalize its headquarters relocation within the&nbsp;year to pursue FAA certification, capital raising&nbsp;and market entry,&rdquo; says Braden J. Kim, founder and CEO of Plana. &ldquo;Vonaer is&nbsp;a highly influential air mobility service platform provider in Asia. Our aircraft will create a much larger market in a sector currently served by helicopters.&rdquo;</p>\n\n<p>Plana previously signed an MOU with Vonaer in May 2023. Since then, the companies have&nbsp;jointly analyzed the data realistically required by the market and collaborated on how to properly shape eVTOL travel.</p>\n\n<p>Vonaer&nbsp;is reported to be Korea&rsquo;s first advanced air mobility (AAM) platform, expanding from helicopter-based services to private jets and eVTOLs. The company is building a hospitality-driven luxury service platform to set the standard for air mobility in Asia and is preparing for expansion into Europe and the U.S.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hybrid-evtol-orders-builds-planas-faa-certification-us-relocation-momentum"
      }
    ],
    "link": "https://www.compositesworld.com/news/hybrid-evtol-orders-builds-planas-faa-certification-us-relocation-momentum"
  },
  {
    "published": "Fri, 26 Sep 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      26,
      15,
      30,
      0,
      4,
      269,
      0
    ],
    "title": "Caracol acquires Hans Weber’s additive manufacturing assets",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Caracol acquires Hans Weber’s additive manufacturing assets"
    },
    "summary": "Caracol will acquire&nbsp;Weber&rsquo;s IP and additive technology&nbsp;with the goal of strengthening the LFAM technological roadmap for European customers and building up its presence in the DACH region.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Caracol will acquire&nbsp;Weber&rsquo;s IP and additive technology&nbsp;with the goal of strengthening the LFAM technological roadmap for European customers and building up its presence in the DACH region."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-caracol-hansweber-acquisition.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-caracol-hansweber-acquisition.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Pictured from left to right: Francesco De Stefano, CEO of Caracol; Ludwig Weber, managing director at Weber; Dr. Markus Weber, managing director at Weber; and Paolo Cassis, COO of Caracol. Source | Caracol</p>\n</div>\n\n<p>Global large-format additive manufacturing (LFAM) company <a href=\"https://www.compositesworld.com/suppliers/caracol\" target=\"_blank\">Caracol</a> (Milano, Italy and Austin, Texas, U.S.) has acquired the IP and&nbsp;robotic machine configuration assets from the additive division of <a href=\"https://www.hansweber.de/\" target=\"_blank\">Hans Weber Maschinenfabrik GmbH</a>&nbsp;(Kronach), a German extrusion technology company with more than&nbsp;100 years of expertise in&nbsp;industrial machinery.</p>\n\n<p>This strategic acquisition serves two main purposes for Caracol: first, to integrate Weber&rsquo;s <a href=\"https://www.compositesworld.com/articles/post-cure-tool-less-direct-extrusion-enables-efficient-complex-composite-structure-development\" target=\"_blank\">additive technology</a> into its product portfolio, creating a highly comprehensive LFAM ecosystem for the market, and addressing a wide range of international customer needs. Second, it reinforces Caracol&rsquo;s commitment to accelerating the global adoption and industrialization of LFAM technologies across diverse manufacturing sectors, expanding Caracol&rsquo;s reach in the DACH region</p>\n\n<p>Customers and partners looking to work with Weber&rsquo;s additive solutions can expect Caracol&rsquo;s full commitment to continued support and development, gaining access to Caracol&rsquo;s global field and service network that spans&nbsp;over 55 countries. Backed by Caracol&rsquo;s holistic approach and deep application expertise, all products will benefit from the same quality service and after-sales support the company is known for, helping businesses scale their production operations with LFAM. Weber will remain a key partner for the development of its extrusion technology and support product development on Caracol&rsquo;s extended portfolio.</p>\n\n<p>&ldquo;This agreement combines heritage with innovation, by two companies united by shared values: progressiveness, engineering excellence and a customer-centric mindset,&rdquo; says Francesco De Stefano, CEO and co-founder of Caracol. &ldquo;It allows us to strengthen the technological roadmap of two technologies, ensuring each can best fit specific customer&rsquo;s industrial needs. On the one hand, Caracol&rsquo;s expertise of the full turnkey technological ecosystem, process&nbsp;and deep vertical application know-how. On the other, Weber&rsquo;s core expertise on extrusion and machinery manufacturing.&rdquo;</p>\n\n<p>De Stefano notes that Caracol clients will be able to access Heron platforms with a broader level of customization and configurations to satisfy their specific industrial needs. &ldquo;This also means additional options when it comes to automation &mdash;&nbsp;such as Siemens control or ABB robots,&rdquo; he says.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/caracol-acquires-hans-webers-additive-manufacturing-assets"
      }
    ],
    "link": "https://www.compositesworld.com/news/caracol-acquires-hans-webers-additive-manufacturing-assets"
  },
  {
    "published": "Fri, 26 Sep 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      26,
      15,
      0,
      0,
      4,
      269,
      0
    ],
    "title": "Avient, FSJ Tactical advance ballistic-rated composite wall panels",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Avient, FSJ Tactical advance ballistic-rated composite wall panels"
    },
    "summary": "Fiberglass-reinforced ThermoBallistic panels for facility protection applications&nbsp;are capable of encapsulating projectiles and preventing harmful deflection and ricochet.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Fiberglass-reinforced ThermoBallistic panels for facility protection applications&nbsp;are capable of encapsulating projectiles and preventing harmful deflection and ricochet."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Stack of wall panels and an image of its ballistic protection capabilities.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-avient-fsj-tactical-panels.jpg;maxWidth=385\" /></div>\n\n<p>Source | Avient Corp.</p>\n</div>\n\n<p>Material solutions provider&nbsp;<a href=\"https://www.compositesworld.com/suppliers/avient-corporation-composites\" target=\"_blank\">Avient Corp.</a> (Cleveland, Ohio, U.S.) has formed a collaboration with customer <a href=\"https://fsjtactical.com/\" target=\"_blank\">FSJ Tactical</a>&nbsp;(Peoria, Ariz., U.S.) to create ballistic-resistant wall panel solutions for facility protection applications.&nbsp;</p>\n\n<p>FSJ Tactical specializes&nbsp;in perimeter safety solutions for public sector entities. Experts in protective systems design, customization&nbsp;and installation, the team at FSJ Tactical has developed Walshield, a ballistic-resistant wall panel solution that has recently been implemented in a large Arizona public school district&rsquo;s educational facility.</p>\n\n<p>FSJ Tactical incorporates Avient&rsquo;s ThermoBallistic&nbsp;panels into its Walshield systems. Thermally formed with layers of 0˚/90˚ unidirectional E-glass fiber-reinforced thermoplastic composites, ThermoBallistic panels are a lightweight material rated to UL 752 Level 3 protection. Compared to steel and concrete solutions, the reduced weight simplifies the installation process, and the fiberglass-reinforced polymer composition facilitates performance by encapsulating projectiles and preventing harmful deflection and ricochet.</p>\n\n<p>&ldquo;This collaboration exemplifies how advanced composite materials can make a real-world impact, especially in environments where safety is paramount,&rdquo; says Brad Schmidt, general manager, advanced composites at Avient.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/avient-fsj-tactical-advance-ballistic-rated-composite-wall-panels"
      }
    ],
    "link": "https://www.compositesworld.com/news/avient-fsj-tactical-advance-ballistic-rated-composite-wall-panels"
  },
  {
    "published": "Fri, 26 Sep 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      26,
      14,
      0,
      0,
      4,
      269,
      0
    ],
    "title": "Holy Technologies secures €4.3 million to build autonomous factory for composite components",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Holy Technologies secures €4.3 million to build autonomous factory for composite components"
    },
    "summary": "Its Hamburg facility, combining digital control and closed-loop recycling, is the company&rsquo;s&nbsp;first step toward scaling its IFP autonomous systems.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Its Hamburg facility, combining digital control and closed-loop recycling, is the company&rsquo;s&nbsp;first step toward scaling its IFP autonomous systems."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-holytechnologies-robotics-cf-parts.jpg\" target=\"_blank\"><img alt=\"Robotic fabrication of composite parts.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-holytechnologies-robotics-cf-parts.jpg;maxWidth=385\" /></a></div>\n\n<p>Robotic fabrication of composite parts. Source | Holy Technologies</p>\n</div>\n\n<p dir=\"ltr\"><a href=\"https://www.holy-technologies.com/\" target=\"_blank\">Holy Technologies</a> (Hamburg, Germany) has raised &euro;4.3 million to build its first autonomous production site for lightweight composite components in Hamburg. The new facility, scheduled to open later in 2025, combines robotics, AI and closed-loop recycling to scale composite part production with greater speed, cost efficiency&nbsp;and sustainability.</p>\n\n<p dir=\"ltr\">Composites manufacturing has traditionally been constrained by high costs, slow cycle times&nbsp;and limited scalability. While automation has reduced some manual work, most processes remain labor-intensive. Holy Technologies is addressing this by developing a fully autonomous production system designed from the ground up to eliminate trade-offs between cost, speed, performance and circularity.</p>\n\n<p dir=\"ltr\">Central to Holy Technologies&rsquo; system is its infinite fiber placement (IFP) technology. IFP places a continuous carbon fiber along a pre-calculated path, tailoring local properties &mdash; such as strength and stiffness&nbsp;&mdash;&nbsp;according to a part's performance requirements. It enables precise fiber deposition in complex geometries, combining robotics with digital control to optimize performance and material efficiency. The system comes with integrated closed-loop recycling. This means that components can be fully recovered at end of life and reused in equivalent applications, avoiding downcycling. While currently specialized in carbon fiber, the technology is designed to be material-agnostic.</p>\n\n<p dir=\"ltr\">Since its founding in 2022, Holy Technologies has:</p>\n\n<ul>\n\t<li>Built a fully operational pilot line</li>\n\t<li>Partnered with OEMs and Tier 1 suppliers in sectors including automotive, motorsports, aerospace, orthopedics&nbsp;and industrial tooling</li>\n\t<li>Secured its first serial production contracts, covering thousands of parts.</li>\n</ul>\n\n<p dir=\"ltr\">In a recent collaboration with <a href=\"https://www.compositesworld.com/news/vcarb-holy-technologies-demonstrate-composites-recyclability-potential-for-formula-1\" target=\"_blank\">a Formula 1&nbsp;team</a>, the company demonstrated a 20% weight reduction compared to incumbent composite parts, underscoring the performance potential of its technology.</p>\n\n<p dir=\"ltr\">The company&rsquo;s most recent funding backed by Rockstart, Vanagon, Sands, Innovationsstarter Fonds Hamburg&nbsp;and EIT Manufacturing, alongside angel investors such as Adrian Locher (Merantix AG), Matthias Dantone (Ellipsis Ventures), Christian Vollmann (C1), Markus Kerkhoff (Poppe+Potthoff), Kai M&uuml;ller (PowerCo)&nbsp;and Timm Moll (Moll Gruppe).</p>\n\n<p dir=\"ltr\">&ldquo;Autonomy in composites is not just about efficiency,&rdquo; notes&nbsp;Moritz Reiners, CTO and co-founder. &ldquo;It enables entirely new component categories &mdash; lighter, stronger&nbsp;and recyclable. But to achieve this, you need to redesign the production system itself. That is exactly what we are doing.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/holy-technologies-secures-43-million-to-build-autonomous-factory-for-composite-components"
      }
    ],
    "link": "https://www.compositesworld.com/news/holy-technologies-secures-43-million-to-build-autonomous-factory-for-composite-components"
  },
  {
    "published": "Thu, 25 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      25,
      16,
      0,
      0,
      3,
      268,
      0
    ],
    "title": "LIFT to lead new \"Critical Materials Processing\" program on ceramics, CMC",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "LIFT to lead new \"Critical Materials Processing\" program on ceramics, CMC"
    },
    "summary": "Multifaceted project aims to accelerate development and scale-up of ultra-high temperature material technologies including ceramic matrix composites (CMC) and carbon fiber as a precursor in CMC preforms.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Multifaceted project aims to accelerate development and scale-up of ultra-high temperature material technologies including ceramic matrix composites (CMC) and carbon fiber as a precursor in CMC preforms."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-lift-ceramics-cmc.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"LIFT facility in Michigan, U.S.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-lift-ceramics-cmc.jpg;maxWidth=720\" /> </a></div>\n\n<p>LIFT High Bay, part of its Future Manufacturing Technology Showcase and Sandbox in Detroit. Source | LIFT&nbsp;</p>\n</div>\n\n<p><a href=\"https://lift.technology/\" target=\"_blank\">LIFT</a> (Detroit, Mich., U.S.) is&nbsp;the Department of Defense-supported National Advanced Materials and Manufacturing Innovation Institute,&nbsp;a nonprofit, public-private partnership between industry, academia and government that supports the U.S. economy and enhances its national security by accelerating innovative advanced manufacturing technology and talent development.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<ul>\n\t<li>Awarded program includes a working group to pursue technology advancements and scaling of technologies for ceramics, CMC and carbon fiber as a critical precursor for CMC.</li>\n\t<li>LIFT and its partners will also pursue&nbsp;solutions to accelerate production of UHTCMC&nbsp;including&nbsp;use of compression molding, resin transfer molding (RTM)&nbsp;and other processes for rapid impregnation and curing of CMC preforms.</li>\n</ul>\n</div>\n</div>\n\n<p>LIFT has been awarded a contract to accelerate the development of ceramic- based materials for use in industrial and defense applications.&nbsp;This 4-year, $9 million &ldquo;Critical Materials Processing&rdquo; program, which was supported by U.S. Senator&nbsp;Gary Peters in the FY2024 federal budget through the Department of Defense&rsquo;s&nbsp;Industrial Base Analysis and Sustainment program, will advance the state of technology and readiness for ceramics, ceramic matrix composites (CMC)&nbsp;and ultra-high temperature (UHT) materials.</p>\n\n<p>&ldquo;We risk both our economic and national security when we depend on foreign adversaries like China for materials that are vital to our manufacturing and defense industries,&rdquo;&nbsp;says&nbsp;Senator Peters, who recently reintroduced the Intergovernmental Critical Minerals Taskforce Act. &ldquo;We must use our partners like LIFT to accelerate the development and production of these materials here at home. Doing so will help create jobs while ensuring our manufacturers have reliable access to these important materials.&rdquo;</p>\n\n<p>The project&rsquo;s technical approach is multifaceted, and includes a working group of experts from government, including the <a href=\"https://www.afrl.af.mil/\" target=\"_blank\">Air Force Research Lab</a>&nbsp;and industry &mdash; including <a href=\"https://exothermicsinc.com/\" target=\"_blank\">Exothermics</a>, <a href=\"https://unmanned-network.com/member/kratos-sre/\" target=\"_blank\">Kratos SRE</a> and <a href=\"https://www.m-r-d.com/wpr/\" target=\"_blank\">Materials Research &amp; Design</a> (MR&amp;D)&nbsp;&mdash; and academia to pursue technology advancements to scale initiatives, such as solid-state ceramic batteries, as well as to onshore and scale technologies associated with carbon fiber, a precursor material for defense-related protection systems that often use CMC and&nbsp;that are in severely limited supply within the U.S.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<blockquote>\n<p>&ldquo;Despite the promise of ceramic materials and their composites, no organization exists within the U.S. to address the scale-up to commercialization of ceramic-related technology and talent initiatives.&rdquo;</p>\n</blockquote>\n</div>\n\n<p>&ldquo;Ceramic-based materials hold significant promise for the technological challenges our industrial base and workforce are seeking to resolve, including withstanding extreme temperatures and other extreme environments,&rdquo; says&nbsp;Nigel Francis, CEO and executive director, LIFT. &ldquo;Despite the promise of ceramic materials and their composites, no organization exists within the U.S. to address the scale-up to commercialization of ceramic-related technology and talent initiatives. With this program, LIFT is positioned to achieve exactly those goals.&rdquo;</p>\n\n<p>LIFT and its partners will also investigate prototype solutions to accelerate:</p>\n\n<ul>\n\t<li>Production of UHTCMC</li>\n\t<li>Community integration and unification</li>\n\t<li>Gap analysis</li>\n\t<li>Identify&nbsp;modeling and simulation tools</li>\n\t<li>Cross-industry standardization.</li>\n</ul>\n\n<p>For prototype solutions aimed at accelerating production, the use of compression molding and/or resin transfer molding (RTM), combined with high-pressure resin injection, will be a specific focus for the rapid impregnation and curing of CMC preform layups.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/lift-to-lead-new-critical-materials-processing-program-on-ceramics-cmc"
      }
    ],
    "link": "https://www.compositesworld.com/news/lift-to-lead-new-critical-materials-processing-program-on-ceramics-cmc"
  },
  {
    "published": "Thu, 25 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      25,
      16,
      0,
      0,
      3,
      268,
      0
    ],
    "title": "Acquisition joins MPM Group and Lamplas GFRP, composite molding expertise",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Acquisition joins MPM Group and Lamplas GFRP, composite molding expertise"
    },
    "summary": "MPM Group&rsquo;s strategic alignment of the two businesses will build enhanced capability, technical expertise and broader market reach in the U.K.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "MPM Group&rsquo;s strategic alignment of the two businesses will build enhanced capability, technical expertise and broader market reach in the U.K."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-mpmgroup-lamplas-acquisition.jfif\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"MPM Group and Lamplas group.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-mpmgroup-lamplas-acquisition.jfif;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | MPM Group</p>\n</div>\n\n<p>U.K.&nbsp;composite moldings and components manufacturer and supplier <a href=\"https://mpmgroup.co.uk/\" target=\"_blank\">MPM Group</a> (West Yorkshire) has acquired <a href=\"https://www.compositesworld.com/suppliers/lamplast-industrial-plastics\" target=\"_blank\">Lamplas Ltd.</a> (West Yorkshire), a fellow long-established specialist in fiberglass and composite moldings manufacture.</p>\n\n<p>This strategic acquisition strengthens MPM Group&rsquo;s position in advanced composites manufacturing while&nbsp;also expanding its product portfolio and reinforcing its commitment to innovation, quality&nbsp;and customer service.</p>\n\n<p>The strategic alignment of the two businesses provides both parties with enhanced manufacturing capability, technical expertise and broader market reach, securing skilled jobs in the sector. This is part of MPM Group&rsquo;s long-term growth strategy to expand its footprint in the U.K. composites sector and helps to continue its investment in high-quality British manufacturing.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"MPM Group GFRP expertise.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-mpmgroup-gfrp.jfif;maxWidth=385\" /></div>\n\n<p>MPM Group GFRP expertise.</p>\n</div>\n\n<p>As part of a larger organization with facilities spanning more than 100,000 square feet and&nbsp;shared capability and expertise, both teams, combining over 90-plus&nbsp;skilled team members, will benefit from stability, stronger career pathways&nbsp;and the chance to collaborate on bigger and more complex projects. On the other hand, customers will benefit from faster turnaround times and greater technical expertise.&nbsp;</p>\n\n<p>Operations at Lamplas will continue as normal, with the existing team and facility remaining in place. Over time, the companies will work together to share best practices and collaborate on projects, bringing further value to customer supply chains.</p>\n\n<p>Lamplas Ltd. is a glass fiber-reinforced polymer (GFRP) molding&nbsp;and components specialist, with more than 50 years of expertise in the leisure, transport&nbsp;and construction markets. Its product range includes pop-top roofs for campervans, shower pods&nbsp;and bespoke molded components. &ldquo;Lamplas has always been proud of its family roots, quality focus&nbsp;and skilled workforce,&rdquo; says Keith Siddle, managing director of Lamplas.</p>\n\n<p>Founded in 1978, MPM Group is a family-owned composites manufacturer also specializing in bespoke GFRP and composite molding components, and a heritage in&nbsp;patternmaking and modern capabilities&nbsp;including CNC machining. &ldquo;We&rsquo;ve long admired the work of Lamplas and worked together on various projects for over 20 years.&nbsp;We&rsquo;re excited about the opportunities ahead,&rdquo; says Ben Wilson, managing director of MPM Group and Composites UK board member.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/acquisition-joins-mpm-group-and-lamplas-gfrp-composite-molding-expertise"
      }
    ],
    "link": "https://www.compositesworld.com/news/acquisition-joins-mpm-group-and-lamplas-gfrp-composite-molding-expertise"
  },
  {
    "published": "Thu, 25 Sep 2025 07:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      25,
      11,
      0,
      0,
      3,
      268,
      0
    ],
    "title": "FIDAMC inaugurates CFA facility in Cádiz for composites innovation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FIDAMC inaugurates CFA facility in Cádiz for composites innovation"
    },
    "summary": "FIDAMC&rsquo;s Centro de Fabricaci&oacute;n Avanzada (CFA), backed by over &euro;18 million and 20 years of composites expertise, will drive multi-sector industrialization in&nbsp;3D printing, robotics&nbsp;and sustainable materials.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "FIDAMC&rsquo;s Centro de Fabricaci&oacute;n Avanzada (CFA), backed by over &euro;18 million and 20 years of composites expertise, will drive multi-sector industrialization in&nbsp;3D printing, robotics&nbsp;and sustainable materials."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-FIDAMC-Cadiz-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-FIDAMC-Cadiz-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>CFA inauguration. Source | FIDAMC</p>\n</div>\n\n<p><a href=\"https://fidamc.es/en/\" target=\"_blank\">FIDAMC</a> &ndash;&nbsp;the&nbsp;Foundation for Research, Development and Application of Composite Materials&nbsp;(Getafe, Spain)&nbsp;has recently inaugurated its&nbsp;advanced manufacturing center, the Centro de Fabricaci&oacute;n Avanzada (CFA), in Puerto Real (C&aacute;diz), Spain. The infrastructure has involved an investment of more than &euro;18 million and is set to be the new key to industrial innovation in Andalusia.</p>\n\n<p>The 1,7000-square-meter space, complete with&nbsp;state-of-the-art equipment like 3D printing (including 3D printing systems <a href=\"https://ceadgroup.com/resources/news/cead-and-fidamc-announce-advanced-manufacturing-partnership/\" target=\"_blank\">from CEAD</a>), robotics, metrology and 3D scanning, is complementary to FIDAMC&rsquo;s&nbsp;<a href=\"https://www.compositesworld.com/articles/fidamc-expands-composites-rd-into-new-markets-and-advanced-manufacturing-centers-\" target=\"_blank\">work with composites in Getafe</a>. The new complex&nbsp;will enable companies to develop innovative projects, serving as a meeting point between universities, technology centers and the companies themselves so that technical development and the manufacturing process can advance hand in hand.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-CEAD-FIDAMC-Cadiz.jfif\" target=\"_blank\"><img alt=\"CEAD’s modular robotic hybrid manufacturing system.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-CEAD-FIDAMC-Cadiz.jfif;maxWidth=385\" /></a></div>\n\n<p>CEAD&rsquo;s modular robotic hybrid manufacturing system. Source | <a href=\"https://www.linkedin.com/posts/ceadgroup_a-new-chapter-for-lfam-in-spain-the-advanced-activity-7375895072157970432-5Pvx/?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAN4sCoBEnrOaN1_kOmfslSmxd1f5UfO6WM\" target=\"_blank\">CEAD LinkedIn</a></p>\n</div>\n\n<p>&ldquo;The CFA will be a magnet for both knowledge and pioneering initiatives that will reinforce our aspiration to continue leading industrial growth,&rdquo; says Juanma Moreno, president of the regional government of&nbsp;Andalusia. &ldquo;Andalusia&rsquo;s GDP is growing above the average for Spain and the European Union, and we are the second largest region in terms of number of companies, ahead of Madrid. All this is the result of working together.&rdquo;</p>\n\n<p>First projects to be hosted by the CFA are expected to begin in October 2025. Specifically, there is already interest from biomedical companies (devices, implants, etc.), companies linked to construction (sustainable materials development) and also from renewable energy companies, all interested in channeling their projects through the&nbsp;C&aacute;diz facility.</p>\n\n<p>FIDAMC has technical management over the CFA. The center has more than 20 years of experience in research, development and innovation in composite materials, and its experience with large companies such as Airbus, Navantia, Talgo and Acciona guarantees that the CFA will be launched with a multi-sector approach, focused on the real transfer of knowledge and the promotion of talent.</p>\n\n<p>&ldquo;It is not just a building that is opening, but the home of industrial research and innovation in the region,&rdquo; says Ernesto Gonz&aacute;lez, CEO of FIDAMC. &ldquo;Research is no longer a luxury, but a necessity.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fidamc-inaugurates-cfa-facility-in-cadiz-for-composites-innovation"
      }
    ],
    "link": "https://www.compositesworld.com/news/fidamc-inaugurates-cfa-facility-in-cadiz-for-composites-innovation"
  },
  {
    "published": "Thu, 25 Sep 2025 06:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      25,
      10,
      0,
      0,
      3,
      268,
      0
    ],
    "title": "James Cropper celebrates 180 years in papermaking and advanced materials",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "James Cropper celebrates 180 years in papermaking and advanced materials"
    },
    "summary": "James Cropper commemorates nearly two centuries of heritage and innovation with celebrations at its Burneside site, reflecting on a legacy of craftsmanship, sustainability&nbsp;and global impact.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "James Cropper commemorates nearly two centuries of heritage and innovation with celebrations at its Burneside site, reflecting on a legacy of craftsmanship, sustainability&nbsp;and global impact."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-JamesCropper-celebration.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-JamesCropper-celebration.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | James Cropper.</p>\n</div>\n\n<p>From the foothills of the English Lakes District to the forefront of global innovation, <a href=\"https://www.compositesworld.com/suppliers/technical-fibre-products\" target=\"_blank\">James Cropper</a> (Schenectady, N.Y., U.S.) has spent 180 years pushing boundaries, shaping industries and making a material difference. This year, the sixth-generation family business celebrates nearly two centuries of papermaking excellence and advanced materials, with festivities at its Burneside mill, where employees and their families came together to honor a legacy built across generations.</p>\n\n<p>Founded in 1845, James Cropper has grown from its Cumbrian roots in Burneside to a global group, with sites in Cornwall, Crewe&nbsp;and Schenectady in the U.S. Across generations, its people have earned an international reputation for color mastery, craftsmanship, technical excellence and sustainable innovation, a culture that continues to define the business today.</p>\n\n<p>That spirit of restless curiosity has shaped defining moments in the company&rsquo;s history: producing paper for the British government during WWI, supplying the iconic red paper for Remembrance Day poppies and welcoming Her Majesty The Queen in 2013 to open the CupCycling&nbsp;plant,&nbsp;a facility dedicated to recycling coffee cups at scale.</p>\n\n<p>Today, that same mindset drives the company&rsquo;s work in advanced materials. From high-performance nonwovens and electrochemical materials used to deliver clean energy, aerospace and medical applications, to molded fiber packaging that accelerates the shift to circular packaging, James Cropper&rsquo;s aim is to help address some of the world&rsquo;s most urgent challenges.</p>\n\n<p>The company&rsquo;s passion for color remains strong. Since creating its first colored paper in the 1850s, it has honed its craft. Its state-of-the art color lab now offers more than 2,000 live shades, including 184 blacks and 62 whites, with limitless potential for designers and brands. Most recently, it unveiled Coloursource, a collection of 50 signature shades available in a variety of weights and embossed patterns.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-JamesCropper-180-years.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-JamesCropper-180-years.jpg;maxWidth=720\" /> </a></div>\n</div>\n\n<p>&ldquo;Our story has never been about standing still,&rdquo; says David Stirling, CEO at James Cropper. &ldquo;For 180 years, change, challenge and creativity have been our fuel. The dedication, curiosity and skill of our people continue to shape the future of sustainable materials and advanced technologies.&rdquo;</p>\n\n<p>The Burneside site remains at the heart of the group, a center of excellence for manufacturing, innovation&nbsp;and sustainability, located within the Lake District&rsquo;s UNESCO World Heritage landscape.&nbsp;</p>\n\n<p>As James Cropper marks its 180<sup>th</sup> anniversary, the focus is firmly on the future. With two core divisions driving its next chapter &mdash; Advanced Materials and Paper &amp; Packaging &mdash;&nbsp;the company is expanding into high-growth markets, from clean energy and next-generation battery technology to sustainable luxury packaging, while strengthening its role as a trusted partner to global brands, designers and manufacturers&nbsp;&mdash;&nbsp;standing ready to make a&nbsp;material difference for another 180 years and beyond.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/james-cropper-celebrates-180-years-in-papermaking-and-advanced-materials"
      }
    ],
    "link": "https://www.compositesworld.com/news/james-cropper-celebrates-180-years-in-papermaking-and-advanced-materials"
  }
]