[
  {
    "published": "Thu, 16 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      16,
      17,
      0,
      0,
      3,
      289,
      0
    ],
    "title": "Exel Composites plant in India begins volume shipments of carbon fiber wind energy components",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Exel Composites plant in India begins volume shipments of carbon fiber wind energy components"
    },
    "summary": "Joint venture Kineco Exel Composites India&nbsp;has reached full-scale production at the Banda facility, which is now shipping&nbsp;IEC 61400-5-certified&nbsp;flats, joiners&nbsp;and bolt fixtures to support major wind OEMs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Joint venture Kineco Exel Composites India&nbsp;has reached full-scale production at the Banda facility, which is now shipping&nbsp;IEC 61400-5-certified&nbsp;flats, joiners&nbsp;and bolt fixtures to support major wind OEMs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-KECI-team.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"The KECI team. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-KECI-team.jpg;maxWidth=720\" /> </a></div>\n\n<p>The KECI team. Source | Exel Composites</p>\n</div>\n\n<p>Pultruded composites manufacturer <a href=\"https://www.compositesworld.com/suppliers/exel-composites-plc\" target=\"_blank\">Exel Composites</a>&rsquo; (Vantaa, Finland) joint venture <a href=\"https://www.kinecoexelindia.com/\" target=\"_blank\">Kineco Exel Composites India</a>&nbsp;(KECI, Goa, India) has reached volume production capacity at its new Banda facility. The factory is purpose-built to serve the wind energy sector, expanding Exel&rsquo;s existing delivery capability in other regions. Following testing throughout 2024 and 2025, the site is now fully operational with dedicated lines for carbon fiber products used in turbine blades.</p>\n\n<p>Completed in 2024, the plant was developed by Exel Composites and long-standing partner Kineco Group (Goa, India), with its machinery and layout specifically tailored for high-volume production of carbon fiber components. The first full customer approvals have been achieved, and the volume shipments of carbon fiber flats have<strong> </strong>started, marking the start of sustained deliveries to major wind energy manufacturers in the region.</p>\n\n<p>These flats, used in turbine blades as structural reinforcements such as in spar caps, are designed to handle the rising mechanical loads as blade lengths increase. The demand for components like these has grown rapidly in recent years as India added a further 4.15 gigawatts&nbsp;to its wind capacity in 2024, bringing the total to 50 gigawatts.</p>\n\n<p>&ldquo;Reaching volume production capacity in India marks a leap in our long-term plans to support the wind industry,&rdquo; explains&nbsp;Kari Loukola, executive vice president of industrial solutions at Exel Composites. &ldquo;By localizing our pultrusion capabilities in India, we can supply high-performance components close to the point of use, helping our customers meet their business goals.&rdquo; The milestone follows a &euro;10 million order from a South Asian manufacturer last year.&nbsp;</p>\n\n<p>The facility dedicates most of its capacity to wind components, including flats, joiners&nbsp;and bolt fixtures, and with production now underway, KECI is positioned to strengthen India&rsquo;s wind supply chain and support the delivery of larger, more efficient turbines.</p>\n\n<p><em>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/news/kineco-exel-to-manufacture-pultruded-carbon-fiber-planks-for-vestas\">Kineco Exel to manufacture pultruded carbon fiber planks for Vestas</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/exel-composites-plant-in-india-begins-volume-shipments-of-carbon-fiber-wind-energy-components"
      }
    ],
    "link": "https://www.compositesworld.com/news/exel-composites-plant-in-india-begins-volume-shipments-of-carbon-fiber-wind-energy-components"
  },
  {
    "published": "Wed, 15 Oct 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      15,
      18,
      0,
      0,
      2,
      288,
      0
    ],
    "title": "Four Syensqo innovations are recognized at 2025 SPE Automotive Awards",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Four Syensqo innovations are recognized at 2025 SPE Automotive Awards"
    },
    "summary": "Syensqo&rsquo;s&nbsp;fiber-reinforced polymers, specialty compounds and bio-based PPA materials earn automotive impact distinction.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Syensqo&rsquo;s&nbsp;fiber-reinforced polymers, specialty compounds and bio-based PPA materials earn automotive impact distinction."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-syensqo-2025-spe-awards.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Syensqo and ZF Group smile on stage.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-syensqo-2025-spe-awards.jpg;maxWidth=720\" /> </a></div>\n\n<p>Matthias Braem, VP transportation at Syensqo, receives first place in &ldquo;Chassis &amp; Structural Components&rdquo; on behalf of the team for a rear axle steering toothed belt pulley developed with ZF Group using Ryton&nbsp;BR111 BL. Source | Syensqo</p>\n</div>\n\n<p dir=\"ltr\">High-performance polymers company <a href=\"https://www.compositesworld.com/suppliers/solvay-composite-materials\" target=\"_blank\">Syensqo</a> (Brussels, Belgium) received four&nbsp;recognitions from the <a href=\"https://www.compositesworld.com/suppliers/spe-society-of-plastics-engineers\" target=\"_blank\">Society of Plastics Engineers</a> (SPE) at the&nbsp;<a href=\"https://speautomotive.com/\" rel=\"noreferrer\" target=\"_blank\">2025 SPE Automotive Awards</a>. The honors were awarded following a rigorous evaluation by a jury of 35 industry experts who assessed submissions for their sustainability impact and technological innovation. The awards ceremony took place in Bonn, Germany.</p>\n\n<p>&ldquo;These awards represent a powerful recognition of Syensqo&rsquo;s commitment to innovation and sustainable mobility,&rdquo; says&nbsp;Matthias Braem, Syensqo&rsquo;s vice president of transportation. &ldquo;By combining Syensqo&rsquo;s materials expertise with the innovation of our partners, we are enabling solutions that make vehicles lighter, safer&nbsp;and more sustainable.&rdquo;</p>\n\n<p>The first place award in &ldquo;Chassis &amp; Structural Components&rdquo; category was granted for a toothed belt pulley for rear axle steering, developed together with ZF Group&nbsp;and manufactured using Ryton BR111&nbsp;BL &mdash; a&nbsp;black-colored glass fiber and mineral-filled polyphenylene sulfide compound.</p>\n\n<p>According to Syensqo, this component exemplifies the&nbsp;potential of specialty polymers in critical automotive systems. It withstands demanding operating conditions up to 150&deg;C in the presence of oils, while retaining dimensional accuracy and wear resistance. Compared with traditional sintered metal solutions, it delivers&nbsp;45% weight reduction, enabling a 30% smaller carbon footprint and reducing noise, vibration&nbsp;and harshness for a smoother driving experience.</p>\n\n<p>Another distinction went to a miniaturized collimator mount produced by Jabil Optics, using&nbsp;Ryton PPS BR111 BL&nbsp;and molded by Ningbo Sunrise for Lucid Gravity electric vehicles (EVs), which earned third prize in the same category. The use of Syensqo&rsquo;s specialty polymer enabled a 79% reduction in material carbon footprint compared to conventional aluminum alternatives.</p>\n\n<blockquote>\n<p>Syensqo&rsquo;s Amodel&nbsp;PPA resins family use fiber reinforcements, heat stabilizers, impact modifiers, flame retardants, minerals and other additives to achieve a broad range of performance, price and processing options.</p>\n</blockquote>\n\n<p>Two additional nominations highlighted Syensqo&rsquo;s contributions to next-gen electric mobility. The first recognizes a high-voltage connector for Bosch e-motors, molded by Furnel Inc. This innovation combines Syensqo&rsquo;s Amodel PPA with an optimized design that delivers high electrical performance, enhanced flame resistance, and a 50% reduction in production cycle time.&nbsp;</p>\n\n<p>The second nomination celebrates a power module developed with Semikron-Danfoss Elektronik GmbH, made from&nbsp;Amodel&nbsp;Bios HFFR R1-133, which according to Syensqo&rsquo;s website features a &ldquo;partially bio-sourced&nbsp;long-chain PPA made from non-food competing biomass and [is] produced using&nbsp;100% renewable electricity.&rdquo;&nbsp;With a surface tracking resistance of 900 volts&nbsp;and a relative thermal index of 140&deg;C, this solution enables miniaturization and long-term reliability. Its compatibility with laser welding simplifies assembly, while its sustainable formulation and transition to recycled aluminum reduce the component&rsquo;s carbon footprint by approximately 40%.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/four-syensqo-innovations-are-recognized-at-2025-spe-automotive-awards"
      }
    ],
    "link": "https://www.compositesworld.com/news/four-syensqo-innovations-are-recognized-at-2025-spe-automotive-awards"
  },
  {
    "published": "Wed, 15 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      15,
      17,
      0,
      0,
      2,
      288,
      0
    ],
    "title": "Škoda Motorsport continues to cut motorsport weight with Bcomp",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Škoda Motorsport continues to cut motorsport weight with Bcomp"
    },
    "summary": "The Czech brand looks to transition&nbsp;natural fiber technologies to production vehicle models after 316-kilogram cut in 2025 Enyaq RS Race pilot project.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Czech brand looks to transition&nbsp;natural fiber technologies to production vehicle models after 316-kilogram cut in 2025 Enyaq RS Race pilot project."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-enyaq-rs-race-interior.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-enyaq-rs-race-interior.jpg;maxWidth=720\" /> </a></div>\n\n<p><em>Enyaq RS Race&nbsp;</em>interior.&nbsp;Source |&nbsp;&Scaron;koda Motorsport</p>\n</div>\n\n<p>In November 2024, <a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a>&nbsp;(Fribourg, Switzerland) and&nbsp;<a href=\"https://www.skoda-motorsport.com/en/\" target=\"_blank\">&Scaron;koda Motorsport</a> (Plazy, Czech Republic) announced the integration of natural fiber composites into&nbsp;&Scaron;koda&rsquo;s&nbsp;<a href=\"https://www.compositesworld.com/news/koda-motorsport-partners-with-bcomp-for-enyaq-rs-race-program\" target=\"_blank\">motorsport vehicles</a>. Now, the companies share results from leveraged materials and&nbsp;&Scaron;koda&rsquo;s future plans.&nbsp;</p>\n\n<p>The collaboration has revamped the 2025 <em>Enyaq RS Race,&nbsp;</em>an all-electric concept car inspired by &Scaron;koda&rsquo;s &ldquo;Rally DNA.&rdquo; It is based on the &Scaron;koda <em>Enyaq Coup&eacute; RS</em> production model and features a host of new upgrades and innovative technology demonstrations. The <em>Enyaq RS Race</em> is a pilot project and proof point for potential use in future &Scaron;koda Auto production models. </p>\n\n<p>With the addition of Bcomp ampliTex and PowerRibs biocomposite parts, the <em>Enyaq RS Race&nbsp;</em>boasts 316 kilograms in weight savings versus the production of the&nbsp;<em>Enyaq Coup&eacute; RS</em>.&nbsp;Bcomp&rsquo;s technologies were used to create interior and body parts &mdash; the bumpers, fenders, roof vent, rear wing, dashboard, door panels, footrests for the driver and passenger, and a replacement panel for the standard model&rsquo;s panoramic glass roof. In total, 16 different vehicle components were replaced with sustainable material alternatives. </p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Important takeaways</h3>\n\n<ul>\n\t<li>&Scaron;koda Motorsport has leveraged Bcomp technologies in new 2025 <em>Enyaq RS Race </em></li>\n\t<li>Weight cut in this pilot project to demonstrate sustainable lightweighting  </li>\n\t<li>All-electric concept car hints at the future of &Scaron;koda production models with technical upgrades .</li>\n</ul>\n</div>\n</div>\n\n<p>&Scaron;koda Motorsport has put ampliTex&nbsp;and powerRibs&nbsp;to the test in challenging conditions as part of its rally program, becoming a&nbsp;best-selling brand in Rally2 for the past 10&nbsp;years. Now, the <em>Enyaq RS Race</em>&nbsp;vehicle hints at how this technology could transition to production&nbsp;automotive applications.  </p>\n\n<p>Bcomp&nbsp;itself has demonstrated capacity for high-volume automotive production in a number of <a href=\"https://www.compositesworld.com/news/natural-fibers-power-cupras-vision-for-sustainable-mobility\" target=\"_blank\">major projects</a> for international OEMs. Working alongside &Scaron;koda Auto to use ampliTex&nbsp;and powerRibs&nbsp;in production models would mark a significant step forward in the collaboration between the&nbsp;Czech brand and the Swiss scale-up. </p>\n\n<p>&ldquo;At &Scaron;koda Motorsport, we are always looking to take advantage of new technologies and materials,&rdquo; Jakub Jare&scaron;, project manager, <em>Enyaq RS Race,</em> says. &ldquo;The cooperation with Bcomp in the field of composites enabled us to achieve significant weight savings while at the same time demonstrating that motorsport can be sustainable. In combination with a fully electric vehicle, this approach makes perfect sense to us. Looking ahead, this material will continue to play an important role in our future projects and it holds great potential for use in series production.&rdquo; </p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/koda-motorsport-continues-to-cut-motorsport-weight-with-bcomp"
      }
    ],
    "link": "https://www.compositesworld.com/news/koda-motorsport-continues-to-cut-motorsport-weight-with-bcomp"
  },
  {
    "published": "Wed, 15 Oct 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      10,
      15,
      16,
      30,
      0,
      2,
      288,
      0
    ],
    "title": "Epsilon Composite acquires Cometec, strengthens presence in Italy",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Epsilon Composite acquires Cometec, strengthens presence in Italy"
    },
    "summary": "The longstanding&nbsp;alliance represents growth for both companies and combined strength and expertise in&nbsp;carbon fiber rollers,&nbsp;offering the market increasingly integrated, high-performance solutions.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The longstanding&nbsp;alliance represents growth for both companies and combined strength and expertise in&nbsp;carbon fiber rollers,&nbsp;offering the market increasingly integrated, high-performance solutions."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-epsiloncomposites-rollers.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Carbon fiber rollers.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-epsiloncomposites-rollers.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Epsilon Composite</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/epsilon-composite\" target=\"_blank\">Epsilon Composite</a> (Gaillan en M&eacute;doc, France) announces the acquisition of its Italian partner <a href=\"https://cometec-italia.it/\" target=\"_blank\">Cometec Srl</a>&nbsp;(Busto Arsizio, Italy), a specialist in carbon fiber technical rollers.</p>\n\n<p>While maintaining Cometec&rsquo;s identity and operational independence, this operation will strengthen existing synergies with Epsilon Composite. Together, both companies aim to offer machine manufacturers &mdash;&nbsp;in Europe and worldwide&nbsp;&mdash;&nbsp;high-performance, cost-competitive carbon fiber rollers thanks to an optimized supply chain and enhanced local service for Italian<br />\ncustomers.</p>\n\n<p>This marks Epsilon Composite&rsquo;s first external growth operation, fully financed with its own funds. The acquisition follows the company&rsquo;s capital increase in 2024, when its long-time partner Sumitomo Corp.&nbsp;(Japan) became a minority shareholder.</p>\n\n<p>Acquiring Cometec builds on a longstanding relationship: beyond a lasting industrial and commercial partnership, it is also the result of strong personal and professional ties between the founding families and their teams over nearly 35 years.</p>\n\n<p>Lucia Sarasini&nbsp;will remain managing director of Cometec and ensure operational continuity until her retirement. &ldquo;The union with Epsilon is a natural outcome,&rdquo; Sarasini says. &ldquo;For our customers, there will be no operational changes, but they will benefit from significant technological advancements thanks to the synergies with Epsilon Composite.&rdquo;</p>\n\n<p>Since 1989, Cometec has been manufacturing carbon fiber rollers using pull-winding and K1&nbsp;tubes supplied by Epsilon Composite, serving both Italian and international industrial customers. The company is recognized for its responsiveness and advanced expertise in roller assembly, machining&nbsp;and<br />\ntechnical surface coatings, enabling&nbsp;to meet small and medium batch production needs for industrial clients seeking short lead times, flexibility and high-quality products.</p>\n\n<p>Epsilon Composite is a&nbsp;family-owned carbon fiber pultrusion business, serving a&nbsp;wide range of markets including industry, energy, civil engineering and aerospace. The company generates more than 80% of its revenue internationally. Its Epsilon Rollers division is reported to be among the top three global manufacturers of technical rollers for the converting industries (technical film production, nonwoven textile manufacturing, flexographic printing, etc.).</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/epsilon-composite-acquires-cometec-strengthens-presence-in-italy"
      }
    ],
    "link": "https://www.compositesworld.com/news/epsilon-composite-acquires-cometec-strengthens-presence-in-italy"
  },
  {
    "published": "Wed, 15 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      15,
      16,
      0,
      0,
      2,
      288,
      0
    ],
    "title": "Future of BioBuilding shares bio-based composite material opportunities, challenges",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Future of BioBuilding shares bio-based composite material opportunities, challenges"
    },
    "summary": "A series of&nbsp;keynotes, interactive panels and networking will be covered over the two-day online event presented by Ceresana&nbsp;in December, focusing on economic&nbsp;perspectives, innovative developments&nbsp;and practical insights.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A series of&nbsp;keynotes, interactive panels and networking will be covered over the two-day online event presented by Ceresana&nbsp;in December, focusing on economic&nbsp;perspectives, innovative developments&nbsp;and practical insights."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div>&nbsp;</div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-fobbuild.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Construction backed by event logo.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-fobbuild.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Future of BioBuilding</p>\n</div>\n\n<p>Bio-based building materials&nbsp;have become promising innovations for the construction industry &mdash; enabling environmentally friendly, energy-saving and healthy-living concepts. From Dec. 10-11, 2025, <a href=\"https://ceresana.com/en\" target=\"_blank\">Ceresana</a>&nbsp;(Konstanz, Germany) is putting on the Future of BioBuilding&nbsp;online conference where industry representatives, innovators and&nbsp;investors will come together to discuss the latest developments.</p>\n\n<p><a href=\"https://ceresana.com/en/events/future-of-biobuilding\" target=\"_blank\">Future of BioBuilding</a> is the fourth online event in Ceresana&rsquo;s&nbsp;series of events on the future of the bioeconomy. Over two days (9:30 a.m. &ndash;&nbsp;1:30 p.m. CET) the focus will be on market opportunities, challenges&nbsp;and networking in the field of bio-based building materials: from insulation materials made from hemp, wood, mycelium&nbsp;or algae to sustainable composites and new material concepts. Participation in this English-language conference is free of charge.</p>\n\n<p>The event includes keynotes, interactive panels&nbsp;and targeted networking opportunities with companies, startups, investors&nbsp;and other players in the industry, creating a platform for exchange, inspiration&nbsp;and new impulses for the future of&nbsp;bio-based building materials.</p>\n\n<p>To learn more or to sign up for the free event, <a href=\"https://ceresana.com/en/events/future-of-biobuilding\" target=\"_blank\">visit here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/future-of-biobuilding-shares-bio-based-composite-material-opportunities-challenges-"
      }
    ],
    "link": "https://www.compositesworld.com/news/future-of-biobuilding-shares-bio-based-composite-material-opportunities-challenges-"
  },
  {
    "published": "Wed, 15 Oct 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      15,
      15,
      0,
      0,
      2,
      288,
      0
    ],
    "title": "ATA CFT provides updated outlook on Chinese, global carbon fiber market",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ATA CFT provides updated outlook on Chinese, global carbon fiber market"
    },
    "summary": "Analysis of 2024 carbon fiber and CFRP market data provides market insights, observations and commentary on their demand, capacities and prospects.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Analysis of 2024 carbon fiber and CFRP market data provides market insights, observations and commentary on their demand, capacities and prospects."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-lingang-china2024report.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-lingang-china2024report.jpg;maxWidth=720\" /> </a></div>\n\n<p>The calculated global demand for carbon fiber by application in kilotons (total amount: 156.10 kilotons). Source | Lin Gang</p>\n</div>\n\n<p>In 2024, <a href=\"http://www.atamachinery.com/\" target=\"_blank\">ATA CFT Guangzhou Co. Ltd.</a>&rsquo;s (Guangzhou, China) general manager Lin Gang published a <a href=\"https://www.compositesworld.com/articles/an-outlook-on-chinas-carbon-fiber-market\" target=\"_blank\">comprehensive report</a> analyzing China&rsquo;s 2023 carbon fiber market. Since then, equipped from additional conversations and feedback obtained from his presentation of the data&nbsp;at <em>CW</em>&rsquo;s Carbon Fiber 2024 event, Lin has&nbsp;published a new report on 2024&nbsp;statistics, trends and observations.&nbsp;</p>\n\n<p>Similar to the first report, this <a href=\"https://dash.compositesworld.com/cdn/cms/2024%20Global%20Carbon%20Fiber%20Composites%20Market%20Report.pdf\" target=\"_blank\">80-page update</a> breaks down:</p>\n\n<ul>\n\t<li>The global carbon fiber market by year, application (by kiloton and USD) and product.</li>\n\t<li>The global carbon fiber supply&rsquo;s theoretical capacities by manufacturer and region.</li>\n\t<li>China&rsquo;s carbon fiber market by year, application, province, source, as well as their current operational capacities and new developments.</li>\n\t<li>The global CFRP composites market by year, application (by&nbsp;kiloton and USD), region, process and matrix, followed by Chinese demand for CFRP by application.</li>\n\t<li>Trends and the prospect of composites in a variety of end markets.</li>\n\t<li>A look at carbon fiber recycling.</li>\n\t<li>Additional observations and reflections.</li>\n</ul>\n\n<p>&ldquo;China&rsquo;s carbon fiber industry had been largely overlooked on the global stage in recent years&nbsp;due in part to limited international information exchange during the COVID-19 pandemic,&rdquo; Lin explains. &ldquo;I drafted this report to help international stakeholders gain a clearer and more objective understanding of the Chinese carbon fiber market and its leading<br />\nmanufacturers.&rdquo;</p>\n\n<p>Data and conclusions for 2024 were obtained through&nbsp;Chinese carbon fiber enterprise annual sales data;&nbsp;annual sales data or business conditions of international carbon fiber companies; reference to&nbsp;current development status of numerous application markets, such as the deliveries of Boeing and Airbus in 2024; and&nbsp;market data from international peers.&nbsp;</p>\n\n<p><a href=\"https://dash.compositesworld.com/cdn/cms/2024%20Global%20Carbon%20Fiber%20Composites%20Market%20Report.pdf\" target=\"_blank\">Access the complete report here</a>.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ata-cft-provides-updated-outlook-on-chinese-global-carbon-fiber-market"
      }
    ],
    "link": "https://www.compositesworld.com/news/ata-cft-provides-updated-outlook-on-chinese-global-carbon-fiber-market"
  },
  {
    "published": "Wed, 15 Oct 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      15,
      14,
      0,
      0,
      2,
      288,
      0
    ],
    "title": "Integris Composites named armor partner for XM30 Combat Vehicle",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Integris Composites named armor partner for XM30 Combat Vehicle"
    },
    "summary": "Expertise in&nbsp;composite armor for land vehicles, aircraft, naval vessels and other applications will support $45 billion U.S. Army program.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Expertise in&nbsp;composite armor for land vehicles, aircraft, naval vessels and other applications will support $45 billion U.S. Army program."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-integris-custom-armor-protection.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Integris Composites operator designs custom armor protection.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-integris-custom-armor-protection.jpg;maxWidth=720\" /> </a></div>\n\n<p>Integris Composites operator designing custom armor protection. The company designs, develops, manufacturers and support composite armor for land vehicles, aircraft, naval vessels, protective housings for optronics and other sensitive technologies, and personal protection. Source | Holy Cow Media</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/integris-composites\" target=\"_blank\">Integris Composites Inc.</a>&nbsp;(Vienna, Va., U.S.)&nbsp;has been named an armor partner for <a href=\"https://www.rheinmetall.com/en/company/subsidiaries/american-rheinmetall\" target=\"_blank\">American Rheinmetall</a>&nbsp;(Sterling Heights, Mich., U.S.) in the U.S. Army&rsquo;s $45 billion XM30 Combat Vehicle program. Integris draws on more than&nbsp;30 years of composite armor expertise and thousands of tested material combinations to deliver optimized protection systems.</p>\n\n<p>The XM30 program represents a $45 billion modernization effort. &ldquo;This transformational program will deliver capabilities to modernize the Army&rsquo;s maneuver force, strengthen the U.S. defense industrial base and create high-tech jobs,&rdquo; says&nbsp;Andrew Bonham, CEO of Integris Composites. &ldquo;We are pleased to be a part of this.&rdquo;</p>\n\n<p>American Rheinmetall is one of two U.S. defense prime contractors selected by the U.S. Army to compete to design, develop, build&nbsp;and support the XM30 Combat Vehicle. As the official replacement for the aging M2 Bradley Infantry Fighting Vehicle, the XM30 will serve as the backbone to the Army&rsquo;s Armored Brigade Combat Teams for decades.</p>\n\n<p>The XM30 announcement is the latest in a series of premier contracts across multiple defense platforms including:</p>\n\n<ul>\n\t<li><a href=\"https://www.compositesworld.com/news/integris-to-provide-composite-ballistic-protection-for-type-45-vessels\" target=\"_blank\"><em>Royal Navy Type 45 </em>Destroyer</a>: ballistic protection systems contract with BAE Systems</li>\n\t<li><em><a href=\"https://www.compositesworld.com/news/integris-composites-becomes-us-army-flraa-armor-supplier\" target=\"_blank\">U.S. Army Future Long-Range Assault Aircraft (FLRAA)</a>:</em> armor systems with Bell Textron</li>\n\t<li><em>Boeing MH-139 </em>Grey Wolf: armor systems for the U.S. Air Force helicopter program</li>\n\t<li><a href=\"https://www.compositesworld.com/news/integris-qinetiq-join-forces-to-support-flraa-aircraft-advancements\" target=\"_blank\"><em>C-130J transport aircraft</em></a>: armor systems through QinetiQ partnership</li>\n\t<li><em>CV90 combat vehicle</em>: armor solutions for the European infantry fighting vehicle platform used by multiple NATO allies.</li>\n</ul>\n\n<p>&ldquo;Integris operates U.S. facilities including its technical design and engineering center in Hebron, Ohio; a vehicle design center in Goleta, California; and global headquarters in Tysons Corner, Virginia,&rdquo; Cordova says.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/integris-composites-named-armor-partner-for-xm30-combat-vehicle"
      }
    ],
    "link": "https://www.compositesworld.com/news/integris-composites-named-armor-partner-for-xm30-combat-vehicle"
  },
  {
    "published": "Tue, 14 Oct 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      14,
      15,
      0,
      0,
      1,
      287,
      0
    ],
    "title": "What is Manufacturing Connected?",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "What is Manufacturing Connected?"
    },
    "summary": "CW parent company&nbsp;Gardner Business Media's new platform brings manufacturing leaders actionable insights on trends and technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "CW parent company&nbsp;Gardner Business Media's new platform brings manufacturing leaders actionable insights on trends and technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-MC-logo1.png\" target=\"_blank\"><img alt=\"MC logo.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-MC-logo1.png;maxWidth=385\" /></a></div>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gardner-business-media\" target=\"_blank\">Gardner Business Media</a> (GBM, Cincinnati, Ohio, U.S.), publisher of <em>CompositesWorld</em>&nbsp;and sister brands serving discrete parts manufacturers, has launched a new platform for the industrial audience: <em><strong>Manufacturing Connected</strong></em>,&nbsp;found at&nbsp;<a href=\"https://www.mfgconnected.com/\" target=\"_blank\">MFGConnected.com</a>.</p>\n\n<p>&ldquo;Gardner&rsquo;s legacy brands dive deep into their subject matter, whether that&rsquo;s CNC machining, moldmaking or composites fabrication,&rdquo; says Stephanie Hendrixson, editor-in-chief of the new brand in addition to her continued role with&nbsp;<em>AM Media</em>. &ldquo;But the reality is that all manufacturers are contending with similar issues, and each vertical that we cover can learn from the others. <em>Manufacturing Connected</em> is a process-agnostic platform designed to inform the leaders who need that broad, cross-disciplinary insight to grow their businesses.&rdquo;</p>\n\n<p>&ldquo;We&rsquo;ve launched <em>Manufacturing Connected</em> on a simple premise: the best solutions in manufacturing often come from looking beyond your own process or market,&rdquo; says Rick Brandt, market vice president, advanced manufacturing group at GBM. &ldquo;By connecting the dots across technologies, industries and proven practices, we're helping manufacturers move faster and smarter.&rdquo;</p>\n\n<p>Intended for business owners, C-suite executives and other decision-makers, <em>Manufacturing Connected</em> offers that insight through short, 2-minute reads presenting key takeaways, coupled with in-depth interviews and reporting from Gardner&rsquo;s experienced B2B journalists.</p>\n\n<p>The introduction of the platform coincides with the launch of&nbsp;<strong>Leaders in Industry</strong>, a multimedia interview series hosted by Christina Fuges, editorial director of&nbsp;<em>MoldMaking Technology</em>&nbsp;(<a href=\"https://www.mfgconnected.com/articles/video-cybersecurity-as-a-leadership-imperative-in-manufacturing\" target=\"_blank\">view the first episode</a>).&nbsp;</p>\n\n<p>&ldquo;For time-strapped C-level professionals, each interview zeroes in on a specific challenge, trend or opportunity and delivers actionable insights viewers can implement immediately,&rdquo; Fuges says. &ldquo;We are excited to sit down with the people who are actually in the trenches, leading transformation on the shop floor and in the C-suite.&rdquo;</p>\n\n<p>In addition to business leadership, the editorial scope for <em>Manufacturing Connected</em> includes:</p>\n\n<ul>\n\t<li><strong>Emerging technologies</strong>&nbsp;such as 3D printing, artificial intelligence and automation</li>\n\t<li><strong>Business considerations</strong>&nbsp;such as cybersecurity, equipment financing and workforce development&nbsp;</li>\n\t<li><strong>Growing end markets for manufactured goods</strong>&nbsp;including data centers, commercial space, power generation and defense.</li>\n</ul>\n\n<p><em>Manufacturing Connected</em> content can be accessed online at&nbsp;<strong><a href=\"http://www.mfgconnected.com/\" target=\"_blank\">www.MFGConnected.com</a></strong>, as well as through a weekly newsletter including exclusive extras. Subscribe at&nbsp;<a href=\"https://gbm.media/MC-signup\" target=\"_blank\">gbm.media/MC-SignUp</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/what-is-manufacturing-connected-2"
      }
    ],
    "link": "https://www.compositesworld.com/news/what-is-manufacturing-connected-2"
  },
  {
    "published": "Mon, 13 Oct 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      13,
      18,
      0,
      0,
      0,
      286,
      0
    ],
    "title": "Marvin opens Kansas City hub for fiberglass windows and doors",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Marvin opens Kansas City hub for fiberglass windows and doors"
    },
    "summary": "Additional manufacturing, fabrication and assembly facility prepares the company for its next stage of development.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Additional manufacturing, fabrication and assembly facility prepares the company for its next stage of development."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-marvin-kansascity-facility.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Kansas City facility.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-marvin-kansascity-facility.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | Marvin Windows and Doors</p>\n</div>\n\n<p><a href=\"https://www.marvin.com/\" target=\"_blank\">Marvin Windows and Doors</a>&nbsp;(Warroad, Minn., U.S.) has opened its newest manufacturing facility at 9820 Leavenworth Road in Kansas City, Kansas. The 400,000-square-foot facility will be a hub for the manufacturing, fabrication and assembly of the company&rsquo;s fiberglass window and door solutions.</p>\n\n<p>&ldquo;With production underway at our newest manufacturing facility, Marvin is entering an exciting stage in our development in Kansas City,&rdquo; says Paul Marvin, CEO of Marvin. &ldquo;Last year, we collaborated with local leaders to map out a vision for Marvin&rsquo;s growth in the area and our commitment to the community and its talented workforce. That vision has come to life, and we look forward to seeing it continue to evolve and grow.&rdquo;</p>\n\n<p>Since beginning construction on the facility in spring 2024, Marvin has hired 70 full-time team members in Kansas City, with hiring to continue in the months ahead. The company anticipates a 600-person workforce in Kansas City by the close of 2028.</p>\n\n<p>&ldquo;Marvin&rsquo;s choice to expand their business in Kansas City is key in helping our community further establish a promising employment pipeline to attract and retain the next generation of modern manufacturing talent locally,&rdquo; says&nbsp;Dr. Greg Mosier, Kansas City Kansas Community College president. &ldquo;Strong employers and economic development go hand in hand. We&rsquo;ve seen over the past year how Marvin&rsquo;s dedication to both innovation and employee well-being will support Kansas City&rsquo;s continued growth, and I look forward to a long-term relationship that helps our graduates and our community thrive.&rdquo;</p>\n\n<p>Designed with employee well-being in mind, Marvin&rsquo;s custom-built facility features details including climate-controlled manufacturing space, exterior patios, LED lighting paired with natural light throughout and electric forklifts for reduced indoor air pollution. The space also offers employee amenities including bright, spacious break rooms with food and beverage options and on-site personal storage.&nbsp;</p>\n\n<p>Robert Conchola, director of operations for Marvin in Kansas City, thanks its local build partners&nbsp;Scannell Properties, JLL, Finkle + Williams Architecture, Olsson, Kadean Construction and many others for helping to complete the facility on time and on budget.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/marvin-opens-kansas-city-hub-for-fiberglass-windows-and-doors"
      }
    ],
    "link": "https://www.compositesworld.com/news/marvin-opens-kansas-city-hub-for-fiberglass-windows-and-doors"
  },
  {
    "published": "Mon, 13 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      13,
      17,
      0,
      0,
      0,
      286,
      0
    ],
    "title": "Belgium-Netherlands event brings together industry leader insight on TPC, FRP recycling",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Belgium-Netherlands event brings together industry leader insight on TPC, FRP recycling"
    },
    "summary": "Save the date for this free cross-border, expert-driven event by Agoria, Sirris and Brightland Materials Center on Nov. 12 in Belgium.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Save the date for this free cross-border, expert-driven event by Agoria, Sirris and Brightland Materials Center on Nov. 12 in Belgium."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-event-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Conference speaker with hands raised in the audience.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-event-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.agoria.be/en\" target=\"_blank\">Agoria</a> (Brussels, Belgium), <a href=\"https://www.compositesworld.com/suppliers/brightlands-materials-center\" target=\"_blank\">Brightlands Materials Center</a> (Geleen, Netherlands) and&nbsp;<a href=\"https://www.sirris.be/en\" target=\"_blank\">Sirris</a> (Brussels) are hosting the first edition of a cross-border, expert-driven event dedicated to accelerating the circular use of thermoplastic composites (TPC) and fiber-reinforced plastics (FRP) by bringing together the local ecosystem.</p>\n\n<p>The free, <a href=\"https://www.eventbrite.be/e/from-recyclable-to-reliable-scaling-circular-thermoplastic-composites-tickets-1667271697529?aff=ebdsoporgprofile\" target=\"_blank\">one-day event</a>, &ldquo;From Recyclable to Reliable: Scaling Circular Thermoplastic Composites&rdquo; is taking place in BluePoint, Antwerp, Belgium, on Nov. 12, 2025 from 10 a.m. &ndash;&nbsp;6 p.m. CET.&nbsp;</p>\n\n<p>This in-person gathering aims to bring together industry leaders, technology providers, researchers&nbsp;and end-users from Belgium, the Netherlands&nbsp;and beyond to:</p>\n\n<ul>\n\t<li>Exchange insights on fiber-reinforced thermoplastic recycling</li>\n\t<li>Share inspiration for the thermoset recycling industry</li>\n\t<li>Build and strengthen a circular ecosystem across borders</li>\n\t<li>Lay the foundation for a recurring annual event alternating between Belgium and the Netherlands.</li>\n</ul>\n\n<p>Confirmed speakers include:</p>\n\n<ul>\n\t<li>Rapha&euml;l Pleynet (EuCIA) on the&nbsp;European Circular Composites Alliance</li>\n\t<li>Veerle Van Steen (Agoria) on waste legislation in Belgium and&nbsp;the ELV directive</li>\n\t<li>Hans Luinge (SpiralRTC &ndash; Rein4ced) on innovative recycling technologies.</li>\n</ul>\n\n<p>Additional speakers are to follow. <a href=\"https://www.eventbrite.be/e/from-recyclable-to-reliable-scaling-circular-thermoplastic-composites-tickets-1667271697529?aff=ebdsoporgprofile\" target=\"_blank\">Sign up here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/belgium-netherlands-event-brings-together-industry-leader-insight-on-tpc-frp-recycling"
      }
    ],
    "link": "https://www.compositesworld.com/news/belgium-netherlands-event-brings-together-industry-leader-insight-on-tpc-frp-recycling"
  }
]