[
  {
    "title": "Delegation des Wirtschafts- und Umweltministeriums des Landes Nordrhein-Westfalen zu Gast im „Werkstoffforum der Zukunft“",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Delegation des Wirtschafts- und Umweltministeriums des Landes Nordrhein-Westfalen zu Gast im „Werkstoffforum der Zukunft“"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/delegation-des-wirtschafts-und-umweltministeriums-des-landes-nordrhein-westfalen-zu-gast-im-werkstoffforum-der-zukunft/"
      }
    ],
    "link": "https://www.avk-tv.de/delegation-des-wirtschafts-und-umweltministeriums-des-landes-nordrhein-westfalen-zu-gast-im-werkstoffforum-der-zukunft/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Mon, 30 Jun 2025 12:32:34 +0000",
    "published_parsed": [
      2025,
      6,
      30,
      12,
      32,
      34,
      0,
      181,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Kunststoff-Institut Lüdenscheid",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8482",
    "guidislink": false,
    "summary": "Kunststoff-Institut Lüdenscheid Eine Delegation des Wirtschafts- und Umweltministeriums des Landes Nordrhein-Westfalen sowie Teilnehmer der Business Metropole Ruhr und der Wirtschaftsförderung des Kreises Unna hat sich am 04.06.2025 im WdZ am ... <a class=\"read-more\" href=\"https://www.avk-tv.de/delegation-des-wirtschafts-und-umweltministeriums-des-landes-nordrhein-westfalen-zu-gast-im-werkstoffforum-der-zukunft/\" title=\"Delegation des Wirtschafts- und Umweltministeriums des Landes Nordrhein-Westfalen zu Gast im &#8222;Werkstoffforum der Zukunft&#8220;\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Kunststoff-Institut Lüdenscheid Eine Delegation des Wirtschafts- und Umweltministeriums des Landes Nordrhein-Westfalen sowie Teilnehmer der Business Metropole Ruhr und der Wirtschaftsförderung des Kreises Unna hat sich am 04.06.2025 im WdZ am ... <a class=\"read-more\" href=\"https://www.avk-tv.de/delegation-des-wirtschafts-und-umweltministeriums-des-landes-nordrhein-westfalen-zu-gast-im-werkstoffforum-der-zukunft/\" title=\"Delegation des Wirtschafts- und Umweltministeriums des Landes Nordrhein-Westfalen zu Gast im &#8222;Werkstoffforum der Zukunft&#8220;\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><a href=\"http://kunststoff-institut.de\">Kunststoff-Institut Lüdenscheid</a></p><p>Eine Delegation des Wirtschafts- und Umweltministeriums des Landes Nordrhein-Westfalen sowie Teilnehmer der Business Metropole Ruhr und der Wirtschaftsförderung des Kreises Unna hat sich am 04.06.2025 im WdZ am Standort bei Nature Compound GmbH in Schwerte umfassend über das innovative und über vier Jahre ausgelegte Projekt &#8222;Werkstoffforum der Zukunft&#8220; im 5-StandorteProgramm informiert. Dieses zukunftsweisende Vorhaben integriert Akteure der Kreislaufwirtschaft und der kunststoffverarbeitenden Industrie in der Region und stärkt die Kunststoffindustrie als Stabilitätsanker in NRW durch gezielte Transformation.</p><p>Am 1. Januar 2024 startete das Projekt offiziell im Rahmen des 5-StandorteProgramms der regionalen Wirtschaftsförderung Business Metropole Ruhr. Die Arbeitspakete sind innerhalb der Partner REMONDIS Recycling GmbH Co. KG, dem Wuppertal-Institut für Klima, Umwelt, Energie gGmbH, der ZENIT GmbH, der TechnoPark und Wirtschaftsförderung Schwerte (TWS) und dem Kunststoff-Institut Lüdenscheid als Konsortialführer klar verteilt und greifen interdisziplinär ineinander mit dem Ziel, den bestmöglichen Ansatz für die Unternehmen zu wählen. Die Interaktionen zwischen den Akteuren spielen im Forum dabei eine wichtige Rolle. Gerade in Bezug auf Nachhaltigkeitsstrategien innerhalb der Unternehmen ist es wichtig zu verstehen, welche Einflüsse Maßnahmen entlang der Wertschöpfungskette sich gegenseitig bedingen. Die Partner haben hierzu ein tragfähiges Konzept in Form eines Werkzeugkoffers entwickelt, um zielgerichtet ins „doing“ zu kommen.</p><p>Seitens der Ministerien Anlass genug, um sich von den Arbeiten und dem Standort Schwerte ein Bild zu machen.</p><p><strong>Werkstoffforum unterstützt Unternehmen bei ihrer Transformation</strong></p><p>Eines der Kernziele des Werkstoffforums ist es, insbesondere die technischen Kunststoffe in den Fokus zu nehmen. Diese kommen in Schlüsselindustrien wie der Automobilbranche, Elektro- oder Bauindustrie zum Einsatz. Die Unternehmen sehen sich zunehmend mit regulatorischen Vorgaben konfrontiert, die den Einsatz nachhaltiger Materialien fordern. Damit läuft die Branche auf eine Rezyklatmangellage zu, die es zu kompensieren gilt. Ziel ist es, den Unternehmen die <a>Werkzeuge und das Wissen an die Hand zu geben, um die Herausforderungen der Sourcensicherung</a> z. B. mit eigenen Geschäftsmodellen zu meistern. Hierbei bedienen sich die Projektpartner eines Werkzeugkoffers an Methoden, um innerhalb von Unternehmensworkshops diese Potentiale zu identifizieren. In ersten Workshop wurden bereits Handlungsempfehlungen und technologische Konzepte erfolgreich erarbeitet. Besonders kleinere und mittelständische Betriebe profitieren von dieser Möglichkeit, die im Forum entwickelten Ansätze direkt in ihre Prozesse zu integrieren. Die Aufnahme des Status Quo und Evaluierung möglicher Stoffströme im Werkstoffforum sind erste Schritte, um Lösungsräume für Unternehmen ableiten zu können. Eine Sonderstellung wird zukünftig der digitale Produktpass einnehmen, der die Komponenten, Materialien und dessen Eigenschaften dokumentiert. Diese Daten und Kennwerte bilden die Grundlage für ein künftiges Bewertungsschema, das die Recyclingfähigkeit und Nachhaltigkeit von Kunststoffen bewertet.</p><p>Einen weiteren, echten „Meerwert“ erzielen Partner des Werkstoffforums z. B. mit der <a>Integration von Algen als neue Source mit Ambitionen </a>im Kontext nachhaltiger Materialien, und dass eben nicht nur für Verpackungen. Das Forum unterstützt damit ebenfalls den Ausbau der Bioökonomie-Strategie des Landes NRW als Wachstumstreiber für die Branche.&nbsp;&nbsp;</p><p>Die Vision des Werkstoffforums reicht weit über die aktuelle Förderperiode hinaus. Ziel ist es, Unternehmen zu befähigen, nachhaltige Werkstoffnutzung eigenständig auszubauen und auf andere Prozesse zu übertragen. Mit regionaler Verankerung auf der Schnittstelle des Kreises Unna als Wachstumsbranche für Kreislaufwirtschaft, der Metropole Ruhr und der starken Kunststoffregion Südwestfalen, schafft das Werkstoffforum in Nordrhein-Westfalen Modellcharakter für nachhaltige Werkstoffnutzung mit nationaler und internationaler Strahlkraft.</p><p>Die Ministerien als auch die Wirtschaftsförderungsgesellschaften konnten sich davon überzeugen, wie durch interdisziplinäre Zusammenarbeit und innovative Ansätze nachhaltige Lösungen entstehen. Das Werkstoffforum verbindet technologische Innovation mit einem klaren gesellschaftlichen Auftrag und zeigt, dass Kunststoffe nicht nur Teil des Problems, sondern auch Teil der Lösung sein können.</p><p><strong>5-StandorteProgramm</strong></p><p>Das 5-StandorteProgramm unterstützt mit Bundesmitteln die Bewältigung der wirtschaftlichen Folgen des Ausstiegs aus der Steinkohleverstromung in Nordrhein-Westfalen. Ziel ist es, Wertschöpfungs- und Beschäftigungsverluste in den betroffenen Regionen abzufedern. Hierfür stellt der Bund dem Land NRW bis zu 662 Millionen Euro für strukturstärkende Projekte in Hamm, Herne, Duisburg, Gelsenkirchen und dem Kreis Unna zur Verfügung. Bis zum Jahr 2038 sollen mit diesen Mitteln innovative Vorhaben angestoßen werden, um neue wirtschaftliche Perspektiven und Chancen an den fünf Standorten zu schaffen. Eines dieser geförderten Projekte ist das Werkstoffforum der Zukunft in Schwerte, das zukunftsweisende Impulse für die Region setzen soll. Das Werkstoffforum der Zukunft wird vom Bundesministerium für Wirtschaft und Klimaschutz (BMWK) sowie vom Ministerium für Wirtschaft, Industrie, Klimaschutz und Energie des Landes NRW gefördert.</p><figure class=\"wp-block-image size-large is-resized\"><img alt=\"\" class=\"wp-image-8480\" height=\"815\" src=\"https://www.avk-tv.de/wp-content/uploads/2025/06/WdZ_04_06_2025-1024x815.jpg\" style=\"width: 436px; height: auto;\" width=\"1024\" /></figure><p><em>Delegation der Ministerien des Landes Nordrhein-Westfalen, Business Metropole Ruhr, Wirtschaftsförderung des Kreises Unna sowie Partner des Werkstoffforum der Zukunft am Standort Nature Compound GmbH, Schwerte 04.06.2025</em></p><p><em>v.l.n.r: Christoph Gutzeit (TWS GmbH), Markus Querfurt (BMR), Sascha Dargazanli (Ministerium für Umwelt, Natur und Verkehr MUNV), Sabine Widdermann (ZENIT GmbH), Andreas Sturm (BMR), Michael Tesch (Kunststoff-Institut Lüdenscheid), Thorsten Witter (TWS GmbH), Michael Ritthoff (Wuppertal-Institut), Christopher Juschka (Ministerium für Wirtschaft, Industrie, Klima und Entwicklung MWIKE)), Nadine Boßle (MWIKE), Bärbel Mauer (MWIKE), Bettina Kittel (MWIKE), Andre Müller (WFG), Monica Harting-Pfeifer (REMONDIS)</em></p><hr class=\"wp-block-separator has-alpha-channel-opacity\" /><p>Jetzt die gesamte Pressemeldung lesen:</p><div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\"><div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/06/PM_Delegation_des_Wirtschafts_Umweltministerium_zu_Gast_beim_WdZ.pdf\">Pressemeldung (DE)</a></div></div>"
      }
    ]
  },
  {
    "title": "Großflächige Inline-Fehlererkennung mit Thermografie",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Großflächige Inline-Fehlererkennung mit Thermografie"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/grossflaechige-inline-fehlererkennung-mit-thermografie/"
      }
    ],
    "link": "https://www.avk-tv.de/grossflaechige-inline-fehlererkennung-mit-thermografie/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Mon, 23 Jun 2025 05:52:15 +0000",
    "published_parsed": [
      2025,
      6,
      23,
      5,
      52,
      15,
      0,
      174,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "SKZ – Das Kunststoff-Zentrum",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8450",
    "guidislink": false,
    "summary": "Mit der Thermografie die Produktion verbessern Das Kunststoff-Zentrum SKZ Das Kunststoff-Zentrum SKZ bietet Entwicklungen im Bereich der Qualitätskontrolle für kontinuierliche Produktionsprozesse, insbesondere für dünnwandige Kunststofferzeugnisse. Die Einführung einer modernen Thermografie-Lösung ... <a class=\"read-more\" href=\"https://www.avk-tv.de/grossflaechige-inline-fehlererkennung-mit-thermografie/\" title=\"Großflächige Inline-Fehlererkennung mit Thermografie\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Mit der Thermografie die Produktion verbessern Das Kunststoff-Zentrum SKZ Das Kunststoff-Zentrum SKZ bietet Entwicklungen im Bereich der Qualitätskontrolle für kontinuierliche Produktionsprozesse, insbesondere für dünnwandige Kunststofferzeugnisse. Die Einführung einer modernen Thermografie-Lösung ... <a class=\"read-more\" href=\"https://www.avk-tv.de/grossflaechige-inline-fehlererkennung-mit-thermografie/\" title=\"Großflächige Inline-Fehlererkennung mit Thermografie\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><strong>Mit der Thermografie die Produktion verbessern</strong></p><p><a href=\"https://www.skz.de/\">Das Kunststoff-Zentrum SKZ</a></p><p><em>Das Kunststoff-Zentrum SKZ bietet Entwicklungen im Bereich der Qualitätskontrolle für kontinuierliche Produktionsprozesse, insbesondere für dünnwandige Kunststofferzeugnisse. Die Einführung einer modernen Thermografie-Lösung unterstützt die Produktionsüberwachung.</em><br /><strong><em><br /></em></strong>Die Herausforderung bei der Herstellung hochwertiger Kunststofferzeugnisse liegt oft in den geringen Toleranzen bezüglich der Oberflächenqualität und innenliegender Fehlstellen. Um höchste Qualitätsstandards zu erfüllen und mögliche Produktreklamationen zu vermeiden, wird eine umfassende und direkt im laufenden Prozess integrierte Qualitätskontrolle immer wichtiger.<br /><br />Das SKZ präsentiert ein Thermografie-Messsystem, das auf einer bewährten Methode basiert. Dabei wird entweder passiv die herstellungsbedingte Erwärmung und Abkühlung der Kunststoffprodukte genutzt oder eine aktive Erwärmung herbeigeführt, um Fehler im Produkt thermografisch sichtbar zu machen. Das System erlaubt eine Inline-Überwachung und erreicht je nach Produkt bis zu 100 % Kontrolle.<br /><br />Im Vergleich zu herkömmlichen optischen Kamerasystemen bietet das Thermografie-Messsystem eine robuste Lösung, die unabhängig von Umgebungsbedingungen wie inhomogener Ausleuchtung arbeitet. Der Betrachtungswinkel spielt eine untergeordnete Rolle, und selbst innenliegende Mängel abseits der Oberfläche werden zuverlässig erkannt.<br /><br />Technisch gesehen nutzt das System die Infrarot-Thermografie, um präzise Temperaturmessungen an der Oberfläche durchzuführen. Durch die Analyse der Temperaturverteilung können nicht nur Oberflächenfehler wie etwa Schlieren oder Dellen erkannt werden, sondern auch innenliegende Mängel wie Poren oder Fremdmaterialeinschlüsse. Die hohe Auflösung und Genauigkeit der Thermografie gewährleisten eine zuverlässige Detektion selbst kleinster Defekte.<br /><br />Das SKZ kann auf eine langjährige und umfangreiche Erfahrung in der Thermografie zurückblicken und bietet Unternehmen Unterstützung bei der Implementierung maßgeschneiderter Lösungen. Von Machbarkeitsstudien über die Integration in die Produktionskette bis hin zu Schulung, Wartung und Support begleitet das Institut den gesamten Entwicklungsprozess.<br /><br />Als aktives Mitglied der Zuse-Gemeinschaft setzt sich das SKZ für kontinuierliche Innovationen und Vernetzung ein, um die Leistungs- und Wettbewerbsfähigkeit der Industrie, insbesondere des Mittelstandes, zu stärken. Die neue Thermografie-Lösung markiert einen bedeutenden Fortschritt in der Qualitätskontrolle und ebnet den Weg für eine effiziente und präzise Produktionsüberwachung.</p>"
      }
    ]
  },
  {
    "title": "Rückschau „Verbundwerkstoff trifft Wasserwirtschaft“ aus der CU-Reihe „Verbundwerkstofftrifft Anwenderbranche“",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Rückschau „Verbundwerkstoff trifft Wasserwirtschaft“ aus der CU-Reihe „Verbundwerkstofftrifft Anwenderbranche“"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/rueckschau-verbundwerkstoff-trifft-wasserwirtschaft-aus-der-cu-reihe-verbundwerkstofftrifft-anwenderbranche/"
      }
    ],
    "link": "https://www.avk-tv.de/rueckschau-verbundwerkstoff-trifft-wasserwirtschaft-aus-der-cu-reihe-verbundwerkstofftrifft-anwenderbranche/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Wed, 18 Jun 2025 18:31:47 +0000",
    "published_parsed": [
      2025,
      6,
      18,
      18,
      31,
      47,
      2,
      169,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Composites United",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8446",
    "guidislink": false,
    "summary": "Verbundwerkstoffe spielen in vielen Anwenderbranchen eine zunehmende Rolle. Der CompositesUnited e. V. (CU) – das führende Netzwerk für faserbasierten hybriden Leichtbau –möchte den Austausch mit Anwenderbranchen intensiveren und hierfür Mitglieder ... <a class=\"read-more\" href=\"https://www.avk-tv.de/rueckschau-verbundwerkstoff-trifft-wasserwirtschaft-aus-der-cu-reihe-verbundwerkstofftrifft-anwenderbranche/\" title=\"Rückschau „Verbundwerkstoff trifft Wasserwirtschaft“ aus der CU-Reihe „Verbundwerkstofftrifft Anwenderbranche“\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Verbundwerkstoffe spielen in vielen Anwenderbranchen eine zunehmende Rolle. Der CompositesUnited e. V. (CU) – das führende Netzwerk für faserbasierten hybriden Leichtbau –möchte den Austausch mit Anwenderbranchen intensiveren und hierfür Mitglieder ... <a class=\"read-more\" href=\"https://www.avk-tv.de/rueckschau-verbundwerkstoff-trifft-wasserwirtschaft-aus-der-cu-reihe-verbundwerkstofftrifft-anwenderbranche/\" title=\"Rückschau „Verbundwerkstoff trifft Wasserwirtschaft“ aus der CU-Reihe „Verbundwerkstofftrifft Anwenderbranche“\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p></p><p>Verbundwerkstoffe spielen in vielen Anwenderbranchen eine zunehmende Rolle. Der Composites<br />United e. V. (CU) – das führende Netzwerk für faserbasierten hybriden Leichtbau –<br />möchte den Austausch mit Anwenderbranchen intensiveren und hierfür Mitglieder und Gäste<br />aus den Branchen ins Gespräch bringen, um Ideen für neue Anwendungen und neue Technologien<br />zu diskutieren. Die Referenten stellen ihre Projekte und Einschätzung vor und stellen<br />sich der Diskussion mit den Teilnehmenden.<br />„Die Wasserwirtschaft steht, angesichts des Klimawandels und des hohen Instandsetzungsbedarfs<br />von Anlagen, vor großen Herausforderungen. Verbundwerkstoffe können als Innovationstreiber<br />den anstehenden Transformationsprozess unterstützen. Wasserwirtschaft, das<br />sind die Bereiche Trinkwasser, Abwasser, Regenwasser, Be- und Entwässerung sowie<br />Brauchwasser für die Industrie,“ so Dr. Heinz Kolz in seiner Begrüßung der Online-Veranstaltung<br />am 02.Juni 2025.</p><p><strong>Glasfaserverstärkte Kunststoffe – Hervorragendes Material für die Wasserwirtschaft</strong><br />Die Industrievereinigung Verstärkte Kunststoffe e.V. (AVK) vertritt 230 Mitgliedsunternehmen entlang der gesamten Wertschöpfungskette im Bereich verstärkte Kunststoffe. Der Fachverband möchte seinen Mitgliedern alle benötigten Dienstleistungen aus einer Hand anzubieten und deren Interessen<br />vertreten. Glasfaserverstärkte Kunststoffe (GFK) bieten hervorragende Eigenschaften<br />wie Korrosionsbeständigkeit, geringes Alterungsverhalten und glatte Oberflächen. Ein hohes Potential bietet<br />GFK in der Wasserwirtschaft bei Rohren, Tanks, Anlagen und Arbeitsplattformen. Die Sanierung mit GFK-Inlinern ist ein weiteres großes Anwendungsfeld.<br /><em>Referent: Dr. Elmar Witten, AVK – Industrievereinigung faserverstärkte Kunststoffe</em></p><p><strong>Armaturen in der Wasserwirtschaft – Potential für Faserverbund?</strong><br />Schönborner Armaturen aus Brandenburg entwickelt und fertigt Produkte zum effizienten und<br />ressourenschonenden Transport von Trinkwasser. Das Unternehmen wurde als eines der 100<br />innovativsten Unternehmen in Deutschland ausgezeichnet und ist aktiv im Innovationscluster<br />Wasserwirtschaft. Dieses Cluster möchte Akteure der Wasserwirtschaft mit dem Ziel vernetzen,<br />die Folgen des Klimawandels auf die Ressource Wasser erfolgreich zu gestalten.<br />Innovationen in der Trinkwasserwirtschaft lassen sich bei 6.000 Anlagenbetreibern in Deutschland<br />nur schwer in der Branche etablieren. Dies auch deshalb, weil Anlagen unter der Erde<br />liegen und 100 Jahre halten. Um die Innovationsbereitschaft zu fördern, bedarf es der Unterstützung<br />aus der Politik. Gussbauteile wurden alternativ aus einem Zinkkern gefertigt und mit<br />Glasfaserverstärkten Kunststoff umspritzt. Die Teile sind haltbarer, unterliegen keiner Korrosion<br />und haben weniger Gewicht. Verbundwerkstoffe bieten darüber hinaus mehr Flexibilität<br />in der Formgebung und bei Werkzeugen bietet die Gewichtseinsparung Vorteile. Das Innovationscluster<br />Wasserwirtschaft will in einem Reallabor Veränderungen und Anpassungen (wie<br />Klimawandel oder demographischen Wandel) am Beispiel einer Kleinstadt simulieren, um Anwendern<br />Handlungsstrategien aufzuzeigen.<br /><em>Referent: Thomas Ebert, Schönborner Armaturen GmbH &amp; Innovationscluster Wasserwirtschaft</em></p><p><strong>Tut dat not? – Schäden in GFK-Anwendungen trotz Eigenschaftspotenzial</strong><br />Die IMA Materialforschung und Anwendungstechnik GmbH, kurz IMA Dresden, ist ein unabhängiges,<br />zertifiziertes und akkreditiertes Prüfzentrum. Die IMA ist eine international anerkannte<br />Prüf-, Überwachungs- und Zertifizierungsstelle für Hersteller und die gesamte Zulieferindustrie,<br />um neue Entwicklungen schneller marktfähig zu machen.<br />GFK-Anwendungen finden sich vor allem in Trink-, Kühl-, Druck- und Abwassersystemen, im<br />Behälterbau und in der Kanalsanierung mit Wandstärken von 4-30 mm. Da es immer wieder<br />zu Schadensfällen kommt, sind vier Aspekte zu prüfen:</p><ul class=\"wp-block-list\"><li>Verbundwerkstoffe sind für die Wasserwirtschaft gut geeignet, weil ein breites Spektrum<br />an Materialien für jede Anforderung zur Verfügung steht.</li>\n\n<li>Die Verfügbaren Herstellungsverfahren bieten Auswahl für jede Anwendung.</li>\n\n<li>Merkblätter, Regelwerke, Normen und Leitfäden liefern den Anwendern das notwendige<br />Know-how für die Herstellung.</li>\n\n<li>Werkstoff- und Bauteilprüfungen bieten am Ende die notwendige Sicherheit.<br />Dennoch kann es zu Schäden kommen durch für die Anwendung ungeeignete Materialien,<br />mangelhafte Herstellung, Fehler in der Auslegung für eine Langzeitanwendung und unvorhergesehene<br />Lasten.</li></ul><p><em>Referent: Prof. Jens Ridzewski, IMA Materialforschung und Anwendungstechnik GmbH</em></p><p></p><p><strong>Carbon trifft Wasser – Hightech für Bachläufe und Trinkwasserbehälter</strong><br />rothycon ist Partner für nachhaltiges, leichtes und technologisch fortschrittliches Bauen. Das<br />Unternehmen nimmt eine Vorreiterrolle im Leichtbau ein und arbeiten eng mit führenden Produzenten<br />von Glas-, Basalt-, Natur- und Carbonfaserbewehrungen zusammen.<br />Als Netzwerk-Geschäftsführer des CU Bau im Composites United gestaltet Roy Thyroff die<br />Zukunft des Bauens aktiv mit. Nichtmetallische Bewährungen für den Bausektor können heute<br />durch Digitalisierung für große Projekte ausgelegt und produziert werden. Sie bieten geringeres<br />Gewicht, CO2-Minderung, keine Korrosion und gute Ergebnisse im Gesamtkostenvergleich.<br />Hürden in Gesetzen und Förderrichtlinien können nur mithilfe politischer Unterstützung<br />überwunden werden. Eine marode denkmalgeschützter historische Brunnenanlage in Berlin<br />konnte nach Reinigung mit Carbonbeton überzogen und erhalten werden. Ein verrohrter 350<br />Meter langer Bachlauf unter einer Straße musste saniert werden. Mit Carbonbeton ausgespritzt<br />konnte darauf verzichtet werden die Straße aufzureißen und den Kanal mit Stützen<br />abzusichern. In der Wasserwirtschaft bietet Carbonbeton deutlich bessere Eigenschaften, weil<br />Carbonbeton nicht korrosionsanfällig ist. Wassereintritt bei Stahlbeton bedeutet Korrosion.<br /><em>Referent: Roy Thyroff, rothycon CARBON BEWEHRUNG und CU Bau</em></p><p>Die Aufzeichnung der Veranstaltung können Sie auf dem YouTube-Kanal des CU anschauen:<br /><a href=\"https://youtu.be/5ro41_Wascc\">https://youtu.be/5ro41_Wascc</a>.<br />Der nächste Termin unserer Reihe:</p><ol class=\"wp-block-list\" start=\"1\"><li>September 2025 „Verbundwerkstoff trifft Windkraft“ (14:00 Uhr, online)<br />Programm und Einladung finden Sie frühzeitig auf der CU-Internetseite. Wir freuen uns über<br />Ihre Teilnahme!<br /><br /><strong>Weitere Informationen erhalten Sie von:</strong><br />Dr. Heinz Kolz, CU West, <a href=\"mailto:heinz.kolz@composites-united.com\">heinz.kolz@composites-united.com</a><br />Dr. Thomas Heber, CU Ost, <a href=\"mailto:thomas.heber@composites-united.com\">thomas.heber@composites-united.com</a><br />Dr. Bastian Brenken, CU Nord, <a href=\"mailto:bastian.brenken@composites-united.com\">bastian.brenken@composites-united.com</a></li></ol><hr class=\"wp-block-separator has-alpha-channel-opacity\" /><p>Jetzt die gesamte Pressemeldung lesen:</p><div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\"><div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/06/PM-CU-Rueckschau-FW-trifft-Wasserwirtschaft-06.2025.pdf\">Pressemeldung (DE)</a></div></div>"
      }
    ]
  },
  {
    "title": "CIRCVET – Qualifizierung für eine zirkuläre Kunststoffwirtschaft in Europa",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CIRCVET – Qualifizierung für eine zirkuläre Kunststoffwirtschaft in Europa"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/circvet-qualifizierung-fuer-eine-zirkulaere-kunststoffwirtschaft-in-europa/"
      }
    ],
    "link": "https://www.avk-tv.de/circvet-qualifizierung-fuer-eine-zirkulaere-kunststoffwirtschaft-in-europa/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Tue, 17 Jun 2025 18:14:34 +0000",
    "published_parsed": [
      2025,
      6,
      17,
      18,
      14,
      34,
      1,
      168,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Kunststoff-Institut Lüdenscheid",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8440",
    "guidislink": false,
    "summary": "Ein hybrides EU-Ausbildungsprojekt mit validierten Lernmodulen und ECTS-Anbindung Kunststoff-Institut Lüdenscheid Im Rahmen des ERASMUS+-Programms entwickelt ein europäisches Konsortium unter Beteiligung des Kunststoff-Instituts Lüdenscheid einen hybriden Weiterbildungskurs für die zirkuläre Kreislaufwirtschaft ... <a class=\"read-more\" href=\"https://www.avk-tv.de/circvet-qualifizierung-fuer-eine-zirkulaere-kunststoffwirtschaft-in-europa/\" title=\"CIRCVET – Qualifizierung für eine zirkuläre Kunststoffwirtschaft in Europa\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Ein hybrides EU-Ausbildungsprojekt mit validierten Lernmodulen und ECTS-Anbindung Kunststoff-Institut Lüdenscheid Im Rahmen des ERASMUS+-Programms entwickelt ein europäisches Konsortium unter Beteiligung des Kunststoff-Instituts Lüdenscheid einen hybriden Weiterbildungskurs für die zirkuläre Kreislaufwirtschaft ... <a class=\"read-more\" href=\"https://www.avk-tv.de/circvet-qualifizierung-fuer-eine-zirkulaere-kunststoffwirtschaft-in-europa/\" title=\"CIRCVET – Qualifizierung für eine zirkuläre Kunststoffwirtschaft in Europa\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><strong>Ein hybrides EU-Ausbildungsprojekt mit validierten Lernmodulen und ECTS-Anbindung</strong></p><p><a href=\"https://kunststoff-institut.de/\">Kunststoff-Institut Lüdenscheid</a></p><p>Im Rahmen des ERASMUS+-Programms entwickelt ein europäisches Konsortium unter Beteiligung des Kunststoff-Instituts Lüdenscheid einen hybriden Weiterbildungskurs für die zirkuläre Kreislaufwirtschaft in der Kunststoffverarbeitung. Ziel ist die Etablierung standardisierter Lernmodule, die auf allen Qualifikationsniveaus anwendbar sind – von der beruflichen Erstausbildung bis zur betrieblichen Weiterbildung.</p><p><strong>Bildung für den Wandel: Europäische Lernplattform zur zirkulären Kreislaufwirtschaft in der Kunststoffverarbeitung</strong></p><p>Einblicke in ein internationales EU-Projekt zur Qualifizierung von Fachkräften für nachhaltige Produktionssysteme</p><p>Die Kunststoffindustrie steht in besonderer Verantwortung, wenn es um nachhaltige Ressourcennutzung und Umweltverträglichkeit geht. Im Rahmen des EU-Bildungsprogramms ERASMUS+ arbeitet ein internationales Konsortium an der Entwicklung von CIRCVET, einer virtuellen Lernplattform, die neue Maßstäbe in der beruflichen und akademischen Aus- und Weiterbildung zur zirkulären Kreislaufwirtschaft setzt.</p><p><strong>Projektziel: Green Skills für Europas Kunststoffbranche</strong></p><p>Das CIRCVET-Projekt verfolgt das Ziel, den bislang umfangreichsten, kostenfreien und bedarfsorientierten Ausbildungskurs zur zirkulären Kreislaufwirtschaft für die Kunststoffverarbeitung bereitzustellen. Die Lerninhalte sind maßgeschneidert auf die realen Anforderungen der Industrie und vereinen das Know-how von zwölf Partnerinstitutionen aus sechs EU-Staaten – darunter Hochschulen, Forschungszentren, Berufsbildungsstätten, Industriecluster und KMU-Vertreter.</p><p>Konkret sind vertreten: Spanien, Portugal, Frankreich, Italien, Deutschland, Litauen.</p><p>Im Zentrum steht der Aufbau sogenannter Green Skills – Kompetenzen, Werte und Einstellungen, die zur Entwicklung und Unterstützung einer nachhaltigen, ressourceneffizienten Wirtschaft erforderlich sind.</p><p><strong>Struktur und Umsetzung der Lernplattform</strong></p><p>Der modulare Kurs ist sowohl synchron (mit direkter Betreuung) als auch asynchron (im Selbststudium) verfügbar und umfasst folgende zentrale Schritte:</p><ol class=\"wp-block-list\" start=\"1\"><li>Bedarfsermittlung: Zielgruppen durchlaufen eine Analyse zur Ermittlung ihrer Vorkenntnisse und Lernbedarfe.</li>\n\n<li>Personalisierte Kurszusammenstellung: Basierend auf den Ergebnissen wird ein passender Modulkatalog zusammengestellt.</li>\n\n<li>Kursdurchführung: Die Inhalte werden über eine MOOC-basierte E-Learning-Plattform vermittelt.</li>\n\n<li>Zertifizierung: Nach erfolgreichem Abschluss aller Module erhalten Teilnehmer ein offiziell anerkanntes EU-Zertifikat.</li></ol><p>Der Kurs ist auf drei Bildungsniveaus ausgelegt:</p><p><strong>I-VET-VET – Berufsschulische Erstausbildung</strong><br />Diese Stufe richtet sich an Lernende in der beruflichen Erstausbildung – also an Auszubildende, die sich auf einen anerkannten Ausbildungsberuf vorbereiten (z. B. Verfahrensmechaniker/in Kunststofftechnik). Die Kursinhalte werden im Präsenz- oder Live-Online-Format vermittelt, d. h. in <strong>synchroner Form</strong> mit direkter Betreuung durch Ausbilder oder Lehrkräfte. Die Gesamtstundenanzahl beträgt 25 Unterrichtsstunden.</p><p><strong>I-VET-HE – Hochschulische Erstausbildung</strong><br />Dieses Kursformat richtet sich an <strong>Studierende auf Hochschulebene</strong>, insbesondere in ingenieurwissenschaftlichen oder umwelttechnischen Studiengängen. Auch hier erfolgt der Unterricht synchron, etwa durch Live-Webinare oder Präsenzveranstaltungen an Universitäten und Fachhochschulen. Der Umfang beträgt 18,75 Stunden, da Inhalte stärker komprimiert und auf akademisches Vorwissen abgestimmt sind.</p><p><strong>C-VET – Berufliche Weiterbildung für Beschäftigte</strong><br />Diese Kursvariante ist für <strong>bereits berufstätige Fachkräfte</strong> konzipiert, die ihre Kenntnisse im Bereich der Kreislaufwirtschaft vertiefen möchten – etwa Produktionsleiter, Techniker oder Nachhaltigkeitsverantwortliche. Die Module stehen im <strong>asynchronen Selbstlernformat</strong> zur Verfügung: über eine E-Learning-Plattform mit Videos, Übungen und Arbeitsmaterialien, die flexibel und zeitunabhängig bearbeitet werden können.</p><p>Thematische Schwerpunkte des Kurses sind:</p><ul class=\"wp-block-list\"><li><strong>1. Kreislaufwirtschaft &amp; systemische Strategien</strong><br />Einführung in grundlegende Konzepte der Circular Economy, einschließlich rechtlicher Rahmenbedingungen, Umsetzungsmöglichkeiten im industriellen Maßstab und strategischer Planung zur Schließung von Stoffkreisläufen.</li></ul><ul class=\"wp-block-list\"><li><strong>2. Ökodesign und Life Cycle Assessment (LCA)</strong><br />Vermittlung von Methoden zur ökologisch optimierten Produktgestaltung, Bewertung ökologischer Auswirkungen entlang des gesamten Lebenszyklus (z. B. mit LCA-Software), und Einbindung von Umweltkennzeichnungen und End-of-Life-Szenarien in das Produktdesign.</li></ul><ul class=\"wp-block-list\"><li><strong>3. Digitale Kompetenzen</strong><br />Anwendung digitaler Technologien wie Blockchain für Materialrückverfolgbarkeit, Künstliche Intelligenz zur Prozessoptimierung, IoT, Big Data, Augmented Reality und Cybersecurity – zentrale Enabler für eine intelligente und vernetzte Kreislaufwirtschaft.</li></ul><ul class=\"wp-block-list\"><li><strong>4. Recyclingprozesse und Werkstoffkreisläufe</strong><br />Vertiefung aktueller Recyclingmethoden (mechanisch, chemisch), Bewertung von Up- und Downcycling-Prozessen, Umgang mit Verbundmaterialien und Anforderungen an sortenreine Stoffströme in unterschiedlichen Industriezweigen.</li></ul><ul class=\"wp-block-list\"><li><strong>5. Fertigungsprozesse unter Nachhaltigkeitsaspekten</strong><br />Nachhaltige Gestaltung von Produktionsprozessen unter Einbeziehung recycelter, biobasierter oder biologisch abbaubarer Materialien – mit Fokus auf Wirtschaftlichkeit, Energieeffizienz und Produktqualität.</li></ul><ul class=\"wp-block-list\"><li><strong>6. Nutzerbedürfnisse und Marktmechanismen</strong><br />Analyse von Verbrauchererwartungen, Zahlungsbereitschaft für nachhaltige Produkte, Bedeutung von Ökolabels und der Kommunikation ökologischer Produktvorteile zur Förderung von Marktakzeptanz.</li></ul><ul class=\"wp-block-list\"><li><strong>7. Wertschöpfung durch Wiederverwertung</strong><br />Darstellung von Konzepten der stofflichen Verwertung, Design-for-Reuse und Demontagefähigkeit sowie Entwicklung effizienter Logistik- und Rückführungssysteme zur Integration sekundärer Rohstoffe.</li></ul><ul class=\"wp-block-list\"><li><strong>8. Unternehmertum &amp; neue Geschäftsmodelle</strong><br />Förderung von Innovationskompetenz zur Entwicklung zirkulärer Geschäftsmodelle, Technologietransfer, Start-up-Förderung und rechtliche Grundlagen geistigen Eigentums in nachhaltigkeitsorientierten Unternehmen.</li></ul><p><strong>Europäische Zusammenarbeit – lokal verankert</strong></p><p>Begleitet wird die technische Entwicklung durch regelmäßige Projekttreffen der internationalen Arbeitsgruppe. Diese Meetings werden mit Workshops vor Ort in den Partnerländern kombiniert – jeweils in enger Kooperation mit regionaler Industrie und Bildungseinrichtungen. So fließt praktisches Erfahrungswissen direkt in die Kursentwicklung ein.</p><p>Gerade in Zeiten globaler Unsicherheiten und geopolitischer Spannungen zeigt sich, wie essenziell ein starker europäischer Zusammenhalt ist. Die enge Zusammenarbeit über Ländergrenzen hinweg – wie sie in diesem Projekt gelebt wird – stärkt nicht nur den technologischen Fortschritt, sondern auch das gegenseitige Vertrauen und die Resilienz der Europäischen Union. Gemeinsame Bildungsinitiativen und der Austausch von Know-how fördern ein vereintes Europa, das in der Lage ist, globalen Herausforderungen mit einer geeinten Stimme zu begegnen und seine Werte sowie wirtschaftliche und technologische Souveränität zu behaupten.</p><p><strong>Der Validierungsprozess ist gestartet</strong></p><p>Im Februar 2025 wurde mit dem Validierungsprozess der CIRCVET-Plattform ein zentrales Projektziel erreicht. Am 19. Februar fand in Alessandria (Italien) der erste Validierungsworkshop mit Unternehmensvertretern statt. Die vorbereiteten Module des kostenfreien Schulungskurses „Circular Economy Expert in Sustainable Plastic Products“ wurden präsentiert und anhand eines Kompetenztests – insbesondere durch Fachkräfte aus dem Verpackungssektor – auf Praxistauglichkeit geprüft.</p><p>Direkt im Anschluss tagte der Lenkungsausschuss des Projekts beim Partnerunternehmen Proplast. Im Mittelpunkt der zweitägigen Sitzung standen die finalen Key Performance Indicators (KPIs), strategische Kommunikations- und Verwertungsmaßnahmen sowie ein spezifischer Workshop zur Ableitung geeigneter Verwertungsstrategien. Im Rahmen eines moderierten Brainstormings analysierten die Partner Risiken, Chancen und praxisnahe Umsetzungsmodelle zur nachhaltigen Nutzung der Projektergebnisse.</p><p>Der multidisziplinäre Austausch – über Länder-, Sprach- und Institutionengrenzen hinweg – führte zu konkreten Ansätzen zur Überwindung identifizierter Hürden.</p><p>Den Abschluss bildet im Juni 2025 ein letztes Projekttreffen, das von der Universität Las Palmas de Gran Canaria ausgerichtet wird. Dort soll entschieden werden, wie CIRCVET über die Projektlaufzeit hinaus verstetigt und in die europäische Bildungslandschaft integriert wird.</p><p>Wer über die nächsten Schritte und Events informiert bleiben möchte, kann den CIRCVET-Newsletter abonnieren.</p><p>Unter dem Link <a href=\"http://www.circvet.eu\">www.circvet.eu</a> kann sich jeder Interessierte kostenfrei für den Lehrgang registrieren und ihn absolvieren.</p><p><strong>Fazit</strong></p><p><a>Mit einem Budget von 1,9 Millionen Euro (Förderquote 80</a> %) und einer Laufzeit bis August 2025 markiert CIRCVET einen innovativen Bildungsansatz im Zeichen der Nachhaltigkeit. Das Projekt leistet nicht nur einen Beitrag zur ökologischen Transformation der Kunststoffindustrie, sondern zeigt auch, wie europäische Bildungskooperation konkret aussehen kann – praxisnah, digital und zukunftsorientiert.</p><p><strong>Projektseite: </strong><a href=\"http://www.circvet.eu\"><strong>www.circvet.eu</strong></a><strong></strong></p><p><strong>Hinweis:</strong></p><p>Das Copyright der Bilder „EU_CircVET_Partners“ sowie „circvet_Start_logo“ liegt beim Projektkonsortium. Die Bilder dürfen für Veröffentlichungen uneingeschränkt verwendet werden.</p><hr class=\"wp-block-separator has-alpha-channel-opacity\" /><p>Jetzt die gesamte Pressemeldung lesen:</p><div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\"><div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/06/PM_CircVET_Qualifizierung_fuer_eine_zirkulaere_Kunststoffkreislaufwirtschaft_in_Europa.pdf\">Pressemeldung (DE)</a></div></div>"
      }
    ]
  },
  {
    "title": "AVK-Newsticker Juni 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AVK-Newsticker Juni 2025"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/avk-newsticker-september-2024-2/"
      }
    ],
    "link": "https://www.avk-tv.de/avk-newsticker-september-2024-2/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Wed, 11 Jun 2025 05:24:03 +0000",
    "published_parsed": [
      2025,
      6,
      11,
      5,
      24,
      3,
      2,
      162,
      0
    ],
    "tags": [
      {
        "term": "News",
        "scheme": null,
        "label": null
      },
      {
        "term": "AVK e. V.",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=5421",
    "guidislink": false,
    "summary": "Jetzt lesen: https://www.avk-tv.de/downloadportal-mitglieder",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Jetzt lesen: https://www.avk-tv.de/downloadportal-mitglieder"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><strong>Jetzt lesen:</strong></p><p><a href=\"https://www.avk-tv.de/downloadportal-mitglieder\">https://www.avk-tv.de/downloadportal-mitglieder</a></p><p></p>"
      }
    ]
  },
  {
    "title": "AVK-Newsticker Juni 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AVK-Newsticker Juni 2025"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/avk-newsticker-juni-2025/"
      }
    ],
    "link": "https://www.avk-tv.de/avk-newsticker-juni-2025/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Tue, 10 Jun 2025 15:58:43 +0000",
    "published_parsed": [
      2025,
      6,
      10,
      15,
      58,
      43,
      1,
      161,
      0
    ],
    "tags": [
      {
        "term": "Downloadportal Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "AVK e. V.",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8423",
    "guidislink": false,
    "summary": "In dieser Ausgabe: AVK &#8211; Neues Seminar: Thermoplastische Composites AVK &#8211; Neues Seminar: Pultrusion 4.0 AVK &#8211; Composites Report No. 11 AVK &#8211; Neue Mitglieder EPTA &#8211; World Pultrusion Conference ... <a class=\"read-more\" href=\"https://www.avk-tv.de/avk-newsticker-juni-2025/\" title=\"AVK-Newsticker Juni 2025\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "In dieser Ausgabe: AVK &#8211; Neues Seminar: Thermoplastische Composites AVK &#8211; Neues Seminar: Pultrusion 4.0 AVK &#8211; Composites Report No. 11 AVK &#8211; Neue Mitglieder EPTA &#8211; World Pultrusion Conference ... <a class=\"read-more\" href=\"https://www.avk-tv.de/avk-newsticker-juni-2025/\" title=\"AVK-Newsticker Juni 2025\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"wp-block-group is-vertical is-layout-flex wp-container-core-group-is-layout-8cf370e7 wp-block-group-is-layout-flex\"><p><strong>In dieser Ausgabe:</strong></p>\n\n<p>AVK &#8211; Neues Seminar: Thermoplastische Composites</p>\n\n<p>AVK &#8211; Neues Seminar: Pultrusion 4.0</p>\n\n<p>AVK &#8211; Composites Report No. 11</p>\n\n<p>AVK &#8211; Neue Mitglieder</p>\n\n<p>EPTA &#8211; World Pultrusion Conference 2026 – Call for Papers</p>\n\n<p>EuCIA &#8211; Newsletter Mai</p>\n\n<p>EuCIA &#8211; Declaration of the European Circular Composites Alliance</p>\n\n<p>GKV &#8211;  Vergünstigte Eintrittskarten K 2025</p>\n\n<p>GKV &#8211; Abgeordnetenbesuche im Unternehmen planen</p>\n\n<p>GKV/FSK &#8211; CSRD – Nachhaltigkeitsberichterstattung: Fristenverschiebung</p>\n\n<p>IK &#8211; Employer Branding in der digitalen Welt</p>\n\n<p>Leichtbauwelt &#8211; Jahrbuch der Leichtbau-Inspirationen</p>\n\n<p>Kooperation &#8211; Renewable Materials Conference</p></div><hr class=\"wp-block-separator has-alpha-channel-opacity\" /><div class=\"wp-block-group is-vertical is-layout-flex wp-container-core-group-is-layout-8cf370e7 wp-block-group-is-layout-flex\"><div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\"><div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/06/03_newsticker_Juni_2025_DE.pdf\">newsticker (DE)</a></div>\n\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/06/03_newsticker_June_2025_EN.pdf\">newsticker (EN)</a></div></div></div>"
      }
    ]
  },
  {
    "title": "Wichtige deutsche Abgeordnete von CDU/CSU, FDP, Freie Wähler, SPD, B90/Die Grünen und Volt im Europäischen Parlament nach Parteien, Regionen und Ausschuss",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Wichtige deutsche Abgeordnete von CDU/CSU, FDP, Freie Wähler, SPD, B90/Die Grünen und Volt im Europäischen Parlament nach Parteien, Regionen und Ausschuss"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/wichtige-deutsche-abgeordnete-von-cdu-csu-fdp-freie-waehler-spd-b90-die-gruenen-und-volt-im-europaeischen-parlament-nach-parteien-regionen-und-ausschuss/"
      }
    ],
    "link": "https://www.avk-tv.de/wichtige-deutsche-abgeordnete-von-cdu-csu-fdp-freie-waehler-spd-b90-die-gruenen-und-volt-im-europaeischen-parlament-nach-parteien-regionen-und-ausschuss/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Tue, 10 Jun 2025 12:28:20 +0000",
    "published_parsed": [
      2025,
      6,
      10,
      12,
      28,
      20,
      1,
      161,
      0
    ],
    "tags": [
      {
        "term": "Downloadportal Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Gesamtverband Kunststoffverarbeitende Industrie e.V. (GKV)",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8415",
    "guidislink": false,
    "summary": "Stand: 14. April 2025)",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Stand: 14. April 2025)"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Stand: 14. April 2025)</p><div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\"><div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/06/250414_Wichtige-Abgeordnete-im-Europaeischen-Parlament-nach-Ausschuessen_GKV.pdf\">Download</a></div></div>"
      }
    ]
  },
  {
    "title": "Abgeordnetenbesuche im Unternehmen professionell plannen",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Abgeordnetenbesuche im Unternehmen professionell plannen"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/abgeordnetenbesuche-im-unternehmen-professionell-plannen/"
      }
    ],
    "link": "https://www.avk-tv.de/abgeordnetenbesuche-im-unternehmen-professionell-plannen/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Tue, 10 Jun 2025 12:26:54 +0000",
    "published_parsed": [
      2025,
      6,
      10,
      12,
      26,
      54,
      1,
      161,
      0
    ],
    "tags": [
      {
        "term": "Downloadportal Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Gesamtverband Kunststoffverarbeitende Industrie e.V. (GKV)",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8411",
    "guidislink": false,
    "summary": "Handreichung für Unternehmen",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Handreichung für Unternehmen"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Handreichung für Unternehmen</p><div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\"><div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/06/250527_GKV_ABGEORDNETENBESUCHE-IM-UNTERNEHMEN-PROFESSIONELL-PLANEN.pdf\">Download</a></div></div>"
      }
    ]
  },
  {
    "title": "Wichtige Abgeordnete von CDU/CSU, SPD und Bündnis 90/Die Grünen im deutschen Bundestag nach Wahlkreisen",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Wichtige Abgeordnete von CDU/CSU, SPD und Bündnis 90/Die Grünen im deutschen Bundestag nach Wahlkreisen"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/wichtige-abgeordnete-von-cdu-csu-spd-und-buendnis-90-die-gruenen-im-deutschen-bundestag-nach-wahlkreisen/"
      }
    ],
    "link": "https://www.avk-tv.de/wichtige-abgeordnete-von-cdu-csu-spd-und-buendnis-90-die-gruenen-im-deutschen-bundestag-nach-wahlkreisen/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Tue, 10 Jun 2025 12:24:36 +0000",
    "published_parsed": [
      2025,
      6,
      10,
      12,
      24,
      36,
      1,
      161,
      0
    ],
    "tags": [
      {
        "term": "Downloadportal Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Gesamtverband Kunststoffverarbeitende Industrie e.V. (GKV)",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8407",
    "guidislink": false,
    "summary": "Stand: 26.5.2025",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Stand: 26.5.2025"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Stand: 26.5.2025</p><div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\"><div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/06/250527_Wichtige-Abgeordnete-im-21.-Bundestag.pdf\">Download</a></div></div>"
      }
    ]
  },
  {
    "title": "SKZ ist erstes offiziell ausgezeichnetes Partnerlabor von ZwickRoell",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SKZ ist erstes offiziell ausgezeichnetes Partnerlabor von ZwickRoell"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/skz-ist-erstes-offiziell-ausgezeichnetes-partnerlabor-von-zwickroell/"
      }
    ],
    "link": "https://www.avk-tv.de/skz-ist-erstes-offiziell-ausgezeichnetes-partnerlabor-von-zwickroell/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Fri, 06 Jun 2025 07:00:08 +0000",
    "published_parsed": [
      2025,
      6,
      6,
      7,
      0,
      8,
      4,
      157,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "SKZ – Das Kunststoff-Zentrum",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8382",
    "guidislink": false,
    "summary": "Gemeinsam die Zukunft der Kunststoffprüfung gestalten SKZ &#8211; Das Kunststoff-Zentrum Die langjährige Zusammenarbeit mit dem führenden Prüftechnikhersteller wird auf eine neue Stufe gehoben und durch modernste Technologie weiter ausgebaut. Mit ... <a class=\"read-more\" href=\"https://www.avk-tv.de/skz-ist-erstes-offiziell-ausgezeichnetes-partnerlabor-von-zwickroell/\" title=\"SKZ ist erstes offiziell ausgezeichnetes Partnerlabor von ZwickRoell\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Gemeinsam die Zukunft der Kunststoffprüfung gestalten SKZ &#8211; Das Kunststoff-Zentrum Die langjährige Zusammenarbeit mit dem führenden Prüftechnikhersteller wird auf eine neue Stufe gehoben und durch modernste Technologie weiter ausgebaut. Mit ... <a class=\"read-more\" href=\"https://www.avk-tv.de/skz-ist-erstes-offiziell-ausgezeichnetes-partnerlabor-von-zwickroell/\" title=\"SKZ ist erstes offiziell ausgezeichnetes Partnerlabor von ZwickRoell\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><strong>Gemeinsam die Zukunft der Kunststoffprüfung gestalten</strong></p><p><a href=\"https://www.skz.de/\">SKZ &#8211; Das Kunststoff-Zentrum</a></p><h6 class=\"wp-block-heading\"><em><strong>Die langjährige Zusammenarbeit mit dem führenden Prüftechnikhersteller wird auf eine neue Stufe gehoben und durch modernste Technologie weiter ausgebaut. Mit dem innovativen CRB-Test und der LTM-Prüfmaschine setzt das SKZ neue Maßstäbe in der Kunststoffprüfung – präzise, nachhaltig und zukunftsweisend.</strong></em><strong><em><br /></em></strong><em><br /></em>Im Rahmen der ZwickRoell Roadshow 2025 machte der beeindruckende Showtruck Halt in Würzburg – ein besonderer Moment für das SKZ. Mit im Gepäck war eine besondere Auszeichnung: das SKZ wurde offiziell zum ersten Partnerlabor von ZwickRoell ernannt.<br /><br />Seit vielen Jahren setzt das SKZ auf die zuverlässige Prüf- und Messtechnik von ZwickRoell. Die nun geschlossene Partnerschaft hebt diese erfolgreiche Zusammenarbeit auf ein neues Niveau. Als zertifiziertes Partnerlabor nutzt das SKZ eine Vielzahl modernster Systeme des renommierten Herstellers – für präzise, belastbare und nachvollziehbare Prüfergebnisse im Sinne einer zukunftsorientierten Qualitätssicherung.<br /><br /><strong>Gemeinsam die Zukunft der Kunststoffprüfung gestalten</strong><br />„Diese Auszeichnung ist nicht nur eine Bestätigung für unsere langjährige Partnerschaft, sondern auch ein Ansporn, gemeinsam die Zukunft der Kunststoffprüfung aktiv zu gestalten“, freut sich Dr. Marcus Heindl, Bereichsleiter Prüflabor und ergänzt: „Ein herzliches Dankeschön an ZwickRoell für das entgegengebrachte Vertrauen – wir freuen uns auf viele weitere gemeinsame Projekte.&#8220;<br /><br /><strong>CRB-Test: Neue Maßstäbe in der PE-Prüfung</strong><br />Ein herausragendes Beispiel für die enge technische Zusammenarbeit ist die Entwicklung einer gemeinsamen Fallstudie zum Cracked Round Bar (CRB)-Test nach ISO 18489.<br /><br />Während bisherige Verfahren wie der Full Notch Creep Test (FNCT) oder der Pennsylvania Edge Notch Tensile Test (PENT) als Industriestandard galten, offenbaren sie in der Praxis mehrere Nachteile. Diese klassischen Methoden sind oft zeitaufwändig, ökologisch bedenklich – insbesondere, wenn kritische Chemikalien zum Einsatz kommen – und in ihrer Aussagekraft für moderne PE 100-RC-Materialien nicht immer ausreichend.<br /><br /><strong>Der CRB-Test hingegen bietet eine Reihe klarer Vorteile:</strong><br />Er ist nach ISO 18489 international standardisiert, liefert signifikant schnellere Ergebnisse, kommt vollständig ohne den Einsatz von Netzmitteln aus und ermöglicht deutlich präzisere Aussagen zur tatsächlichen Materialperformance unter realen Einsatzbedingungen.<br /><br />Das SKZ zählt zu den ersten Laboren in Deutschland, die für die Durchführung des CRB-Tests durch die Deutsche Akkreditierungsstelle (DAkkS) offiziell akkreditiert wurden – ein weiterer Meilenstein auf dem Weg zu höchster Qualität und Verlässlichkeit in der Kunststoffprüfung.<br /><br /><strong>Warum das SKZ auf die LTM-Prüfmaschine von ZwickRoell setzt</strong><br />Am SKZ wird der CRB-Test bereits erfolgreich mit der elektrodynamischen Prüfmaschine LTM von ZwickRoell durchgeführt. Die Entscheidung für dieses System fiel aus mehreren überzeugenden Gründen:<br /><br />Die LTM-Prüfmaschine arbeitet vollständig elektrodynamisch, wodurch aufwendige hydraulische Komponenten überflüssig werden. Sie ermöglicht Prüfungen mit hoher Frequenz bei gleichzeitig minimalem Wartungsaufwand. Dank des geschlossenen Aufbaus ist zudem keine zusätzliche Klimakammer erforderlich, was den Betrieb deutlich vereinfacht.<br /><br />Ein weiterer Vorteil liegt in der intuitiven Bedienbarkeit: Die Steuerung erfolgt über die leistungsstarke testXpert®-Software von ZwickRoell, die nach dem Prinzip „Plug &amp; Play“ funktioniert und so eine schnelle Inbetriebnahme sowie effiziente Prozessabläufe ermöglicht.<br /><br /><strong>Fazit: Effizient, nachhaltig, zukunftssicher</strong><br />Mit dem CRB-Test und der innovativen LTM-Prüftechnologie setzt das SKZ neue Maßstäbe in der Kunststoffprüfung – effizient, nachhaltig und technologisch auf dem neuesten Stand. Die Partnerschaft mit ZwickRoell ist ein starkes Zeichen für gelebte Innovation und unterstreicht den Anspruch des SKZ, als führendes Kompetenzzentrum die Qualitätsstandards der Branche aktiv mitzugestalten.<br /><br /><strong><a href=\"https://www.zwickroell.com/news-events/case-studies/skz-testing/?utm_source=linkedin&amp;utm_medium=post&amp;utm_campaign=case-study&amp;utm_content=skz\"><strong>Die vollständige Case Study mit Video</strong></a></strong></h6>"
      }
    ]
  }
]