[
  {
    "published": "Wed, 24 Sep 2025 12:48:27 -0400",
    "published_parsed": [
      2025,
      9,
      24,
      16,
      48,
      27,
      2,
      267,
      0
    ],
    "title": "Midnight eVTOL aircraft reaches highest altitude flight to date",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Midnight eVTOL aircraft reaches highest altitude flight to date"
    },
    "summary": "Altitudes of 7,000 feet surpass the aircraft&rsquo;s intended operational altitudes of up to 4,000 feet, marking the flexibility of the platform.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Altitudes of 7,000 feet surpass the aircraft&rsquo;s intended operational altitudes of up to 4,000 feet, marking the flexibility of the platform."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-archer-midnight-flight-milestone.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Pilot flying aircraft.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-archer-midnight-flight-milestone.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Archer Aviation</p>\n</div>\n\n<p>On Sept. 22, <a href=\"https://news.archer.com/\" target=\"_blank\">Archer Aviation</a>&rsquo;s (Santa Clara, Calif., U.S.) <em>Midnight</em> aircraft successfully completed its&nbsp;highest altitude flight to date, reaching altitudes of 7,000 feet. The flight took off from Archer&rsquo;s test facility in Salinas, and represents the latest milestone in <em>Midnight</em>&rsquo;s envelope expansion testing program.</p>\n\n<p>This flight marked one in a series of upcoming aircraft performance test flights designed to test and showcase <em>Midnight</em>&rsquo;s operational range &mdash; electric vertical takeoff and landing (eVTOL) aircraft, like <em>Midnight</em>, are primarily intended to operate in and around cities at altitudes between 1,500 and 4,000 feet. However, having the operational capability to operate at higher altitudes provides flexibility for managing air traffic in high-density environments and enables these aircraft to be able to operate in certain cities at elevation.</p>\n\n<p>During this flight, <em>Midnight</em>&rsquo;s test pilot conducted a steady climb after takeoff, leveled off at altitude, then continued to fly for 45 miles in total at speeds in excess of 120 miles per hour. The achievement follows <a href=\"https://www.compositesworld.com/news/archer-completes-longest-flight-for-piloted-midnight-aircraft\" target=\"_blank\">August&rsquo;s&nbsp;record-setting flight</a>&nbsp;in which the aircraft covered approximately 55 miles in 31 minutes at speeds exceeding 126 miles per hour.</p>\n\n<p>Test pilots will continue to safely and methodically test <em>Midnight</em>&rsquo;s speed, duration and mission profiles to prepare for early commercial operations.</p>\n\n<div class=\"article_sidebar\">\n<h3>Acceleration updates</h3>\n\n<p>On Sept. 12, Archer said it is aiming to participate in the newly established eVTOL Integration Pilot Program (eIPP) alongside U.S. airlines, including&nbsp; United Airlines, and interested cities. This is the first federal initiative designed specifically to accelerate real-world electric air taxi operations in the U.S.</p>\n\n<p>The trials are expected to focus on demonstrating that eVTOL operations are safe, quiet and scalable &mdash; key factors in building community trust and support for adoption of this new technology.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/midnight-evtol-aircraft-reaches-highest-altitude-flight-to-date"
      }
    ],
    "link": "https://www.compositesworld.com/news/midnight-evtol-aircraft-reaches-highest-altitude-flight-to-date"
  },
  {
    "published": "Wed, 24 Sep 2025 11:36:27 -0400",
    "published_parsed": [
      2025,
      9,
      24,
      15,
      36,
      27,
      2,
      267,
      0
    ],
    "title": "CEAD, RusselSmith to bring LFAM to Africa in localization efforts",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CEAD, RusselSmith to bring LFAM to Africa in localization efforts"
    },
    "summary": "Collaborative efforts will&nbsp;help businesses across West Africa improve uptime, reliability and supply chain efficiency while reducing environmental impact.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaborative efforts will&nbsp;help businesses across West Africa improve uptime, reliability and supply chain efficiency while reducing environmental impact."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-cead-russelsmith.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CEAD and RusselSmith.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-cead-russelsmith.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | CEAD B.V.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/cead-bv\" target=\"_blank\">CEAD&nbsp;B.V.</a>&nbsp;(Delft, Netherlands) is forming a strategic collaboration with <a href=\"https://russelsmithgroup.com/\" target=\"_blank\">RusselSmith</a>&nbsp;(Lagos, Nigeria), an ISO-certified provider of innovative asset integrity and advanced manufacturing solutions for critical industries in Africa.</p>\n\n<p>Through this partnership, CEAD and RusselSmith will introduce large-scale additive manufacturing (LFAM) technologies to African markets, enabling new opportunities for local supply chain development, rapid prototyping&nbsp;and manufacturing localization across industries such as energy, maritime&nbsp;and construction.</p>\n\n<p>This marks the second CEAD system to be installed on the African continent, reinforcing the company&rsquo;s commitment to supporting innovation, localized production&nbsp;and industrial growth across the region. RusselSmith is set to initiate its journey into LFAM with the implementation of a CEAD Flexcube 3D printing and three-axis machining solution, to be used to produce end-use parts across multiple industries &mdash; including maritime, additive construction, energy&nbsp;and tooling applications&nbsp;&mdash; supporting&nbsp;clients in manufacturing replacement parts, tooling&nbsp;and bespoke components locally.</p>\n\n<p>Under the agreement, RusselSmith has been appointed CEAD&rsquo;s exclusive regional implementation partner for LFAM&nbsp;systems in designated West African territories. The collaboration encompasses technology deployment, with CEAD advising on equipment specifications and providing training, technical support&nbsp;and material adaptation guidance. RusselSmith will apply LFAM in marine, defense&nbsp;and construction sectors, supported by new manufacturing facilities it will construct and operate. Together, the companies will promote LFAM capabilities across West Africa and jointly evaluate local material supply chains. CEAD will serve as a technological advisor throughout the collaboration.</p>\n\n<p>CEAD&rsquo;s systems, based on in-house developed LFAM extrusion technology, including the robot-based Flexbot and cartesian-style Flexcube, seamlessly integrate software, large-format 3D printing and advanced postprocessing technologies, such as milling. This enables end users to efficiently produce high-quality, fiber-reinforced thermoplastic parts with greater&nbsp;strength and durability</p>\n\n<p>&ldquo;Our partnership with CEAD is a step forward for RusselSmith and brings real value to the industries we serve. By integrating LFAM into our existing capabilities, we are better positioned to support key sectors with more innovative, sustainable and localized manufacturing solutions that deliver shorter lead times, reduced logistics costs&nbsp;and stronger local supply chains,&rdquo; says&nbsp;Kayode Adeleke, CEO of RusselSmith. &ldquo;RusselSmith and CEAD share a common vision in promoting the adoption of LFAM and this collaboration reflects our strong commitment to building more resilient industries and creating lasting value across Africa.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cead-russelsmith-to-bring-lfam-to-africa-in-localization-efforts"
      }
    ],
    "link": "https://www.compositesworld.com/news/cead-russelsmith-to-bring-lfam-to-africa-in-localization-efforts"
  },
  {
    "published": "Wed, 24 Sep 2025 10:53:11 -0400",
    "published_parsed": [
      2025,
      9,
      24,
      14,
      53,
      11,
      2,
      267,
      0
    ],
    "title": "REFRESH wind blade recycling data shows promising environmental benefits",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "REFRESH wind blade recycling data shows promising environmental benefits"
    },
    "summary": "Initial LCA processing carbon and glass fibers evaluates mechanical and thermal recycling methods, finds&nbsp;environmental reduction impact surpasses the impact associated with&nbsp;the&nbsp;recycling processes themselves.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Initial LCA processing carbon and glass fibers evaluates mechanical and thermal recycling methods, finds&nbsp;environmental reduction impact surpasses the impact associated with&nbsp;the&nbsp;recycling processes themselves."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-refresh-project-wind-turbine.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Wind turbine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-refresh-project-wind-turbine.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Jason Bickley</p>\n</div>\n\n<p>In an update on the&nbsp;EU-funded REFRESH project <a href=\"https://www.compositesworld.com/news/eucia-participates-in-eu-funded-refresh-wind-blade-recycling-project\" target=\"_blank\">launched</a> in 2023, its consortium has&nbsp;published promising results from the initial life cycle assessment (LCA) of the project&rsquo;s processes for recycling glass&nbsp;and carbon fiber-reinforced composites from end-of-life (EOL) wind turbine blades. The analysis highlights significant environmental benefits for the REFRESH mechanical recycling and thermal recycling processes compared to traditional disposal methods, including a reduction in climate change impacts of &gt;70% for the thermal processes compared to incineration.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div>\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-refresh-fig1-updated.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-refresh-fig1-updated.png;maxWidth=385\" /></a></div>\n</div>\n\n<p><strong>Figure 1.</strong>&nbsp;GWP impact and savings from mechanical recycling&nbsp;show the positive contribution to environmental sustainability. Source (All Figures) | REFRESH project</p>\n</div>\n</div>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-refresh-fig2-updated.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-refresh-fig2-updated.png;maxWidth=385\" /></a></div>\n</div>\n\n<p><strong>Figure 2.&nbsp;</strong>GWP impact and savings from microwave-assisted pyrolysis (MW-pyrolysis).</p>\n</div>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-refresh-fig3-updated.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-refresh-fig3-updated.png;maxWidth=385\" /></a></div>\n</div>\n\n<p><strong>Figure 3.&nbsp;</strong>GWP impact and savings from thermal recycling (pyrolysis) highlights&nbsp;the clear environmental benefits of using recycled fibers.</p>\n</div>\n</div>\n</div>\n</div>\n\n<p>The evaluation of advanced recycling techniques, including microwave-&nbsp; &nbsp;assisted pyrolysis, remain under-explored in existing environmental assessments. This study, based on high-quality primary and experimental data sourced from the project&rsquo;s partners, provides a comprehensive and data-driven assessment of innovative recycling processes for composites derived from EOL blades, a topic of increasing importance in the transition to a circular economy. The study included a detailed hotspot analysis, providing actionable insights for reducing environmental impacts across different process phases.</p>\n\n<p>Conducted by the project&rsquo;s coordinator&nbsp;Rina&nbsp;Consulting (Genova, Italy) in the initial&nbsp;phase of the project, the analysis followed ISO 14040 and 14044 standards. The functional unit for the analysis was defined as the recycling of 1 ton of EOL wind turbine blades, and covered REFRESH&rsquo;s&nbsp;three main recycling processes: mechanical recycling&nbsp;and two thermal processes, pyrolysis and microwave-assisted pyrolysis (MW-pyrolysis).</p>\n\n<p>Calculations were performed using the GaBi LCA for Expert software. The study focused on three main impact categories: climate change,&nbsp;resource use (fossils)&nbsp;and resource use (minerals and metals). The characterization method used was the Environmental Footprint (EF) 3.1 method, which is aligned with the latest standards and EU recommendations.</p>\n\n<p>Overall, the comprehensive LCA provided&nbsp;a thorough evaluation of the environmental impacts across the entire lifespan of the recycling processes.&nbsp;<br />\nMechanical recycling demonstrated a 2% reduction in environmental impact compared to landfilling. Despite the relatively low percentage reduction, it is important to highlight the generation of secondary raw materials through the recycling process.</p>\n\n<p>The thermal recycling processes, pyrolysis and microwave-assisted pyrolysis, demonstrated a 71% and 72% reduction in climate change impact, respectively, compared to incineration. This highlights the potential of these processes for significantly reducing greenhouse gas emissions.</p>\n\n<p>The study also revealed that the environmental benefits of using recycled fibers in relevant industries (for example, lightweight structures and&nbsp;textiles) as secondary raw materials, were significantly greater than the impacts associated with the recycling processes themselves. This means that although recycling involves energy consumption and emissions, avoiding the impacts associated with production of virgin fibers (which is typically energy-intensive and resource-demanding) results in a net environmental gain. Therefore, substituting virgin materials with recycled fibers represents a significantly more sustainable option.</p>\n\n<p>All three recycling processes demonstrate significant environmental benefits compared to the impact of the recycling process itself. Figures 1, 2 and 3 show the global warming potential (GWP) benefits offered by the mechanical recycling and thermal recycling processes.</p>\n\n<p>This initial LCA analysis indicates that the REFRESH recycling processes have the potential to significantly reduce environmental impacts compared to traditional disposal methods. The environmental benefits of using recycled materials further support the project&rsquo;s goals of promoting circular economy practices and reducing reliance on virgin materials. Next steps involve optimizing these&nbsp;processes, assessing the final use of the recycled materials and conducting an economic and social assessment to maximize REFRESH&rsquo;s sustainability potential.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/refresh-wind-blade-recycling-data-shows-promising-environmental-benefits"
      }
    ],
    "link": "https://www.compositesworld.com/news/refresh-wind-blade-recycling-data-shows-promising-environmental-benefits"
  },
  {
    "published": "Mon, 22 Sep 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      22,
      17,
      0,
      0,
      0,
      265,
      0
    ],
    "title": "LIME project to develop hybrid-electric aircraft battery system with composite casing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "LIME project to develop hybrid-electric aircraft battery system with composite casing"
    },
    "summary": "Airbus, ATR and Daher are supporting the 2026 Clean Aviation project led by Exoes, which will design a safety- and user-centric TLR 4 battery concept meeting CS-23&nbsp;and&nbsp;CS-25&nbsp;certification standards.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Airbus, ATR and Daher are supporting the 2026 Clean Aviation project led by Exoes, which will design a safety- and user-centric TLR 4 battery concept meeting CS-23&nbsp;and&nbsp;CS-25&nbsp;certification standards."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-aircraft-wing-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> </a><source media=\"(min - width: 1000px)\" /><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-aircraft-wing-gettyimages1.jpg\" target=\"_blank\"> </a><source media=\"(min - width: 401px) and (max-width: 1000px)\" /><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-aircraft-wing-gettyimages1.jpg\" target=\"_blank\"> </a><source media=\"(max-width: 400px)\" /><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-aircraft-wing-gettyimages1.jpg\" target=\"_blank\"> <!--[if IE 9]></video><![endif]--> <img alt=\"Airplane wing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-aircraft-wing-gettyimages1.jpg;maxWidth=720\" /></a></div>\n\n<p>Source | Getty Images&nbsp;</p>\n</div>\n\n<p>On Sept. 10, the European project&nbsp;Lithium-based Innovation for Modular Energy (LIME)&nbsp;officially launched under the <a href=\"https://www.compositesworld.com/news/clean-aviation-third-call-selects-12-projects-starting-in-2026-delivers-945-million-total-funding\" target=\"_blank\">umbrella of Europe&rsquo;s&nbsp;Clean Aviation&nbsp;program</a>, with a &euro;5 million grant awarded to the consortium led by&nbsp;Exoes,&nbsp;Ascendance Flight Technologies,&nbsp;Basquevolt&nbsp;and&nbsp;RWTH Aachen University. This recognition reflects strong support from major aircraft manufacturers including&nbsp;Airbus,&nbsp;ATR&nbsp;and&nbsp;Daher.</p>\n\n<p>The LIME project aims to develop a next-generation battery system for an&nbsp;ultra-efficient hybrid-electric aircraft concept. The system will be designed to meet&nbsp;CS-23&nbsp;and&nbsp;CS-25&nbsp;certification standards, with a focus on safety, modularity and integration&nbsp;into future hybrid-electric propulsion architectures. This initiative is part of Clean Aviation&rsquo;s broader mission to accelerate the&nbsp;decarbonization of air transport&nbsp;and contribute to the EU&rsquo;s climate goals.</p>\n\n<p>The project addresses six key objectives for the aerospace industry:&nbsp;</p>\n\n<ul>\n\t<li><em>Safety and end-user-centric design</em>: Design a battery system that meets stringent certification standards and user requirements for aviation, especially CS25 applications.&nbsp;</li>\n\t<li><em>Disruptive battery innovation:</em> Push&nbsp;the boundaries of current technology with a battery system surpassing existing capabilities in cell technology, thermal management&nbsp;and composite casing.</li>\n\t<li><em>TRL 4 prototyping</em>: Manufacture and test a TRL 4 prototype including cell blocks, battery management&nbsp;and thermal systems, followed by ground demonstrations.</li>\n\t<li><em>Digital twin agility</em>: Use high-fidelity digital twins to optimize development, reduce costs&nbsp;and minimize physical prototyping, ensuring rapid design validation.&nbsp;</li>\n\t<li><em>Roadmap to entry into service</em>: Support integration studies and create an industrialization plan to prepare the battery system for service in regional aircraft, specifically targeting the ATR 42/72 for entry into service by 2035.&nbsp;</li>\n\t<li><em>Maximize European impact</em>: Advance critical aviation technology to benefit European society, economy&nbsp;and competitiveness by disseminating research and results widely.</li>\n</ul>\n\n<p>Exoes&nbsp;(Gradignan), a French company specializing in&nbsp;high-voltage battery systems,&nbsp;thermal management&nbsp;and&nbsp;hazardous testing, is responsible for the&nbsp;design, prototyping&nbsp;and testing&nbsp;of the cell blocks. The company brings its expertise in&nbsp;high-performance battery and cooling technologies&nbsp;and&nbsp;system integration&nbsp;to ensure performance, safety&nbsp;and certification readiness.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/lime-project-to-develop-hybrid-electric-aircraft-battery-system-with-composite-casing"
      }
    ],
    "link": "https://www.compositesworld.com/news/lime-project-to-develop-hybrid-electric-aircraft-battery-system-with-composite-casing"
  },
  {
    "published": "Mon, 22 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      22,
      16,
      0,
      0,
      0,
      265,
      0
    ],
    "title": "Gen 2 Carbon, Americarb launch rCF strategy for clean energy",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Gen 2 Carbon, Americarb launch rCF strategy for clean energy"
    },
    "summary": "Combined expertise unlocks novel applications for rCF&nbsp;in batteries, fuel cells, electrolyzers and structural energy storage.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Combined expertise unlocks novel applications for rCF&nbsp;in batteries, fuel cells, electrolyzers and structural energy storage."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0225-cw-news-paper-signing-GettyImages1.jpg\" target=\"_blank\"><img alt=\"Stock image of paper signing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0225-cw-news-paper-signing-GettyImages1.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gen-2-carbon\" target=\"_blank\">Gen 2 Carbon</a>&nbsp;(Coseley, U.K.) and&nbsp;<a href=\"https://www.americarb.com/\" target=\"_blank\">Americarb</a>&nbsp;(Niagara Falls, N.Y., U.S.) have announced a&nbsp;strategic partnership to accelerate the development and commercialization of recycled carbon fiber&nbsp;(rCF) materials for clean energy technologies. This cross-Atlantic collaboration aims to transform waste carbon fiber&nbsp;into high-performance products that directly support the global transition to a circular, net-zero economy.</p>\n\n<p>Gen 2 Carbon specializes in collecting, recycling&nbsp;and converting carbon fiber-reinforced polymer (CFRP) waste into high-quality nonwoven intermediates and recycled fibers. Americarb&rsquo;s capabilities lie in fiber&nbsp;impregnation, curing&nbsp;and heat treatment to produce engineered products &mdash; including electrodes, gas diffusion layers&nbsp;and bipolar plates &mdash; for advanced energy storage and conversion. Together, the companies will&nbsp;repurpose difficult-to-recycle CFRP&nbsp;waste into advanced components and establish a fully integrated supply chain for rCF-based products, reducing reliance on virgin carbon fiber&nbsp;and lowering raw material costs and carbon footprint.</p>\n\n<p>The partnership will deliver integrated solutions for clean energy sector needs, targeting:</p>\n\n<ul>\n\t<li>Lithium-ion batteries (rCF as a cost-effective, partial replacement for synthetic graphite anodes)</li>\n\t<li>Flow and metal-air batteries (rCF felts as high-performance, freestanding electrodes)</li>\n\t<li>Fuel cells and&nbsp;electrolyzers (rCF nonwovens and composites for efficient gas diffusion layers and dense bipolar plates)</li>\n\t<li>Structural power (multifunctional rCF composites capable of storing energy while bearing mechanical loads).</li>\n</ul>\n\n<p>According to Gen 2 Carbon and Americarb, commercial users &mdash; including battery, fuel cell&nbsp;and electrolyzer manufacturers &mdash; will benefit from 20-30% cost savings compared to virgin fiber alternatives; matching or exceeding performance in demanding energy applications; up to 95% lower carbon footprint (based on life cycle analysis); and enhanced supply chain resilience by leveraging abundant domestic CFRP waste.</p>\n\n<p>This approach also targets the acceleration of&nbsp;green hydrogen deployment and adoption, transportation electrification, renewables&nbsp;integration into modern grids and circular economy practices that turn industry waste into strategic resources.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gen-2-carbon-americarb-launch-rcf-strategy-for-clean-energy"
      }
    ],
    "link": "https://www.compositesworld.com/news/gen-2-carbon-americarb-launch-rcf-strategy-for-clean-energy"
  },
  {
    "published": "Mon, 22 Sep 2025 11:45:09 -0400",
    "published_parsed": [
      2025,
      9,
      22,
      15,
      45,
      9,
      0,
      265,
      0
    ],
    "title": "Market report: Composites and carbon fiber in hydrogen storage",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Market report: Composites and carbon fiber in hydrogen storage"
    },
    "summary": "This first-of-its-kind technical report from&nbsp;CompositesWorld breaks down the key economic and engineering variables influencing carbon fiber composite tanks for hydrogen-powered mobility.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "This first-of-its-kind technical report from&nbsp;CompositesWorld breaks down the key economic and engineering variables influencing carbon fiber composite tanks for hydrogen-powered mobility."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": ""
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/market-report-composites-and-carbon-fiber-in-hydrogen-storage"
      }
    ],
    "link": "https://www.compositesworld.com/news/market-report-composites-and-carbon-fiber-in-hydrogen-storage"
  },
  {
    "published": "Mon, 22 Sep 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      22,
      15,
      30,
      0,
      0,
      265,
      0
    ],
    "title": "Private equity firm Iron Path invests in Gougeon Brothers Inc.",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Private equity firm Iron Path invests in Gougeon Brothers Inc."
    },
    "summary": "This marks the&nbsp;first investment in Iron Path Capital&rsquo;s&nbsp;advanced materials platform, accelerating growth of Gougeon&rsquo;s epoxy resin systems while preserving the company&rsquo;s culture, technical leadership and quality.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "This marks the&nbsp;first investment in Iron Path Capital&rsquo;s&nbsp;advanced materials platform, accelerating growth of Gougeon&rsquo;s epoxy resin systems while preserving the company&rsquo;s culture, technical leadership and quality."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-business-partnership-gettyimages1.jpg\" target=\"_blank\"><img alt=\"Business partnership.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-business-partnership-gettyimages1.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://ironpathcapital.com/\" target=\"_blank\">Iron Path&nbsp;Capital</a> (Charlottesville, Va., U.S.), a&nbsp;private equity firm focused on&nbsp;<span style=\"font-size: 1.1rem; letter-spacing: 0.008em;\">healthcare and specialty </span>industrials<span style=\"font-size: 1.1rem; letter-spacing: 0.008em;\">, has announced a growth partnership with <a href=\"https://gougeon.com/\" target=\"_blank\">Gougeon Brothers Inc.</a>&nbsp;(Bay City, Mich., U.S.) an epoxy manufacturer in the composites and marine end markets.</span></p>\n\n<p>&ldquo;We are partnering with the Gougeon management team to develop and grow their West System, Pro-Set and Entropy Resins&nbsp;epoxy resin systems for making and repairing composite structures,&rdquo; says&nbsp;Ted Clark, partner at Iron Path Capital. &ldquo;Gougeon has a long and storied history as a pioneer and innovator in advanced composite epoxy resin systems for both repair and use in OEM composite parts manufacturing. We will continue to build the business through organic and inorganic opportunities in the fast-growing composite materials market.&rdquo;</p>\n\n<p>Family-owned since 1969, Gougeon formulates and manufactures epoxy systems for various applications in the marine, recreational, automotive, aerospace&nbsp;and industrial composites markets. The company is committed to customer service and technical support in ensuring customers&rsquo; effective use of its products. Its in-house chemists develop tailored solutions for each application, ensuring quality and performance through their high strength and optimal handling characteristics.</p>\n\n<p>The company&rsquo;s history is rooted in boatbuilding with the Gougeon brothers developing the use of epoxy resin systems in boat construction. In addition to formulating and manufacturing products, Gougeon is known for its instructional magazine and online forum, <a href=\"https://www.epoxyworks.com/\" target=\"_blank\">Epoxywork</a>, its book, &ldquo;<a href=\"https://www.westsystem.com/instruction/the-gougeon-brothers-on-boat-construction-book/\" target=\"_blank\">The Gougeon Brothers on Boat Construction</a>,&rdquo; and&nbsp;seminars and training sessions including the &ldquo;<a href=\"https://www.westsystem.com/boat-repair-workshops/\" target=\"_blank\">Glue-U</a>&rdquo; seminar for boat repair.</p>\n\n<p>Gougeon CEO Alan Gurski notes that the company chose Iron Path as &ldquo;they share our&nbsp;entrepreneurial spirit, and our commitment to each other, our community, our customers&nbsp;and to manufacturing the finest products for our markets.&rdquo;</p>\n\n<p>Ted Clark will serve as executive chairman of Gougeon as part of the new advanced materials platform. Clark is an experienced operator in formulated coatings, adhesives and sealants, as well as in composites. He previously led Royal Adhesives &amp; Sealants as president and CEO from 2003-2017, which was acquired by H.B. Fuller. Post-acquisition, Clark served as senior VP, Royal Adhesives, then as executive VP and COO of H.B. Fuller before joining Iron Path Capital as a partner in 2022. Earlier in his career, Clark also served as president and CEO of PRC-DeSoto International, a producer of coatings and sealants for aircraft.</p>\n\n<p>This marks the fifth platform in Iron Path&rsquo;s main strategy. From day one, Iron Path Capital says it works hand-in-hand with management teams to add value through its blend of Wall Street capability and Main Street authenticity.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/private-equity-firm-iron-path-invests-in-gougeon-brothers-inc"
      }
    ],
    "link": "https://www.compositesworld.com/news/private-equity-firm-iron-path-invests-in-gougeon-brothers-inc"
  },
  {
    "published": "Mon, 22 Sep 2025 10:51:28 -0400",
    "published_parsed": [
      2025,
      9,
      22,
      14,
      51,
      28,
      0,
      265,
      0
    ],
    "title": "MSP CNC metrology cuts Leonardo tiltrotor blade production time from 20 weeks to 3 days",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "MSP CNC metrology cuts Leonardo tiltrotor blade production time from 20 weeks to 3 days"
    },
    "summary": "Advanced manufacturing metrology demonstrates its prowess in addressing complex composite machining issues, increasing Leonardo&rsquo;s carbon fiber part productivity by more than 4,500%, and eliminating scrap and fixture reliance.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Advanced manufacturing metrology demonstrates its prowess in addressing complex composite machining issues, increasing Leonardo&rsquo;s carbon fiber part productivity by more than 4,500%, and eliminating scrap and fixture reliance."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-msp-perfectpart-cut.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"MSP PerfectPart cutting.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-msp-perfectpart-cut.jpg;maxWidth=720\" /> </a></div>\n\n<p>MSP PerfectPart cut the production time of Leonardo&rsquo;s tiltrotor blades from 20 weeks to 3 days. Source (All Images) | MSP&nbsp;</p>\n</div>\n\n<p>Global industrial group&nbsp;<a href=\"https://www.leonardo.com/en/\" target=\"_blank\">Leonardo</a> (Rome, Italy)&nbsp;has experienced a&nbsp;leap in its production of complex carbon fiber&nbsp;tiltrotor blades for one of its&nbsp;helicopter programs after implementation of&nbsp;advanced CNC metrology solutions from <a href=\"https://mspltd.com/\" target=\"_blank\">Metrology Software Products</a>&nbsp;(MSP, Northumberland, U.K.)&nbsp;cut production time from 20 weeks to 3 days, an increase in productivity of more than&nbsp;4,500%.</p>\n\n<p>Leonardo has also seen its part alignment process reduced from days to 5 minutes, estimated scrap rate reduced from 95% to 0% and reliance on using fixtures for part alignment processes eliminated.</p>\n\n<p>Faced with the challenge of producing large, twisted composite blades that were deemed &ldquo;impossible to manufacture&rdquo;&nbsp;by simulation software due to varying levels of distortion and a thin tip making them hard to fixture, Leonardo turned to MSP&rsquo;s PerfectPart suite of metrology products.</p>\n\n<p>&ldquo;To align our parts, we would normally probe and measure parts using CAD, but as the composite blades are often all different and never conform to this data, we had to find another way,&rdquo; explains David Madigan, Leonardo tooling design engineer.</p>\n\n<p>Originally, Leonardo considered tackling the problem itself&nbsp;using traditional manufacturing methods, but this was predicted to create a 18-20 week lead time and&nbsp;was therefore&nbsp;deemed an unsuitable option. A feasible solution was metrology-package MSP PerfectPart. According to MSP, its&nbsp;NC-Checker and NC-PartLocator product modules give manufacturers error-free and right-first-time part production.</p>\n\n<p>NC-Checker was introduced as a standard operating procedure at Leonardo for its ability to assess the geometric performance of a CNC machine tool to check that it is capable of machining parts to tolerance. &ldquo;The tiltrotor blades are low volume and high value, so you don&rsquo;t want to risk scrapping any,&rdquo; says Madigan.&nbsp;&ldquo;NC-Checker allows us to monitor the machine tool in a simple way and gives us the confidence that no error on the machine will negatively impact the parts. Before we machine a blade, it is a stipulation that the software is run. Then, if something does go wrong, the first question is &lsquo;Well, did you run NC-Checker?&rsquo;&rdquo;</p>\n\n<p>NC-PartLocator was introduced to solve Leonardo&rsquo;s main challenge of accurately aligning the blades despite the unknown amounts of distortion. Unlike traditional part alignment methods, NC-PartLocator uses five-axis probing to measure a part on the machine and generate an accurate best fit alignment in six degrees of freedom.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-msp-leonardo.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"MSP and Leonardo personnel.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-msp-leonardo.jpg;maxWidth=720\" /> </a></div>\n\n<p>MSP&rsquo;s James Dent (left) pictured with Leonardo tooling design engineer David Madigan (right) and CAD CAM engineer Keith Upton-Pittaway (middle).</p>\n</div>\n\n<p>Most importantly in Leonardo&rsquo;s case, the software compensates for any discrepancy between the physical part location and the nominal machining program to show where the part &ldquo;really is&rdquo;&nbsp;on the machine. The updated alignment is automatically uploaded to the controller and any misalignment errors are automatically removed.</p>\n\n<p>Madigan admits&nbsp;the product shocked him.&nbsp;&ldquo;NC-PartLocator&rsquo;s alignment results can be quite surprising. The software often shows that the blade should be somewhere else entirely, even when it doesn&rsquo;t look any different on the surface.&rdquo; It has also aided his fixturing routine.&nbsp;&ldquo;I designed the fixtures based on the fact that you move the machine to the part instead of moving the part. All I needed to do was hold the part in position so it could be probed. It didn&rsquo;t matter that the blades were all variable and the position wasn&rsquo;t correct, as I knew NC-PartLocator would compensate for that. It&rsquo;s night and day compared to traditional methods.&rdquo;</p>\n\n<p>And the results certainly show this difference. Using MSP as part of its processes, Leonardo has cut its estimated 20-week production time and 95% scrap rate to a stable 3-day production time with a potential for 0% scrap rate.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/msp-ltd-cnc-metrology-cuts-leonardo-tiltrotor-blade-production-time-from-20-weeks-to-3-days"
      }
    ],
    "link": "https://www.compositesworld.com/news/msp-ltd-cnc-metrology-cuts-leonardo-tiltrotor-blade-production-time-from-20-weeks-to-3-days"
  },
  {
    "published": "Mon, 22 Sep 2025 00:34:25 -0400",
    "published_parsed": [
      2025,
      9,
      22,
      4,
      34,
      25,
      0,
      265,
      0
    ],
    "title": "Introducing GROW: A full-funnel marketing solutions provider",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Introducing GROW: A full-funnel marketing solutions provider"
    },
    "summary": "GROW is the newly formed marketing services arm of Gardner Business Media. Offering custom content, marketing, creative, research&nbsp;and data services, GROW expands and builds on the company&rsquo;s deep first-party reach into the discrete parts manufacturing sector.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "GROW is the newly formed marketing services arm of Gardner Business Media. Offering custom content, marketing, creative, research&nbsp;and data services, GROW expands and builds on the company&rsquo;s deep first-party reach into the discrete parts manufacturing sector."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a href=\"https://www.gardnerweb.com/grow\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/AM/2025-AM/0925-am-growlogo.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gardner-business-media\" target=\"_blank\">Gardner Business Media</a> (GBM, Cincinnati, Ohio, U.S.), a leader in media and marketing solutions to industrial markets, has recently launched GROW, a full-funnel marketing services provider.</p>\n\n<p>GROW combines GBM&rsquo;s first-party audience network, industry-expert content creators, owned media brands (such as <em>CompositesWorld,</em>&nbsp;<a href=\"https://www.mmsonline.com/\" target=\"_blank\"><em>Modern Machine Shop</em></a>, <a href=\"https://www.compositesworld.com/\" target=\"_blank\"><em>CompositesWorld</em></a><em> </em>and <a href=\"https://www.ptonline.com/\" target=\"_blank\"><em>Plastics Technology</em></a>), and extensive data insights to help industrial manufacturing companies reach their brand and business goals.</p>\n\n<p>GROW is comprised of four pillars.<strong> GROW Performance</strong>, a campaign performance and audience insights platform, launched earlier this year with exclusive access for GBM clients. On the heels of GROW Performance&rsquo;s successful launch, GROW has expanded to include GROW Marketing, GROW Studio&nbsp;and GROW Intelligence.</p>\n\n<p>The <strong>GROW Marketing</strong> team takes an audience-first approach to crafting strategic marketing programs for clients that build brand, drive demand&nbsp;and connect businesses with qualified prospects.</p>\n\n<blockquote>\n<p>&ldquo;Our clients are getting more than campaign support, they&rsquo;re gaining access to trusted<strong> </strong>content, vetted audience reach&nbsp;and established media channels.&rdquo;</p>\n</blockquote>\n\n<p>To fuel those marketing programs, <strong>GROW Studio</strong>, an experienced team of industry writers, designers&nbsp;and videographers, works with clients to craft compelling original content.</p>\n\n<p><strong>GROW Intelligence</strong> (formerly Gardner Intelligence) offers custom research services to inform go-to-market strategies through brand affinity and market analysis studies. In addition, GROW Intelligence will continue to produce familiar studies including the <a href=\"https://www.gardnerintelligence.com/report/gbi\" target=\"_blank\">Gardner Business Index</a>, <a href=\"https://www.gardnerintelligence.com/report/world-machine-tool\" target=\"_blank\">World Machine Tool Survey</a>, <a href=\"https://www.gardnerintelligence.com/report/top-shops-benchmarking\" target=\"_blank\">Top Shops Benchmarking</a>&nbsp;and the <a href=\"https://www.gardnerweb.com/manufacturing-insights/ibi\" target=\"_blank\">Industrial Buying Influence Survey</a>.</p>\n\n<p>&ldquo;GBM&rsquo;s brands are proven leaders in providing media and marketing solutions in industrial markets. Building on that established success, GROW Marketing will deliver the same level of professional service and commitment GBM is known for,&rdquo; says Debi Williams, director of GROW marketing services. &ldquo;As a dedicated and informed marketing partner, we see ourselves as an extension of our clients&rsquo; marketing teams, offering strategic planning, creative services&nbsp;and campaign monitoring.&rdquo;</p>\n\n<p>&ldquo;Backed by the Gardner Industrial Network, our clients are getting more than campaign support, they&rsquo;re gaining access to trusted<strong> </strong>content, vetted audience reach&nbsp;and established media channels,&rdquo; says Rick Kline, Jr., president of GBM. &ldquo;We are uniquely positioned to understand both the position of our clients and the needs and interests of the industrial audience.&rdquo;</p>\n\n<p>For more information about GROW, visit <a href=\"https://www.gardnerweb.com/grow\" target=\"_blank\">gardnerweb.com/grow</a> or connect on <a href=\"https://www.linkedin.com/showcase/grow-industrial-marketing\" target=\"_blank\">LinkedIn</a>. For those existing GBM clients, login to your <a href=\"https://grow.gardnerweb.com/landing\" target=\"_blank\">GROW Performance dashboard</a> for campaign performance and audience insights.</p>\n\n<p><em>Gardner Business Media has been the premier publisher for the heart of manufacturing in North America since 1928,&nbsp;providing one-of-a-kind, relevant information of keen interest to the people who power plants, shops&nbsp;and factories.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/introducing-grow-a-full-funnel-marketing-solutions-provider-6"
      }
    ],
    "link": "https://www.compositesworld.com/news/introducing-grow-a-full-funnel-marketing-solutions-provider-6"
  },
  {
    "published": "Fri, 19 Sep 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      19,
      18,
      0,
      0,
      4,
      262,
      0
    ],
    "title": "Management team acquires Hexcel Neumarkt manufacturing site",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Management team acquires Hexcel Neumarkt manufacturing site"
    },
    "summary": "Paul Leitner and Manfred Bankhammer will secure the future of the industrial composites manufacturing site, providing stability and focused growth under new ownership.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Paul Leitner and Manfred Bankhammer will secure the future of the industrial composites manufacturing site, providing stability and focused growth under new ownership."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-hexcel-neumarket-site.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerial view of the Neumarkt site.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-hexcel-neumarket-site.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Hexcel Corp.</p>\n</div>\n\n<p>In a strategic move to secure the future of the Neumarkt manufacturing site, long-standing management team members Paul Leitner and Manfred Bankhammer have signed an agreement to acquire the facility from <a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel</a> (Stamford, Conn., U.S.). The transaction is expected to be finalized upon completion of customary conditions</p>\n\n<p>&ldquo;This acquisition marks a significant milestone for us personally and for the entire Neumarkt team,&rdquo; says&nbsp;Bankhammer. &ldquo;We are proud to continue the legacy of excellence built over decades and look forward to deepening our relationships with customers in our core markets.&rdquo;</p>\n\n<p>Founded in 1947 and part of Hexcel since 1996, the Neumarkt site has been a cornerstone of the company&rsquo;s industrial composites production, manufacturing high-performance materials such as glass- and carbon fiber-reinforced epoxy prepregs, laminates and polyurethane formulations. These products serve a wide range of industries including wind energy, winter sports, marine and automotive.</p>\n\n<p>&ldquo;As new owners, our commitment remains unchanged,&rdquo; emphasizs&nbsp;Leitner. &ldquo;We will continue to deliver high quality, reliable service and on-time delivery &mdash;&nbsp;values that define our promise to customers and partners.&rdquo;</p>\n\n<p>The continuity of operations ensures stability for employees and customers alike, while opening new opportunities for focused growth and innovation under the new ownership. At the same time, Hexcel will continue to serve the industrial market and applications where it&nbsp;can leverage its premium aerospace-grade carbon fiber.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/management-team-acquires-hexcel-neumarkt-manufacturing-site"
      }
    ],
    "link": "https://www.compositesworld.com/news/management-team-acquires-hexcel-neumarkt-manufacturing-site"
  }
]