[
  {
    "published": "Fri, 30 May 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      18,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "Vertical performs piloted VX4 eVTOL flight in open airspace",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Vertical performs piloted VX4 eVTOL flight in open airspace"
    },
    "summary": "Successful wingborne flight following approval from the UK Civil Aviation Authority (CAA) completes Phase 3 of Vertical&rsquo;s path toward certification and commercial operation.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Successful wingborne flight following approval from the UK Civil Aviation Authority (CAA) completes Phase 3 of Vertical&rsquo;s path toward certification and commercial operation."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-vertical-vx4-prototype-flight-openair-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-vertical-vx4-prototype-flight-openair-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>The VX4 prototype soars across the U.K. countryside from Cotswold Airport. Source | Vertical Aerospace</p>\n</div>\n\n<p>On May 27,&nbsp;<a href=\"https://vertical-aerospace.com/\" target=\"_blank\">Vertical Aerospace</a>&nbsp;(London, U.K.) achieved piloted wingborne flight of a winged electric vertical takeoff and landing (eVTOL) aircraft in open airspace. The landmark flight of the VX4 prototype, piloted by chief test pilot Simon Davies, saw the aircraft takeoff, fly and land like a conventional aircraft, with lift generated by the wing.</p>\n\n<p>Soaring across the U.K. countryside from Cotswold Airport,&nbsp;the VX4 prototype demonstrated controlled wingborne flight in open airspace for the first time, marking a critical step toward commercial deployment as part of Vertical&rsquo;s&nbsp;Flightpath 2030 strategy.</p>\n\n<p>Notably, the UK Civil Aviation Authority (CAA) approved the flight through open airspace at Cotswold Airport by extending Vertical&rsquo;s Permit to Fly. This followed a rigorous review of tens of thousands of pages of safety and technical documentation.</p>\n\n<p>&ldquo;Our performance predictions were spot on, and the aircraft took off as a natural extension of all the ground tests and preparation we&rsquo;ve done,&rdquo; says Davies.</p>\n\n<p>Vertical&rsquo;s piloted winged eVTOL prototype has been developed under a design organization&nbsp;approval (DOA) from the CAA. A DOA&nbsp;is required to hold a type certificate, required for commercial passenger operations. The CAA is working closely with the European Union Aviation Safety Agency (EASA) for its concurrent validation and certifying the VX4 to the highest safety standards required for commercial use.</p>\n\n<div class=\"article_sidebar\">\n<h3>Vertical Aerospace milestones and future goals</h3>\n\n<p><strong>Phase 1</strong>: Tethered: The VX4 prototype will perform stabilized hover while loosely tethered to the ground. <em>Completed September 2024.&nbsp;</em></p>\n\n<p><strong>Phase 2</strong>: Thrustborne: The VX4 prototype will takeoff and land vertically and conduct low speed flight maneuvers with lift generated by the propellers.&nbsp;<em>Completed February 2025.</em></p>\n\n<p><strong>Phase 3</strong>: Wingborne: The VX4 prototype will takeoff, fly and land like a conventional aircraft, with lift generated by the wing.&nbsp;<em>Completed May 2025.</em></p>\n\n<p><strong>Phase 4</strong>: Transition: The VX4 prototype will transition between thrustborne and wingborne flight, and vice versa. <em>Expected before year-end 2025.</em></p>\n</div>\n\n<p>Vertical&rsquo;s recent flight achievement has been supported by early U.K. government&nbsp;investment through programs including the Aerospace Technology Institute (ATI) and the Future Flight Challenge. These initiatives have contributed to the development of Vertical&rsquo;s technology and flight test campaign, and form part of wider efforts to advance the U.K.&rsquo;s net-zero and aerospace ambitions.</p>\n\n<p>What is the significance of wingborne flight? During this Phase 3 testing, the VX4 aircraft&nbsp;operates like a conventional aircraft, using lift generated by its wings&nbsp;rather than relying solely on rotor thrust. This low-power, quiet&nbsp;and range-efficient mode of flight is key to making electric air travel practical, scalable and economically viable.&nbsp;</p>\n\n<p>It also leads the company to its next milestone:&nbsp;a full piloted transition flight, expected in the second half of 2025. This will demonstrate the VX4&rsquo;s ability to shift seamlessly between vertical lift and forward cruise &mdash;&nbsp;the operating mode it will use in passenger service.</p>\n\n<p>During the wingborne flight phase, the VX4 will reach speeds of up to 150 miles per hour (120 knots) and altitudes close to 2,000 feet under real-world conditions. Engineers captured more than 30,000 in-flight data parameters, confirming the aircraft performed well across stability, control&nbsp;and energy use.</p>\n\n<p>To prepare for piloted wingborne flights, Vertical has completed thousands of hours of lab, simulation&nbsp;and high speed ground testing, including:</p>\n\n<ul>\n\t<li>7.2 million fatigue cycles on each propeller blade to simulate lifespan loads over the flight test campaign.</li>\n\t<li>15.2-meter&nbsp;battery pack drop test, comparable to fuel-tank testing in traditional rotorcraft.</li>\n\t<li>Full-scale thermal runaway propagation test on a VX4 sub-pack, indicating safe flight and landing is possible even in the event of a battery fire.</li>\n\t<li>More than 3,000 hours of component and integration testing on flight control computers to ensure system reliability and performance.</li>\n</ul>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/vertical-performs-piloted-vx4-evtol-flight-in-open-airspace"
      }
    ],
    "link": "https://www.compositesworld.com/news/vertical-performs-piloted-vx4-evtol-flight-in-open-airspace"
  },
  {
    "published": "Fri, 30 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      17,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "GVP tanks pass extreme fire tests, confirm market readiness",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "GVP tanks pass extreme fire tests, confirm market readiness"
    },
    "summary": "Full-size, high-pressure Type 3&nbsp;composite&nbsp;tank test results conclude safe containment during severe fire scenarios, concluding the final stage of GVP&rsquo;s certification program.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Full-size, high-pressure Type 3&nbsp;composite&nbsp;tank test results conclude safe containment during severe fire scenarios, concluding the final stage of GVP&rsquo;s certification program."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gvp-tank-fire-test-before.png\" target=\"_blank\"><img alt=\"Type 3 tank prior to testing. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gvp-tank-fire-test-before.png;maxWidth=385\" /></a></div>\n\n<p>Type 3 tank prior to testing. Source (All Images) | Gas Vessel Production (GVP)</p>\n</div>\n\n<p><a href=\"https://www.gasvp.com/\" target=\"_blank\">Gas Vessel Production</a> (GVP, Buttrio, UD, Italy), a European-based engineering and production company focused on the manufacture&nbsp;and commercialization of the world&rsquo;s largest high-pressure composite tanks for clean gas transport, has&nbsp;successfully completed a series of full-scale fire tests, demonstrating the high fire resistance and structural integrity of its technology under the most extreme conditions.</p>\n\n<p>GVP&rsquo;s high-capacity, lightweight Type 3 composite tanks are designed for scalable transport and storage of hydrogen, CNG, CO<sub>2</sub>&nbsp;and other industrial gases. Testing was conducted in compliance with ADR Regulations (Section 6.9.2.7.1.5), one of the most stringent fire test standards for pressure vessels worldwide.</p>\n\n<p>The full-size prototype underwent initial exposure to an oil pool fire, followed by subsequent direct flame contact from multiple LPG burners evenly distributed around the tank. Testing conditions included:&nbsp;</p>\n\n<ul>\n\t<li>External surface temperatures exceeding 800&deg;C, reaching up to 1000&deg;C</li>\n\t<li>Heat flux greater than 75 kilowatts/square meter&nbsp;</li>\n\t<li>Sustained fire exposure for more than&nbsp;30 minutes.</li>\n</ul>\n\n<p>According to GVP, the prototype tank&rsquo;s internal temperature&nbsp;rose by only 1-2&deg;C. In addition, no leaks, venting&nbsp;or structural failure occurred during or after testing. These results further confirmed&nbsp;the robustness and thermal resilience of GVP&rsquo;s composite tank design, ensuring safe containment even in the most severe fire exposure scenarios.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gvp-tank-fire-test-during.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gvp-tank-fire-test-during.png;maxWidth=720\" /> </a></div>\n</div>\n\n<p>The fire test concludes the final stage of GVP&rsquo;s prototype certification program, which already includes extreme pressure performance, resistance to vacuum conditions, high-cycle fatigue durability, optimal blunt impact resistance and high fire safety.</p>\n\n<p>&ldquo;This milestone confirms the safety and market readiness of our tanks,&rdquo; says Giovanni Fratti, CTO of GVP. &ldquo;We&rsquo;re proud to contribute to the next generation of clean gas logistics.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gvp-tanks-pass-extreme-fire-tests-confirm-market-readiness"
      }
    ],
    "link": "https://www.compositesworld.com/news/gvp-tanks-pass-extreme-fire-tests-confirm-market-readiness"
  },
  {
    "published": "Fri, 30 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      16,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "Agile Ultrasonics breaks new ground for ultrasonic composites welding in space manufacturing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Agile Ultrasonics breaks new ground for ultrasonic composites welding in space manufacturing"
    },
    "summary": "Continuous ultrasonic welding (CUW) innovation presents the flexibility crucial for future lunar and deep-space missions, but also for composites joining in defense and commercial aerospace.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Continuous ultrasonic welding (CUW) innovation presents the flexibility crucial for future lunar and deep-space missions, but also for composites joining in defense and commercial aerospace."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-agileultrasonics-cuw-trial.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-agileultrasonics-cuw-trial.jpg;maxWidth=720\" /> </a></div>\n\n<p>Chris Skocik, Agile Ultrasonics engineering manager, is loading the company&rsquo;s vacuum chamber in preparation for an ultrasonic weld trial joining CFRTP&nbsp;at the company&rsquo;s facility in Columbus, Ohio. Source | Agile Ultrasonics</p>\n</div>\n\n<p><a href=\"https://www.agileultrasonics.com/\" target=\"_blank\">Agile Ultrasonics</a>&nbsp;(Columbus, Ohio, U.S.), a company developing advanced ultrasonic welding solutions for thermoplastic composites (TPC), and a key player in the &ldquo;Structural Materials Joining in Space&rdquo;&nbsp;project, funded by <a href=\"https://ohiofrn.org/\" target=\"_blank\">Ohio Federal Research Network</a> (OFRN), is tackling the challenge of achieving reliable TPC&nbsp;welding in the harsh, environmental conditions of space. This project is an enabler for in-space manufacturing, servicing&nbsp;and repair &mdash;technologies that NASA and other industry leaders could use for the future of deep-space exploration.</p>\n\n<p>Agile Ultrasonics&rsquo; expertise extends beyond space applications, with a strong foundation&nbsp;in developing, designing&nbsp;and manufacturing advanced robotic end effectors for critical polymer composites joining. As Jim Stratton, president of Agile Ultrasonics highlights, the company&rsquo;s technology has been installed in top-tier aerospace and is being evaluated for use in U.S. Air Force, and NASA programs. Agile&rsquo;s innovations include continuous ultrasonic welding (CUW) without the need for energy directors, film layers&nbsp;or other inserts &mdash; an advancement that enhances efficiency and reliability while expanding material selection options for component designers.&nbsp;Additionally, the company&rsquo;s solutions enable precise shaping and compacting of high-performance carbon fiber-reinforced thermoplastic (CFRTP) composites, supporting both terrestrial- and space-based applications.</p>\n\n<h3>Overcoming the challenges of space welding</h3>\n\n<p>Traditional ultrasonic welding techniques often require additional materials, such as energy directors or resin inserts, which introduce complexities in space where weight and automation are critical concerns. To address this challenge, and through the aforementioned OFRN project, Agile Ultrasonics has developed CUW&nbsp;without the need for energy directors or film layer inserts, a process that can be used to eliminate auxiliary materials while ensuring high-performance joints in TPCs such as LM-PAEK, PEEK or PEKK prepregs, which are widely used in aerospace structures.</p>\n\n<p>&ldquo;The &lsquo;Structural Materials Joining in Space&rsquo;&nbsp;project that Agile has been awarded by Parallax Research seeks to develop baseline ultrasonic welds of TPCs in extreme space conditions. No data is currently known to exist for this type of ultrasonic welding,&rdquo;&nbsp;Stratton explains.</p>\n\n<p>To test its technology, Agile has designed and built a custom vacuum chamber capable of simulating&nbsp;the extreme thermal fluctuations of space, ranging from -190&deg;C to +120&deg;C. This chamber enables real-time, in-weld temperature monitoring using a sensor array that provides critical data to correlate thermal profiles with mechanical strength. According to Stratton, these insights are essential for refining welding parameters and ensuring the long-term reliability of TPC&nbsp;welds in space environments.</p>\n\n<p>Notably, the CUW technology represents an opportunity for&nbsp;space-based and terrestrial composites manufacturing. Unlike conventional ultrasonic welding systems, Agile has commercialized its technology as a modular, adaptable robot-agnostic end effector.&nbsp;This flexibility could be crucial for future lunar and deep-space missions, where robotic assembly and repair may be necessary for constructing and maintaining spacecraft structures and habitats.</p>\n\n<p><em>&ldquo;</em>Agile created the option of applying this highly adaptable, modular, low-power, machine-driven robotic system to structural element manipulation, joining and repurposing of composite materials on-orbit or on the lunar surface,&rdquo; Stratton elaborates. &ldquo;By correlating weld test data with corresponding weld temperature data, we will advance understanding of the environmental impact on welds as they occur.&rdquo;</p>\n\n<p>Beyond space applications, Agile&rsquo;s CUW technology has&nbsp;potential for defense and commercial aerospace where the ability to create high-strength, lightweight composite joints &mdash; without adhesives or reinforcements &mdash; can be significant for advanced aerospace structures. Current efforts include maturing the technology to support advanced air mobility (AAM) systems and potentially autonomous&nbsp;collaborative platforms (ACP) for AFRL through Midwestern Regional Network funding.</p>\n\n<h3>Industry collaboration and commercialization</h3>\n\n<p>Agile Ultrasonics&rsquo; success is built on strategic supply chain partnerships including material and robotic systems makers, Tier 1 aerospace, NASA, the U.S. Air Force&nbsp;and research institutions&nbsp;including the University of Dayton Research Institute (UDRI), The Ohio State University, Central State University and Oak Ridge National Laboratory (ORNL). These collaborations have been&nbsp;critical in bridging the gap between research and real-world applications.</p>\n\n<p>Support from the OFRN Round 6 program has accelerated Agile&rsquo;s commercialization efforts, enabling&nbsp;the company to demonstrate its advancements in ultrasonic welding technology to key aerospace stakeholders. The funding has also enabled crucial testing, process refinement and validation studies that strengthen Agile&rsquo;s composites joining leadership.</p>\n\n<p>&ldquo;OFRN 6 has provided leverage for Agile to grow its existing business with NASA and helped Parallax demonstrate to its funding source that the support Agile has received through OFRN 6 is producing jobs, breakthrough technology&nbsp;and follow-on programs as proposed at the outset,&rdquo; Stratton notes. &ldquo;Further, the work being done under OFRN 6 has helped Agile gain traction with the U.S. Air Force.&nbsp;Agile recently received an award from the Air Force Research Lab [AFRL]&nbsp;Midwest Regional Network to apply its continuous ultrasonic welding of thermoplastic composites to an AFRL-funded program.&rdquo;</p>\n\n<p>Agile Ultrasonics continues to refine its CUW process. Stratton believes that it will not only play&nbsp;a vital role in the&nbsp;long-term vision of sustainable space exploration, but also unlock&nbsp;new opportunities for high-performance composites in aviation, AAM&nbsp;and defense through continued collaboration and industry support.</p>\n\n<p>&ldquo;We have worked almost daily with our stakeholders at NASA&rsquo;s Glenn Research Center in Cleveland, NASA&rsquo;s Langley Research Center in Hampton, Virginia, and NASA&rsquo;s Goddard Space Flight Center in Greenbelt, Maryland. We have hosted multiple face-to-face visits at our facility and collaborated extensively on ultrasonic welding projects within and outside of OFRN 6,&rdquo; Stratton emphasizes. &ldquo;Our objective is to advance Agile&rsquo;s technology so that it becomes an integral part of the supply chain as a go-to platform for joining, shaping, compacting, sealing&nbsp;or consolidating TPCs. An immense effort will be required to achieve this level of commercial success.&rdquo;</p>\n\n<p><em>Air Force Research Lab<strong>&nbsp;</strong>AFRL-2025-2496.&nbsp;Distribution statement A: Approved for Public Release: distribution is unlimited.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/agile-ultrasonics-breaks-new-ground-for-ultrasonic-composites-welding-in-space-manufacturing"
      }
    ],
    "link": "https://www.compositesworld.com/news/agile-ultrasonics-breaks-new-ground-for-ultrasonic-composites-welding-in-space-manufacturing"
  },
  {
    "published": "Fri, 30 May 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      15,
      30,
      0,
      4,
      150,
      0
    ],
    "title": "Northrop Grumman Series D investment advances MLV Eclipse co-developed with Firefly",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Northrop Grumman Series D investment advances MLV Eclipse co-developed with Firefly"
    },
    "summary": "A $50 million investment further supports Eclipse, a platform&nbsp;built upon the success of Firefly&rsquo;s carbon fiber Alpha and Northrop Grumman&rsquo;s Antares rocket with a leap in power, performance&nbsp;and payload capacity.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A $50 million investment further supports Eclipse, a platform&nbsp;built upon the success of Firefly&rsquo;s carbon fiber Alpha and Northrop Grumman&rsquo;s Antares rocket with a leap in power, performance&nbsp;and payload capacity."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-firefly-grumman-eclipse.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Eclipse launch vehicle rendering.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-firefly-grumman-eclipse.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Firefly Aerospace</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/northrop-grumman-tactical-space-space-components\" target=\"_blank\">Northrop Grumman Corp.</a> (Falls Church, Va., U.S.) has invested $50 million into <a href=\"https://fireflyspace.com/\" target=\"_blank\">Firefly Aerospace</a>&nbsp;(Cedar, Texas, U.S.) to further advance production of a co-developed medium launch vehicle (MLV), now known as Eclipse. The companies continue to make progress in the development of Eclipse flight hardware with qualification testing underway and more than 60 Miranda engine hot fire tests performed to date.</p>\n\n<p>&ldquo;Northrop Grumman&rsquo;s investment further solidifies our&nbsp;partnership to build the first stage of <em>Antares 330</em> and jointly develop Eclipse,&rdquo; says&nbsp;Jason Kim, CEO of Firefly Aerospace. &ldquo;Eclipse represents two powerful forces coming together to transform the launch market with decades of flight heritage, a rapid, iterative approach&nbsp;and bold innovation. With a 16 metric ton to orbit capability, Eclipse is a sweet spot for programs like NSSL Lane 1 and a natural fit to launch proliferated constellations in LEO, MEO, GEO&nbsp;and TLI.&rdquo;</p>\n\n<p>Built upon Grumman&rsquo;s Antares and Firefly&rsquo;s <em>Alpha</em> rocket,&nbsp;<a href=\"https://fireflyspace.com/eclipse/\" target=\"_blank\">Eclipse</a>&nbsp;offers what partners say is&nbsp;a significant leap in power, performance, production cadence and payload capacity. The MLV&nbsp;retains the flight-proven avionics from the Antares program with additional upgrades, including a larger 5.4-meter payload fairing. Eclipse also uses the same first stage Firefly is developing for <em>Antares 330</em> and retains scaled-up versions of <em>Alpha</em>&rsquo;s propulsion systems and carbon fiber composite structures, enabling the team to rapidly build and test Eclipse with significant production efficiencies and economies of scale.</p>\n\n<p>Firefly also used the same tap-off cycle architecture from <em>Alpha</em>&rsquo;s Reaver and Lightning engines for Eclipse&rsquo;s Miranda and Vira engines, and completed mission duty cycle with a 206-second Miranda hot fire, matching the longest time the engine will burn during a flight. Following several development test campaigns, flight hardware has been manufactured for the common dome propellant tanks, engine bay and interstage.</p>\n\n<p>&ldquo;Eclipse gives customers the right balance between payload capacity and affordability,&rdquo; notes&nbsp;Wendy Williams, vice president and general manager, launch and missile defense systems, Northrop Grumman. &ldquo;Our partnership with Firefly builds on our capacity to provide crucial spaced-based communication, observation&nbsp;and exploration for civil and national security customers.&rdquo;</p>\n\n<p>Eclipse is equipped to deliver 16,300 kilograms of cargo to low Earth orbit or 3,200 kilograms of cargo to geosynchronous transfer orbit. Eclipse will first launch from Wallops Island, Virginia, as early as 2026 and is able to support space station resupply, commercial spacecraft, critical national security missions and scientific payloads for the domestic and international markets.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/northrop-grumman-series-d-investment-advances-mlv-eclipse-co-developed-with-firefly"
      }
    ],
    "link": "https://www.compositesworld.com/news/northrop-grumman-series-d-investment-advances-mlv-eclipse-co-developed-with-firefly"
  },
  {
    "published": "Fri, 30 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      15,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "JEC Group to launch series of composites events in the Middle East",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "JEC Group to launch series of composites events in the Middle East"
    },
    "summary": "A 3-year strategic agreement with the region targets the organization of a one-day JEC Talks in June 2025 and a JEC Forum Middle East in 2026 in the effort to build on Saudi&nbsp;Arabia&rsquo;s proliferating composites space.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A 3-year strategic agreement with the region targets the organization of a one-day JEC Talks in June 2025 and a JEC Forum Middle East in 2026 in the effort to build on Saudi&nbsp;Arabia&rsquo;s proliferating composites space."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tradeshow-blurred-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Blurred trade show.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tradeshow-blurred-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/jec-composites\" target=\"_blank\">JEC Group</a>&nbsp;(Paris, France) announces a&nbsp;strategic collaboration agreement with the&nbsp;OSP&nbsp;and&nbsp;IFC Promosalons, the representative of JEC in the Middle East. The agreement aims to organize a series of events dedicated to composite materials held in Saudi Arabia for the first time starting in June 2025. The events will facilitate the creation of opportunities for local and international companies and accelerate the adoption of sustainable materials across multiple industries in the region.&nbsp;</p>\n\n<p>This 3-year agreement formalizes the long-term cooperation with OSP, and aims to:</p>\n\n<ul>\n\t<li>Enhance and increase awareness of the sustainability and efficiency of polymer-based applications.</li>\n\t<li>Promote nonmetallic materials as enablers of industrial diversification.</li>\n\t<li>Facilitate innovative technologies being transferred and increasing industrial partnerships between local and international stakeholders.</li>\n</ul>\n\n<p>With the Saudi Vision 2030 roadmap and large-scale investments in advanced materials, Saudi Arabia is actively diversifying its economy through innovation. Fiber-reinforced composites are central to this transformation, with applications in mobility, building and&nbsp;construction, renewable energy, oil and&nbsp;gas, infrastructure&nbsp;and more.</p>\n\n<p>JEC looks forward to being part of this momentum, creating strong business opportunities, driving innovation&nbsp;and supporting industrial development in the region. &ldquo;This agreement is a significant milestone for JEC,&rdquo; says&nbsp;Thomas Lepretre, VP sales, events and operations, JEC Group.&nbsp;&ldquo;It reflects our shared ambition to accelerate innovation and collaboration in the Middle East, and to supply our communities with networking opportunities in all geographical areas. We are looking forward to working with the OSP to build bridges between companies in the region and potential suppliers and customers abroad.&rdquo;</p>\n\n<p>Accordingly, the partnership&nbsp;paves the way for the launch of two major new events in the Kingdom. JEC Talks Middle East, an&nbsp;invitation-only event held on June 24, 2025, is offering a high-level insight day to explore Saudi Arabia&rsquo;s and the region&rsquo;s composites ecosystem. JEC Forum Middle East, scheduled for June 23-24, 2026, in Riyadh, Saudia Arabia, will be the first edition of a business meeting-based event gathering the entire regional and international composites value chain.</p>\n\n<p><em>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/news/jec-group-launches-jec-forum-southeast-asia-for-2026\">JEC Group launches JEC&nbsp;Forum Southeast Asia for 2026</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/jec-group-to-launch-series-of-composites-events-in-the-middle-east"
      }
    ],
    "link": "https://www.compositesworld.com/news/jec-group-to-launch-series-of-composites-events-in-the-middle-east"
  },
  {
    "published": "Fri, 30 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      14,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "Flyber launches U.K. composites manufacturing site for advanced mobility applications",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Flyber launches U.K. composites manufacturing site for advanced mobility applications"
    },
    "summary": "The startup&rsquo;s design automation and composite material layup and curing technologies target lightweighting for aerospace, UAVs, eVTOL&nbsp;and high-performance mobility platforms.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The startup&rsquo;s design automation and composite material layup and curing technologies target lightweighting for aerospace, UAVs, eVTOL&nbsp;and high-performance mobility platforms."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-flyber.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Advanced mobility composite propeller.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-flyber.jpg;maxWidth=720\" /> </a></div>\n\n<p>UAV composite propeller. Source | Flyby</p>\n</div>\n\n<p><a href=\"https://www.flyber.tech/\" target=\"_blank\">Flyber</a>&nbsp;(Kislingbury), a U.K.-based&nbsp;startup specializing in advanced design and manufacturing of propellers for unmanned aerial vehicles (UAVs) and advanced air mobility (AAM), has unveiled its&nbsp;new manufacturing site in Northampton. It is&nbsp;aimed at transforming structural component fabrication for mobility markets, including aerospace, electric vertical takeoff and landing (eVTOL) vehicles, UAVs and&nbsp;the wider AAM market with an initial focus on composite propellers &mdash;&nbsp;in Flyber&rsquo;s&nbsp;view, the hardest to get right, to prove their value.</p>\n\n<p>Flyber&rsquo;s core innovation lies in its composite-first design platform, which uses proprietary algorithms and in-house developed simulation tools to generate optimized structural propeller components that fully leverage the performance characteristics of carbon fiber. The platform directly connects design intent with automated manufacturing, Flyber explains, reducing time-to-part and material waste.</p>\n\n<p>&ldquo;Composites have long promised unmatched strength-to-weight ratios, but have historically come with trade-offs in design flexibility, production scalability&nbsp;and cost,&rdquo; says Rowan Carstensen, co-founder and CEO of Flyber. &ldquo;Our platform and process eliminates those trade-offs by combining software-driven design optimization with fully integrated manufacturing processes tailored to composite materials for propellers.&rdquo;</p>\n\n<p>Unlike traditional thermoset prepreg systems, Flyber&rsquo;s solution requires no autoclave or extensive curing cycles, enabling on-demand, out-of-autoclave (OOA) part fabrication with enhanced recyclability and sustainable material use.</p>\n\n<p>To validate its technology, Flyber has partnered with several AAM&nbsp;developers and universities and research centers within the U.K., France and Italy. In ongoing trials, Flyber-produced components have demonstrated cycle times of 15 minutes, improved aerodynamic performance of 30% (depending on the measure of performance), reduced weight by 5% and increased life cycles by 250%.</p>\n\n<p>&ldquo;Our customers are seeking production-ready composite propellers for their UAVs with bespoke performance according to their aircraft&rsquo;s and end-user&rsquo;s needs, along with high-volumes and reduced lead times,&rdquo; says Carstensen. &ldquo;Flyber bridges the gap the U.K. traditionally falls behind on in rapidly scaling manufacturing and services.&rdquo;</p>\n\n<p>Flyber&rsquo;s modular, scalable manufacturing cells are currently being deployed, with plans to expand with customers in North America and Europe.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/flyber-launches-uk-composites-manufacturing-site-for-advanced-mobility-applications"
      }
    ],
    "link": "https://www.compositesworld.com/news/flyber-launches-uk-composites-manufacturing-site-for-advanced-mobility-applications"
  },
  {
    "published": "Fri, 30 May 2025 00:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      4,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "People in composites: May 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "People in composites: May 2025"
    },
    "summary": "IACMI, Ilium Composites, Wrexham University, 47G, Gurit and Thermwood Corp. have shared new hires and promotions in the composites industry.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "IACMI, Ilium Composites, Wrexham University, 47G, Gurit and Thermwood Corp. have shared new hires and promotions in the composites industry."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article_sidebar\">\n<h3>IACMI names new chief commercialization officer</h3>\n\n<p>On May 28, <a href=\"https://www.compositesworld.com/suppliers/institutef\" target=\"_blank\">IACMI &ndash; The Composites Institute</a> (Knoxville, Tenn., U.S.) announced that&nbsp;Jason Gibson, Ph.D., will join IACMI on June 2 as its chief commercialization officer (CCO). He will succeed Dale Brosius, who is retiring following 10 years as the institute&rsquo;s founding CCO.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Jason Gibson.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-iacmi-jasongibson-highres.jpg;maxWidth=385\" /></div>\n\n<p>Jason Gibson, IACMI&rsquo;s chief commercialization officer (CCO).</p>\n</div>\n\n<p>Gibson brings more than 20 years of leadership in composites innovation, technology commercialization&nbsp;and cross-sector collaboration to this pivotal role. As CCO, he will lead efforts to commercialize advanced composites technologies, guide strategic direction and coordinate high-impact collaborative projects aligned with IACMI&rsquo;s mission to advance sustainable U.S. manufacturing. He will also serve as executive director of IACMI&rsquo;s Consortium Council.</p>\n\n<p>&ldquo;Jason has a proven track record in the area of applied innovation, industry collaboration and a commitment to workforce development,&rdquo; says&nbsp;IACMI CEO Chad Duty. &ldquo;As a results-driven professional, he is the right leader at the right time to build on the strong foundation Dale has created and to take our commercialization strategy into the next decade.&rdquo;</p>\n\n<p>Gibson joins IACMI after more than two decades at Composites One, where he most recently served as chief applications engineer. There, he led the development and commercialization of technologies such as aerospace-certified thermoplastic composites, graphene-enhanced resins for hydrogen storage&nbsp;and next-generation lightweight defense materials. His work consistently bridged research and market readiness, often involving collaborations with OEMs, national laboratories&nbsp;and academic research institutions.</p>\n\n<p>&ldquo;I am thrilled to join IACMI and contribute to its mission of accelerating the development and adoption of advanced composites,&rdquo; says&nbsp;Gibson. &ldquo;IACMI is at the heart of our nation&rsquo;s composites innovation ecosystem. I look forward to advancing technologies that can drive real impact across energy, defense and sustainability while fostering the workforce needed to support them.&rdquo;</p>\n\n<p>Gibson holds a Ph.D. in mechanical engineering from the University of Central Florida, and Masters of Science&nbsp;degrees in both mechanical engineering and industrial and systems engineering, along with a Bachelor of Science&nbsp;in aeronautical and astronautical engineering &mdash; all from Ohio State University.</p>\n\n<p>Gibson will follow Dale Brosius, who has served as CCO since 2015 and was named executive VP&nbsp;in 2023 following one year as IACMI&rsquo;s interim CEO. Brosius was the first employee hired at IACMI following its establishment by the U.S. Department of Energy (DOE), and his leadership has been foundational in shaping the institute&rsquo;s commercialization vision, collaborative approach&nbsp;and national impact.</p>\n\n<p>Over the past 10 years, Brosius has led more than&nbsp;60 technical innovation projects involving over 90 IACMI member organizations. These projects, supported by DOE and cost-sharing partners, represented a combined $150-plus&nbsp;million in R&amp;D investment and significantly advanced TRLs in key sectors such as additive manufacturing, automotive composites, wind energy&nbsp;and recycling. His leadership directly contributed to the commercialization of more than 25 new products and technologies.</p>\n\n<p>&ldquo;Dale has been instrumental in building IACMI into an internationally recognized institute for composites innovation,&rdquo; adds&nbsp;Duty. &ldquo;He has been a tireless advocate for innovation and collaboration and has played a pivotal role in creating the roadmap for composites commercialization in the U.S. We are grateful for his leadership and are honored to celebrate his legacy.&rdquo;</p>\n\n<p>Brosius will officially retire from his role as CCO at the end of June and will continue supporting IACMI during the leadership transition.</p>\n</div>\n\n<h3><strong>Thermwood announces executive leadership promotions</strong></h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/thermwood\" target=\"_blank\">Thermwood Corp.</a> (Dale, Ind., U.S.) announces the promotion of two key executives as part of its continued focus on innovation, growth&nbsp;and long-term leadership development.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Jason Susnjara.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-peoplenews-thermwood-jasonsusnjara-highres.jpg;maxWidth=385\" /></div>\n\n<p>Jason Susnjara, president of Thermwood.</p>\n</div>\n\n<p>Jason Susnjara has been promoted to president of Thermwood,&nbsp;succeeding&nbsp; David Hildenbrand, who recently retired after 47 years of distinguished service. With more than 30 years at the company, Susnjara has held a wide range of leadership roles across multiple departments, gaining a comprehensive understanding of the company&rsquo;s operations.</p>\n\n<p>Since 2019, he has served as executive VP, where he played a key role in guiding Thermwood&rsquo;s strategic direction and growth. He also serves on the company&rsquo;s board of directors.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Jennifer Watt\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-peoplenews-thermwood-jenniferwatt-highres.jpeg;maxWidth=385\" /></div>\n\n<p>Jennifer Watt, Thermwood executive VP.</p>\n</div>\n\n<p>Jennifer Watt has been promoted to executive VP. Since 2019, Watt has served as the company&rsquo;s chief legal officer, where she has led Thermwood&rsquo;s legal and corporate governance efforts with distinction.</p>\n\n<p>Watts holds a Juris Doctor from Chicago-Kent College of Law and a Bachelor of Science in business from the Indiana University Kelley School of Business. She is a licensed attorney in both Indiana and Illinois and serves on Thermwood&rsquo;s board of directors.</p>\n\n<div class=\"article_sidebar\">\n<h3><strong>Ilium Composites welcomes business development manager&nbsp;</strong></h3>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"José María Rodríguez Ramírez.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-illium-josémaría.jpg;maxWidth=385\" /></div>\n\n<p>Jos&eacute; Mar&iacute;a Rodr&iacute;guez Ram&iacute;rez, Ilium Composites business development manager.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/ilium-composites\" target=\"_blank\">Ilium Composites</a> (Hidd, Bahrain)&nbsp;announces the appointment of Jos&eacute; Mar&iacute;a Rodr&iacute;guez Ram&iacute;rez as business development manager, strengthening the company&rsquo;s strategic growth plans for its advanced composite material solutions across global markets.</p>\n\n<p>Based in Europe and reporting directly to managing director Luma Aljishi, Rodr&iacute;guez Ram&iacute;rez brings a combination of technical expertise, commercial acumen and international experience to Ilium. With more than&nbsp;25 years of experience in the polymer and composite materials industries, he has held senior roles in R&amp;D, technical sales, business development&nbsp;and project management at&nbsp;companies including Fiberline Composites, Owens Corning and DSM.</p>\n\n<p>Rodr&iacute;guez Ram&iacute;rez has consistently delivered optimal results throughout his career, including driving significant sales growth, developing and implementing structured business strategies, managing complex customer relationships and leading cross-functional teams. His strong technical foundation in composites technologies, particularly in resin infusion, pultrusion&nbsp;and reinforcement manufacturing, matches his robust commercial focus, making him ideally suited to support Ilium&rsquo;s expansion plans.</p>\n\n<p>At Ilium,Rodr&iacute;guez Ram&iacute;rez will play a pivotal role in identifying and developing new business opportunities, enhancing customer relationships&nbsp;and supporting the launch of innovative products. His appointment aligns with Ilium&rsquo;s commitment to delivering high-quality, customized composite solutions that meet customers&rsquo;&nbsp;evolving needs worldwide.</p>\n\n<p>Rodr&iacute;guez Ram&iacute;rez&nbsp;holds an Master&nbsp;of Science&nbsp;in chemistry from the University of Barcelona, a Bachelor&nbsp;of Science&nbsp;in business from the Universitat Oberta de Catalunya, and a Master&rsquo;s degree in Paint Technology. Fluent in English, Spanish&nbsp;and Catalan, with working proficiency in Dutch and French, he is well-positioned to support Ilium&rsquo;s international client base.</p>\n</div>\n\n<h3>&nbsp;</h3>\n\n<h3><strong>Wrexham University appoints researchers for&nbsp;Enterprise Engineering and Optics Centre project</strong></h3>\n\n<p>Two researchers in hydrogen engineering and composite materials have been appointed at <a href=\"https://wrexham.ac.uk/\" target=\"_blank\">Wrexham University</a> (Wales), as part of the institution&rsquo;s Enterprise Engineering and Optics Centre (EEOC) project.</p>\n\n<p>Barry Johnston has joined Wrexham University as research associate in hydrogen engineering, while Dr. Meysam Anamagh has been appointed as research Fellow in composite materials engineering.</p>\n\n<p>Their appointments will play a pivotal role in conducting cutting-edge research in the new EEOC, which is currently being built at the university&rsquo;s Plas Coch campus. Green hydrogen will also be developed on-site as part of the EEOC project, thanks to the installation of a hydrogen electrolyzer as part of the build, which will contribute to sustainable practices in industry.</p>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-eeoc-barryjohnson-meysamanamagh.png;maxWidth=720\" /> </div>\n\n<p>Barry Johnston and Dr. Meysam Anamagh.</p>\n</div>\n\n<p>&ldquo;I&rsquo;m delighted to have been appointed to the role, particularly at what is an optimistic time for green hydrogen production, here in North Wales,&rdquo; says Johnston.&nbsp;&ldquo;My areas of focus will be on seeking out opportunities in hydrogen research and collaborating with industry partners with an emphasis on decarbonation.&rdquo;</p>\n\n<p>Meanwhile, Anamagh will play a key role in carrying out research, collaborating with industry partners and securing funding to advance the field of composite structures.</p>\n\n<p>&ldquo;As a newly established entity within the university, my role presents a valuable opportunity to collaboratively build a versatile and forward-thinking composite research center,&rdquo; Anamagh&nbsp;notes. &ldquo;In my role, my focus will be on the design, manufacturing&nbsp;and evaluation of composite structures &mdash; specifically, my current research is centered on novel designs for hydrogen composite tanks used in automotive and aerospace applications. The overarching goal is to develop more sustainable hydrogen tanks for future applications, including aircraft and vehicles.&rdquo;</p>\n\n<p>According to&nbsp;Richard Day, professor of composites engineering and pro vice-chancellor for research at Wrexham University, both individuals bring with them extensive research experience in their fields.</p>\n\n<div class=\"article_sidebar\">\n<h3>Utah leaders join 47G board of directors</h3>\n\n<p><a href=\"https://www.linkedin.com/company/47g/\" target=\"_blank\">47G | Utah Aerospace &amp; Defense</a>&nbsp;(Salt Lake City, Utah, U.S.) has announced the&nbsp;appointment of Utah Senator Ann Millner and Governor&rsquo;s Office of Economic Opportunity (GOEO) executive director Jefferson Moss to its board of directors. With deep roots in higher education, public service and economic development, both individuals bring invaluable perspective to 47G&rsquo;s work advancing Utah&rsquo;s fast-growing aerospace and defense industries.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Ann Millner.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-47g-annmillner.jpg;maxWidth=385\" /></div>\n\n<p>Utah Senator Ann Millner.</p>\n</div>\n\n<p>Millner is a longtime champion of Utah&rsquo;s aerospace and defense ecosystem. As both president and vice president at Weber State University, she built critical relationships with Hill Air Force Base and local defense contractors, supporting collaborative research, workforce development and regional economic alignment. Under her leadership, Weber State is reported to have contributed to one of the first statewide cluster reports quantifying the economic benefits of Utah&rsquo;s defense sector.</p>\n\n<p>&ldquo;Utah&rsquo;s defense and aerospace industries are central to our economic future and national security,&rdquo; says&nbsp;Millner. &ldquo;From advanced air mobility and AI to critical minerals, we are at a pivotal point where strategic partnerships and workforce alignment will determine our long-term success. 47G is doing the work to position Utah as a national leader in innovation and industry growth, and I am honored to support this mission as a member of the board.&rdquo;</p>\n\n<p>In her role as co-chair of the legislative aerospace and defense caucus, Millner has played a key part in shaping policy conversations around Utah&rsquo;s emerging aviation technologies. She has also been actively engaged in 47G&rsquo;s Project Alta, a statewide initiative exploring the feasibility and readiness of advanced air mobility in Utah ahead of the 2034 Winter Olympic Games.</p>\n\n<p>Millner currently serves as chair of Talent Ready Utah. In this capacity, she oversees efforts made by education and industry partnerships to build a highly skilled workforce while providing students with increased career and education opportunities. She continues to advocate for strengthening the education-to-employment pipeline and addressing gaps in engineering, production and maintenance roles that are critical to the needs of defense and aerospace companies.</p>\n\n<p>&ldquo;We need to think differently about how we build and support these industries,&rdquo; Millner adds. &ldquo;Employers want graduates who are ready to contribute from day one. That means aligning our educational institutions with workforce demands and ensuring we have a business environment that fosters innovation while protecting our national interests.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Jefferson Moss.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-47g-jeffersonmoss.jpg;maxWidth=385\" /></div>\n\n<p>Governor&rsquo;s Office of Economic Opportunity (GOEO) executive director Jefferson Moss.</p>\n</div>\n\n<p>Joining her on the board is former state representative Jefferson Moss, a leader in higher education, innovation and public-private partnerships. Moss was recently appointed by Utah Governor Spencer Cox as the executive director of the GOEO. In this capacity, Moss will oversee the state&rsquo;s economic development strategy and initiatives.</p>\n\n<p>&ldquo;Utah has an opportunity to lead the nation in cutting-edge research, advanced manufacturing and defense technology,&rdquo; says&nbsp;Moss. &ldquo;From policy to capital to talent, 47G is helping connect the right partners to accelerate progress. I&rsquo;m excited to help shape that future and drive meaningful outcomes for the industries and people of Utah.&rdquo;</p>\n\n<p>In his role as associate commissioner for innovation and commercialization at the Utah System of Higher Education, Moss mobilized Utah&rsquo;s research institutions and capital networks to accelerate market-ready solutions. He also leads the Utah Innovation Fund, which supports early stage companies spun out of the state&rsquo;s colleges and universities. His efforts have expanded access to venture capital, strengthened Utah&rsquo;s commercialization infrastructure&nbsp;and driven forward-thinking public policy through the Nucleus Institute &mdash; an entity designed to address the pressing need for a more connected approach to workforce development, innovation&nbsp;and commercialization.</p>\n\n<p>&ldquo;Senator Millner and Jefferson Moss are visionary leaders who understand the long-term investments needed to ensure Utah continues to thrive as a national hub for aerospace and defense,&rdquo; concludes&nbsp;Aaron Starks, president and CEO of 47G. &ldquo;Their leadership will help strengthen our efforts to align policy, capital and talent with industry needs.&rdquo;</p>\n</div>\n\n\n\n<h3>Gurit announces changes in executive board</h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gurit-uk\" target=\"_blank\">Gurit</a>&nbsp;(Zurich, Switzerland)&rsquo;s Dr. Javier Perez-Freije, chief financial officer (CFO) and currently acting CEO&nbsp;ad interim, will be leaving the company at the end of November 2025.</p>\n\n<p>Perez-Freije&nbsp;joined Gurit in May 2024 as CFO and took on the additional role of acting CEO ad interim by end of October 2024. His steady leadership has been key in maintaining momentum across both people and business operations.</p>\n\n<p>As previously communicated on April 1, 2025, <a href=\"https://www.compositesworld.com/news/people-in-composites-april-2025\" target=\"_blank\">a permanent CEO</a>, Dr. Tobias L&uuml;hrig, has been appointed and will commence on July 1, 2025. In the meantime, Gurit will initiate the search process for the future CFO of Gurit. The nomination will be announced in due course.</p>\n\n<p>The board of directors wishes to extend its sincere appreciation to Perez-Freije. His leadership was critical during a transformative period, particularly in the successful execution of the right-sizing efforts and the pivot to its new strategic direction. The board of directors thanks Javier for his service and dedication and wishes him continued success in his future endeavors</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/people-in-composites-may-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/people-in-composites-may-2025"
  },
  {
    "published": "Wed, 28 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      28,
      17,
      0,
      0,
      2,
      148,
      0
    ],
    "title": "Space Walker relocates flagship branch for next phase of spaceplane development",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Space Walker relocates flagship branch for next phase of spaceplane development"
    },
    "summary": "The move to&nbsp;Minamisoma City supports the startup&rsquo;s future mass production of reusable composite launch vehicles, supporting Japan&rsquo;s future competitiveness in the space industry.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The move to&nbsp;Minamisoma City supports the startup&rsquo;s future mass production of reusable composite launch vehicles, supporting Japan&rsquo;s future competitiveness in the space industry."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-SpaceWalker-new-flagship-branch.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"New branch building.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-SpaceWalker-new-flagship-branch.jpg;maxWidth=720\" /> </a></div>\n\n<p>New flagship branch in&nbsp;Minamisoma&nbsp;City. Source (All Images) | Space Walker</p>\n</div>\n\n<p>On May 23,&nbsp;<a href=\"https://www.space-walker.co.jp/en\" target=\"_blank\">Space Walker Inc.</a>&nbsp;(Tokyo, Japan) announced the relocation of its flagship branch and business from Chiyoda Ward, Tokyo, to Minamisoma City,&nbsp;Fukushima Prefecture, with the purpose of further advancing its <a href=\"https://www.compositesworld.com/news/space-walker-raises-45-million-for-composite-spaceplane-business-developments\" target=\"_blank\">composites-intensive spaceplane development</a> and preparing a future mass production system. The company notes that while the flagship branch was relocated, its head office remains in Shimbashi,&nbsp;Minato-ku, Tokyo, where the Administrative Division continues to operate.</p>\n\n<p>With the establishment of a development and production base, the company aims to anchor its space transportation technology and promote the regional industry, providing an optimized environment to develop, test and manufacture spaceplanes. Space Walker&rsquo;s flagship branch specifically aims to advance social implementation of winged reusable launch vehicles while strengthening local industry infrastructure.</p>\n\n<p>Minamisoma&nbsp;City offers&nbsp;infrastructure that supports R&amp;D of robotics and advanced technology, which contributed to this decision. Space Walker says it is an&nbsp;area that is actively involved in fostering new industries, including space-related industries. Another critical factor for the new location is its sea access to the town of Taiki in Hokkaido, which Space Walker is considering as a launch pad. Under these circumstances, Space Walker will establish a development and production base in Minamisoma to promote space transportation technology and industrial infrastructure, as well as to contribute to the formation of a new industrial base deeply rooted in the region.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-spacewalker-raijinproject.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-spacewalker-raijinproject.png;maxWidth=720\" /> </a></div>\n\n<p>Space Walker&rsquo;s RaiJin and FuJin&nbsp;launch missions.</p>\n</div>\n\n<p>Space Walker is developing a winged, reusable, suborbital spaceplane for launch in the 2030s. Currently, it is progressing the&nbsp;<a href=\"https://space-walker.co.jp/en/spaceplane/plane2028\" target=\"_blank\">RaiJin Mission</a>, a small suborbital satellite launch, in March 2028.&nbsp;In spaceplane development, key components such as methane engines, composite material tanks&nbsp;and systems technology play an important role. Space Walker aims to commercialize these component units to strengthen the Japanese space industry&rsquo;s competitiveness. Head office relocation and development and production base establishment addresses these additional objectives:</p>\n\n<ul>\n\t<li>Establishing individual factories for technical testing, development&nbsp;and manufacturing of spaceplanes and various components in collaboration with local enterprises in Minamisoma City, to compose a core base for production and development systems.</li>\n\t<li>Expand employment of highly skilled technicians (engineers, manufacturing technicians, test operation staff, etc.) in the region, as well as throughout Japan and overseas.</li>\n\t<li>Promote training of next-generation space engineers in cooperation with universities and research institutions in the region and beyond</li>\n\t<li>Provide learning opportunities and events using the space industry, and collaborate with local manufacturing industries, among other options, to provide opportunities to enter the space industry from various perspectives, thus increasing regional recognition.</li>\n</ul>\n\n<p>Currently, Minamisoma&nbsp;City is actively promoting the aerospace industry under the national project &ldquo;Fukushima Innovation Coast Initiative,&rdquo; and has established the Fukushima Robot Test Field (RTF)&nbsp;and the Space Industry Promotion Office. The relocation of Space Walker&rsquo;s flagship branch to Minamisoma means that the company will follow in those same steps.</p>\n\n<p>Space Walker is a startup certified by the Tokyo University of Science that conducts R&amp;D of winged reusable rockets (spaceplanes) to provide a sustainable means of space transportation. The company is also engaged in the development, manufacturing&nbsp;and sales of next-generation composite material tanks that contribute to decarbonization.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/space-walker-relocates-flagship-branch-for-next-phase-of-spaceplane-development"
      }
    ],
    "link": "https://www.compositesworld.com/news/space-walker-relocates-flagship-branch-for-next-phase-of-spaceplane-development"
  },
  {
    "published": "Wed, 28 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      28,
      16,
      0,
      0,
      2,
      148,
      0
    ],
    "title": "FACC optimizes inspection processes through augmented reality",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FACC optimizes inspection processes through augmented reality"
    },
    "summary": "Cooperation with students from the University of Applied Sciences Upper Austria leads to successful use of AR, increasing the efficiency of components testing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Cooperation with students from the University of Applied Sciences Upper Austria leads to successful use of AR, increasing the efficiency of components testing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-facc-ai-inspection.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"FACC and Upper Austria students pose with inspected components.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-facc-ai-inspection.jpg;maxWidth=720\" /> </a></div>\n\n<p>Left to right:&nbsp;Tomas Geri (FACC), Thomas Ecker (FACC), Lena D&ouml;berl (student FH Upper Austria), Paul Nasc (student FH Upper Austria) and Franz Obermair (FH Upper Austria). Source | FACC AG</p>\n</div>\n\n<p><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.facc.com&amp;esheet=52783801&amp;newsitemid=20220718005475&amp;lan=en-US&amp;anchor=FACC&amp;index=2&amp;md5=5bfa230c491305979c57e1234ec1a3f0\" rel=\"nofollow\" target=\"_blank\">FACC</a>&rsquo;s&nbsp;(Ried im Innkreis, Austria) quality engineering team recently implemented a&nbsp;digitally supported inspection solution using augmented reality (AR), which has now been successfully tested in cooperation with students of the Smart Production and Management&nbsp;degree program at the University of Applied Sciences Upper Austria. FACC says that the novel testing method is not specifically tied to any material, however, composite materials being the company&rsquo;s main focus, it is clear that the system could be used for these kinds of applications.</p>\n\n<p>&ldquo;With the newly developed digital inspection, we are establishing an additional efficient and precise inspection method that offers significant advantages compared to conventional inspection methods,&rdquo; says CEO Robert Machtlinger, emphasizing the added value of the research project for FACC.</p>\n\n<p>With AR, digital information is integrated into the user&rsquo;s environment in real time. This is done using a tablet on which the live image of a component is superimposed with the digital content generated by a software program. The AR software, which was specially developed for industrial applications, projects inspection instructions as digital 3D overlays directly onto the respective test object. &ldquo;By automatically navigating to each inspection point and the mandatory confirmation of conformity, we minimize the risk of errors and deviations,&rdquo; explains Thomas Ecker, program engineer and head of the student project at FACC. &ldquo;This enables us to detect errors at an early stage and ensures product quality.&rdquo;</p>\n\n<p>According to FACC, the AR-supported solution offers a much faster inspection, especially for large and complex components. The automated documentation of the test results and the structured process improve quality assurance. FACC also sees potential for other areas of application in production and also in maintenance and repair work. The successful company project together with the University of Applied Sciences Upper Austria illustrates the potential of practice-oriented research and shows how digitization can be further advanced in the aviation industry.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/facc-optimizes-inspection-processes-through-augmented-reality"
      }
    ],
    "link": "https://www.compositesworld.com/news/facc-optimizes-inspection-processes-through-augmented-reality"
  },
  {
    "published": "Wed, 28 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      28,
      15,
      0,
      0,
      2,
      148,
      0
    ],
    "title": "EuCIA publishes declaration of the European Circular Composites Alliance",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "EuCIA publishes declaration of the European Circular Composites Alliance"
    },
    "summary": "Voluntary initiative intends to set&nbsp;and achieve targets on the use of recovered and recycled composites, develop standards for circular product design and provide a forum for industry voices.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Voluntary initiative intends to set&nbsp;and achieve targets on the use of recovered and recycled composites, develop standards for circular product design and provide a forum for industry voices."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eucia-circularity-chart.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composites circularity model.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eucia-circularity-chart.png;maxWidth=720\" /> </a></div>\n\n<p>Composites can be reused both in closed-loop and open-loop processes. Source |&nbsp;EuCIA publication, &ldquo;Composites are circular materials.&rdquo;</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://eucia.eu/\" target=\"_blank\">European Composites Industry Association</a>&nbsp;(EuCIA, Brussel, Belgium) has published the declaration of the European Circular Composites Alliance (ECCA), a new voluntary initiative designed to advance the circularity of composite materials and fully exploit the potential of recycled composites. Stakeholders across the value chain in Europe are now being invited to sign the declaration, speak with one voice&nbsp;and drive collective action to realize a circular economy for composite materials.</p>\n\n<p>Preparations for the official launch of the ECCA are ongoing, and the kick-off meeting is expected to take place in Q4 2025.</p>\n\n<p>The ECCA was launched by EuCIA, in partnership with <a href=\"https://www.compositesworld.com/suppliers/jec-composites\" target=\"_blank\">JEC</a> (Paris, France) <a href=\"https://www.compositesworld.com/news/eucia-jec-group-launch-european-circular-composites-alliance\" target=\"_blank\">during JEC World 2025</a> in Paris. Industry response has been overwhelmingly positive, and the letter of intent was signed by more than 100 organizations.</p>\n\n<p>The published declaration of the alliance presents the core objectives of the ECCA and sets out deliverables focused on five areas:</p>\n\n<ul>\n\t<li><em>Design for circularity and recycling</em>:&nbsp;Develop or revise guidelines for composite products</li>\n\t<li><em>Collection and sorting</em>: Target improved composites waste collection and zero landfilling of composites waste</li>\n\t<li><em>Recycled content</em>: Increase the uptake of recycled composites in new products</li>\n\t<li><em>Recycling status, R&amp;D and investment needs</em>: Identify untapped potential and guide investment planning;</li>\n\t<li><em>Monitoring</em>: Set up a voluntary system to monitor volumes of recycled composites used in European products.</li>\n</ul>\n\n<p>The declaration also outlines the structure and governance of the alliance and its code of ethics and conduct.</p>\n\n<p>&ldquo;Achieving the full circularity of composite materials will require the collaboration of all stakeholders,&rdquo; states EuCIA&rsquo;s president, Professor Roberto Frassine. &ldquo;ECCA members will commit to this goal, working together to fully establish the circular economy for composites by implementing strategies for greater reuse, repair, repurposing and recycling, and enhancing the uptake of recycled composites in new products. Composite materials play a key role in enabling sustainable technologies across countless applications and we are committed to building circular and competitive value chains in Europe to support this.&rdquo;</p>\n\n<p>To read the declaration and join the alliance <a href=\"https://www.eucia.eu/ecca\" target=\"_blank\">visit this link</a>. There is no membership fee.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/eucia-publishes-declaration-of-the-european-circular-composites-alliance"
      }
    ],
    "link": "https://www.compositesworld.com/news/eucia-publishes-declaration-of-the-european-circular-composites-alliance"
  }
]