[
  {
    "published": "Wed, 20 Aug 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      20,
      18,
      0,
      0,
      2,
      232,
      0
    ],
    "title": "Cygnet Texkimp relaunches customer slitting trials at UK Innovation Centre",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Cygnet Texkimp relaunches customer slitting trials at UK Innovation Centre"
    },
    "summary": "A production-scale prepreg tape slitting system featuring SAHM winding technology is available for thermoset, thermoplastic and ceramic tape trialing following an Asia contract win.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A production-scale prepreg tape slitting system featuring SAHM winding technology is available for thermoset, thermoplastic and ceramic tape trialing following an Asia contract win."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\"><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-cygnet-prepreg-tape-slitting-machine.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </a></div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Cygnet-slit-tape-actual-machine.JPG\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"In-house tape slitting equipment. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Cygnet-slit-tape-actual-machine.JPG;maxWidth=720\" /> </a></div>\n\n<p>In-house tape slitting equipment. Source (All Images) | Cygnet Texkimp</p>\n</div>\n\n<p>Fiber&nbsp;handling and converting technology specialist <a href=\"https://www.compositesworld.com/suppliers/cygnet-texkimp\" target=\"_blank\">Cygnet Texkimp</a> (Northwich, U.K.) has unveiled its next-gen production-scale prepreg&nbsp;tape slitting machine installed at its&nbsp;UK Innovation Centre.</p>\n\n<p>The technology has been developed to support advances in automated fiber placement (AFP) and automated tape laying (ATL) applications for aerospace and other high-performance industries. Organizations can trial the slitting of continuous thermoset, thermoplastic and ceramic prepreg tapes in real-world conditions using their own materials or those produced on Cygnet Texkimp&rsquo;s in-house R&amp;D prepreg machines (those interested in trialing <a href=\"https://cygnet-texkimp.com/contact/\" target=\"_blank\">can reach out here</a>). The system can slit tapes at speeds of up to 60 meters/minute, subject to the input material.</p>\n\n<p>The move follows the sale of the company&rsquo;s original demonstrator machine to a composite material manufacturer based in East Asia. The contract was won after a successful program&nbsp;of trials using the customer&rsquo;s prepreg materials to produce tapes for AFP applications in the aerospace market. The machine was subsequently upgraded by Cygnet Texkimp to retrofit in-process monitoring and data capture and enable&nbsp;the management of key data including tape width, thickness and consistency. In this way the customer can create digital passports for the slit tapes which can then be tracked in the downstream process.</p>\n\n<p>Cygnet Texkimp&rsquo;s&nbsp;prepreg&nbsp;tape slitting technology is typically used by materials producers to develop tapes for the high-rate production of composite parts, including large-scale parts, using AFP and ATL.&nbsp;Notably, it enables manufacturers to integrate the slitting process into their own production environment rather than subcontracting. According to Cygnet Texkimp, having the resources to convert prepreg on-site gives manufacturers complete control of production quality and speed and removes the need to ship or store materials, therefore enhancing efficiency and profitability. This is particularly important in the case of thermoset prepregs, which have a limited shelf life and need to be stored in special conditions.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Cygnet-tapeslitting-winding-tech.jpg\" target=\"_blank\"><img alt=\"Tape slitting up close.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Cygnet-tapeslitting-winding-tech.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>With increasing emphasis on automation in composite layup, the quality of the slit tapes is a critical enabler for part performance and manufacturing reliability. Cygnet Texkimp&rsquo;s machine is engineered to achieve very high levels of accuracy and consistency in the slitting of continuous thermoset, thermoplastic, ceramic and other materials. Its design draws on extensive understanding of material behavior to deliver accurate and uniform slit tapes&nbsp;with minimal material scrap&nbsp;or operational downtime.</p>\n\n<p>The slitting machine features fiber&nbsp;and tape spooling banks provided by winding technology specialist <a href=\"https://www.sahmwinder.com/\" target=\"_blank\">SAHM</a> (Eschwege, Germany) and is capable of processing intermediate materials including a polymer interleaf. SAHM&rsquo;s 460XE compact and modular winders feature a low-maintenance, reliable design, capable of handling various bobbin types and winding materials with efficient product changes. The technology offers the flexibility to wind packages in a variety of formats, including pineapple and cassette formations. The two companies have worked together for almost 50 years, since Cygnet Texkimp first became SAHM&rsquo;s agent and reseller in the U.K.</p>\n\n<p>Feedback from customer trials has shown that Cygnet Texkimp&rsquo;s equipment helps to improve uptime in the downstream process, reduces scrap and increases speed, efficiency and equipment ROI.</p>\n\n<p>&ldquo;We rebuilt our slitter spooler capability back into our Innovation Centre after a particularly successful trial program&nbsp;resulted in the sale of our original machine,&rdquo; says Graeme Jones, wide web product director at Cygnet Texkimp. &ldquo;The technologies we have in the Centre&nbsp;are the same designs we have out in the market, and this results in very reliable and realistic test programs that prove out processes and illustrate ROI. In this case, the machine was able to completely satisfy the customer with regards to speed and efficiency, and we were able to agree a deal for the same machine that was used in the trials and further equip it to deliver a bespoke solution.&rdquo;</p>\n\n<p>Jones adds that Cygnet Texkimp is looking forward to engaging with partners at&nbsp;early stage&nbsp;in-process development&nbsp;to test out their concepts, explore machine parameters, assess output quality and validate performance with support from Cygnet&rsquo;s team.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cygnet-texkimp-relaunches-customer-slitting-trials-at-uk-innovation-centre"
      }
    ],
    "link": "https://www.compositesworld.com/news/cygnet-texkimp-relaunches-customer-slitting-trials-at-uk-innovation-centre"
  },
  {
    "published": "Wed, 20 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      20,
      17,
      0,
      0,
      2,
      232,
      0
    ],
    "title": "AMSL Aero secures $3 million to progress Australian LH2 aviation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AMSL Aero secures $3 million to progress Australian LH2 aviation"
    },
    "summary": "Project goals include designing LH2 refueling systems, validating power distribution and fuel measurement in flight,&nbsp;and gathering evidence to support future national regulatory frameworks.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Project goals include designing LH2 refueling systems, validating power distribution and fuel measurement in flight,&nbsp;and gathering evidence to support future national regulatory frameworks."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-amslaero-h2-fuel-cell.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-amslaero-h2-fuel-cell.jpg;maxWidth=720\" /> </a></div>\n\n<p>Associate senior engineer Alfie Swallow works on AMSL Aero's hydrogen fuel cell. Source |&nbsp;Peter Morris/AMSL Aero</p>\n</div>\n\n<p><a href=\"https://www.amslaero.com/\" target=\"_blank\">AMSL Aero</a>&nbsp;(Sydney, Australia) has&nbsp;secured $3 million in grant funding from the Australian federal government to&nbsp;develop and demonstrate liquid hydrogen-powered aircraft for regional and remote Australia. The platform being used is the company&rsquo;s&nbsp;hydrogen-electric vertical takeoff and landing (eVTOL) aircraft <em>Vertiia</em>, which comprises an&nbsp;electric motor with a battery, a hydrogen fuel cell and a composite tank.</p>\n\n<p>The 2-year project, called Liquid Hydrogen Powered Aircraft for Regional and Remote Australia, is worth $7.56 million in total. It was awarded by the Australian Government Department of Industry Cooperative Research Centres Projects (CRC-P) Program.</p>\n\n<p>AMSL Aero will collaborate with liquid hydrogen (LH<sub>2</sub>)&nbsp;company Fabrum, Monash University&nbsp;and Deakin University to address the technical, regulatory&nbsp;and safety challenges of hydrogen-powered eVTOL aircraft in real-world environments. The project will focus on designing safe&nbsp;LH<sub>2&nbsp;</sub>refueling systems,&nbsp;testing advanced fuel measurement and power distribution during various stages of flight of <em>Vertiia</em>, securing evidence for the development of national regulatory pathways, and demonstrating refueling procedures integrated with aircraft systems.</p>\n\n<p><em>Vertiia</em> is a new generation of aircraft that take off and land like a helicopter but fly fast and smoothly like a fixed-wing airplane.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/amsl-aero-secures-3-million-to-progress-australian-lh2-aviation"
      }
    ],
    "link": "https://www.compositesworld.com/news/amsl-aero-secures-3-million-to-progress-australian-lh2-aviation"
  },
  {
    "published": "Wed, 20 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      20,
      16,
      0,
      0,
      2,
      232,
      0
    ],
    "title": "ISCC Plus validates Teijin Aramid’s use of alternative feedstocks in Twaron fiber production",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ISCC Plus validates Teijin Aramid’s use of alternative feedstocks in Twaron fiber production"
    },
    "summary": "The certification ensures that Twaron-based tire components can be produced with bio-based and recycled feedstocks&nbsp;while maintaining high performance standards.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The certification ensures that Twaron-based tire components can be produced with bio-based and recycled feedstocks&nbsp;while maintaining high performance standards."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div>&nbsp;</div>\n</div>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/0324-cw-news-teijin-aramid-twaron-yarn.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/0324-cw-news-teijin-aramid-twaron-yarn.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Teijin Aramid</p>\n</div>\n\n<p>High-performance aramid fibers manufacturer <a href=\"https://www.compositesworld.com/suppliers/teijin-aramid-bv\" target=\"_blank\">Teijin&nbsp;Aramid</a> (Arnhem, Netherlands) has achieved ISCC Plus certification, acknowledging that the company&rsquo;s sourcing and&nbsp;processing of alternative feedstocks meet internationally recognized sustainability standards.&nbsp;</p>\n\n<p>The certification also enables the use of ISCC Plus-certified raw materials &mdash;&nbsp; including&nbsp;bio-based and recycled feedstocks&nbsp;&mdash;&nbsp;within a mass balance framework. This approach enables certified and conventional materials to be processed together under controlled conditions, ensuring full traceability and third-party validation.</p>\n\n<p>Teijin&rsquo;s aramid tires are primarily made with&nbsp;Twaron, a high-performance para-aramid fiber, which is incorporated into the tire&rsquo;s structure as a cap ply, belt&nbsp;and carcass. According to the company, Twaron fiber-reinforced tire components produced under ISCC Plus&nbsp;can help manufacturers</p>\n\n<ul>\n\t<li>Reduce Scope 3 emissions by integrating certified alternative feedstocks</li>\n\t<li>Meet growing regulatory and OEM requirements for circular materials</li>\n\t<li>Maintain high mechanical performance across UHP, electric vehicle&nbsp;and commercial tire applications.</li>\n</ul>\n\n<p>Teijin Aramid&rsquo;s latest sustainability report highlights steady progress across operations, including a 28% reduction in the carbon footprint of Twaron since 2014 and the use of 100% renewable electricity at Dutch production sites. ISCC Plus&nbsp;certification adds an additional layer of transparency and validation at the material sourcing level.</p>\n\n<p>Customers can now make third-party verified sustainability claims for aramid-reinforced tire components, support rolling resistance reduction and lightweight construction goals and participate in emerging circular initiatives such as end-of-life aramid recovery and reuse.</p>\n\n<p>Looking ahead, Teijin Aramid continues to invest in the development of bio-based Twaron&nbsp;variants and is exploring closed-loop recycling models in collaboration with industry partners, all in an effort to support a more sustainable, transparent&nbsp;and high-performance future for the global tire industry.</p>\n\n<p>&ldquo;The tire industry is under pressure to reduce emissions and adopt circular materials without compromising safety or performance,&rdquo; says Hendrik de Zeeuw, chief commercial officer at Teijin Aramid. &ldquo;This certification helps us support our customers with verifiable, lower-impact solutions that meet both technical and sustainability goals.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/iscc-plus-validates-teijin-aramids-use-of-alternative-feedstocks-in-twaron-fiber-production"
      }
    ],
    "link": "https://www.compositesworld.com/news/iscc-plus-validates-teijin-aramids-use-of-alternative-feedstocks-in-twaron-fiber-production"
  },
  {
    "published": "Wed, 20 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      20,
      15,
      0,
      0,
      2,
      232,
      0
    ],
    "title": "DITF launches €4.2 million recycling projects to advance fiber, textile circular economies",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DITF launches €4.2 million recycling projects to advance fiber, textile circular economies"
    },
    "summary": "The initiatives focus on creating industrial-scale processes for recycled high-performance fibers and transforming textile waste into high-quality yarns.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The initiatives focus on creating industrial-scale processes for recycled high-performance fibers and transforming textile waste into high-quality yarns."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-ditf-rcf-tapes.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"RCF tapes.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-ditf-rcf-tapes.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | DITF</p>\n</div>\n\n<p>Addressing the low recycling rate of textile and fiber materials, the&nbsp;<a href=\"https://www.ditf.de/en/index/ditf.html\" target=\"_blank\">German Institutes of Textile and Fiber Research Denkendorf</a>&nbsp;(DITF), reported to be Europe&rsquo;s largest textile research center,&nbsp;has launched two projects with a total project volume of more than &euro;4.2 million.</p>\n\n<p>To promote the recycling of high-performance fibers &mdash; such as carbon and glass fibers&nbsp;&mdash;&nbsp;the DITF will establish a center for the development of high-performance fiber composite structures based on recycled high-performance fibers (HiPerReF) over the next 2&nbsp;years. There, scientists are developing a complete process chain for the industrial-scale production of highly oriented semi-finished products from recycled carbon and glass fibers. In order to achieve maximum performance in the final component, the interaction of all machines and equipment is being optimized to produce commercially available semi-finished products such as prepreg and nonporous composite plastics with a fiber volume fraction of more than 45%.</p>\n\n<p>The CYCLOTEXUM project focuses on recycling classic textile waste into high-quality yarns. The aim is to intelligently combine existing mechanical, physical&nbsp;and chemical process steps so that fine, uniform yarns can be produced from secondary raw materials. The Material Flow and Cost Accounting (MFCA) developed at the DITF makes it possible to review all technological developments for economic efficiency and sustainability.</p>\n\n<p>The research work of the two centers aims to provide&nbsp;the national and global textile industry with tools and solutions for an effective textile circular economy.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ditf-launches-42-million-recycling-projects-to-advance-fiber-textile-circular-economies"
      }
    ],
    "link": "https://www.compositesworld.com/news/ditf-launches-42-million-recycling-projects-to-advance-fiber-textile-circular-economies"
  },
  {
    "published": "Wed, 20 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      20,
      14,
      0,
      0,
      2,
      232,
      0
    ],
    "title": "Hexagon Agility lands major CNG orders in Mexico and Jordan to advance clean energy transition",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexagon Agility lands major CNG orders in Mexico and Jordan to advance clean energy transition"
    },
    "summary": "Deployments will supply onboard CNG fuel systems for 100 Cummins X15N-powered trucks in Mexico&rsquo;s largest fleet and deliver ADR X-Store Mobile Pipeline modules to Jordan&rsquo;s Watani in deals set to begin delivery in Q3 2025.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Deployments will supply onboard CNG fuel systems for 100 Cummins X15N-powered trucks in Mexico&rsquo;s largest fleet and deliver ADR X-Store Mobile Pipeline modules to Jordan&rsquo;s Watani in deals set to begin delivery in Q3 2025."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orange truck.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-hexagonagility-trayecto-mexico.jpg;maxWidth=720\" /> </div>\n\n<p>Source | Hexagon Agility</p>\n</div>\n\n<p><a href=\"http://hexagonagility.com/\" target=\"_blank\">Hexagon Agility</a>&nbsp;(Costa Mesa, Calif., U.S.), a <a href=\"https://www.compositesworld.com/suppliers/hexagon-composites-asa\" target=\"_blank\">Hexagon Composites</a> (&Aring;lesund, Norway) business, continues to support the transition to compressed natural gas (CNG) with two orders: A fuel systems order&nbsp;for X15N natural gas-powered trucks in Mexico, and&nbsp;an inaugural order for Mobile Pipeline modules for safer, more efficient CNG delivery in Jordan.</p>\n\n<p>Fuel systems will be used for&nbsp;100 heavy-duty trucks to be operated by Trayecto, said to be the&nbsp;largest trucking company in Mexico. This deployment is a major milestone for the region and made possible through collaboration with Kenworth Mexicana. All of these new trucks will feature Cummins&rsquo; X15N engine, coupled with Hexagon Agility&rsquo;s largest available onboard CNG fuel systems. This configuration for Trayecto will deliver the largest hauling capacity achieved to date by commercial CNG trucks, Hexagon Agility reports.</p>\n\n<p>The combination of the&nbsp;X15N engine and Hexagon Agility&rsquo;s fuel systems enables these trucks to have a driving range of more than&nbsp;1,000 kilometers while hauling very heavy loads &mdash;&nbsp;critical for maintaining operational efficiency.&nbsp;Deliveries are scheduled to start in Q3 2025.</p>\n\n<p>Hexagon Agility is also delivering its&nbsp;Mobile Pipeline&nbsp;ADR X-Store 45-foot modules to&nbsp;Watani, The National Advanced Natural Gas Company of Jordan.&nbsp; The order represents an estimated value of $6.9 million. Deliveries are also scheduled to start in Q3 2025.</p>\n\n<p>Watani was created in alignment with Jordan&rsquo;s national strategy to secure reliable energy supplies and reduce dependence on imports. The company is the result of years of dedicated efforts to fulfill the Kingdom&rsquo;s vision of advancing toward sustainable and clean energy while using national resources to support industries and the economy.</p>\n\n<p>According to&nbsp;Khalil Abu Al-Rubb, chairman of Jordan LNG, joint owner of Watani, the Mobile Pipeline&nbsp;solution &ldquo;is a natural fit for our ambitions because it offers the flexibility, safety&nbsp;and efficiency we need to reach industrial zones and remote communities alike.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexagon-agility-lands-major-cng-orders-in-mexico-and-jordan-to-advance-clean-energy-transition"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexagon-agility-lands-major-cng-orders-in-mexico-and-jordan-to-advance-clean-energy-transition"
  },
  {
    "published": "Tue, 19 Aug 2025 08:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      19,
      12,
      0,
      0,
      1,
      231,
      0
    ],
    "title": "Scaled Composites Model 437 aircraft to be flown for Beacon autonomy testbed",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Scaled Composites Model 437 aircraft to be flown for Beacon autonomy testbed"
    },
    "summary": "Northrop Grumman subsidiary part of Digital Pathfinder development of stealth aircraft with wings using continuous carbon fiber additive manufacturing and determinate assembly.\n\n&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Northrop Grumman subsidiary part of Digital Pathfinder development of stealth aircraft with wings using continuous carbon fiber additive manufacturing and determinate assembly.\n\n&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-beacon-m437-opener.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Scaled Composites Model 437 aircraft Beacon testbed features SCRAM composites\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-beacon-m437-opener.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Northrop Grumman, Siemens, Electroimpact, Scaled Composites</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/northrop-grumman-tactical-space-space-components\" target=\"_blank\">Northrop Grumman</a>&nbsp;(Falls Church, Va., U.S.) has announced it will use the <em>Model 437</em> aircraft built&nbsp;by subsidiary <a href=\"https://www.compositesworld.com/suppliers/scaled-composites\" target=\"_blank\">Scaled Composites</a> (Mojave, Calif., U.S.) to test its Beacon autonomy ecosystem this year. This pioneering system will be tested in a pioneering aircraft &mdash; most likely the first to use continuous carbon fiber additive manufacturing in primary structures, namely the wings &mdash; showcasing Northrop Grumman&rsquo;s investment and achievements via its <a href=\"https://www.northropgrumman.com/what-we-do/air/using-the-digital-ecosystem-for-future-programs\" target=\"_blank\">Digital Pathfinder</a> and Advanced Manufacturing teams.</p>\n\n<p>Beacon is built on more than 500,000 autonomous flight hours and integrates advanced autonomous software and solutions within a digital environment that aims to accelerate software deployment, reduce risk and improve readiness for future aircraft programs.</p>\n\n<p>Six partners &mdash; Applied Intuition, Autonodyne, Merlin, Red 6, Shield AI and SoarTech, an Accelint company &mdash; will test and refine their solutions using the <em>Model 437</em> with Northrop Grumman&rsquo;s flight autonomy hardware during a series of flight demonstrations this year.</p>\n\n<div></div>\n\n<h3>&nbsp;</h3>\n\n<h3><strong><em>Model 437</em> via Digital Pathfinder</strong></h3>\n\n<p>According to the&nbsp;<a href=\"https://scaled.com/portfolio/vanguard/\" target=\"_blank\">Scaled Composites website</a>,&nbsp;<em>Model 437</em> began as a conceptual design exploring a multi-mission low-cost attritable aircraft, with <em>Vanguard</em> as a crewed variant. The 41-foot-long&nbsp;aircraft has a 41-foot wingspan, gross takeoff weight of 10,000 pounds and is powered by a single 3,400-pound-thrust Pratt &amp; Whitney engine.</p>\n\n<p>It was also a key demonstrator&nbsp;for the Digital Pathfinder team to develop an innovative stealth aircraft using&nbsp;a&nbsp;fully connected digital environment.&nbsp;The integration of digital tools and processes combined with advanced manufacturing techniques enabled the <em>Model 437</em> to be built faster and more affordably. Indeed, its <a href=\"https://www.compositesworld.com/news/scaled-composites-conducts-first-model-437-aircraft-flight\" target=\"_blank\">first flight in August 2024</a> was just 27 months after starting the project.</p>\n\n<p>As explained&nbsp;in the&nbsp;2024 <em>Breaking Defense</em> article,&nbsp;<a href=\"https://breakingdefense.com/2024/10/the-wings-of-the-m437-take-flight-after-being-developed-in-a-fully-connected-digital-ecosystem/\" target=\"_blank\">&ldquo;The wings of the M437 take flight after being developed in a fully connected digital ecosystem&rdquo;</a>,&nbsp;Northrop Grumman led design, build and manufacturing of the aircraft&rsquo;s removable wing assemblies while Scaled Composites managed aerodynamic and structural analysis, fuselage and empennage fabrication, aircraft assembly and systems integration as well as ground and flight tests.</p>\n\n<div></div>\n\n<h3>&nbsp;</h3>\n\n<h3><strong>AM composite and titanium wings</strong></h3>\n\n<p>Northrop Grumman fellow in advanced manufacturing, Eric Barnes, explained in a <a href=\"https://www.linkedin.com/posts/eric-barnes-a12b2422_the-wings-of-the-m437-take-flight-after-being-activity-7256462525410508800-snON?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAN4sCoBEnrOaN1_kOmfslSmxd1f5UfO6WM\" target=\"_blank\">LinkedIn post</a>&nbsp;how new targeted determinate assembly techniques and composite AM processes were used to build the aircraft&rsquo;s wings.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p><strong>Read more about the SCRAM system:</strong></p>\n\n<ul>\n\t<li>&ldquo;<a href=\"https://www.compositesworld.com/news/siemens-and-electroimpact-highlight-capabilities-of-scram-continuous-fiber-3d-printing-system\" target=\"_blank\">... capabilities of SCRAM continuous fiber 3D printing system</a>&rdquo;</li>\n\t<li>&ldquo;<a href=\"https://www.compositesworld.com/news/electroimpacts-6-axis-continuous-fiber-3d-printer-one-part-of-future-multi-functional-manufacturing-cell\" target=\"_blank\">Electroimpact&rsquo;s 6-axis continuous fiber 3D printer, &hellip; </a>&rdquo;</li>\n\t<li><a href=\"https://www.compositesworld.com/articles/combining-afp-with-3d-printing-for-flexible-parts-production\" target=\"_blank\">Interview with SCRAM&rsquo;s engineering team</a></li>\n</ul>\n</div>\n</div>\n\n<p>&ldquo;We utilized fully digital information through our patented Scalable Composite Robotic Additive Manufacturing (SCRAM) capability that required no hard tooling,&rdquo; he says, &ldquo;only a rapidly deposited polymer wash away tool. Combined with no secondary cures or autoclaves needed in this process, we greatly reduced cost and schedule timelines.&rdquo;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2020-CW/1120-cw-supplement-electroimpact-fig2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"SCRAM additive manufacturing system unveiled in 2020\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2020-CW/1120-cw-supplement-electroimpact-fig2.jpg;maxWidth=720\" /> </a></div>\n\n<p>Electroimpact&rsquo;s SCRAM additive manufacturing system in 2020. See <a href=\"https://www.compositesworld.com/articles/combining-afp-with-3d-printing-for-flexible-parts-production\" target=\"_blank\">&ldquo;Combining AFP with 3D printing ...&rdquo;</a></p>\n</div>\n\n<blockquote>\n<p>&ldquo;We have multiple patents associated with this continuous fiber additive manufacturing cell. One of these patents allows machines to switch between materials, laying down continuous fiber composites in true 3D form. This enables us to align fibers with load directions, producing lighter, stronger structures with less material.&rdquo;&nbsp;&mdash; Eric Barnes, in 2024&nbsp;<em>Breaking Defense</em> article</p>\n</blockquote>\n\n<p>&ldquo;We also incorporated Plasma Arc Directed Energy Deposition [using] titanium for some of the primary structure of the wing,&rdquo; said Barnes, &ldquo;which we believe was the first time this process was used in a defense primary structural application. Through this we are seeing a 30% reduction in cost and schedule timelines for these parts, compared to traditional processes.&rdquo;</p>\n\n<h3><strong>Digital thread, determinate assembly</strong></h3>\n\n<p>Sarah Beaudin, DPF director at Northrop Grumman, noted in the <em>Breaking Defense</em> article that in today&rsquo;s world, the ability to deliver high-tech, high-end aircraft/aerospace solutions within tighter timelines is imperative. &ldquo;Digital engineering makes that possible,&rdquo; she added. &ldquo;Our digital environment provides near-real-time visibility, creating a single source of truth. This allows us to adopt a shift-left approach &mdash; iterating everything from design through sustainment as early as possible in the program. By the time we actually start building things, we&rsquo;ve already got it right.&rdquo;</p>\n\n<p>&ldquo;We integrated suppliers into the digital transformation collaborative toolset,&rdquo; Barnes explained. &ldquo;This was a game-changer in many ways. To perform determinant assembly effectively, we need to push digital collaboration down to our suppliers, integrating them into our digital toolsets.&rdquo;</p>\n\n<p>This capability reduced not only the timeline but also costs. &ldquo;Typical programs budget 15-20% for engineering rework,&rdquo; said Beaudin. &ldquo;We saw less than 1%. In addition, we saw improved efficiencies on the manufacturing floor.&rdquo;</p>\n\n<ul>\n</ul>\n\n<p>Just as the power of collaboration has been demonstrated by Digital Pathfinder in the <em>Model 437</em> platform, Beacon will reportedly do the same for autonomy. &nbsp;</p>\n\n<blockquote>\n<p>&ldquo;By providing open access to the Beacon ecosystem, we&rsquo;re enhancing the innovation, new competition and ultimately the autonomous capabilities that industry can deliver to our customers, with unmatched speed and at scale,&rdquo;&nbsp;&mdash; Tom Jones, corporate vice president and president, Aeronautics Systems, Northrop Grumman.</p>\n</blockquote>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/scaled-composites-model-437-aircraft-to-be-flown-for-beacon-autonomy-testbed"
      }
    ],
    "link": "https://www.compositesworld.com/news/scaled-composites-model-437-aircraft-to-be-flown-for-beacon-autonomy-testbed"
  },
  {
    "published": "Mon, 18 Aug 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      18,
      18,
      0,
      0,
      0,
      230,
      0
    ],
    "title": "Trelleborg invests in Innovation Center expansion, remodel",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Trelleborg invests in Innovation Center expansion, remodel"
    },
    "summary": "An additional purpose-built space in Delano, Minnesota, by early 2027 adds a&nbsp;visitor center, Swiss machining, injection molding and increased space for automation.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "An additional purpose-built space in Delano, Minnesota, by early 2027 adds a&nbsp;visitor center, Swiss machining, injection molding and increased space for automation."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-trelleborg-innovationcenter.jpg\" target=\"_blank\"><img alt=\"Trelleborg Innovation Center.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-trelleborg-innovationcenter.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Trelleborg Sealing Solutions</p>\n</div>\n\n<p><a href=\"https://www.trelleborg.com/en/seals\" target=\"_blank\">Trelleborg Sealing Solutions</a>&nbsp;(Fort Wayne, Ind., U.S.) has announced the significant expansion of its&nbsp;Innovation Center in Minnesota, to take on&nbsp;additional projects and accelerate the design and development cycle for customers. The Innovation Center &mdash;&nbsp;currently in the city of Plymouth &mdash;&nbsp;will concurrently move to a new purpose-built space in nearby Delano.</p>\n\n<p>As described upon the company&rsquo;s <a href=\"https://www.compositesworld.com/news/trelleborg-expands-capabilities-through-us-innovation-center\" target=\"_blank\">opening of the center</a> announced in June 2024, the facility&rsquo;s core&nbsp;competencies include &ldquo;design, consultation, toolmaking&nbsp;(metal), prototyping, high-precision machining, silicone molding, thermoset elastomer molding, thermoplastic molding (including thermoplastic composites molding), automation, assembly and secondary operations.&rdquo; It also offers advice on design for manufacturability (DfM), mold flow analysis, build to 3D CAD models, raw materials traceability and more.</p>\n\n<p>&ldquo;We know that speed to market and high quality, reliable supply are critical factors in our customer partnerships,&rdquo; says Mel Melehes, regional sales director for North America. &ldquo;With increased capabilities, the Innovation Center is a dedicated space with personnel possessing decades of combined experience. It enables customers to work with design, materials and quality experts throughout the entire life cycle of a project.&rdquo;</p>\n\n<p>This project involves a remodel of the tool shop and room for expansion, 6,000 square feet/557 square meters total. It also includes nearly 40,000 square feet/3,716 square meters of new construction comprising a visitor center, additional high-end Swiss machining, injection molding and increased space for the automation laboratory.</p>\n\n<p>&ldquo;The visitor center will be a collaborative, high-tech meeting area where customers can brainstorm on project ideas alongside our experts,&rdquo; notes Chris Tellers, Innovation Center and new product development director. &ldquo;The additional Swiss machining and injection molding will enhance our in-house capabilities to provide the highest quality components fast without relying on outside shops.</p>\n\n<p>&ldquo;The increased automation space provides scalability to support future projects,&rdquo; Tellers continues. &ldquo;We continually hear from customers that they choose us for our expertise in tooling, technical solutions and ability to assist with everything from prototyping to serial production enhanced with automation. This remodel and expansion project enables us to continue doing that but on a larger scale, using more equipment and experts added through our new apprenticeship program.&rdquo;</p>\n\n<p>The Innovation Center move and expansion project is scheduled to start in&nbsp; spring 2026 with a scheduled completion date of early 2027.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/trelleborg-invests-in-innovation-center-expansion-remodel"
      }
    ],
    "link": "https://www.compositesworld.com/news/trelleborg-invests-in-innovation-center-expansion-remodel"
  },
  {
    "published": "Mon, 18 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      18,
      16,
      0,
      0,
      0,
      230,
      0
    ],
    "title": "SGL Carbon reports lower sales amid weak markets, early gains from Carbon Fibers restructuring",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SGL Carbon reports lower sales amid weak markets, early gains from Carbon Fibers restructuring"
    },
    "summary": "SGL Carbon&rsquo;s half-year 2025 results show a significant drop in sales, driven mainly by weaker semiconductor demand and heightened global trade tensions impacting key markets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "SGL Carbon&rsquo;s half-year 2025 results show a significant drop in sales, driven mainly by weaker semiconductor demand and heightened global trade tensions impacting key markets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-sgl-sigratex.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Sigratex textile materials. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-sgl-sigratex.jpg;maxWidth=720\" /> </a></div>\n\n<p>Sigratex textile materials. Source | SGL Carbon</p>\n</div>\n\n<p>Increasing uncertainty about the future development of global trade, tariff increases between the U.S. and Europe, and weak demand in some of its markets have weighed on <a href=\"https://www.compositesworld.com/suppliers/sgl-carbon-se\" target=\"_blank\">SGL Carbon</a>&rsquo;s (Wiesbaden, Germany) sale and performance for the first half of 2025. On the other hand, the <a href=\"https://www.compositesworld.com/news/sgl-carbon-makes-decision-to-restructure-carbon-fibers-business\" target=\"_blank\">restructuring</a> of SGL&rsquo;s Carbon Fibers business unit is showing initial signs of success. After 6 months of fiscal 2025, SGL Carbon generated sales of &euro;453.2 million, down 15.8% on the previous year (H1 2024: &euro;538.0 million).</p>\n\n<p>The group&rsquo;s decline in sales is&nbsp;primarily attributable to negative volume effects, while currency and price effects played only a minor role. In particular, the ongoing weak demand from SGL&rsquo;s semiconductor customers in the Graphite Solutions business unit weighed on sales development. Furthermore, the Carbon Fibers business unit reported lower sales as a result of the discontinuation of unprofitable business activities as part of the company&rsquo;s restructuring.</p>\n\n<p>While this unit&rsquo;s restructuring did result in some cost savings, and there was a&nbsp;slight improvement in adjusted EBITDA in SGL&rsquo;s&nbsp;Process Technology business unit, these&nbsp;developments were unable to offset the shortfall in earnings contributions from the decline in the high-margin semiconductor business. Adjusted EBITDA decreased by 16.2% compared to the first half of 2024 to &euro;72.5 million (H1 2024: &euro;86.5 million). The adjusted EBITDA margin remained almost unchanged at 16.0% compared to the previous year (H1 2024: 16.1%).</p>\n\n<p>Taking into account depreciation and amortization of &euro;25.8 million (H1 2024: &euro;27.0 million) and non-recurring and special items of &euro;-49.9 million (H1 2024: &euro;3.6 million), EBIT for the first half of 2025 amounted to &euro;3.2 million (H1 2024: &euro;55.9 million). The non-recurring and special items result in particular from restructuring expenses of &euro;47.0 million.<br />\n&nbsp;</p>\n\n<h3><strong>SGL business units</strong></h3>\n\n<p>The <strong>Graphite Solutions (GS)</strong> business unit reported sales of &euro;221.0 million in the first half of 2025, down 22.2% on the same period of the previous year (H1 2024: &euro;284.2 million). This significant decline in sales is primarily attributable to lower demand in the Semiconductor and&nbsp;LED market segment, which saw a significant drop in sales of &euro;63.4 million to &euro;78.4 million (H1 2024: &euro;141.8 million).</p>\n\n<p>&ldquo;Our customers&rsquo;&nbsp;demand for graphite components for the semiconductor industry is a key driver of sales and earnings for the entire SGL Carbon business,&rdquo; explains Andreas Klein, CEO of SGL Carbon and head of the GS business unit.&nbsp;&ldquo;As expected, demand was weak in the first half of 2025 due to continued high inventory levels at our customers. In addition, Western electric vehicle [EV] manufacturers in particular postponed market launches of new vehicle models with silicone carbide&nbsp;[SiC] semiconductor structures. We generally expect demand to pick up again once our customers have reduced their inventories, but it will continue to be driven by EV&nbsp;sales figures in the future.&rdquo;</p>\n\n<p>The significant decline in sales in the high-margin business with SiC semiconductor customers had a negative impact on GS&rsquo;&nbsp;adjusted EBITDA. Compared to the same period last year, this business unit&rsquo;s&nbsp;adjusted EBITDA decreased to &euro;40.8 million (H1 2024: &euro;72.2 million). Measures initiated to reduce personnel and energy costs only partially offset the volume-related decline. The adjusted EBITDA margin decreased significantly to 18.5% in a 6-month comparison (H1 2024: 25.4%).</p>\n\n<blockquote>\n<p>&ldquo;SGL Carbon is not immune to the economic environment or developments in our sales markets&hellip;&nbsp;[but] we will continue to optimize our cost structures and work on developing new market segments.&rdquo;</p>\n</blockquote>\n\n<p>With sales of &euro;70.2 million, slightly up on the same period of the previous year (H1 2024: &euro;69.9 million), the <strong>Process Technology (PT) </strong>business unit confirmed the stability of its business activities. PT benefited in particular from its global customer base, especially in Q1 2025. The completion of several major projects was also reflected in adjusted EBITDA. This increased from &euro;16.0 million in the same period of the previous year to &euro;19.9 million. Higher capacity utilization and positive cost effects for raw materials led to an improvement in the adjusted EBITDA margin from 22.9% in the first half of 2024 to 28.3% in the first half of 2025.</p>\n\n<p>The restructuring announced in February 2025 showed initial success in the first half of 2025, with positive adjusted EBITDA for SGL&rsquo;s&nbsp;<strong>Carbon Fibers (CF)</strong> business unit. The discontinuation of loss-making business activities resulted in a 15.1% decline in sales to &euro;93.5 million (H1 2024: &euro;110.1 million) but also led to an increase in adjusted EBITDA for CF from &euro;-4.4 million to &euro;5.2 million year-on-year.</p>\n\n<p>&ldquo;As part of the CF restructuring, production at our site in Lavradio [Portugal], which mainly produced acrylic fibers and precursors for carbon fibers, was closed down,&rdquo; says Dr. Stephan B&uuml;hler, member of the executive board responsible for this area.&nbsp;&ldquo;Production and consequently also our business activities in the acrylic fibers and precursors product areas were completely discontinued at the end of June 2025. CF will focus in future on profitable products with greater differentiation from the international competition.&rdquo;</p>\n\n<p>It should be noted that the adjusted EBITDA of the CF business unit includes an earnings contribution of &euro;4.7 million from its equity-accounted joint venture BSCCB (H1 2024: &euro;7.9 million). The decline in BSCCB&rsquo;s earnings contribution is due to the costs of expanding production capacity and volatile demand from automotive customers. Excluding the earnings contribution of the equity-accounted BSCCB, adjusted EBITDA for CF would have been &euro;0.5 million (H1 2024: &euro;-12.3 million).</p>\n\n<p>The <strong>Composite Solutions (CS) </strong>business unit was also unable to avoid the increasing uncertainty in the automotive industry about future growth prospects. CS sales declined by 11.7% to &euro;59.1 million in the first half of 2025 (H1 2024: &euro;66.9 million). It should be noted that the first 6&nbsp;months of the previous year still included sales from a contract with an automotive customer that expired in Q2 2024.</p>\n\n<p>As a result of lower volumes and the associated lower use of production capacities, CS&rsquo;s&nbsp;adjusted EBITDA decreased by &euro;2.7 million to &euro;5.4 million (H1 2024: &euro;8.1 million) compared to the same period last year. Accordingly, the adjusted EBITDA margin of CS declined to 9.1% (H1 2024: 12.1%).</p>\n\n<h3><br />\n<strong>Outlook for the rest of 2025</strong></h3>\n\n<p>Increasing trade barriers, especially due to U.S. tariff policy, are having a negative impact on the business development of SGL&rsquo;s customers and sales markets. In particular, the high level of uncertainty about future developments in the automotive industry is currently weighing on demand for its&nbsp;products. This also includes expected sales of EVs, which are the main drivers of demand for SiC&nbsp;semiconductors. Special graphite components from SGL Carbon are required to manufacture these high-performance semiconductors.</p>\n\n<p>In light of the current economic environment, the company&rsquo;s expectations for developments in its&nbsp;sales markets in the upcoming months, and taking into account its restructuring measures within its CF&nbsp;business unit, SGL has adjusted its&nbsp;sales forecast for fiscal year 2025. The company now expects consolidated sales for the full fiscal year 2025 to decline by 10-15% compared with the previous year (2024: &euro;1,026.4 million). Previously, SGL Carbon had expected sales to decrease by up to 10% (slight decline) compared with the previous year.</p>\n\n<p>Due to the discontinuation of loss-making business activities in the CF business unit and cost savings as part of the successful restructuring and associated improvement in profitability, the forecast for the group&rsquo;s adjusted EBITDA for fiscal year 2025 remains unchanged in the range of &euro;130-150 million.</p>\n\n<p>&ldquo;SGL Carbon is not immune to the economic environment or developments in our sales markets,&rdquo; notes Thomas Dippold, CFO of SGL Carbon. &ldquo;But we have taken measures to stabilize SGL Carbon&rsquo;s profitability. The measures already implemented as part of the CF&nbsp;restructuring are showing initial signs of success, and for the first time in many quarters, adjusted EBITDA for CF business unit is positive again. But we are not satisfied yet. We will continue to optimize our cost structures and work on developing new market segments.&rdquo;</p>\n\n<p>Further details on business development in the first half of 2025 can be found in the half-year report on SGL&rsquo;s&nbsp;<a href=\"https://www.sglcarbon.com/en/investor-relations/publications-news-key-figures/\" target=\"_blank\">website</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/sgl-carbon-reports-lower-sales-amid-weak-markets-early-gains-from-carbon-fibers-restructuring"
      }
    ],
    "link": "https://www.compositesworld.com/news/sgl-carbon-reports-lower-sales-amid-weak-markets-early-gains-from-carbon-fibers-restructuring"
  },
  {
    "published": "Mon, 18 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      18,
      16,
      0,
      0,
      0,
      230,
      0
    ],
    "title": "Global research teams propose standards for structural power composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Global research teams propose standards for structural power composites"
    },
    "summary": "Researchers have published a set of characterization and reporting protocols to&nbsp;accelerate the industrial adoption of SPCs, which combine structural strength with energy storage capabilities.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Researchers have published a set of characterization and reporting protocols to&nbsp;accelerate the industrial adoption of SPCs, which combine structural strength with energy storage capabilities."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-advancedenergymaterials.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-advancedenergymaterials.jpg;maxWidth=720\" /> </a></div>\n\n<p>Motivation for universal coupon to characterize coupled electrochemical-mechanical performance. Source |&nbsp;&ldquo;<a href=\"https://advanced.onlinelibrary.wiley.com/doi/10.1002/aenm.202404702\" target=\"_blank\">Characterization and Reporting Protocols for Structural Power Composites: A Perspective</a>,&rdquo; Emile S. Greenhalgh, Sang Nguyen, Leif E. Asp, Alfredo Bici, Alexander Bismarck, Derrick Fam, Mats Johansson, G&ouml;ran Lindbergh, Jodie L. Lutkenhaus, Milo S. P. Shaffer, Natasha Shirshova, Madhavi Srinivasan, Johanna Xu, Dan Zenkert, <strong><a href=\"https://creativecommons.org/licenses/by/4.0/\" target=\"_blank\">CC BY 4.0</a></strong></p>\n</div>\n\n<p>Leading research groups in structural power composites (SPCs) &mdash; including those from&nbsp;<a href=\"https://profiles.imperial.ac.uk/e.greenhalgh\" target=\"_blank\">Imperial College London</a> and <a href=\"https://www.durham.ac.uk/staff/natasha-shirshova/\" target=\"_blank\">Durham University</a> in the U.K., <a href=\"https://www.kth.se/profile/danz\" target=\"_blank\">KTH</a> and <a href=\"https://www.chalmers.se/en/persons/leifas/\" target=\"_blank\">Chalmers</a> in Sweden, <a href=\"https://mc.univie.ac.at/polymer-composite-engineering-group/people/head-of-the-group/\" target=\"_blank\">University of Vienna</a> in Austria, <a href=\"https://research.a-star.edu.sg/researcher/derrick-w-h-fam/\" target=\"_blank\">A-Star</a> and <a href=\"https://dr.ntu.edu.sg/entities/person/Srinivasan-Madhavi\" target=\"_blank\">NTU</a> in Singapore and <a href=\"https://engineering.tamu.edu/chemical/profiles/jlutkenhaus.html\" target=\"_blank\">Texas A&amp;M</a> in the U.S.&nbsp;&mdash; have published a paper that sets out the characterization and requirements and reporting protocols for this emerging class of multifunctional materials. Accessible in <a href=\"https://advanced.onlinelibrary.wiley.com/doi/10.1002/aenm.202404702\" target=\"_blank\"><em>Advanced Energy Materials</em></a>, researchers&nbsp;intend for the paper to&nbsp;set the groundwork for formal standard methods to be developed, which are vital for industry to assess, contrast and potentially adopt these emerging materials in future products.</p>\n\n<p>SPCs&nbsp;could have a profound impact on the future direction of composites. By tailoring the constituents and composite architecture, researchers have developed &ldquo;structural supercapacitors&rdquo; and &ldquo;structural batteries.&rdquo;&nbsp;These are not only electrochemical energy storage devices but also structural materials that go <em>beyond</em> smart structures &mdash;&nbsp;rather than embedding an electrochemical cell into a composite laminate (a battery in a structure) the groups&rsquo; SPCs can intrinsically&nbsp;undertake two roles simultaneously (structural battery).</p>\n\n<p>It has been found that SPCs not only&nbsp;deliver lightweighting and efficient energy storage, but also offer a novel approach to composite design and innovation. For instance, it has been shown that SPC floor panels could power the seatback entertainment units in future electric aircraft, considerably reducing electrical wiring and providing weight and volume savings. This could also translate into more&nbsp;ubiquitous applications as well: phones, cars, computers, medical devices, infrastructure and so on. Moreover, the World Economic Forum has&nbsp;recognized SPCs are one of the <a href=\"https://www.weforum.org/publications/top-10-emerging-technologies-of-2025/in-full/structural-battery-composites/\" target=\"_blank\">Top 10 Emerging Technologies of 2025</a>.</p>\n\n<p>But as with any emerging technology, particularly one which draws together very different disciplines (i.e., structural composites and electrochemistry), there are no standards for characterization and reporting. The conventions, nomenclature and standards followed by conventional electrochemical and mechanical (composite) fields are very different and combining them has proved to be challenging.</p>\n\n<p>Through this paper, &ldquo;<a href=\"https://advanced.onlinelibrary.wiley.com/doi/10.1002/aenm.202404702\" target=\"_blank\">Characterization and Reporting Protocols for Structural Power Composites: A Perspective</a>,&rdquo; researchers&nbsp;have sought to rectify this. This includes recommendations that the&nbsp;multifunctional performance of SPCs be reported, but that this performance should also be contrasted against monofunctional benchmarks &mdash; conventional composites and electrochemical cells that use some of the same constituents. Recommendations have also been made for&nbsp;reporting device performance, to ensure that the published data uses the same protocols for normalization by mass or volume, for instance.&nbsp;</p>\n\n<p>Perhaps one of the paper&rsquo;s most important findings is the need for a universal coupon (see opening image), in which both mechanical and electrochemical characterization can be undertaken. In fact, such a coupon should permit simultaneous mechanical and electrochemical characterization, as the material would be used in practice. This would mean the &ldquo;multifunctional performance&rdquo;&nbsp;could be credibly declared and any coupling phenomena (such as mechanical strain influencing electrochemical behavior) identified. Realization of such an universal coupon, and widespread adoption of this protocol, would deliver much more reliable and convincing data for SPCs, and underpin the material development and industrialization.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/global-research-teams-propose-standards-for-structural-power-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/global-research-teams-propose-standards-for-structural-power-composites"
  },
  {
    "published": "Mon, 18 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      18,
      15,
      0,
      0,
      0,
      230,
      0
    ],
    "title": "Polestar 3 sets World Record for longest electric SUV journey on single charge",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Polestar 3 sets World Record for longest electric SUV journey on single charge"
    },
    "summary": "Unmodified Polestar 3, which uses natural fiber composites in its interiors, achieves 935.44 kilometers on a single charge on U.K. public roads.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Unmodified Polestar 3, which uses natural fiber composites in its interiors, achieves 935.44 kilometers on a single charge on U.K. public roads."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-polestar3-record-opener.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Polestar 3 awarded Guiness World Record for longest single-charge journey\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-polestar3-record-opener.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | Polestar</p>\n</div>\n\n<p><a href=\"https://www.polestar.com/us/\" target=\"_blank\">Polestar</a>&rsquo;s (Gothenburg, Sweden) large electric SUV, the <em>Polestar 3</em>, has broken the Guinness World Record for longest journey traveled by an electric SUV on a single charge. Achieving 935.44 kilometers (581.3 miles), the recently launched long-range single-motor variant was pushed to its limits.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-polestar3-record-data.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"data during Polestar 3 record winning drive\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-polestar3-record-data.jpg;maxWidth=720\" /> </a></div>\n</div>\n</div>\n\n<p>The attempt took 22 hours and 57 minutes to complete in mixed weather conditions including rain. The <em>Polestar 3</em> achieved an efficiency of 12.1 kilowatt-hours/100 kilometers. Professional efficiency drivers, Sam Clarke, Kevin Booker and Richard Parker, switched every 3 hours to maintain alertness. The <em>Polestar 3 </em>achieved its WLTP figure of 706 kilometers with 20% of its battery capacity still available and delivered an extra 12.8 kilometers after showing 0% battery &mdash;&nbsp;but the <em>Polestar 3</em> reached a charger before ultimately stopping.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-polestar3-record-team.jpg\" target=\"_blank\"><img alt=\"Polestar 3 team awarded Guinness World Record\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-polestar3-record-team.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>&ldquo;This official Guinness World Record for range is another proof point that&nbsp;<em>Polestar 3</em> is setting new standards,&rdquo; says Polestar CEO Michael Lohscheller. &ldquo;We will continue to push the boundaries of technology and electric performance.&rdquo;</p>\n\n<blockquote>\n<p>&ldquo;While the drivers pushed the <em>Polestar 3</em> to the boundaries of its range capability, it goes to show how battery range has improved exponentially over the past few years,&rdquo; says Matt Galvin, Polestar UK managing director. &ldquo;For a large premium SUV to go way beyond a London-to-Edinburgh distance is truly impressive and with this, the adage that <em>&lsquo;EVs can&rsquo;t go far&rsquo;&nbsp;&nbsp;</em>has been very much consigned to the history books.&rdquo;</p>\n</blockquote>\n\n<p>The production-standard SUV was adjudicated by Guinness World Records judge, Paulina Sapinska, with Webfleet providing meticulously documented and independently verified video footage, odometer readings, GPS readings and battery level data. The car received zero modifications for the attempt and was on standard 20-inch wheels fitted with standard Michelin Sport 4 EV tires. The attempt was supported by the AA.</p>\n\n<h3><em>Polestar 3</em> features&nbsp;natural fiber composites</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-polestar3-record-bcomp.jpg\" target=\"_blank\"><img alt=\"Polestar and Bcomp develop natural fiber composites \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-polestar3-record-bcomp.jpg;maxWidth=385\" /></a></div>\n\n<p>Polestar and Bcomp worked together to develop the Polestar Signature Weave material used in the seat shells of the Polestar 3. A blend of flax fiber textile, natural fiber composite&nbsp;and Bcomp powerRibs, it reduces&nbsp;plastic usage and&nbsp;weight. See <a href=\"https://www.polestar.com/us/news/polestar-bcomp-the-making-of-our-signature-interior-weave/\" target=\"_blank\">&ldquo;Polestar and Bcomp: The making of our signature interior weave.&rdquo;</a></p>\n</div>\n\n<p><em>Polestar 3</em>&rsquo;s use of natural fiber composites featuring&nbsp;materials from <a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a>&nbsp;(Fribourg, Switzerland) was highlighted on <a href=\"https://www.bcomp.com/news/polestar-day-2023/\" target=\"_blank\">Polestar Day 2023</a>.&nbsp;&ldquo;We understood the huge potential of this material and, finally, after years of development together with our suppliers &mdash;&nbsp;and Bcomp &mdash;&nbsp;we&rsquo;ve found the key to applying it in high-volume production,&rdquo; says&nbsp;Maximilian Missoni, Polestar&nbsp;head of design. &ldquo;Our own signature weave brings a luxurious and technical finish to this natural fiber&nbsp;composite, which means it can now be used as a functional and visual material.&rdquo;&nbsp;</p>\n\n<p>&ldquo;Taking the step into volume production means we have now unlocked the potential for more natural fiber composites in our cars,&rdquo; Missoni continues. &ldquo;It leads to less than half of the fossil-based content compared to traditional premium solutions used in automotive interiors, and it reduces the CO<sub>2</sub> emissions of these components by more than 50%.&rdquo;</p>\n\n<p>Polestar is the Swedish electric performance car brand. It has&nbsp;three models in its line-up: <em>Polestar 2</em>, <em>Polestar 3</em>&nbsp;and <em>Polestar 4</em>. Planned models include the <em>Polestar 5</em> four-door GT (to be introduced in 2025), the <em>Polestar 6</em> roadster and the <em>Polestar 7</em> compact SUV. With its vehicles currently manufactured on two continents, North America and Asia, Polestar plans to diversify its manufacturing footprint further, with production of <em>Polestar 7</em> planned in Europe.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/polestar-3-sets-world-record-for-longest-electric-suv-journey-on-single-charge"
      }
    ],
    "link": "https://www.compositesworld.com/news/polestar-3-sets-world-record-for-longest-electric-suv-journey-on-single-charge"
  }
]