[
  {
    "published": "Thu, 30 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      30,
      16,
      0,
      0,
      3,
      303,
      0
    ],
    "title": "People in composites: October 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "People in composites: October 2025"
    },
    "summary": "Engineering Technology Corp., Daher, RUAG International and ACS Group announce internal faculty updates, appointments and changes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Engineering Technology Corp., Daher, RUAG International and ACS Group announce internal faculty updates, appointments and changes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<h3>Engineering Technology Corp. welcomes general manager</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Robert Eyre headshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/pr-rob-eyreopt-2-1.jpg;maxWidth=385\" /></div>\n\n<p>Robert Eyre, ETC general manager.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/engineering-technology\" target=\"_blank\">Engineering Technology Corp.</a> (ETC, Salt Lake City, Utah, U.S.) has announced that Robert Eyre is joining&nbsp;the company as general manager.</p>\n\n<p>As general manager, Eyre will oversee day-to-day plant operations, driving manufacturing excellence, safety&nbsp;and innovation. His leadership will focus on advancing ETC&rsquo;s mission of delivering world-class composite equipment for the manufacture of composite parts.</p>\n\n<p>&ldquo;I&rsquo;m thrilled to join ETC at this pivotal moment of growth and opportunity,&rdquo; says Eyre. &ldquo;I&rsquo;m eager to collaborate with our talented team to prioritize safety, streamline processes&nbsp;and drive innovation as we build upon a culture where everyone thrives and delivers value to our customers and each other.&rdquo;</p>\n\n<p>Eyre&nbsp;brings more than 20 years of expertise in composites production and operations management. Prior to joining ETC, he served as production and operations manager at TCR Composites, where he successfully led initiatives that enhanced operational efficiency, R&amp;D capabilities&nbsp;and profit margins.</p>\n\n<p>Through strategic recruiting, onboarding&nbsp;and performance management, he cultivated high-performing teams that reduced turnover and strengthened organizational capabilities. His track record of continuous improvement, process optimization&nbsp;and collaborative leadership makes him a good&nbsp;fit for ETC&rsquo;s growth strategy.</p>\n\n<p>Outside of work, Eyre enjoys time with family and friends, whether sharing meals or enjoying a round of golf. He is also passionate about continuous learning and meditation, which inspire fresh perspectives and innovation in his professional life.</p>\n\n<div class=\"article_sidebar\">\n<h3>RUAG International announces upcoming board of director changes</h3>\n\n<p>Rainer Schulz, chairman of <a href=\"https://www.ruag.com/en\" target=\"_blank\">RUAG International Holding AG</a> (Zurich, Switzerland), will not stand for re-election at the Annual General Meeting in spring 2026. The search for his successor will be managed by the Department of Defense, Civil Protection&nbsp;and Sport (DDPS). In addition, the two board members J&uuml;rg Oleas and Andreas S. Spreiter will also not stand for re-election.</p>\n\n<p>Schulz has been a member of RUAG&rsquo;s board of directors since 2020. He took over as chairman of the board in May 2025. Since Parliament&rsquo;s decision to keep the Beyond Gravity&nbsp;space division in state ownership, he has ensured the necessary continuity for employees and business partners. Schulz&nbsp;has also closely accompanied the realignment of the company by the newly responsible owner, the DDPS.</p>\n\n<p>For personal reasons, Schulz&nbsp;has decided not to stand for re-election at the next Annual General Meeting&nbsp;and will&nbsp;step down from the board of directors of RUAG International.</p>\n\n<p>&ldquo;I joined the board with the task of privatizing what was then a broadly based technology company, which has now been successfully completed,&rdquo; explainds. &ldquo;With my decision, I would like to make way for someone who will successfully continue to shape the strategic development of the company, which now specializes in space technology, in the coming years.&rdquo;&nbsp;With this decision, he also wants to help ensure that the search for a qualified successor can be initiated at an early stage. In addition to looking for Schulz&rsquo;s successor, the DDPS is working with a support group of experts to develop the key parameters of Beyond Gravity&rsquo;s future strategy.</p>\n\n<p>Moreover, board members J&uuml;rg Oleas, who has been on the board since 2011, and Andreas S. Spreiter, a member since 2024, have also announced that they will not stand for re-election at the 2026 Annual General Meeting. The board of directors has already begun the search for qualified candidates to succeed them.</p>\n</div>\n\n<h3>&nbsp;</h3>\n\n<h3>Daher Group reports new appointments</h3>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-peoplenews-daher-group-appointment_wide.jpg;maxWidth=720\" /> &nbsp;</div>\n</div>\n\n<p>Effective Oct. 1,&nbsp;<a href=\"https://www.daher.com/en/\" target=\"_blank\">Daher</a>&nbsp;(Nantes, France) has announced the following appointments:&nbsp;</p>\n\n<ul>\n\t<li>Aymeric Daher, a member of the executive committee, is named the deputy chief executive officer (CEO) in charge of the Logistics division and Human Resources</li>\n\t<li>J&eacute;r&ocirc;me Leparoux, a member of the executive committee and currently the company general secretary, also is appointed as the director of group strategy</li>\n\t<li>Vincent Chanron is named as the group HR&nbsp;director, reporting to the deputy CEO</li>\n\t<li>The board of directors has appointed Thibault Scaramanga as vice chairman, replacing Olivier Genis, who continues as a director.</li>\n</ul>\n\n<p>These developments are part of the group&rsquo;s&nbsp;forward-looking approach, with a desire to begin strategic planning now that will shape the next decade.</p>\n\n<p>With his appointment as the deputy CEO, <strong>Aymeric Daher</strong> will continue to develop the group&rsquo;s Logistics division, with a stronger international focus. He also will head up HR, with the aim of anticipating changes within the group &mdash; whether related to customers, markets, technologies&nbsp;or societal transformations &mdash;&nbsp;and responding to them effectively. He will represent the HR function in the executive committee. &nbsp;</p>\n\n<p>In the position as the group&rsquo;s general secretary since October 2019 in charge of institutional relations, communications&nbsp;and legal affairs, <strong>J&eacute;r&ocirc;me Leparoux</strong> also has been appointed the director of dtrategy. His mission will be to coordinate the strategic orientations of the various company divisions and prepare Daher&rsquo;s next strategic plan. He will continue to represent Daher&rsquo;s interests with its stakeholders, aligned with the company&rsquo;s strategic challenges.&nbsp;</p>\n\n<p>Serving as the deputy HR director since early 2024, <em>Vincent Chanron</em> has been appointed as the group&rsquo;s HR director. His mission will be to ensure the&nbsp;development of skills and talent, as well as advancing the transformation of the managerial culture and the internationalization of teams, while continuing to strengthen social dialogue.</p>\n\n<p>Appointed vice chairman of the Daher Group board of directors, <strong>Thibault Scaramanga</strong> succeeds Olivier Genis, who remains a director. A family director since October 2016, Scaramanga will contribute to supporting the group&rsquo;s strategic thinking over the long term.</p>\n\n<div class=\"article_sidebar\">\n<h3><strong>Machinery sales veteran joins ACS Group</strong></h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Dayton Patterson headshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-peoplenews-acs-daytonpatterson.png;maxWidth=385\" /></div>\n\n<p>Dayton Patterson, ASC Group.</p>\n</div>\n\n<p>The <a href=\"https://www.acscorporate.com/\" target=\"_blank\">ACS Group</a>&nbsp;(New Berlin, Wisc., U.S.) announces that Dayton Patterson has joined the company as Southwest regional sales manager and business development manager for Wabash and Carver in North America.</p>\n\n<p>Patterson will oversee all sales activity for the AEC, Cumberland, Sterling and MiVue brands in California, Arizona, New Mexico and Baja California, Mexico. He brings more thans&nbsp;19 years of experience with plastics machinery sales in California and the Tijuana area.</p>\n\n<p>The Los Angeles-area native resides in Santa Monica, California, with his wife and two children.</p>\n\n<p>The ACS Group designs, manufactures, markets and supports comprehensive lines of auxiliary products for the plastics processing, including size reduction equipment, material conveying equipment, metering and blending devices, heat exchangers, drying systems&nbsp;and hydraulic presses.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/people-in-composites-october-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/people-in-composites-october-2025"
  },
  {
    "published": "Wed, 29 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      29,
      16,
      0,
      0,
      2,
      302,
      0
    ],
    "title": "CANCOM 2026 brings together domestic, international composites players in Vancouver",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CANCOM 2026 brings together domestic, international composites players in Vancouver"
    },
    "summary": "The Canadian composites conference is taking place Aug. 10-13, 2026, spanning the full spectrum of composites research.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Canadian composites conference is taking place Aug. 10-13, 2026, spanning the full spectrum of composites research."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cancomevent-2024.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cancomevent-2024.jpeg;maxWidth=720\" /> </a></div>\n\n<p>CANCOM 2024/Industry Day, Fraunhofer Innovation Platform (FIP) for Composites Research at Western University, Aug.&nbsp;6, 2024. Source | CANCOM</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://cancom2026.ca/\" target=\"_blank\">Canadian-International Conference on Composites</a> (CANCOM) is the flagship national conference&nbsp;of the <a href=\"https://www.cacsma.ca/\" target=\"_blank\">Canadian Association for Composite Structures and Materials</a> (CACSMA). Taking place Aug. 10-13, 2026, at the&nbsp;University of British Columbia (Vancouver),&nbsp;the 14<sup>th</sup> CANCOM event brings&nbsp;together researchers, industry professionals&nbsp;and government partners to exchange ideas, strengthen collaborations&nbsp;and share advances in composite materials and structures.</p>\n\n<p>Over the years, the conference has become the central meeting point for the Canadian composites community. The 2026 scientific committee includes members from Canada, the U.S., Europe&nbsp;and Asia, with organizers&nbsp;expecting stronger-than-usual international participation.&nbsp;</p>\n\n<p>The conference program will span the full spectrum of composites research topics, including:</p>\n\n<ul>\n\t<li>Advances in experimental analysis and modeling.</li>\n\t<li>Numerical modeling of materials and structures.</li>\n\t<li>Nondestructive methods.</li>\n\t<li>Automation in manufacturing, data generation&nbsp;and analysis.</li>\n\t<li>Advancements in materials and manufacturing processes.</li>\n\t<li>Sustainable materials and technologies.</li>\n\t<li>AI and machine learning methods.</li>\n</ul>\n\n<p>CANCOM&nbsp;currently&nbsp;invites abstract submissions of original research and application-focused studies in the field of composite materials and structures until Jan. 15, 2026.&nbsp;Notification of acceptance is Jan. 31, 2026.</p>\n\n<p>Submissions will be managed through&nbsp;<a href=\"https://cmt3.research.microsoft.com/docs/help/author/author-submission-form.html\">Microsoft&rsquo;s Conference Management Toolkit</a>&nbsp;(CMT), an online platform for handling abstract and paper submissions, reviews&nbsp;and author notifications. CMT account registration is required, and the guidelines can be found&nbsp;<a href=\"https://cancom2026.ca/submissions/cmt-registration/\">here</a>.</p>\n\n<p>For more information, visit the <a href=\"https://cancom2026.ca/\" target=\"_blank\">event website</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cancom-2026-brings-together-domestic-international-composites-players-in-vancouver"
      }
    ],
    "link": "https://www.compositesworld.com/news/cancom-2026-brings-together-domestic-international-composites-players-in-vancouver"
  },
  {
    "published": "Wed, 29 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      29,
      16,
      0,
      0,
      2,
      302,
      0
    ],
    "title": "CMH-17 releases new revision of Vol. 3 for “Polymer Matrix Composites” handbook",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CMH-17 releases new revision of Vol. 3 for “Polymer Matrix Composites” handbook"
    },
    "summary": "Over 2,000 pages of peer-reviewed technical content represents 13 years of extensive revisions and numerous topic expansions covering the design, analysis, manufacture&nbsp;and field support of composite materials.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Over 2,000 pages of peer-reviewed technical content represents 13 years of extensive revisions and numerous topic expansions covering the design, analysis, manufacture&nbsp;and field support of composite materials."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-chm17-vol31.png;maxWidth=720\" /> </div>\n\n<p>Source | Getty Images and&nbsp;SAE International</p>\n</div>\n\n<p>The Composite Materials Handbook-17 (CMH-17) has completed a new revision of Vol. 3 &ldquo;Polymer Matrix Composites: Materials Usage, Design and Analysis.&rdquo; The revision is available for purchase in <a href=\"https://www.sae.org/books/composite-materials-handbook-volume-3-revision-h-r-640\" target=\"_blank\">print and digital</a> format through SAE International (Warrendale, Pa., U.S.).</p>\n\n<p>CMH-17 Vol. 3 has undergone extensive revisions and expansions on numerous critical topics including two new chapters on spacecraft and engine applications. The new print version consists of four bindings to manage more than&nbsp;2,000 pages of peer-reviewed technical content. The revision includes hundreds of archivable references and documentation of new practical engineering content that has never been published. The combined efforts of the primary authors represent hundreds of years of practical experience on the ever-expanding use of composites in safety-critical applications shown to have significant value in the market.</p>\n\n<blockquote>\n<p>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/articles/cmh-17-updates-composites-data-publishes-new-volume-7-on-additive-manufacturing\">CMH-17 updates composites data, will publish new Volume 7 on additive manufacturing</a>&rdquo;</p>\n</blockquote>\n\n<p>Revisions to Vol. 3 have been made over the last 13 years,&nbsp;led by CMH-17 members from industry, government&nbsp;and academia. The length of Vol. 3 has doubled, with the addition of new case studies, sections and chapters. It includes content that the authors says is not available anywhere else on product development and design of composite structures (Chapter 7), over 350 pages on damage tolerance (Chapter 12)&nbsp;and extensive guidelines and case studies on sustainment and repair (Chapter 14). Industry practitioners reviewed and approved of all new content for the tevision, consistent with CMH-17 standard practice. Revision H includes significant updates to the following topics:</p>\n\n<ul>\n\t<li>Bond process, design, analysis</li>\n\t<li>Certification</li>\n\t<li>Design criteria, requirements&nbsp;and other constraints</li>\n\t<li>Bolted design and analysis</li>\n\t<li>Durability and damage tolerance</li>\n\t<li>Supportability (bonded/bolted repair substantiation)</li>\n\t<li>Integrated product development and readiness</li>\n\t<li>Crashworthiness (energy management for certification)</li>\n\t<li>Structural engineering technology.</li>\n</ul>\n\n<p>CMH-17 Vol. 3 is global tool for&nbsp;engineers who design and use composite parts throughout an application&rsquo;s life cycle. It provides proven methodologies and lessons learned for the design, analysis, manufacture&nbsp;and field support of fiber-reinforced, polymeric matrix composite structures. This includes special considerations of environmental durability, damage tolerance, crashworthiness&nbsp;and structural bonding as applied to aircraft product safety needs and commercial/military certification requirements. It also provides guidelines on material and process specifications and procedures for utilization of the data presented in Vol. 2. The information provided is consistent with the guidance <a href=\"https://www.compositesworld.com/news/cmh-17-publishes-new-revision-of-volume-1-for-polymer-matrix-composites\" target=\"_blank\">provided in Vol. 1</a> and is an extensive compilation of knowledge and experience of subject matter experts from industry, government&nbsp;and academia.</p>\n\n<p>Wichita State University&rsquo;s <a href=\"https://www.compositesworld.com/news/cmh-17-publishes-new-revision-of-volume-1-for-polymer-matrix-composites\" target=\"_blank\">National Institute for Aviation Research</a>&nbsp;(NIAR) serves as secretariat for CMH-17, which holds regular meetings to create, publish&nbsp;and maintain proven material data and engineering information. This material, subjected to thorough technical review, supports the development and use of advanced materials and structures in aerospace applications.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cmh-17-releases-new-revision-of-vol-3-for-polymer-matrix-composites-handbook"
      }
    ],
    "link": "https://www.compositesworld.com/news/cmh-17-releases-new-revision-of-vol-3-for-polymer-matrix-composites-handbook"
  },
  {
    "published": "Wed, 29 Oct 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      29,
      15,
      0,
      0,
      2,
      302,
      0
    ],
    "title": "DLR rocket flight in ATHEAt program demonstrates CMC nose, movable body flaps",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DLR rocket flight in ATHEAt program demonstrates CMC nose, movable body flaps"
    },
    "summary": "Successful flight tests heat-resistant components and innovative sensor technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Successful flight tests heat-resistant components and innovative sensor technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-atheat-flight.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ATHEAt first test flight features CMC nose, body flaps\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-atheat-flight.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;<a href=\"https://www.dlr.de/en/service/imprint\">DLR (CC BY-NC-ND 3.0)</a></p>\n</div>\n\n<p>On Oct.&nbsp;6, the <a href=\"https://www.compositesworld.com/suppliers/dlr---german-aerospace-center\" target=\"_blank\">German Aerospace Center</a> (DLR, Braunschweig) launched a 13.5-meter-long research rocket for the <a href=\"https://www.dlr.de/en/research-and-transfer/projects-and-missions/atheat\" target=\"_blank\">Advanced Technologies for High Energetic Atmospheric Flight of Launcher Stages (ATHEAt)</a> program from the And&oslash;ya launch site in northern Norway.</p>\n\n<p>The experiment flew for &asymp;4 minutes, including 2 minutes of high-speed flight with the peak speed exceeding Mach 9, exposing the vehicle to gas temperatures exceeding 2000&deg;C and extreme aerothermal loads on its structures and materials &mdash; similar to those encountered by spacecraft re-entering Earth&rsquo;s atmosphere. During the flight, the research rocket reached a maximum altitude of more than 30 kilometers.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/0424-cw-blog-jec2024-highlights-dlr-nozzle.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CMC rocket nozzle exhibited by DLR at JEC World 2024\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/0424-cw-blog-jec2024-highlights-dlr-nozzle.jpg;maxWidth=720\" /> </a></div>\n\n<p>CMC rocket nozzle DLR exhibited at JEC World 2024. Source | <a href=\"https://www.compositesworld.com/articles/jec-world-2024-highlights-thermoplastic-composites-cmc-and-novel-processes#C/C-SiC%20rocket%20nozzles,%20piston%20rings\" target=\"_blank\"><em>CW</em></a></p>\n</div>\n\n<p>DLR exhibited a CMC rocket nozzle for the ATHEAt program at <a href=\"https://www.compositesworld.com/articles/jec-world-2024-highlights-thermoplastic-composites-cmc-and-novel-processes#C/C-SiC%20rocket%20nozzles,%20piston%20rings\" target=\"_blank\">JEC World 2024</a>. It was designed and produced for a hybrid engine using carbon fiber and a matrix of carbon and silicon carbide (C/C-SiC) aiming&nbsp;to increase nozzle efficiency by drastically reducing abrasion and component weight for&nbsp;reusability.</p>\n</div>\n</div>\n\n<p>The shimmering gray nose cone of the rocket was made largely from a fiber- reinforced ceramic matrix composite (CMC) manufactured entirely at DLR using specially developed in-house processes.</p>\n\n<p>This high-performance material not only withstands very high temperatures but is also strong and relatively lightweight. The scientific payload onboard the ATHEAt flight included two cooling experiments which researchers used to investigate how the extreme high temperatures at the nose of the rocket can be managed through active cooling.</p>\n\n<p>The ATHEAt flight experiment&rsquo;s front body also included four movable flaps made of DLR&rsquo;s CMC which were successfully deployed during the flight and experienced very high temperatures. In the future, such flaps could be used to make space transportation vehicles more controllable.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-atheat-first-rocket.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ATHEAt first flight rocket\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-atheat-first-rocket.jpeg;maxWidth=720\" /> </a></div>\n\n<p>The CMC nose cone and deployable body flaps on the ATHEAt first rocket.&nbsp;Source |&nbsp;<a href=\"https://www.dlr.de/en/service/imprint\">DLR (CC BY-NC-ND 3.0)</a>. For more details, see&nbsp;<a href=\"https://www.dlr.de/en/blog/archive/2025/atheat-flight-experiment-on-the-road-in-norway-for-next-generation-of-space-transport\" target=\"_blank\">ATHEAt flight experiment</a>.</p>\n</div>\n\n<p>To achieve the highest possible temperatures, the research rocket flew along a specially planned, shallower trajectory, enabling it to fly at high Mach numbers for an extended period at relatively low altitudes. A newly developed DLR sensor network provided essential data to determine the precise moment of ignition for the second stage. This &ldquo;sensor cube&rdquo;&nbsp;uses a defined starting position and measures the acceleration and rotation rates in flight to calculate the position of the rocket in space. At the end of its flight, it splashed down safely in a designated and secure area of the Norwegian Sea.</p>\n\n<h3><strong>Successful first flight</strong></h3>\n\n<p>&ldquo;With the ATHEAt flight experiment, we have succeeded in flying at high Mach numbers for much longer than in our previous projects,&rdquo; says Ali G&uuml;lhan, ATHEAt project manager and head of the Supersonic and Hypersonic Technologies Department at the DLR Institute of Aerodynamics and Flow Technology. &ldquo;We have now reached a new milestone and collected&nbsp;data for further R&amp;D.&rdquo;</p>\n\n<p>This data harvest was made possible by the more than 300 sensors installed by the DLR team into the flight experiment. Also on board were miniaturized, noncontact sensors such as infrared cameras, laser scanners and radiation thermometers. A modular data acquisition system developed by DLR recorded the measurements and transmitted the processed data by radio to ground stations below.</p>\n\n<p>&ldquo;The conditions simulated in the ATHEAt flight experiment are comparable to those that thermal protection systems on future reusable space transport systems will have to reliably withstand during reentry into Earth&rsquo;s atmosphere,&rdquo;&nbsp;explains G&uuml;lhan. The reentry phase, with its extreme aerodynamic and aerothermodynamic conditions, is also a crucial point of development for the space industry. &ldquo;With projects like ATHEAt, we are specifically working on closing this global technology gap.&rdquo;</p>\n\n<p>DLR combines flight experiments like ATHEAt and its predecessor projects, supported and continuously refined with sophisticated simulations, design processes and component testing on the ground.</p>\n\n<h3><strong>ATHEAt program</strong></h3>\n\n<p>Initiated in January 2022, the ATHEAt program seeks to test key technologies aimed to make future reusable space vehicles more reliable and cost-efficient, with an emphasis on reentry performance. The program is also developing a hybrid rocket booster for use as a future sounding rocket upper stage.</p>\n\n<p>The technologies developed are being tested in ground tests and two space flights. This first flight was structured to test materials, cooling techniques, miniaturized nonintrusive sensors and the aerodynamic properties of the two-stage sounding rocket. The first stage was powered by a Red Kite booster developed by DLR in partnership with Bayern-Chemie, while the second stage was powered by a Canadian-built Black Brant Mark 4 booster.</p>\n\n<p>A second launch, scheduled for 2026 from Esrange Space Center in Sweden, will mark the inaugural flight of the Alduina hybrid rocket booster. Powered by hydrogen peroxide and hydroxyl-terminated polybutadiene (HTPB), the booster is designed to enable throttleability and reignition while maintaining low system complexity.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dlr-rocket-flight-in-atheat-program-demonstrates-cmc-nose-movable-body-flaps"
      }
    ],
    "link": "https://www.compositesworld.com/news/dlr-rocket-flight-in-atheat-program-demonstrates-cmc-nose-movable-body-flaps"
  },
  {
    "published": "Wed, 29 Oct 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      29,
      14,
      0,
      0,
      2,
      302,
      0
    ],
    "title": "NIAR video documents how FPP advances aerocomposites manufacturing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "NIAR video documents how FPP advances aerocomposites manufacturing"
    },
    "summary": "Using its&nbsp;Cevotec Sambo Pro system, the institution offers an instructional video for fiber patch placement (FPP)&nbsp;design, optimization&nbsp;and manufacturing of small complex parts at high rates.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Using its&nbsp;Cevotec Sambo Pro system, the institution offers an instructional video for fiber patch placement (FPP)&nbsp;design, optimization&nbsp;and manufacturing of small complex parts at high rates."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-niar-cevotec-fpp-video.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-niar-cevotec-fpp-video.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | <a href=\"https://www.youtube.com/watch?v=wNWj17Y4A00\" target=\"_blank\">NIAR ATLAS FPP Documentary</a></p>\n</div>\n\n<p>Wichita State University&rsquo;s (WSU, Kan., U.S.) <a href=\"https://www.compositesworld.com/suppliers/national-institute-for-aviation-research\" target=\"_blank\">National Institute for Aviation Research</a> (NIAR)&nbsp;has released a documentary-style video that shows how their ATLAS lab team approaches fiber patch placement (FPP) leveraging their&nbsp;10-axis Samba&nbsp;Pro system by <a href=\"https://www.compositesworld.com/suppliers/cevotec\" target=\"_blank\">Cevotec</a>&nbsp;(Munich, Germany) &mdash; featuring an&nbsp;ultra-fast Scara pick-and-place robot and a six-axis tool manipulator &mdash; and how it&rsquo;s relevant to current challenges in aerospace composites manufacturing. The video can be found below.</p>\n\n<p>The video offers a concise look at FPP process intent and aerospace use cases, including performance test results. In addition, for those who&nbsp;prefer the technical basis, NIAR&rsquo;s SAMPE‑recognized paper, &ldquo;<a href=\"https://www.cevotec.com/niars-award-winning-sampe-paper-how-fpp-effectively-addresses-challenges-in-complex-composites-parts-manufacturing/\" target=\"_blank\">Design Optimization and Analysis Validation of Complex Composite Parts Manufactured Using Fiber Patch Placement</a>,&rdquo;&nbsp;offers additional information on how&nbsp;complex geometry parts can experience significant performance gains by design optimizations that are unique to FPP.</p>\n\n<p>What can aerospace programs take from this? FPP is best used in applications dominated by geometrical complexities like conical transitions, step features and domed shapes (convex /concave) &mdash;&nbsp;think fairings, antenna domes, nacelle inlets and&nbsp;sandwich structures with chamfer transitions. NIAR&rsquo;s work results points to the same outcome: For challenging shapes,&nbsp;where other technologies struggle,&nbsp;a patch-based laminate strategy can maintain the fiber orientation and achieve thickness build-up close to the design requirements at a production rate that future aerospace programs are targeting.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>What is FPP?</h3>\n\n<p>Fiber patch placement (FPP) builds laminates from precisely placed, oriented patches rather than continuous tows. That change matters on complex surface geometry: Patches can be rotated, adjusted in size and sequenced to follow curvature while maintaining compaction, reducing classic curved-tool issues like wrinkles, bridging&nbsp;and fiber angle drift.</p>\n</div>\n</div>\n\n<p>In addition, Cevotec Samba&nbsp;systems supports true multi‑material placement in a single automated sequence, including auxiliary materials like adhesive films and glass fiber veils. Along with adjustable gaps/overlaps definition of the laminate, a distinctive FPP design feature, full single-layer coverage can be achieved. According to Cevotec, this differentiates FPP for complex material stacks and is a key enabler for full lay-up automation of high-performance structures like sandwich panels.</p>\n\n<p>NIAR offers a broad range of development services to aerospace manufacturers, including material tests, prototyping and process development with FPP on-site in the U.S. This&nbsp;enables&nbsp;manufacturers to reduce their risks in the deployment of new technologies and typically shortens overall development cycles. Moreover, Cevotec offers&nbsp;a complimentary first screening and feasibility evaluation.</p>\n\n<div style=\"text-align: center;\"></div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/niar-video-documents-how-fpp-advances-aerocomposites-manufacturing"
      }
    ],
    "link": "https://www.compositesworld.com/news/niar-video-documents-how-fpp-advances-aerocomposites-manufacturing"
  },
  {
    "published": "Wed, 29 Oct 2025 00:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      29,
      4,
      0,
      0,
      2,
      302,
      0
    ],
    "title": "Cycle Inspect announces carbon fiber NDT certification program purpose-built for cycling industry",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Cycle Inspect announces carbon fiber NDT certification program purpose-built for cycling industry"
    },
    "summary": "Full certification targets bicycle MRO professionals, offering comprehensive composite material theory, UT and inspection training that aligns with ASNT standards.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Full certification targets bicycle MRO professionals, offering comprehensive composite material theory, UT and inspection training that aligns with ASNT standards."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-CycleInspect-certification-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Worker looking on laptop for bike inspection.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-CycleInspect-certification-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Cycle Inspect</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/cycle-inspect\" target=\"_blank\">Cycle Inspect</a> (Sydney, Austrlia), a company providing&nbsp;data-driven damage and risk assessment solutions for the carbon fiber bicycle industry, as launched a carbon fiber nondestructive testing (NDT) inspection training and certification program, aligned to&nbsp;American Society for Nondestructive Testing (ASNT)&nbsp;standards and purpose-built for the cycling industry.</p>\n\n<p>The program aims to set&nbsp;a new global benchmark in education for cycling industry professionals, with a focus on promoting safety, professionalism and accessibility to the core principles and practices of NDT&nbsp;of carbon fiber bicycles&nbsp;and components.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Program highlights</h3>\n\n<ul>\n\t<li>Full certification comprises of online theory, in-person practical skills training&nbsp;and assessments</li>\n\t<li>Independent assessment by third-party evaluators</li>\n\t<li>Access to Cycle Inspect Compass, a machine learning-powered inspection and reporting platform</li>\n\t<li>Equipment and inspection hardware available directly through Cycle Inspect&nbsp;and trusted brands</li>\n</ul>\n</div>\n</div>\n\n<p>It delivers comprehensive training in composite material theory and ultrasonic testing (UT) techniques, along with rigorous theoretical and practical assessments in accordance with ASNT&nbsp;standards. Upon successful completion of the program, graduates obtain a Level 2 SNT-TC-1A certification, qualifying them to perform professional-grade inspections of carbon fiber&nbsp;bicycles and accessories.</p>\n\n<p>&ldquo;Carbon fiber&nbsp;has revolutionized bicycle design, however, damage or defects can remain unseen to the naked eye and difficult to impossible to detect via basic testing techniques such as tap-testing. Until now, there&rsquo;s been no formal education and training programs, and no standardized approach to inspecting these materials for damage,&rdquo; says&nbsp;Michael Biggs, co-founder of Cycle Inspect.&nbsp;Based on <a href=\"https://injuryprevention.bmj.com/content/early/2025/03/31/ip-2024-045518\" target=\"_blank\">recent research</a> by the University of New South Wales (UNSW) and supported by Cycle Inspect, 25% of surveyed cyclists had a component replaced due to &ldquo;failure during normal use&rdquo;&nbsp;yet only 42% were aware of the existence of NDT methods. &ldquo;Our certification changes that. It brings industrial-level NDT knowledge and methods to the cycling world accessible to anyone with a basic understanding of bike components.&rdquo;</p>\n\n<p>The course is currently open for enrollment&nbsp;via <a href=\"http://www.cycleinspect.com\" target=\"_blank\">www.cycleinspect.com</a>. Combining&nbsp;flexible, self-paced online learning through Cycle Inspect&rsquo;s dedicated learning platform, it covers&nbsp;detailed introduction to composites materials, as well as&nbsp;ultrasound theory and inspection. This is then followed by an intensive 3-day in-person and &ldquo;hands-on&rdquo;&nbsp;practical skills training experience in Newcastle, Australia. Trainees also gain access to Compass, Cyle Inspection&rsquo;s&nbsp;AI-powered inspection and reporting platform.</p>\n\n<p>The program targets&nbsp;professionals in bicycle maintenance, manufacturing and repair,&nbsp;as well as those aspiring to enter this specialized area.&nbsp;The certification program officially launches in October 2025, with training offered initially in Newcastle, Australia.</p>\n\n<p>Cycle Inspect also offers low-cost and obligation free programs (non-certified) for cyclists and industry professionals looking to improve their knowledge and skills in NDT <a href=\"https://cycleinspect.com/training/ndt-foundations/\" target=\"_blank\">via NDT Foundations</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cycle-inspect-announces-carbon-fiber-ndt-certification-program-purpose-built-for-cycling-industry"
      }
    ],
    "link": "https://www.compositesworld.com/news/cycle-inspect-announces-carbon-fiber-ndt-certification-program-purpose-built-for-cycling-industry"
  },
  {
    "published": "Tue, 28 Oct 2025 15:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      28,
      19,
      0,
      0,
      1,
      301,
      0
    ],
    "title": "DLR-SY exhibits full-scale CFRP liquid hydrogen tank test item for zero-emission aviation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DLR-SY exhibits full-scale CFRP liquid hydrogen tank test item for zero-emission aviation"
    },
    "summary": "The German Aerospace Center Institute for Lightweight Systems exhibits 1.9-meter autoclave infusion composite structure as part of LUFO UpLift project aiming for LH2 as part of short-haul aircraft propulsion by 2040.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The German Aerospace Center Institute for Lightweight Systems exhibits 1.9-meter autoclave infusion composite structure as part of LUFO UpLift project aiming for LH2 as part of short-haul aircraft propulsion by 2040."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-invent-tank.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CFRP outer tank cap for LH2 storage\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-invent-tank.jpg;maxWidth=720\" /> </a></div>\n\n<p>CFRP outer tank cap, part of composite&nbsp;dewar construction&nbsp;for cyrogenic&nbsp;liquid hydrogen&nbsp;storage. Source |&nbsp;<a href=\"https://www.dlr.de/de/service/impressum\" target=\"_blank\">&copy; DLR. Alle Rechte vorbehalten</a></p>\n</div>\n\n<p>The <a href=\"https://www.dlr.de/de/sy\" target=\"_blank\">German Aerospace Center (DLR) Institute for Lightweight Systems</a>&nbsp;(Braunschweig), together with <a href=\"https://www.invent-gmbh.de/\" target=\"_blank\">INVENT GmbH</a>&nbsp;(Braunschweig, Germany), has developed a 1.9-meter-diameter carbon fiber-reinforced polymer (CFRP) cylindrical tank component for storing liquid hydrogen (LH<sub>2</sub>) for zero-emission propulsion. DLR reports using LH<sub>2</sub> as an energy carrier for short-haul aircraft will become a reality by 2040. For this to succeed, lightweight tanks are needed that can be produced safely, easily and efficiently.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-invent-tank-config.jpg\" target=\"_blank\"><img alt=\"outer CFRP tank construction for LH2 storage\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-invent-tank-config.jpg;maxWidth=385\" /></a></div>\n\n<p>Source |&nbsp;<a href=\"https://www.dlr.de/de/service/impressum\" target=\"_blank\">&copy; DLR. Alle Rechte vorbehalten</a></p>\n</div>\n\n<p>The 1.9-meter CFRP structure is the shorter of two segments comprising an outer tank for a dewar construction with vacuum between the inner and outer tanks, standard in cryogenic storage. It was reportedly made using materials and processes already approved for aviation, including DLR-SY&rsquo;s&nbsp;autoclave infusion process.</p>\n\n<p>It was presented for the first time at the <a href=\"https://www.hydrogen-worldexpo.com/\" target=\"_blank\">Hydrogen Technology World Expo 2025</a> (Oct. 20-22, Hamburg, Germany).</p>\n\n<div></div>\n\n<p><br />\nDLR-SY develops and tests new systems technologies based on lightweight materials, structures and functional integration for resource-efficient and climate-friendly structures in aerospace, transport&nbsp;and the energy and security sectors. As part of its work in the German-funded LUFO UpLift project, this first full-scale test structure was produced using DLR-SY&rsquo;s autoclave infusion process &mdash; considered an innovative approach for producing large-scale CFRP tanks.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-invent-tank-test.jpg\" target=\"_blank\"><img alt=\" UpLift liquid hydrogen tank testing\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-dlr-invent-tank-test.jpg;maxWidth=385\" /></a></div>\n\n<p>Source |&nbsp;<a href=\"https://www.dlr.de/de/service/impressum\" target=\"_blank\">&copy; DLR. Alle Rechte vorbehalten</a></p>\n</div>\n\n<p>The LH<sub>2</sub> tank must withstand cryogenic temperatures of -253&deg;C, a pressure between 2 and 10 bar and must also provide lightweight yet robust leak-tight storage to meet the requirements of commercial aircraft. Aircraft with 100 seats and a 1,000-nautical mile range are the first target for such composite tank developments. The UpLift ground test facility enables testing of full-scale composite tank components and under realistic operational conditions for this segment of future short-haul aircraft.</p>\n\n<p>This development, titled &ldquo;Lightweight liquid hydrogen tanks for sustainable aviation,&rdquo; is one of six finalists for the <a href=\"https://innovationsnetzwerk.nds.de/nominierung/mit-leichtbau-fluessigwasserstofftanks-zur-nachhaltigen-luftfahrt/\" target=\"_blank\">Lower Saxony Innovation Award 2025</a> in the Key Technologies category. Possible applications are said to include cryogenic space tanks &mdash; particularly in the upper stage for the <em>Ariane</em> launch vehicle &mdash; and as LH<sub>2</sub> or ammonia storage tanks in the maritime sector. The experience gained in the manufacture of large, thin-walled, low-pressure vessels could also be beneficial toward further advancing high-rate production of future aircraft fuselages and other large components such as pressure bulkheads or rudder shells.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dlr-sy-exhibits-full-scale-cfrp-liquid-hydrogen-tank-test-item-for-zero-emission-aviation"
      }
    ],
    "link": "https://www.compositesworld.com/news/dlr-sy-exhibits-full-scale-cfrp-liquid-hydrogen-tank-test-item-for-zero-emission-aviation"
  },
  {
    "published": "Tue, 28 Oct 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      28,
      15,
      0,
      0,
      1,
      301,
      0
    ],
    "title": "Cevotec joins Airbus-led R&D on CFRTP fuselage frames",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Cevotec joins Airbus-led R&D on CFRTP fuselage frames"
    },
    "summary": "Cevotec contributes its FPP&nbsp;preforming expertise to the 3‑year feasibility and maturation project driven to reduce weight, increase layup rates&nbsp;and develop a scrap‑lean process chain.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Cevotec contributes its FPP&nbsp;preforming expertise to the 3‑year feasibility and maturation project driven to reduce weight, increase layup rates&nbsp;and develop a scrap‑lean process chain."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-cevotec-lufovii1-project1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"FPP off-axis illustration.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-cevotec-lufovii1-project1.png;maxWidth=720\" /> </a></div>\n\n<p><strong>Figure 1.&nbsp;</strong>Illustration of off-axis ply placement using fiber patch placement (FPP) technology. Source (All Images) | Cevotec</p>\n</div>\n\n<p style=\"text-align: start;\"><a href=\"https://www.compositesworld.com/suppliers/cevotec\" target=\"_blank\">Cevotec</a> (Munich, Germany) is participating&nbsp;in an Airbus (Toulouse, France)-led R&amp;D consortium within the German aerospace research program &ldquo;LuFo VII-1,&rdquo; that is&nbsp;focused on developing a high-rate manufacturing route for carbon fiber-reinforced thermoplastic (CFRTP) fuselage structures.</p>\n\n<p style=\"text-align: start;\">The 3‑year program, launched in August 2025, centers on technology route development and validation. The consortium comprises Airbus (Lead), the <a href=\"https://www.compositesworld.com/suppliers/dlr---german-aerospace-center\" target=\"_blank\">German Aerospace Center</a> (DLR), Fraunhofer institutes IGCV, ICT and <a href=\"https://www.compositesworld.com/suppliers/fraunhofer-institute-for-manufacturing-technology\" target=\"_blank\">IFAM</a>, the Leibnitz Institute IVW and Cevotec. Cevotec&nbsp;is contributing its fiber patch placement (FPP) preform expertise for off‑axis (&plusmn;45&deg;/90&deg;) ply layup for fuselage frames (Fig 1.), providing a technology module for a future integrated process chain that also includes automated 0&deg; ply layup, stamp forming&nbsp;and trimming. The shared goal? To reduce weight, increase layup rates&nbsp;and develop a scrap‑lean process chain that can support future production of more than 75 single-aisle&nbsp;aircraft per month.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3 style=\"text-align: start;\"><strong>The case for CFRTP fuselage frames</strong></h3>\n\n<p style=\"text-align: start;\">Fuselage frames are a key component of the airframe. They carry loads, stabilize the skin&nbsp;and create the interfaces to systems and cabins. Traditionally, these frames are metallic or made with thermoset composites. CFRTP adds a compelling alternative: weldability, faster processing, inherent toughness and proven pathways to repair and recycling.</p>\n\n<p style=\"text-align: start;\">But those benefits come with their own manufacturing challenges, driven by the&nbsp;materials&rsquo;&nbsp;inertness at room temperature. Unlike thermoset prepregs, which usually exhibit a certain stickiness (tack), non-tacky thermoplastic prepregs can&rsquo;t merely be stacked as preparation for curing, but have to be preformed using high (local) temperatures for lamination and (pre-) consolidation.</p>\n</div>\n</div>\n\n<p style=\"text-align: start;\">The project team intends to build up the modules of a future integrated process chain, purpose‑built for rate and repeatability. Cevotec&rsquo;s robots place off‑axis patches (&plusmn;45&deg;/90&deg;) to form complete stacks. Zero-degree plies that carry axial loads efficiently will be placed by Fraunhofer IGCV using thermoplastic composite (TPC) automated fiber placement (AFP). Airbus then takes over with stamp forming; the preforms are heated and shaped in seconds, followed by trimming and downstream finishing.</p>\n\n<p style=\"text-align: start;\">The process will be digitally defined and traceable; placement data can be used to verify that fiber orientations and locations match design intent. An AI-driven vision system to monitor the accuracy of placement will be investigated. Those will be building blocks of a &ldquo;first‑time‑right&rdquo; process that minimizes scrap and stabilizes quality across shifts and manufacturing sites.</p>\n\n<p style=\"text-align: start;\">The project is guided by an ambitious set of outcomes, says Cevotec. First, weight: Moving to CFRP frames is a direct lever on reducing airframe mass, resulting in lower fuel burn and emissions over the aircraft&rsquo;s life. Second, rate: Each step &mdash;&nbsp;from placement to forming &mdash;&nbsp;must fit a takt‑time‑driven environment capable of supporting more than 75 aircraft per month. Third, cost and sustainability: By&nbsp;combining precise patch placement with robust forming, partners are targeting a step‑change reduction in production scrap and a path to circularity enabled by thermoplastics.</p>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-cevotec-lufovii1-layup-order.png;maxWidth=720\" /> </div>\n\n<p><strong>Figure 2.&nbsp;</strong>Virtual manufacturing cell Cevotec Samba&nbsp;Step L system (digital mock-up for frame preforming).</p>\n</div>\n\n<p style=\"text-align: start;\">For the intended process chain, FPP is expected to achieve higher layup rate than AFP for off‑axis plies on complex geometries. AFP remains the efficient choice for the curved, continuous 0&deg; layers, while FPP is applied to lay up the non-zero (i.e., &ldquo;off-axis&rdquo;) plies. In one fast placement operation, a wide patch with the desired fiber orientation can be placed. Compared to multiple AFP placement operations required to cover the same width, FPP offer the opportunity to improve cycle and takt time, thereby process economics and rate capability.</p>\n\n<blockquote>\n<p style=\"text-align: start;\">The shared goal? To reduce weight, increase layup rates&nbsp;and develop a scrap‑lean process chain that can support future production of more than 75 single-aisle&nbsp;aircraft per month.</p>\n</blockquote>\n\n<p style=\"text-align: start;\">The HERA project focuses on validating technology modules for a high-rate thermoplastic process chain for future aircraft structures. To develop and validate the FPP module, Cevotec will modify and expand the capabilities of its Samba&nbsp;Step L lab system (Fig. 2). This equipment offers a high flexibility to integrate project-developed sub-modules, while benefiting from general precision&nbsp;placement of larger plies as validated in previous aerospace projects.</p>\n\n<p style=\"text-align: start;\"><em>This research program is supported by the Federal Ministry for Economic Affairs and Energy (BMWE) under the support code 20W2405E.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cevotec-joins-airbus-led-rd-on-cfrtp-fuselage-frames"
      }
    ],
    "link": "https://www.compositesworld.com/news/cevotec-joins-airbus-led-rd-on-cfrtp-fuselage-frames"
  },
  {
    "published": "Mon, 27 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      27,
      16,
      0,
      0,
      0,
      300,
      0
    ],
    "title": "Aeromech opens training center, launches comprehensive aerocomposites training course",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aeromech opens training center, launches comprehensive aerocomposites training course"
    },
    "summary": "The&nbsp;Aeromech Training Centre in Brisbane aims to build a robust, sovereign composites workforce for defense and aerospace&nbsp;through an industry professional-developed course offered in a portable delivery format.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The&nbsp;Aeromech Training Centre in Brisbane aims to build a robust, sovereign composites workforce for defense and aerospace&nbsp;through an industry professional-developed course offered in a portable delivery format."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-aeromech-training-centre.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aeromech Training Centre oven with composite materials.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-aeromech-training-centre.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images)&nbsp;| Aeromech</p>\n</div>\n\n<p><a href=\"https://www.aeromech.com.au/\" target=\"_blank\">Aeromech</a>&nbsp;(Brisbane, Australia) has announced the&nbsp;opening of the Aeromech Training Centre in Brisbane to deliver advanced composites training for aerospace manufacturing and repair across Australia first, with subsequent expansion to New Zealand, the broader Asia-Pacific region&nbsp;and the Middle East. Alongside this launch, the company highlights its flagship &ldquo;Advanced Composites&nbsp;Aerospace Manufacturing and Repair&rdquo; training program offering comprehensive training across the full life cycle of composite manufacturing and sustainment.</p>\n\n<p>&ldquo;This is more than a training center &mdash;&nbsp;it&rsquo;s a strategic capability enabler,&rdquo; says Joe Bryant, founder and managing director at Aeromech. &ldquo;Whether you&rsquo;re starting out or building on years of experience, our programs equip professionals with the technical knowledge and hands-on skills needed to meet modern aerospace requirements.&rdquo;</p>\n\n<p>The goal, he says, is to address the aerospace and defense skills shortage and build a robust, sovereign workforce &mdash; all with minimal disruption to operations through the Training Centre&rsquo;s portable, turnkey delivery mode. &ldquo;We bring&nbsp;the same quality training to your location &mdash; whether you&rsquo;re in Brisbane, Darwin, Auckland or anywhere across the region,&rdquo; says Bryant.&nbsp;&ldquo;It&rsquo;s flexible, efficient&nbsp;and always industry-grade.&rdquo;</p>\n\n<p>Aeromech&rsquo;s&nbsp;training course&nbsp;was developed by experienced engineers and technicians with extensive defense and commercial aerospace backgrounds. It is designed for&nbsp;current and aspiring manufacturing and repair technicians, engineers and managers. Exceeding the&nbsp;standards of the EASA- and FAA-approved SAE AIR4938 &ndash; Composite and Bonded Structure Technical Specialist Training, the program includes:</p>\n\n<ul>\n\t<li>Occupational health and safety</li>\n\t<li>Understanding and handling of composite materials</li>\n\t<li>Understanding tooling and structural design</li>\n\t<li>Layup, bonding, curing and composites fabrication techniques</li>\n\t<li>Inspection, nondestructive testing and damage assessment</li>\n\t<li>Structural repair, quality assurance and compliance</li>\n\t<li>Surface prep and painting</li>\n\t<li>Supply chain, quality and the management of composites end to end in a manufacturing and operational environment</li>\n\t<li>Real-world scenarios from rotary and fixed-wing platforms in civilian aviation and defense.</li>\n</ul>\n\n<p>The course&nbsp;combines&nbsp;in-depth theoretical knowledge with practical, hands-on experience, delivered by practicing aerospace industry professionals. All materials and equipment are provided and course content is&nbsp;tailored from entry-level through to advanced users and specialized applications, depending on a participant&rsquo;s expertise and&nbsp;skill level.&nbsp;Accredited and non-accredited options available.</p>\n\n<p>The &ldquo;Advanced Composites Aerospace Manufacturing and Repair Training&rdquo; course is now open for enrollment at the Aeromech Training Centre in Brisbane, with portable training delivery available across Australia, Asia, Oceania&nbsp;and the Middle East.&nbsp;To learn more or to register, visit <a href=\"https://www.aeromech.com.au\" target=\"_blank\">www.aeromech.com.au</a> or contact@aeromech.com.au.</p>\n\n<div class=\"article_sidebar\">\n<h3>Aeromech&rsquo;s&nbsp;roots in aerospace</h3>\n\n<p>Aeromech was founded by Joe Bryant, a recognized expert in aerospace composites and a former senior leader at Airbus Australia. Bryant&nbsp;led and managed Airbus Australia&rsquo;s Advanced Composites Manufacturing Facility and was also responsible for the NH90 Final Assembly and Delivery Line, overseeing the local production and delivery of advanced multi-role military helicopters.</p>\n\n<p>His first-hand experience with high-performance aerospace manufacturing and complex aircraft integration underpins Aeromech&rsquo;s training philosophy: real-world relevance, industry credibility&nbsp;and future readiness.</p>\n\n<p>The Training Centre is also supported by Joseph Saporito, former CEO of Airbus Australia and executive vice president of supply chain at Airbus Helicopters, further strengthening Aeromech&rsquo;s strategic alignment with global aerospace standards.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-aeromech-bryant-saporito.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Joe Bryant and Joseph Saporito.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-aeromech-bryant-saporito.jpg;maxWidth=720\" /> </a></div>\n\n<p>Joe Bryant and Joseph Saporito.</p>\n</div>\n\n<p>&ldquo;This is exactly the kind of practical, targeted training the region needs,&rdquo; says Saporito. &ldquo;Aeromech is preparing the next generation of aerospace professionals with the knowledge and hands-on ability to deliver on real operational demands.&rdquo;</p>\n\n<p>The opening of the Aeromech Training Centre follows the success of the company&rsquo;s Advanced Composite Workshops for high school students, which have introduced hundreds of students across Australia to aerospace manufacturing. These workshops are bridging the gap between education and industry, sparking early interest and creating clear career pathways into aerospace, defense and advanced manufacturing.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aeromech-opens-training-center-launches-comprehensive-aerocomposites-training-course"
      }
    ],
    "link": "https://www.compositesworld.com/news/aeromech-opens-training-center-launches-comprehensive-aerocomposites-training-course"
  },
  {
    "published": "Mon, 27 Oct 2025 11:11:11 -0400",
    "published_parsed": [
      2025,
      10,
      27,
      15,
      11,
      11,
      0,
      300,
      0
    ],
    "title": "Embraer, Mahindra Group form strategic alliance to introduce C-390 Millennium to India",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Embraer, Mahindra Group form strategic alliance to introduce C-390 Millennium to India"
    },
    "summary": "The composites-intensive military transport aircraft will be jointly promoted in India with the establishment of&nbsp;local manufacturing, assembly, supply chain and MRO capabilities.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The composites-intensive military transport aircraft will be jointly promoted in India with the establishment of&nbsp;local manufacturing, assembly, supply chain and MRO capabilities."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-embraer-c390.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"C-390 aircraft.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-embraer-c390.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Embraer&nbsp;</p>\n</div>\n\n<p>In a bold step toward&nbsp;India&rsquo;s Atmanirbhar Bharat vision, <a href=\"https://www.embraer.com/en/\" target=\"_blank\">Embraer Defense &amp; Security</a>&nbsp;(Jacksonville, Fla., U.S.) and <a href=\"https://www.mahindra.com/\" target=\"_blank\">Mahindra Group</a> (New Delhi, India), have signed a landmark strategic cooperation agreement (SCA) to advance the C-390 <em>Millennium</em>&nbsp;for the Indian Air Force&rsquo;s Medium Transport Aircraft (MTA) program. This agreement was inked alongside the inauguration of Embraer&rsquo;s national office in Aerocity, New Delhi.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>While Embraer has been reported to be a major provider of composite materials for the C-390 <em>Millennium</em>, it also relies on <a href=\"https://www.airframer.com/aircraft_detail.html?model=C-390#4\" target=\"_blank\">an international network</a> of suppliers and partners to produce the aircraft&rsquo;s composite and metal alloy components such as&nbsp;Latecoere Aerostructures (formerly Avcorp Industries).</p>\n</div>\n</div>\n\n<p>The agreement builds upon the memorandum of understanding signed in February 2024 at the Embassy of Brazil in New Delhi, deepening the scope of cooperation to include joint marketing, industrialization and developing India as a hub for the C-390 <em>Millennium</em>. Since the signing, the aircraft has further increased its operator base globally.</p>\n\n<p>Embraer and Mahindra Group will work closely with stakeholders in the country and engage with India&rsquo;s military and aerospace ecosystem to identify opportunities for local manufacturing, assembly facilities, supply chain and maintenance, repair and overhaul (MRO) activities. The long-term ambition is to position India as a manufacturing and support hub for the C-390 <em>Millennium</em> aircraft, serving both domestic and regional requirements.</p>\n\n<p>&ldquo;The agreement is a significant milestone in our relationship with Mahindra Group,&rdquo; notes Bosco da Costa Junior, president and CEO of&nbsp;Embraer Defense &amp; Security. &ldquo;This partnership is more than an aerospace deal &mdash;&nbsp;it reflects our commitment to &lsquo;Atmanirbhar Bharat&rsquo; and the growing friendship between Brazil and India.&rdquo;</p>\n\n<p>The C-390 <em>Millennium,&nbsp;</em>a modern military transport aircraft, can carry more payload (26 tons) compared to other medium-sized military transport aircraft and is said to fly&nbsp;faster (470 knots) and farther. It is able to perform a wide range of missions including cargo and troop transport, airdrops, medical evacuation, search and rescue, firefighting&nbsp;and humanitarian operations. It can operate from temporary or unpaved runways. The aircraft can also be configured for air-to-air refueling, both as a tanker and as a receiver.</p>\n\n<p>The current fleet, in operation, has demonstrated a mission completion rate of more than 99%. It has already been selected by air forces in Brazil, Portugal, Hungary, the Netherlands, Austria, South Korea, Czech Republic, Sweden, Slovakia, Lithuania and an undisclosed customer.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/embraer-mahindra-group-form-strategic-alliance-to-introduce-c-390-millennium-to-india"
      }
    ],
    "link": "https://www.compositesworld.com/news/embraer-mahindra-group-form-strategic-alliance-to-introduce-c-390-millennium-to-india"
  }
]