[
  {
    "published": "Fri, 1 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      17,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "NASA contract enables Firefly Blue Ghost Mission 4 in 2029",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "NASA contract enables Firefly Blue Ghost Mission 4 in 2029"
    },
    "summary": "The company&rsquo;s fourth lunar mission and fifth NASA CLPS award will use the Elytra orbital vehicle and Blue Ghost lunar lander to operate two rovers and three scientific instruments on the Moon&rsquo;s south pole.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company&rsquo;s fourth lunar mission and fifth NASA CLPS award will use the Elytra orbital vehicle and Blue Ghost lunar lander to operate two rovers and three scientific instruments on the Moon&rsquo;s south pole."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-firefly-blueghost-lunar.png\" target=\"_blank\"><img alt=\"Blue Ghost landed on the moon.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-firefly-blueghost-lunar.png;maxWidth=385\" /></a></div>\n\n<p>Source | Firefly Aerospace</p>\n</div>\n\n<p>On July 29,&nbsp;<a href=\"https://fireflyspace.com/\" target=\"_blank\">Firefly Aerospace</a>&nbsp;(Cedar Park, Texas, U.S.) was awarded a&nbsp;$176.7 million NASA Commercial Lunar Payload Services (CLPS) contract to deliver five NASA-sponsored payloads to the Moon&rsquo;s south pole in 2029. The mission will use Firefly&rsquo;s composites-intensive Elytra orbital vehicle and <em>Blue Ghost</em> lunar lander to enable payload operations that include evaluating the Moon&rsquo;s south pole resources, such as hydrogen, water&nbsp;and other minerals, and studying the radiation and thermal environment that could affect future astronauts and lunar infrastructure.</p>\n\n<p>During&nbsp;Blue Ghost Mission 4&nbsp;operations, Firefly&rsquo;s&nbsp;Elytra <em>Dark</em>&nbsp;transfer vehicle will first deploy the&nbsp;<em>Blue Ghost</em>&nbsp;lander into lunar orbit and remain on orbit to provide a long-haul communications relay for the mission. <em>Blue Ghost</em> will then land in the Moon&rsquo;s south pole region, deploy the rovers&nbsp;and enable payloads operations with data, power&nbsp;and communications services for more than 12 days on the lunar surface.</p>\n\n<p>The NASA-sponsored payloads onboard <em>Blue Ghost</em> include two rovers &mdash; the MoonRanger rover and a Canadian Space Agency rover &mdash;&nbsp;as well as a laser ablation ionization mass spectrometer (LIMS), a laser retroreflector&nbsp;array (LRA)&nbsp;and the stereo cameras for lunar plume surface studies (SCALPSS), which also flew on&nbsp;<a href=\"https://fireflyspace.com/missions/blue-ghost-mission-1/\" target=\"_blank\">Blue Ghost Mission 1</a>. These payloads will help uncover the composition and resources available at the Moon&rsquo;s south pole, advance lunar navigation, evaluate the chemical composition of lunar regolith&nbsp;and further study the effects of a lander&rsquo;s plume on the Moon&rsquo;s surface during landings.</p>\n\n<p>Following Blue Ghost Mission 4 operations, Elytra <em>Dark</em> will remain operational in lunar orbit for more than 5&nbsp;years in support of Firefly&rsquo;s&nbsp;Ocula lunar imaging service. The mission enables a third Elytra <em>Dark</em> in Firefly&rsquo;s growing constellation to provide customers with faster revisit times for lunar mapping, mission planning,&nbsp;situational awareness&nbsp;and mineral detection services. The first two Elytra <em>Dark</em> vehicles will launch as part of&nbsp;<a href=\"https://fireflyspace.com/missions/blue-ghost-mission-2/\" target=\"_blank\">Blue Ghost Mission 2</a>&nbsp;to the far side of the Moon in 2026 and&nbsp;<a href=\"https://fireflyspace.com/missions/blue-ghost-mission-3/\" target=\"_blank\">Blue Ghost Mission 3</a>&nbsp;to the Gruithuisen Domes in 2028.</p>\n\n<p>&ldquo;Firefly&rsquo;s Elytra <em>Dark</em> spacecraft are companions for <em>Blue Ghost</em> &mdash;&nbsp;they&rsquo;re highly maneuverable vehicles built with the same flight-proven components and propulsion system that successfully landed <em>Blue Ghost</em> on the Moon,&rdquo; says Chris&nbsp;Clark, VP of spacecraft. &ldquo;As our Elytra constellation continues to grow in lunar orbit, Firefly is in a position to provide lunar imaging services and a communications relay for missions anywhere on the Moon&rsquo;s surface. And with extra payload capacity on both Elytra and <em>Blue Ghost</em>, we invite additional government and commercial customers <a href=\"https://fireflyspace.com/missions/blue-ghost-mission-4/\" target=\"_blank\">to join our fourth mission</a>.&rdquo;</p>\n\n<p><em>Want to learn more about Firefly&rsquo;s developments? Take a look at these <a href=\"https://www.compositesworld.com/search?q=Firefly%20Aerospace\" target=\"_blank\">recent announcements</a>.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/nasa-contract-enables-firefly-blue-ghost-mission-4-in-2029"
      }
    ],
    "link": "https://www.compositesworld.com/news/nasa-contract-enables-firefly-blue-ghost-mission-4-in-2029"
  },
  {
    "published": "Fri, 1 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      17,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "Aimplas launches NEOCOMP and REFUGI projects",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aimplas launches NEOCOMP and REFUGI projects"
    },
    "summary": "The Spanish center is focusing on the development of sustainable, flame-retardant coatings and composites to enhance safety in construction and mobility.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Spanish center is focusing on the development of sustainable, flame-retardant coatings and composites to enhance safety in construction and mobility."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-aimplas-neocomp.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"NEOCOMP project filaments.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-aimplas-neocomp.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | Aimplas</p>\n</div>\n\n<p>There is growing concern about the environmental impact generated by key industrial sectors, especially in areas such as construction and mobility, where achieving materials with good mechanical performance, lighter weight&nbsp;and greater fire resistance plays a crucial role. In this context, <a href=\"https://www.aimplas.net/\" target=\"_blank\">Aimplas</a>, the Plastics Technology Centre (Valencia, Spain)&nbsp;is working on two projects &mdash; REFUGI and NEOCOMP&nbsp;&mdash;&nbsp;funded by the Valencian Institute for Competitiveness and Innovation (IVACE+i), with support from the European Regional Development Fund (ERDF), to sustainably develop new flame-retardant coatings and composite materials that enhance safety in homes and transportation.</p>\n\n<p>The NEOCOMP project, in collaboration with Ziur Composites and IT3D, focuses on developing high-performance, flame-retardant composite materials using advanced manufacturing technologies. This involves producing various parts through industrial processes such as dry fiber placement (DFP) and additive manufacturing. These composite materials must not only offer high performance in terms of mechanical strength, durability and flame resistance but also significantly contribute to reducing the environmental impact in construction and mobility.</p>\n\n<p>Specifically, NEOCOMP will develop flame-retardant thermoplastic binders for dry fiber, unidirectional dry fiber tapes for DFP&nbsp;and continuously reinforced 3D filaments. According to Aimplas, these&nbsp;new manufacturing approaches will enable&nbsp;the efficient production of preforms with complex geometries and also the production of customized composite parts with improved mechanical properties, greater fatigue resistance&nbsp;and optimal&nbsp;fire resistance. This will open new opportunities in sectors such as construction, automotive&nbsp;and aerospace.&nbsp;</p>\n\n<p>The main objective of the REFUGI project is to develop phosphorus-based flame retardants using mechanochemical processes, representing a step toward more environmentally friendly methods. These flame retardants are being integrated into varnish formulations specifically designed for use on wood. This strategy aims to improve the fire-resistant properties of coatings used in the construction sector.</p>\n\n<p>&ldquo;The use of flame-retardant varnishes has increased in recent years, as they offer a finish virtually identical to any wood coating, with the added benefit of greater fire resistance, delaying its spread and effects in the event of a fire,&rdquo; explain Carolina Acosta, lead researcher in mechanochemistry and reactive extrusion at Aimplas. &ldquo;We are focusing on exploring different material sources to produce these flame retardants, prioritizing those that are renewable and recyclable.&rdquo;</p>\n\n<p>This research, carried out in collaboration with Omar Coatings and Decomader, aims not only to improve the efficiency of flame-retardant production, but also to reduce the environmental impact associated with their manufacture and application.</p>\n\n<p>Both projects are part of the IVACE+i grant program for non-economic R&amp;D projects carried out in collaboration with companies by technology centers in the Valencian Community for 2024, funded by the European Union&rsquo;s ERDF under the 2021&ndash;2027 Operational Program.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aimplas-launches-neocomp-and-refugi-projects"
      }
    ],
    "link": "https://www.compositesworld.com/news/aimplas-launches-neocomp-and-refugi-projects"
  },
  {
    "published": "Fri, 1 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      16,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "Horizon Europe projects present webinar for advancing aviation digitalization, composite technologies",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Horizon Europe projects present webinar for advancing aviation digitalization, composite technologies"
    },
    "summary": "Free webinar on Sept. 24, 2025, brings together members from&nbsp;DEMOQUAS, GENEX and TOSCA to delve into how these projects are contributing to safer, more efficient and&nbsp;environmentally responsible aviation technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Free webinar on Sept. 24, 2025, brings together members from&nbsp;DEMOQUAS, GENEX and TOSCA to delve into how these projects are contributing to safer, more efficient and&nbsp;environmentally responsible aviation technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-genex-herwingt-webinar.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-genex-herwingt-webinar.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Horizon Europe</p>\n</div>\n\n<p>In a step toward the future of aerospace innovation, three European projects &mdash;&nbsp;<a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.demoquas.eu%2F&amp;data=05%7C02%7CGNehls%40gardnerweb.com%7C544b7da6c2644ccbcb2c08ddcf36f479%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638894557145321652%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=QxkmTTCWSVRs%2BHmkf%2FdlaJcqvSP9FJh96Oza1jK2qho%3D&amp;reserved=0\" target=\"_blank\">DEMOQUAS</a>, <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fgenex-project.eu%2F&amp;data=05%7C02%7CGNehls%40gardnerweb.com%7C544b7da6c2644ccbcb2c08ddcf36f479%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638894557145349762%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=nMMlf2Lzeaj9uXLiLsCEbsXTHRDuyJF2%2BFQIuJa3Be8%3D&amp;reserved=0\" target=\"_blank\">GENEX</a>&nbsp;and <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.tosca-project.eu%2F&amp;data=05%7C02%7CGNehls%40gardnerweb.com%7C544b7da6c2644ccbcb2c08ddcf36f479%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638894557145364829%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=so2HZds7xDBhGxFI%2Bmi3H6aLJ%2BOzdoQaEEse1ht1ggE%3D&amp;reserved=0\" target=\"_blank\">TOSCA</a>&nbsp;(more on these below)<strong>&nbsp;</strong>&mdash; are joining forces to present a webinar titled &ldquo;Advancing Digitalization and Composite Technologies for Safer, More Sustainable Aviation.&rdquo; The free and exclusive online event takes place&nbsp;on Sept. 24, 2025 from 11:00 &ndash;&nbsp;12:00 p.m. CET. Interested parties can <a href=\"https://events.teams.microsoft.com/event/077e4b5d-f88a-45bb-892e-21796196b7eb@1fc902d5-ed41-4d28-943d-4941726de980\" target=\"_blank\">register here</a>.</p>\n\n<p>This collaborative event brings together leading minds and cutting-edge research to explore how digital transformation and advanced materials are reshaping the aviation industry.</p>\n\n<p>At the forefront of this transformation is GENEX, a project redefining aerospace manufacturing through its eco-efficient composites and intelligent production systems. Central to GENEX&rsquo;s innovation is an out-of-autoclave process using 3R resin &mdash; thermoplastic developed for recyclability, repairability and reprocessability (hence the name 3R). At the heart of GENEX innovation is Health and Usage Monitoring and&nbsp;Management, promoting real-time diagnostics and predictive analytics. By enabling data-driven maintenance, it enhances safety, boosts efficiency&nbsp;and extends asset life &mdash;ensuring mission readiness with sustainable precision.</p>\n\n<p>The webinar will delve into how these advancements, alongside the contributions of DEMOQUAS and TOSCA, are converging to create safer, more efficient&nbsp;and environmentally responsible aviation technologies. Attendees will gain insights into the integration of digital tools, sensor technologies&nbsp;and sustainable composite materials &mdash; key enablers to&nbsp;the aerospace sector&rsquo;s green transition.</p>\n\n<p>Notably, this event is not just a showcase of technological progress &mdash; it is a call to action for stakeholders across the aerospace value chain to embrace innovation and collaboration in pursuit of a cleaner, smarter future in flight.&nbsp;It also promises to be of great interest to aerospace professionals, engineers, researchers, digital twin experts&nbsp;and sustainability advocates alike, offering valuable insights and opportunities for engagement.</p>\n\n<p><em>Note: The webinar will be recorded and later uploaded to the official </em><a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.youtube.com%2F%40GENEXPROJECT&amp;data=05%7C02%7CGNehls%40gardnerweb.com%7C544b7da6c2644ccbcb2c08ddcf36f479%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638894557145422490%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=W2jL2szIAZxKcCQybDLfkFgAooH1%2BcuQUhiebvj1TqQ%3D&amp;reserved=0\" target=\"_blank\"><em>GENEX YouTube channel</em></a><em> for wider dissemination.</em></p>\n\n<div class=\"article_sidebar\">\n<h2>Horizon Europe projects</h2>\n\n<h3>DEMOQUAS</h3>\n\n<p>&ldquo;DEsigning, Manufacturing and Operating Quantification of Uncertainties to increase Aviation Safety&rdquo; (DEMOQUAS) is a 36-month Horizon Europe project launched on May 1, 2024. It is coordinated by AUTH and aims to strengthen aviation safety for future propulsion technologies by advancing uncertainty quantification (UQ) methodologies across the full life cycle of aircraft and engine components. The project develops an integrated, UQ-enabled framework based on digital threads and digital twins, applied to six industrially relevant test cases. DEMOQUAS focuses on the multiscale and multi-fidelity representation and propagation of uncertainties in design, manufacturing&nbsp;and operations.</p>\n\n<h3>GENEX&nbsp;</h3>\n\n<p>&ldquo;Next end-to-end digital framework for optimized manufacturing and maintenance of next-generation aircraft composite structures&rdquo; (GENEX)&nbsp; is a 42-month Horizon Europe project launched on Sept. 1, 2022. GENEX is led by ITA and commits to work toward&nbsp;EU goals by developing three pioneering technological assets which, through integration, will lead to a multidisciplinary digital twin of the component throughout its life cycle for next-generation&nbsp;aircraft composite structures. The project objectives have been achieved via the development of three main&nbsp;technological asset blocks.</p>\n\n<h3>TOSCA</h3>\n\n<p>The &ldquo;Manufacturing Processes and Digital&nbsp;Tools for more Sustainable Composite Aerostructures&rdquo; (TOSCA) project aims to develop the manufacturing&nbsp;processes of future aerostructures using a new type of vitrimer resin. Processes such as automated fiber&nbsp;placement, quality control, welding and repair will be analyzed and adapted to the new type of resin. Example parts include components from future eVTOL vehicles. The processes will be supported by a digital twin, that collects relevant information about the part throughout its lifetime. The project is coordinated by Profactor GmbH and started in January 2025.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/horizon-europe-projects-present-webinar-for-advancing-aviation-digitalization-composite-technologies"
      }
    ],
    "link": "https://www.compositesworld.com/news/horizon-europe-projects-present-webinar-for-advancing-aviation-digitalization-composite-technologies"
  },
  {
    "published": "Fri, 1 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      15,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "Clean Aviation's regional aircraft technology testbed #2 demonstrates advances with composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Clean Aviation's regional aircraft technology testbed #2 demonstrates advances with composites"
    },
    "summary": "European project advances OOA outer wing box using resin infusion and thermoplastic composite technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "European project advances OOA outer wing box using resin infusion and thermoplastic composite technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-cleanaviation-ftb2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"C295 Flight Test Bed 2 for Clean Aviation Green Regional Aircraft program\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-cleanaviation-ftb2.jpg;maxWidth=720\" /> </a></div>\n\n<p>The Airbus C295 Flight Test Bed 2 (FTB#2) successfully performed its flight campaign,&nbsp;testing a new semi-morphing wing, as well as&nbsp;on-ground structural tests of a novel composite outer wing box. Source | Clean Aviation, Airbus Defence and Space</p>\n</div>\n\n<p>As reported by the <a href=\"https://www.clean-aviation.eu/revolutionising-regional-aviation-airbus-c295-ftb2-takes-flight\" target=\"_blank\">Clean Aviation</a> program, the Green Regional Aircraft (GRA) program&rsquo;s&nbsp;Flight Test Bed 2 (FTB#2) &mdash; a modified version of the Airbus C295 &mdash; has successfully completed its flight test campaign. Marking a significant milestone in progressing next-gen&nbsp;technologies for sustainable aviation, the aircraft integrates advanced aerodynamics, innovative flight controls and new composite technologies to enhance efficiency and reduce emissions including:</p>\n\n<ul>\n\t<li>Up to 43% CO<sub>2</sub> and 70% NOx emissions reductions in regional aircraft multi-mission scenarios, alongside a 45% noise reduction during takeoff.</li>\n\t<li>A semi-morphing wing, dynamic winglets&nbsp;and an advanced flight control system were successfully tested to optimize aerodynamic performance.</li>\n\t<li>Innovative manufacturing processes&nbsp;&mdash;&nbsp;including additive manufacturing and one-shot composite assembly&nbsp;&mdash;&nbsp;to improve production efficiency.</li>\n</ul>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3><strong>Read <em>CW</em>&rsquo;s coverage of this project:</strong></h3>\n\n<ul>\n\t<li><a href=\"https://www.compositesworld.com/news/clean-sky-2-outer-wing-box-demonstrator-validates-ooa-lri-shimless-assembly-and-shm\" target=\"_blank\">Clean Sky 2 outer wing box demonstrator validates OOA LRI, shimless assemly and SHM</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/advancing-thermoplastic-composite-primary-structure-and-morphing-wings\" target=\"_blank\">Advancing thermoplastic composite primary structure and morphing wings</a></li>\n\t<li><a href=\"https://www.compositesworld.com/news/clean-sky-2-outcome-project-demonstrates-peek-thermoplastic-composite-wingbox-cover\" target=\"_blank\">Clean Sky 2 OUTCOME project demonstrates PEEK thermoplastic composite wingbox cover</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/advancing-the-ooa-infused-wing-box\" target=\"_blank\">Advancing the OOA infused wing box</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/the-path-to-ooa-wings-with-minimal-fasteners\" target=\"_blank\">The path to OOA wings with minimal fasteners</a></li>\n</ul>\n</div>\n</div>\n\n<p>These combined achievements are timely in the context of mounting global pressure to curb aviation&rsquo;s environmental impacts. Stricter regulations on carbon emissions, coupled with society&rsquo;s increasing demand for sustainability, are driving the need for greener air travel. The FTB#2 demonstrator&rsquo;s successful flight highlights Europe&rsquo;s leadership in sustainable aviation and reinforces the importance of the Clean Sky 2, now Clean Aviation, initiative in pioneering these essential advancements.</p>\n\n<p>The success of the flight test activities was made possible through a combination of these design/fabrication elements in conjunction with other aerodynamic enhancements to the C295 flight demonstrator aircraft, such as lightweight composite materials and a more efficient propulsion system. Altogether these modifications optimize fuel consumption while maintaining the aircraft&rsquo;s reliability and versatility. Data collected during the flight provides valuable insights into real-world performance, confirming the effectiveness of these innovations.</p>\n\n<h3><strong>FTB#2 multi-mission platform testing</strong></h3>\n\n<p>As explained by Clean Aviation project officer, Costin-Ciprian Miglan, FTB#2 is a multi-mission platform that can support multiple configurations for a range of roles. &ldquo;For example, it can be used to carry passengers, transport supplies or humanitarian aid, or the aircraft can also be equipped with fire-retardant substances and used to combat wildfires,&rdquo; says Miglan.</p>\n\n<p>The flight test campaign involved 12 successful flights conducted over 17 flight hours, with all planned test points fully achieved. The results were highly satisfactory, confirming the maturity of key technologies tested on board. These included innovations in a composite external outer wing box and morphing control surfaces.</p>\n\n<h3><strong>Advances composites use</strong></h3>\n\n<p>This flight campaign was complemented by a ground-based demonstrations of an out-of-autoclave (OOA) cured carbon fiber-reinforced plastic (CFRP) outer wing box based on a highly integrated design that minimizes components using two different materials and manufacturing processes. The first is liquid resin infusion (LRI), which was used for the lower skin to integrate the spars, stringers and main structure into a one-shot infused part. The second was in situ consolidation (ISC) using automated fiber placement (AFP) to produce a thermoplastic composite (TPC) upper skin with integrated stringers. Together, this resulted in a weight reduction of 5.6% compared with equivalent conventional components.</p>\n\n<p>A highly integrated composite winglet based on a one-shot multi-spar torsion box (which saves 20% weight compared to conventional architecture) was also put through a comprehensive structural test campaign from detail to full-scale. This improved winglet also reduces cost due to reduced riveting during manufacture.</p>\n\n<p>Commenting on the stepped processes of flight and ground testing, Clean Aviation&rsquo;s Miglan explains that &ldquo;<strong>Step one</strong> was the flight test; <strong>step two</strong> involved further maturing other technologies, but only on the ground &mdash; such as the outer wing box and actuation systems for the movable surfaces. The flight test was a major milestone for Clean Sky 2. During this campaign, the entire outer wing, from the engine to the wingtip, was completely replaced. This achievement was the result of multiple &lsquo;Core Partner&rsquo;&nbsp;and &lsquo;Call for Proposals&rsquo;&nbsp;projects under the airframe and regional platforms, all integrated by Airbus Defence and Space.&rdquo;&nbsp;</p>\n\n<p>See <a href=\"https://www.clean-aviation.eu/clean-sky-2/programme-overview-and-structure/clean-sky-2-structure/regional-aircraft\" target=\"_blank\">Clean Aviation Regional Aircraft</a> for more details on FTB#1 and #2 as well as the flight and ground test programs.</p>\n\n<h3><strong>Overcoming challenges in development</strong></h3>\n\n<p>Developing the C295 demonstrator was no easy feat. The project faced several challenges that had to be addressed to achieve success.</p>\n\n<p>&ldquo;Merging multiple advanced systems into an existing aircraft while ensuring compliance with safety regulations required precise integration strategies,&rdquo; emphasizes.&nbsp;Miglan. &ldquo;Engineering challenges associated with new aerodynamic designs, composite materials&nbsp;and propulsion technologies had to be overcome through rigorous testing and iteration. Aligning efforts among various European partners &mdash; each contributing specialized expertise&nbsp;&mdash; demanded&nbsp;strong coordination and communication. Meeting stringent aviation certification standards was another crucial factor in ensuring that all new technologies were safe and viable for future applications.&rdquo;</p>\n\n<p>Despite these challenges, the project&rsquo;s success underscores the strength of collaborative innovation in advancing sustainable aviation. Looking forward, Airbus Defence and Space will continue to contribute to Clean Aviation&rsquo;s next phases. The experience gained from the C295 demonstrator will inform future projects, ensuring continued progress in aviation sustainability. The project has generated valuable insights that could lead to further technological innovations and commercial applications.</p>\n\n<h3><strong>Environmental benefits</strong></h3>\n\n<p>The FTB#2 demonstrator sets a new standard for environmentally responsible regional aircraft operations. The incorporation of advanced materials, innovative technologies and aerodynamic improvements aimed at reducing noise, CO<sub>2</sub> and NOx emissions has surpassed initial expectations.</p>\n\n<p>&ldquo;During a typical search and rescue mission, we estimate that these innovations could achieve up to a 43% reduction in CO<sub>2</sub> emissions and a 70% decrease in NOx emissions during a typical 400-nautical-mile search and rescue mission, along with a 45% reduction in noise during takeoff,&rdquo; says Luis Ben&iacute;tez Monta&ntilde;&eacute;s, formerly the chief engineer in the Clean Sky 2 program for Airbus Defence and Space, who led the Airbus side of the FTB#2 project. &ldquo;These improvements not only support Airbus&rsquo;s sustainability goals but also pave the way for more eco-friendly air travel options worldwide.&rdquo;</p>\n\n<div class=\"article_sidebar\">\n<p>This project ran from 2014 to 2024, with development, refinement and integration of the C295 demonstrator&rsquo;s technologies made possible by a consortium of more than 60 research and academic institutions, industrial partners and technology providers across 12 countries.</p>\n\n<p>Airbus Defence and Space (formerly EADS-CASA) led the integration and testing of new technologies. The total budget for the C295 demonstrator was &euro;102.5 million, comprising &euro;55.4 million dedicated to the Clean Sky 2 AIRFRAME program and &euro;47.1 million allocated to the regional aircraft (REG) Innovative Airframe Technology Demonstrator&nbsp;(IATD)&nbsp;program. The EU contribution associated with the FTB#2 in AIRFRAME was &euro;27.7 million, with an additional &euro;23.55 million toward&nbsp;the REG IATD, for a total of &euro;51.25 million.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/clean-aviations-regional-aircraft-technology-testbed-2-demonstrates-advances-with-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/clean-aviations-regional-aircraft-technology-testbed-2-demonstrates-advances-with-composites"
  },
  {
    "published": "Fri, 1 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      1,
      14,
      0,
      0,
      4,
      213,
      0
    ],
    "title": "Strohm completes first 13 thermoplastic composite jumpers for ExxonMobil",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Strohm completes first 13 thermoplastic composite jumpers for ExxonMobil"
    },
    "summary": "The thermoplastic composite pipe (TCP) jumpers were fabricated as part of the company&rsquo;s Jumper on Demand concept aimed at flexible, high-volume part manufacture.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The thermoplastic composite pipe (TCP) jumpers were fabricated as part of the company&rsquo;s Jumper on Demand concept aimed at flexible, high-volume part manufacture."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-strohm-11.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Strohm thermoplastic composite jumper\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-strohm-11.jpg;maxWidth=720\" /> </a></div>\n\n<p>Strohm&rsquo;s thermoplastic composite pipe jumpers. Source | Strohm&nbsp;</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/strohm\" target=\"_blank\">Strohm</a>&nbsp;(IJmuiden, Netherlands) announces that it has completed fabrication of the first 13 water alternating gas injection thermoplastic composite pipe (TCP) jumpers as part of its Jumper on Demand concept, for ExxonMobil&rsquo;s Yellowtail field offshore Guyana.</p>\n\n<p>Strohm says that its&nbsp;Jumper on Demand concept allows multiple pipe lengths to be spooled from a delivery reel of continuous pipe and cut into discrete jumper lengths onsite. The individual jumpers are then fabricated in parallel by the company&rsquo;s Field Service Group, a team of specialists which are trained in pipe handling and termination of TCP.</p>\n\n<p>This approach is said to provide a safe, efficient and flexible method to produce large volumes of jumpers faster.</p>\n\n<p>The first two TCP jumpers were integrated with vertical connections, pressure tested and installed subsea at depths of more than 1,700 meters in early July. The jumpers, installed by spreader bar, were locked in and back seal tested successfully by the client&rsquo;s installation contractor.</p>\n\n<p>Gavin Leiper, VP of the Americas and Global Field Services Group at Strohm, says, &ldquo;This first Jumper on Demand campaign for ExxonMobil applies a high-volume fabrication method, proving that on-site fabrication of TCP jumpers has the flexibility to scale up or down as the installation schedule demands. As a manufacturer of disruptive technology, we are especially appreciative of ExxonMobil&rsquo;s continued confidence and support to deploy TCP on their assets. The campaign was completed on time, under budget and with zero safety incidents or observations, a fact that was globally commended by the client within their organization. We look forward to collaborating again with ExxonMobil during the next fabrication campaign in 2026.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/strohm-completes-first-13-thermoplastic-composite-jumpers-for-exxonmobil"
      }
    ],
    "link": "https://www.compositesworld.com/news/strohm-completes-first-13-thermoplastic-composite-jumpers-for-exxonmobil"
  },
  {
    "published": "Thu, 31 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      31,
      16,
      0,
      0,
      3,
      212,
      0
    ],
    "title": "People in composites: July 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "People in composites: July 2025"
    },
    "summary": "New composites company announcements from CMS Spa, AMSL Aero, Airbus, Hexcel, Wisk and Delta Marine.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New composites company announcements from CMS Spa, AMSL Aero, Airbus, Hexcel, Wisk and Delta Marine."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<h3><strong>CMS appoints general manager for advanced materials</strong></h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-peoplenews-cms-cosimo-capuzzello.jpg\" target=\"_blank\"><img alt=\"Cosimo Capuzzello.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-peoplenews-cms-cosimo-capuzzello.jpg;maxWidth=385\" /></a></div>\n\n<p>Cosimo&nbsp;Capuzzello, CMS general manager.</p>\n</div>\n\n<p><a href=\"https://www.cms.it/en_US\" target=\"_blank\">CMS SpA</a>&nbsp;(Zogno, Italy), a&nbsp;company of the SCM&nbsp;Group&nbsp;that provides technologies for composite materials, plastic, glass, stone&nbsp;and metal processing, announces the appointment of Cosimo Capuzzello as general manager.</p>\n\n<p>Capuzzello brings more than&nbsp;15 years of executive experience at Datalogic &mdash; a&nbsp;Bologna-based automatic data capture and industrial automation company &mdash; where he most recently held the position of executive vice president (VP) of Datalogic&rsquo;s&nbsp;Industrial Automation division. His appointment as CMS general manager was made July 2 by the company&rsquo;s board of directors, and continues CMS&rsquo;&nbsp;growth strategy, aimed at further strengthening the brand&rsquo;s positioning on a global scale.</p>\n\n<p>SCM Group offers equipment for machining a wide range of materials &mdash; wood, aluminum, plastic, glass, stone, metal and advanced materials &mdash;&nbsp;and industrial components. Across the globe, the group&rsquo;s companies act as highly reliable partners to a wide range of product sectors, from furniture to construction, automotive to aerospace&nbsp;and nautical to plastic machining.</p>\n\n<div class=\"article_sidebar\">\n<h3>AMSL Aero appoints CEO to lead next growth phase</h3>\n\n<p><a href=\"https://www.amslaero.com/\" target=\"_blank\">AMSL Aero</a>&nbsp;(Sydney, Australia), developer of the hydrogen-electric vertical takeoff and landing (eVTOL) aircraft <em>Vertiia</em>, has appointed Dr. Adriano Di Pietro as CEO.&nbsp;He brings deep sector knowledge, strategic acumen&nbsp;and scale-up and go-to-market experience to the role, with nearly 20 years of leadership and technical expertise spanning aerospace, automotive, defense and autonomous systems.&nbsp;Di Pietro commenced&nbsp;his CEO role at AMSL Aero as of July 7.</p>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"AMSL Aero CEO Adriano Di Petrio with chairman Chris Smallhorn.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-peoplenews-amslaero-adrianodipietro.png;maxWidth=720\" /> </div>\n\n<p>AMSL Aero CEO Adriano Di Petrio with chairman Chris Smallhorn.</p>\n</div>\n\n<p>Di Pietro joins AMSL Aero from the Aerospace Innovation Research Hub (AIR Hub) at Swinburne University where he served as director and CEO (interim) of the Australian Air Mobility Cooperative Research Centre (AAMCRC), leading an expert team supporting the growth of Australia&rsquo;s uncrewed air systems (UAS) and advanced air mobility development and manufacturing industry.&nbsp;He has helped scale multiple high-tech ventures across Australia, the U.S.&nbsp;and Europe.&nbsp;</p>\n\n<p>In November 2024, AMSL Aero joined a group of top-tier global companies to fly <em>Vertiia</em> in untethered horizontal flight successfully. Di Pietro joins AMSL Aero as the company prepares to build its second full-scale prototype of <em>Vertiia</em> and undertake its first hydrogen-powered flight test program. He will lead AMSL Aero&rsquo;s campaign for certification by the Civil Aviation Safety Authority (CASA), scale up manufacturing capability and drive global commercial expansion, fueled by strong forward orders.</p>\n\n<p>&ldquo;I am excited to join AMSL Aero,&rdquo; says Di Pietro. &ldquo;I believe in the company&rsquo;s bold vision to revolutionize air mobility through accessible zero-emissions technology. AMSL has a team that&rsquo;s not only redefining the future of aviation but building a cleaner, faster and more connected regional transportation system, something that&rsquo;s vital to Australia&rsquo;s economic resilience, accessibility&nbsp;and future prosperity.&rdquo;</p>\n\n<p>Previously, Di Pietro held key roles at XTEK (now HighCom Group) as chief technology officer (CTO), where he led the commercialization of aerospace and defense technologies. He was also one of the first employees at Zoox, the Silicon Valley-based autonomous vehicle company acquired by Amazon, and held leadership roles at Quickstep Technologies, an aerospace composites manufacturer in Australia and Germany. Di Pietro&nbsp;holds a Ph.D. in advanced aerospace manufacturing technology and a degree in engineering.</p>\n</div>\n\n<h3>Airbus welcomes new CEO of&nbsp;<strong>Commercial Aircraft business for 2026</strong></h3>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-peoplenews-airbus-larswagner-min.jpg\" target=\"_blank\"><img alt=\"Lars Wagner.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-peoplenews-airbus-larswagner-min.jpg;maxWidth=385\" /></a></div>\n\n<p>Lars Wagner, future Airbus Commerical Aircraft&nbsp;CEO.</p>\n</div>\n\n<p>Lars Wagner, currently CEO&nbsp;of MTU Aero Engines AG (Munich, Germany), will join the <a href=\"https://www.airbus.com/en\" target=\"_blank\">Airbus</a> (Toulouse, France) executive committee and succeed Christian Scherer as CEO of the Commercial Aircraft business, effective Jan. 1, 2026.<br />\n<br />\nWagner will join Airbus from the beginning of November 2025 to ensure a smooth transition with Scherer. Scherer remains CEO of the Commercial Aircraft business until Dec. 31, 2025, topping a career spanning more than 40 years in several executive roles with Airbus.</p>\n\n<p>Wagner, 50, has held the position of CEO at MTU Aero Engines AG since January 2023. Prior to his appointment as CEO and since joining MTU in 2015, he assumed the roles of chief operating officer and executive VP in charge of OEM operations. He previously held a number of management positions at Airbus including in Bremen, Hamburg and Toulouse. Wagner holds a degree in mechanical and aeronautical engineering as well as an MBA.</p>\n\n<div class=\"article_sidebar\">\n<h3>Hexcel announces leadership transition in aerospace, industrial business</h3>\n\n<p>On July 10, <a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel</a>&nbsp;(Stamford, Conn., U.S.) announced the following leadership changes:</p>\n\n<ul>\n\t<li>Thierry Merlot&nbsp;will transition from his current role of president &ndash; aerospace Europe, Asia Pacific, Middle East, Africa and&nbsp;Industrial, to executive VP, strategy effective Sept.&nbsp;29, 2025, as part of succession planning as he prepares for his retirement from Hexcel at a future date.</li>\n\t<li>Lilian Brayle&nbsp;is joining Hexcel and will succeed Thierry as president of the Aerospace, Europe, Asia Pacific, Middle East, Africa and&nbsp;Industrial business, effective Sept. 29, 2025.</li>\n</ul>\n\n<p>Brayle brings more than 30 years of global experience in the aerospace and defense industry. He joins Hexcel from Naval Group, where he served as executive VP&nbsp;of systems, equipment&nbsp;and propulsion. Prior to that, he held senior leadership roles at KNDS Group, Airbus&nbsp;and Safran, where he led large-scale, complex businesses and drove strategic growth initiatives.</p>\n\n<p>Brayle holds a degree in mechanical and process engineering from the University of Sheffield, a degree in mechanical engineering from the National Institute of Applied Sciences&nbsp;and a master&rsquo;s degree in international business from the National Institute of Applied Sciences.</p>\n</div>\n\n<h3>Wisk&nbsp;announces new CEO, leadership role transitions</h3>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-peoplenews-wiskaero-sebastien-brian-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-peoplenews-wiskaero-sebastien-brian-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Sebastien Vigneron (left) and Brian Yutko (right).</p>\n</div>\n\n<p>Back in May 2025,&nbsp;<a href=\"http://wisk.aero/\" target=\"_blank\">Wisk Aero</a>&nbsp;(Mountain View, Calif., U.S.), a wholly owned subsidiary of Boeing, announced the appointment of Sebastien Vigneron as its new CEO. Vigneron, who previously served as Wisk&rsquo;s&nbsp;senior VP&nbsp;of engineering and programs, will succeed Brian Yutko, who is transitioning to a leadership role within&nbsp;Boeing&rsquo;s Commercial Airplanes&nbsp;Division (BCA).</p>\n\n<p>Vigneron brings a wealth of experience and deep understanding of Wisk&rsquo;s technology and strategic direction to his role as CEO. Previously at Wisk, Vigneron drove product development of the company&rsquo;s Generation 6 aircraft, including the Autonomy and Airspace Integration technologies. He also oversaw the Hardware &amp; Software Engineering, Simulation, Systems Test, Flight Test&nbsp;and Program Management teams.</p>\n\n<p>Before joining Wisk in 2021, he was VP&nbsp;of product development engineering and chief engineer at Virgin Hyperloop where he led the development of the Hyperloop system, a new mode of transportation from requirements capture through design, build&nbsp;and test. He also held leadership and technical roles at Bombardier and Dassault Aviation, developing type-certified aircraft from initial concept through flight testing and certification. He has a bachelor&rsquo;s and master&rsquo;s degree in mechanical engineering from &Eacute;cole Polytechnique and a master&rsquo;s degree in aeronautics and astronautics from Stanford University.</p>\n\n<p>His new appointment comes at a significant time for Wisk, as the company prepares to fly its Gen 6 aircraft and progress on its certification path. His background and intimate knowledge of new aircraft development are key to accelerating Wisk&rsquo;s path toward commercialization.</p>\n\n<p>&ldquo;Having been deeply involved in our journey over the last 4&nbsp;years, I&rsquo;m honored to lead Wisk into this next chapter as we bring our Gen 6 aircraft to market,&rdquo; says&nbsp;Vigneron. &ldquo;This is a truly exciting time for the company and AAM as a whole. I look forward to guiding our team through this critical stage and leveraging the enhanced collaboration with Boeing to bring safe, autonomous flight to everyday life.&rdquo;&nbsp;</p>\n\n<p>Yutko will become VP of product development at BCA. In this role, he&nbsp;will provide strategic oversight and support to Wisk. &ldquo;Leading Wisk as CEO and being a part of the progress our team has made on our Gen 6 product has been a true privilege,&rdquo; says Yutko. &ldquo;​​Sebastien is an incredible leader, and I look forward to continuing to work closely with him and the Wisk team as we fly Gen 6, progress our certification program&nbsp;and enter service.&rdquo;</p>\n\n<div class=\"article_sidebar\">\n<h3>Delta Marine remembers co-founder Ivor Jones</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-peoplenews-DeltaMarine-IvorJones1.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-peoplenews-DeltaMarine-IvorJones1.jpg;maxWidth=385\" /></a></div>\n\n<p>Ivor Jones.</p>\n</div>\n\n<p><a href=\"https://www.deltamarine.com/\" target=\"_blank\">Delta Marine Industries Inc.</a>&nbsp;(Seattle, Wash., U.S.) is deeply saddened to announce the passing of co-founder Ivor Jones.</p>\n\n<p>Driven by an early passion for boat racing, Jones&nbsp;was defined by his relentless energy and unwavering commitment. He led by example, always hands-on and working alongside his crew. His drive was contagious, inspiring those around him to push harder and aim higher. Jones carried that ethic into the founding of Delta Marine in 1967 with his brother, Jack. Together, they built a <a href=\"https://www.compositesworld.com/news/delta-marine-shares-110-foot-custom-motor-yacht-with-novel-hull\" target=\"_blank\">prestigious U.S.&nbsp;yachtbuilding company</a>.</p>\n\n<p>From the start, Jones had a bold vision for the yard&rsquo;s future. He invested in the infrastructure, assembled a talented team&nbsp;and created the environment for world-class boatbuilding to take root. In its early years, Delta delivered more than 600 commercial vessels, including the iconic Delta 58, a benchmark in the Alaskan fishing fleet. Today, Delta operates on 25 acres along the Duwamish River in Seattle, Washington, with more than 300,000 square feet of manufacturing space &mdash; a reflection of Jones&rsquo;&nbsp;enduring vision and commitment to the company.</p>\n\n<p>Throughout his life, Jones&nbsp;remained committed to quality, integrity&nbsp;and family. He built more than boats. He built a legacy and a culture that continues to guide the company. Delta remains family-owned and operated, grounded in the values he&nbsp;championed from the beginning.</p>\n\n<p>&ldquo;Ivor led with heart, grit&nbsp;and a deep sense of responsibility to his craft, his team&nbsp;and his family,&rdquo; says&nbsp; Michelle Jones, VP&nbsp;of Delta Marine.&nbsp;&ldquo;The culture he created at Delta is rooted in integrity, care&nbsp;and relentless dedication. We are committed to honoring that legacy in everything we do.&rdquo;</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/people-in-composites-july-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/people-in-composites-july-2025"
  },
  {
    "published": "Wed, 30 Jul 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      30,
      18,
      0,
      0,
      2,
      211,
      0
    ],
    "title": "DLR closes the loop in fiber-reinforced 3D printing with EmpowerAX, SchallFTP projects",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DLR closes the loop in fiber-reinforced 3D printing with EmpowerAX, SchallFTP projects"
    },
    "summary": "Building on its work in EmpowerAX, the DLR and partners now aim to create a&nbsp;standardized, certifiable value chain that turns&nbsp;fiber waste into consistently reinforced thermoplastic filaments for 3D printing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Building on its work in EmpowerAX, the DLR and partners now aim to create a&nbsp;standardized, certifiable value chain that turns&nbsp;fiber waste into consistently reinforced thermoplastic filaments for 3D printing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-dlr-empowerax-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Additive extrusion.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-dlr-empowerax-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | DLR</p>\n</div>\n\n<p>At the EmpowerAX InnovationLab, the <a href=\"https://www.compositesworld.com/suppliers/dlr---german-aerospace-center\" target=\"_blank\">DLR Institute of Lightweight Systems</a> (Braunschweig, Germany) has worked together with partners from research and industry domains to explore how additive extrusion with continuous fiber&nbsp;reinforcement can be industrialized across various application areas &mdash; from&nbsp;aerospace to mobility. The focus has been on the entire process chain, from filament production and printing to the functionally integrated lightweight structure. <em>CW </em>published <a href=\"https://www.compositesworld.com/articles/demonstrating-functionalized-cost-effective-composites-using-additive-extrusion\" target=\"_blank\">an overview of the EmpowerAX open platform</a> in 2023.</p>\n\n<p>Building directly on these findings, DLR is actively pursuing the&nbsp;SchallFTP project, which aims to apply a sonic infusion cell for the impregnation and manufacture of fiber-reinforced&nbsp;thermoplastic semi-finished products &mdash;&nbsp;such as filaments &mdash; in an industrial context. A key area of the project is the advancement of circular economy principles within additive manufacturing. Central to this is the question of how fiber&nbsp;waste can be transformed into new, pseudo continuously reinforced 3D printing filaments&nbsp;in a resource-efficient, cost-effective way with strong application potential.</p>\n\n<p>One thing is clear: carbon fiber-reinforced plastics (CFRP) retain significant material value, even at the end of their service life. Landfilling such materials is not only environmentally questionable but also heavily restricted by EU legislation (1999/31/EC). Against this backdrop, DLR is developing a process within the SchallFTP&nbsp;project that will enable&nbsp;efficient recycling of production waste and reject components into high-quality filaments for fiber-reinforced 3D printing.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-schallftp-rcf-vcf-comparison.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Comparison of strengths of vCF- and rCF-based filaments.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-schallftp-rcf-vcf-comparison.png;maxWidth=720\" /> </a></div>\n\n<p>Comparison of strengths of vCF- and rCF-based filaments.</p>\n</div>\n\n<p>To achieve this,&nbsp;carbon fibers&nbsp;coming from production rejects and waste (rCF) are combined with high-performance thermoplastics (such as PPS) through a specially adapted impregnation process. This in-house method enables a fiber&nbsp;volume content of up to 50%, while maintaining minimal degradation, thus&nbsp;making the recycled fibers viable for industrial use. The resulting filaments offer comparable design freedom to those made with virgin carbon fibers (vCF), while significantly reducing both costs and resource consumption, the DLR reports. This makes them particularly attractive for non-load-bearing applications in aerospace, automotive&nbsp;and other mobility sectors,&nbsp;ranging from cabin components to structural parts in vehicle construction.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Illustration on the subject of rCF.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-schallftp-process.jpg;maxWidth=385\" /></div>\n\n<p>Illustration on the subject of rCF.</p>\n</div>\n\n<p>The DLR&rsquo;s goal is to preserve the material value of rCF as much as possible, closing the loop&nbsp;in lightweight construction in a truly sustainable way. Future research will focus on the reliable processing of different recyclates, particularly regarding fiber&nbsp;quality, contamination&nbsp;and ageing. The objective is to establish robust, industry-ready processes that enable reproducible transformation of recycled fibers into new semi-finished products&nbsp;from filament to functional structure.</p>\n\n<p>Thermoplastic matrix systems also play a key role here. Targeted use of these materials is expected to simplify and accelerate recycling processes. Supported by simulation methods and new quality standards, these efforts aim to boost industry confidence in the use of recycled fibers. In the long term, the DLR seeks to work closely with material producers and application industries to create a standardized, certifiable value chain for rCF-based products.</p>\n\n<p>Insights into the latest developments in high-performance fiber&nbsp;recycling will be presented at the annual <a href=\"https://dlr.expert/eax-science-day-2025/\" target=\"_blank\">EmpowerAX Science Day</a> on Oct. 8,&nbsp;2025 in Stade, Germany. The topic will be showcased as one of many exciting research focal points. Participating researchers look forward to engaging directly with attendees and jointly discussing the next steps toward&nbsp;a sustainable, circular fiber-processing future.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dlr-closes-the-loop-in-fiber-reinforced-3d-printing-with-empowerax-schallftp-projects"
      }
    ],
    "link": "https://www.compositesworld.com/news/dlr-closes-the-loop-in-fiber-reinforced-3d-printing-with-empowerax-schallftp-projects"
  },
  {
    "published": "Wed, 30 Jul 2025 13:06:02 -0400",
    "published_parsed": [
      2025,
      7,
      30,
      17,
      6,
      2,
      2,
      211,
      0
    ],
    "title": "Base Materials announces DNV type approval across entire Subtec portfolio",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Base Materials announces DNV type approval across entire Subtec portfolio"
    },
    "summary": "Syntactic buoyancy material range is now backed by&nbsp;regulatory and safety standard assurances for use in 2,000 to 11,500-meter subsea depths.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Syntactic buoyancy material range is now backed by&nbsp;regulatory and safety standard assurances for use in 2,000 to 11,500-meter subsea depths."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-basematerials-subtec-dnvapproval.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Buoyancy foam testing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-basematerials-subtec-dnvapproval.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Base Materials</p>\n</div>\n\n<p>Syntactic foam subsea buoyancy materials manufacturer <a href=\"https://base-materials.com/\" target=\"_blank\">Base&nbsp;Materials</a> (Leicester, U.K.) has achieved full DNV type approval (TAC) across its entire Subtec portfolio, buoyancy materials composed of&nbsp;high-grade hollow glass microspheres and a thermoset polymer matrix.</p>\n\n<p>The certification follows an extensive and robust testing program&nbsp;carried out by DNV (H&oslash;vik, Norway), following Base Materials&rsquo; <a href=\"https://www.compositesworld.com/news/base-materials-subsea-buoyancy-foams-earn-dnv-type-approval\" target=\"_blank\">November 2024 TAC approval</a> for&nbsp;Subtec&nbsp;11500, designed for operation down to 11,500 meters. With all seven Subtec<sup>&nbsp;</sup>grades now fully type approved, the company aims to set&nbsp;a new benchmark in quality assurance and performance consistency for subsea buoyancy.</p>\n\n<p>&ldquo;Achieving type approval offers our customers full confidence that no matter the depth or criticality of the application, every Subtec&nbsp;material meets the exacting standards of DNV,&rdquo; says Stephen Sloan, head of commercial at Base Materials.&nbsp;&ldquo;This milestone is a testament to the rigor of our testing processes, the expertise of our team&nbsp;and our unwavering commitment to raising the bar in subsea material performance.&rdquo;</p>\n\n<p>DNV is a global classification body that delivers testing, certification&nbsp;and technical advisory services to the maritime industry. DNV certification provides assurances that the products and services accredited meet the regulatory and safety standards required for the end-use application.</p>\n\n<p>Subtec buoyancy materials offer a range of densities &mdash; from 400-650 kilograms/cubic meters&nbsp;&mdash; and grades to&nbsp;suit a range of seawater depths from 2,000-11,500 meters. They provide ultra-high strength-to-weight characteristics with optimal water ingress resistance. Each grade in the range is color coded to ensure depth ratings match within buoyancy assemblies.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/base-materials-announces-dnv-type-approval-across-entire-subtec-portfolio"
      }
    ],
    "link": "https://www.compositesworld.com/news/base-materials-announces-dnv-type-approval-across-entire-subtec-portfolio"
  },
  {
    "published": "Wed, 30 Jul 2025 12:22:49 -0400",
    "published_parsed": [
      2025,
      7,
      30,
      16,
      22,
      49,
      2,
      211,
      0
    ],
    "title": "Kautex Textron wins BEV battery housing contract with automotive OEM",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Kautex Textron wins BEV battery housing contract with automotive OEM"
    },
    "summary": "Order for full BEV lower battery housing unit will incorporate Kautex&rsquo;s thermoplastic&nbsp;composite (TPC)&nbsp;Pentatonic battery enclosure product, which enhances thermal management and reduces vehicle weight.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Order for full BEV lower battery housing unit will incorporate Kautex&rsquo;s thermoplastic&nbsp;composite (TPC)&nbsp;Pentatonic battery enclosure product, which enhances thermal management and reduces vehicle weight."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-kautex-test-vehicles.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Kautex test vehicles.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-kautex-test-vehicles.png;maxWidth=720\" /> </a></div>\n\n<p>Kautex test vehicles. Source | Kautex Textron</p>\n</div>\n\n<p>Automotive Tier 1 supplier&nbsp;<a href=\"https://www.kautex.com/en\" target=\"_blank\">Kautex Textron GmbH &amp; Co. KG</a>&nbsp;(Bonn, Germany), a Textron company, has received an&nbsp;order from a leading automotive OEM for a full battery-electric vehicle (BEV) thermoplastic composite (TPC) lower battery housing unit. The lower housing is part of the company&rsquo;s Pentatonic battery enclosure portfolio, facilitating BEV and hybrid electric vehicle (HEV) production (read &ldquo;<a href=\"https://www.compositesworld.com/articles/moving-toward-sustainable-automotive-parts-manufacturing-\" target=\"_blank\">Moving toward sustainable automotive parts manufacturing</a>&rdquo;).</p>\n\n<p>The Kautex Pentatonic product line offers lightweight, customizable electric vehicle (EV) solutions made from TPC&nbsp;or metal-composite&nbsp;hybrids. These solutions include products that enhance the thermal management of the battery pack and contribute to the overall lightweight design, boosting vehicle performance and extending driving range.&nbsp;&nbsp;</p>\n\n<p>The lower housing seals and protects the vehicle battery while meeting extensive structural and stringent thermal requirements, such as crush and bottom impact testing, and external and internal fire tests. Kautex says it will be produced for a major BEV platform, spanning across multiple vehicle brands.</p>\n\n<p>According to&nbsp;Joerg Rautenstrauch, president and&nbsp;CEO of Kautex, Pentatonic offers&nbsp;advantages over its conventional metal counterparts, with lower cost through a reduction in components due to its high functional integration and thus a leaner bill of material. Use of TPC helps to lower the carbon footprint of the part, while the lightweight housing contributes to reduced&nbsp;carbon emissions while driving. This multi-material approach provides corrosion resistance with no compromise in performance throughout the lifespan of the vehicle. &nbsp;</p>\n\n<p>This order marks Kautex&rsquo;s second Pentatonic business win, following its initial success in January 2023 with a full BEV underbody protection skid plate that entered serial production in 2024. Pentatonic has garnered numerous awards, including <a href=\"https://www.compositesworld.com/news/kautex-wins-spe-grand-innovation-award-for-thermoplastic-composite-battery-enclosure-with-integrated-cooling\" target=\"_blank\">the SPE Grand Innovation Award</a> in Europe, as well as the Lingxuan and Gasgoo Innovation Awards in China. Additionally, Kautex has deployed three on-road test vehicles in the U.S., Japan and Europe, validating the performance of full BEV and hybrid Pentatonic enclosures across various terrains and weather conditions. Collectively, these vehicles have been road-tested for more than&nbsp;100,000 miles.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/kautex-textron-wins-bev-battery-housing-contract-with-automotive-oem"
      }
    ],
    "link": "https://www.compositesworld.com/news/kautex-textron-wins-bev-battery-housing-contract-with-automotive-oem"
  },
  {
    "published": "Wed, 30 Jul 2025 11:49:18 -0400",
    "published_parsed": [
      2025,
      7,
      30,
      15,
      49,
      18,
      2,
      211,
      0
    ],
    "title": "Consumer goods manufacturer orders Hexagon Agility CNG fuel systems",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Consumer goods manufacturer orders Hexagon Agility CNG fuel systems"
    },
    "summary": "Following successful piloting of X15N engine natural gas trucks, this new fleet of 60 day cab and sleeper trucks will benefit from Hexagon&rsquo;s CNG systems with Type 4 tanks.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Following successful piloting of X15N engine natural gas trucks, this new fleet of 60 day cab and sleeper trucks will benefit from Hexagon&rsquo;s CNG systems with Type 4 tanks."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Front of a truck.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-hexagonagility-cumminsx15n-engine.jpg;maxWidth=720\" /> </div>\n\n<p>Source | Hexagon Composites</p>\n</div>\n\n<p>On July 28,&nbsp;<a href=\"http://hexagonagility.com/\" target=\"_blank\">Hexagon Agility</a>&nbsp;(Costa Mesa, Calif., U.S.), a Hexagon Composites (&Aring;lesund, Norway) business, has received an order for natural gas (CNG) fuel systems from a U.S.&nbsp;consumer goods manufacturer for 60 trucks powered by <a href=\"https://www.cummins.com/\" target=\"_blank\">Cummins</a>&rsquo; (Columbus, Ind., U.S.) 15-liter (X15N)&nbsp;engine. The order follows the successful piloting of X15N natural gas trucks over the last 6&nbsp;months.</p>\n\n<p>This new fleet of natural gas&nbsp;day cab and sleeper trucks is expected to travel more than 8 million miles each year. Hexagon Agility says that by transitioning the&nbsp;heavy-duty trucks within their fleet to renewable natural gas, the company will benefit from fuel savings of up to $1.50/diesel gallon equivalent and reduce emissions by more than 90% compared to conventional diesel &mdash;&nbsp;the equivalent of planting more than 13,000 acres of forest each year.</p>\n\n<p>&ldquo;Following a successful pilot stage, we are now supporting this leading manufacturer in scaling their deployment of X15N natural gas-powered trucks,&rdquo; says&nbsp;Ian MacDonald, head of fuel systems for Hexagon Agility. &ldquo;The proven performance, reliability&nbsp;and cost benefits of natural gas trucks make them an ideal solution for distribution fleets, and we&rsquo;re excited to see those benefits now being realized in the long-haul, heavy-duty segment.&rdquo;</p>\n\n<p>Deliveries of the natural gas fuel systems are scheduled to start in Q3 2025.</p>\n\n<p>With power ratings up to 500 horsepower&nbsp;and torque up to 1,850 foot-pounds, the Cummins X15N engine meets the demands of long-haul heavy-duty fleet operators, delivering performance that matches diesel. Coupled with Hexagon Agility&rsquo;s fuel systems, trucks can now achieve a driving range of more than 1,100 miles, meeting fleet range requirements that were previously only provided by diesel-powered vehicles.</p>\n\n<p>Natural gas trucking is supported by a growing network of more than&nbsp;1,600 public and private CNG/RNG fueling stations along key transportation corridors throughout North America.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/consumer-goods-manufacturer-orders-hexagon-agility-cng-fuel-systems"
      }
    ],
    "link": "https://www.compositesworld.com/news/consumer-goods-manufacturer-orders-hexagon-agility-cng-fuel-systems"
  }
]