[
  {
    "published": "Mon, 10 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      10,
      17,
      0,
      0,
      0,
      314,
      0
    ],
    "title": "Envalior plastics, composites expertise earns two SPE Automotive Award",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Envalior plastics, composites expertise earns two SPE Automotive Award"
    },
    "summary": "Envalior was recognized with the Grand Innovation Award and first&nbsp;place in Enabler Technology for a roof cap design and hybrid composite battery cover, respectively.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Envalior was recognized with the Grand Innovation Award and first&nbsp;place in Enabler Technology for a roof cap design and hybrid composite battery cover, respectively."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-envalior-hybrid-ev-cover-speauto.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hybrid composite battery cover.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-envalior-hybrid-ev-cover-speauto.jpg;maxWidth=720\" /> </a></div>\n\n<p>Hybrid composite battery cover developed by Envalior&rsquo;s Tepex team in collaboration with SABIC, Siebenwurst, Ensinger and Forward Engineering. Source (All Images) | Envalior</p>\n</div>\n\n<p><a href=\"https://www.envalior.com/en-us/home\" target=\"_blank\">Envalior</a>&nbsp;(D&uuml;sseldorf, Germany) has received two awards at this year&rsquo;s <a href=\"https://www.compositesworld.com/suppliers/society-of-plastics-engineers-inc-spe-automotive-division\" target=\"_blank\">Society of Plastics Engineers (SPE) Automotive</a> Awards in Bonn, Germany. The company earned the Grand Innovation Award for &ldquo;Most Innovative Use of Plastics&rdquo; and first place in the &ldquo;Enabler Technology&rdquo; category, underscoring its work in sustainable, high-performance lightweighting solutions for the automotive industry.</p>\n\n<p>The Grand Innovation Award recognizes Envalior&rsquo;s contribution to the development of a lightweight roof cap &mdash;&nbsp;once considered an area unsuitable for plastics&nbsp;&mdash; for a premium German automotive convertible, manufactured by R&ouml;chling Automotive (Mannheim, Germany).&nbsp;Developed through close collaboration between Envalior, R&ouml;chling Automotive&nbsp;and the German automotive OEM, the roof cap combines Envalior&rsquo;s materials expertise&nbsp;&mdash; including its Tepex family of fiber-reinforced thermoplastic composites&nbsp;&mdash;with R&ouml;chling&rsquo;s advanced manufacturing and the OEM&rsquo;s demanding design requirements.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-envalior-crossmember-speauto.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-envalior-crossmember-speauto.jpg;maxWidth=385\" /></a></div>\n\n<p>Lightweight, high-performance roof crossmember made with Durethan and Tepex materials, integrated at the front of the convertible&rsquo;s fabric roof for strength and design flexibility.</p>\n</div>\n\n<p>The result is a lightweight, high-performance solution that meets stringent safety and aesthetic standards. The roof cap is also&nbsp;fully recyclable, aligning with upcoming European Union End-of-Life Vehicle Regulation (ELVR), which sets ambitious recyclability and recoverability targets for new vehicles.</p>\n\n<p>Envalior&rsquo;s second award &mdash; first place in &ldquo;Enabler Technology&rdquo; &mdash; recognizes a collaborative project between Envalior, <a href=\"https://www.compositesworld.com/suppliers/sabic-innovative-plastics-na\" target=\"_blank\">SABIC</a>, Siebenwurst, <a href=\"https://www.compositesworld.com/suppliers/ensinger-gmbh\" target=\"_blank\">Ensinger</a>&nbsp;and Forward Engineering. Together, the teams developed a hybrid composite battery cover designed to make electric vehicle (EV) battery housings lighter, safer&nbsp;and more cost-efficient to manufacture.</p>\n\n<p>The design features a sandwich architecture composed of two Tepex&nbsp;Dynalite glass fiber-reinforced polypropylene (PP) laminates and a flame-retardant, fiber-reinforced core. This configuration delivers low weight, improved heat management, enhanced safety&nbsp;and greater cost efficiency, helping extend EV range and performance.</p>\n\n<p>Together, Envalior says these dual awards showcase how advanced thermoplastics and composite technologies can redefine what&rsquo;s possible in automotive design.&nbsp;&ldquo;Winning these awards is not just about a project &mdash; it&rsquo;s about the spirit of innovation and teamwork that drives Envalior forward,&rdquo; says Sascha Bornemann, global Tepex&nbsp;business manager at Envalior.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/envalior-plastics-composites-expertise-earns-two-spe-automotive-award"
      }
    ],
    "link": "https://www.compositesworld.com/news/envalior-plastics-composites-expertise-earns-two-spe-automotive-award"
  },
  {
    "published": "Mon, 10 Nov 2025 11:28:35 -0500",
    "published_parsed": [
      2025,
      11,
      10,
      16,
      28,
      35,
      0,
      314,
      0
    ],
    "title": "Roman Stone partners with Rock Fiber, introduces basalt fibers to U.S. precast concrete market",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Roman Stone partners with Rock Fiber, introduces basalt fibers to U.S. precast concrete market"
    },
    "summary": "MiniBars reinforcement&nbsp;is four times stronger than traditional rebar and weighs 30% less, in addition to delivering&nbsp;strength,&nbsp;ductility and greener benefits.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "MiniBars reinforcement&nbsp;is four times stronger than traditional rebar and weighs 30% less, in addition to delivering&nbsp;strength,&nbsp;ductility and greener benefits."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-romanstone-minibars.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Precast duct banks and MiniBars.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-romanstone-minibars.png;maxWidth=720\" /> </a></div>\n\n<p>Main image shows Roman Stone&rsquo;s precast duct banks manufactured for data centers. In the lower left-hand corner are Rock Fiber&rsquo;s MiniBars product. The precast duct banks are&nbsp;comprised of more than 350,000 individual MiniBars&nbsp;pieces. Source | Rock Fiber Inc.</p>\n</div>\n\n<p>Precast concrete company <a href=\"https://romanstoneco.com/\" target=\"_blank\">Roman Stone</a> (Bay Shore, N.Y., U.S.) is now partnering with&nbsp;<a href=\"http://www.rockfiber.com/\" target=\"_blank\">Rock Fiber&nbsp;Inc.</a> to introduce MiniBars, a reinforcement product made from basalt fiber-reinforced macro-fibers, to the U.S. precast concrete industry.</p>\n\n<p>&ldquo;Bringing MiniBars&nbsp;to our precast portfolio will give&nbsp;the industry a smarter, faster&nbsp;and more durable way to build,&rdquo; says Daniel Murray, president and CEO of Roman Stone. &ldquo;The addition of this novel reinforcement gives us the ability to streamline our manufacturing processes and enables us to offer a more sustainable and durable product for our customers far beyond a traditional precast product.&rdquo;</p>\n\n<p>Through its own extensive engineering and testing, Roman Stone has proved that the performance of the MiniBars&nbsp;enables the company to develop, engineer&nbsp;and launch new products in less&nbsp;time versus traditional product development. Additionally, the product is substantially stronger, more durable&nbsp;and &mdash;&nbsp;most importantly &mdash; greener.</p>\n\n<p>MiniBars&nbsp;are engineered to replace or reduce traditional steel reinforcement. Designed to mix evenly throughout concrete, they provide uniform reinforcement and deliver optimal post-crack strength, impact resistance and fatigue durability, without the drawbacks of other macro-fibers.</p>\n\n<p>Composite MiniBars made with basalt fibers deliver four&nbsp;times the strength of conventional rebar at just 30% the weight of rebar, and flood the concrete matrix, delivering strength and ductility throughout while being immune to corrosion, ensuring longer service life in harsh environments such as marine, wastewater&nbsp;and de-icing salt exposure.&nbsp;Using fibers produced directly from volcanic rock, MiniBars also&nbsp;have a substantially lower carbon footprint than steel without corrosion and support longer lifecycle infrastructure.</p>\n\n<p>MiniBars also&nbsp;eliminate the need for rebar cages, saving labor and fabrication time while enabling thinner, lighter precast units.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/roman-stone-partners-with-rock-fiber-introduces-basalt-fibers-to-us-precast-concrete-market"
      }
    ],
    "link": "https://www.compositesworld.com/news/roman-stone-partners-with-rock-fiber-introduces-basalt-fibers-to-us-precast-concrete-market"
  },
  {
    "published": "Mon, 10 Nov 2025 10:59:41 -0500",
    "published_parsed": [
      2025,
      11,
      10,
      15,
      59,
      41,
      0,
      314,
      0
    ],
    "title": "Airborne, FIDAMC join forces to progress composites manufacturing automation strategies",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airborne, FIDAMC join forces to progress composites manufacturing automation strategies"
    },
    "summary": "The MOU will target challenges in automating the production of small- to medium-sized composite parts, particularly for commercial and defense markets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The MOU will target challenges in automating the production of small- to medium-sized composite parts, particularly for commercial and defense markets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airborne-fidamc.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airborne-fidamc.jpg;maxWidth=720\" /> </a></div>\n\n<p>Juan Carlos Southwood, FIDAMC&rsquo;s Felix Dominguez and Airborne&rsquo;s Marcus Kremers. Source | Airborne</p>\n</div>\n\n<p>On Oct. 29,&nbsp;<a href=\"https://www.compositesworld.com/suppliers/airborne\" target=\"_blank\">Airborne</a> (The Hague, the Netherlands) and the <a href=\"https://fidamc.es/en/\" target=\"_blank\">Foundation for Research, Development, and Application of Composite Materials</a> (FIDAMC, Madrid, Spain), a prominent research institution in composite materials, announced a memorandum of understanding (MOU) to establish a partnership for joint R&amp;D&nbsp;activities. This partnership aims to innovate and enhance manufacturing processes for composite materials, particularly for future aircraft programs in commercial and defense sectors.</p>\n\n<p>The collaboration will address the industry challenge of automating the production of small- to medium-sized composite parts, an area currently lacking suitable automation technologies for high-rate production. Joint efforts will focus on developing and implementing scalable, efficient&nbsp;and cost-effective automation solutions to increase productivity and reduce material waste in composites manufacturing.</p>\n\n<p>Key areas of collaboration include:</p>\n\n<p><strong>Automated ply placement (APP)</strong>. APP is a novel manufacturing method for high-rate production of composite parts, either in prepreg, thermoplastic or dry fiber.&nbsp;It creates tailored blanks or parts by efficiently cutting the material into the required ply shapes, picking and placing them into the laminate at high accuracy.</p>\n\n<p>The collaboration topics involve testing and modeling material properties; developing strategies for managing tackiness;&nbsp;forming laminates into 3D structures;&nbsp;assessing debulking and consolidation needs; and developing demonstrators showcasing APP capabilities.</p>\n\n<p>The partnership will also explore optimized cutting strategies;&nbsp;new gripper technologies;&nbsp;integrate sensor technologies;&nbsp;and explore multi-material laminate concepts and novel laminate strategies.</p>\n\n<p>Additionally, teams will assess innovative materials such as multilayer noncrimp fabrics (NCF), recycled fibers, nonwoven materials, and metallic laminates, and evaluate the role of consumables in process optimization.</p>\n\n<p><strong>Kit by light (KBL)</strong>. KBL is an augmented reality (AR) solution for improving the productivity of ply cutting and kitting processes, and at the same time reduce material waste. It supports the operator during ply offloading and kitting operations, and uses distinctive and patented software to create sequenced kits in one step. It also provides the capability for automated nesting on the shopfloor by the operators directly.</p>\n\n<p>Efforts will focus on demonstrating system functionality;&nbsp;gathering feedback for algorithm refinement;&nbsp;improving ergonomic aspects;&nbsp;and integrating KBL into digital factory ecosystems for enhanced efficiency and traceability.</p>\n\n<p>A joint development roadmap will be established and regularly updated in coordination with aircraft manufacturers and composites production companies to align with industry needs. Both parties will also engage in joint marketing efforts to showcase the developed technologies. FIDAMC will have the ability to use the equipment and technologies with other partners, including production companies, aircraft manufacturers&nbsp;and material companies, for further testing and development of automation solutions.</p>\n\n<p>Under the terms of the MOU, Airborne will provide expertise in automation and digitalization of composites manufacturing processes and share relevant technologies, including APP and KBL. FIDAMC will contribute research capabilities and facilities for material and technology development and testing, facilitate collaboration with universities and research centers, and disseminate research findings. FIDAMC will also lead efforts in training, material and process research, pre-qualification of materials and manufacturing techniques, and developing demonstrators to validate new composite applications, using its capabilities in molding, press equipment, structural testing, nondestructive inspection (NDI)&nbsp;and digital connectivity.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airborne-fidamc-join-forces-to-progress-composites-manufacturing-automation-strategies"
      }
    ],
    "link": "https://www.compositesworld.com/news/airborne-fidamc-join-forces-to-progress-composites-manufacturing-automation-strategies"
  },
  {
    "published": "Mon, 10 Nov 2025 10:30:15 -0500",
    "published_parsed": [
      2025,
      11,
      10,
      15,
      30,
      15,
      0,
      314,
      0
    ],
    "title": "Fairmat raises additional €10 million, ramping up growth in new market verticals",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Fairmat raises additional €10 million, ramping up growth in new market verticals"
    },
    "summary": "Infinity Recycling&nbsp;has made its first investment in France, embodying the rise of European composites circularity and intensifying Fairmat&rsquo;s momentum.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Infinity Recycling&nbsp;has made its first investment in France, embodying the rise of European composites circularity and intensifying Fairmat&rsquo;s momentum."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-fairmat1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"recycled carbon fiber \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-fairmat1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Fairmat</p>\n</div>\n\n<p>Seven months after raising &euro;51.5 million and confirming strong commercial appeal in France and the U.S., <a href=\"https://www.fairmat.tech/\" target=\"_blank\">Fairmat</a>&nbsp;(Paris, France) has raised an additional &euro;10 million in equity from the Circular Plastics Fund, managed by <a href=\"https://infinity-recycling.com/\" target=\"_blank\">Infinity Recycling</a> (Rotterdam, Netherlands), a European investor in the transition to a circular economy. This transaction will not only strengthen Fairmat&rsquo;s international momentum but will also serve to further intensify its pace of development in new market verticals. It marks the fund&rsquo;s first investment in a French company.</p>\n\n<p>Circular Plastics Fund, a &euro;175 million Luxembourg fund managed from Rotterdam, has companies in its portfolio from the U.S., Canada, Switzerland, the U.K., Luxembourg, the Netherlands, France&nbsp;and Germany (nine investments and&nbsp;eight countries).&nbsp;The fund backs companies deploying disruptive technologies to recycle complex materials and reduce global dependence on virgin resources.</p>\n\n<p>&ldquo;Fairmat is addressing one of the biggest environmental challenges &mdash; composites waste&nbsp;&mdash;&nbsp;while creating high value-added recycled products,&rdquo; notes Jeroen Kelder, managing partner at Infinity Recycling. &ldquo;This investment&nbsp;&mdash; our first in France, a country with an ambitious industrial policy &mdash;&nbsp;demonstrates our commitment to fostering the transition toward&nbsp;a more sustainable industry and to support Fairmat&rsquo;s ambitions.&rdquo;</p>\n\n<p>Since its last fundraising round, Fairmat has launched production much earlier than expected, with a ramp-up of between 6,000 and 10,000 square meters&nbsp;of materials produced each month &mdash;&nbsp;the equivalent of three football fields. This acceleration confirms the company&rsquo;s industrial expertise, which deploys a recycling approach that combines AI, robotics&nbsp;and circularity on a large scale, further reducing cost, improving material quality and enhancing competitiveness.&nbsp;</p>\n\n<p>In a very tense global context, France is establishing itself as an attractive ecosystem for international investors (read &ldquo;<a href=\"https://www.compositesworld.com/articles/fairmat-and-the-rise-of-deep-tech-in-france\">Fairmat and the rise of deep tech in France</a>&rdquo;). For Infinity Recycling, investing in Fairmat also means betting on a team of excellence, a global market worth several hundred billion euros, and a rare capacity for execution. The fund intends to attract more French investors to its second, more globally focused fund scheduled for 2026.</p>\n\n<p>What&rsquo;s next? Fairmat continues to expand its industrial and commercial footprint with mass production at its two plants in France and the U.S., and to roll out its Infinity Recycling process to achieve total circularity by 2027. With this global circular supply chain for materials, Fairmat is bringing a new generation of materials to the mobility, sports, construction&nbsp;and energy sectors, among others.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fairmat-raises-additional-10-million-ramping-up-growth-in-new-market-verticals"
      }
    ],
    "link": "https://www.compositesworld.com/news/fairmat-raises-additional-10-million-ramping-up-growth-in-new-market-verticals"
  },
  {
    "published": "Mon, 10 Nov 2025 10:00:37 -0500",
    "published_parsed": [
      2025,
      11,
      10,
      15,
      0,
      37,
      0,
      314,
      0
    ],
    "title": "SAMPE launches 2026 Emerging Engineers Challenge",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SAMPE launches 2026 Emerging Engineers Challenge"
    },
    "summary": "Early-career engineers are invited to submit design concepts by Dec. 8, focused on enhancing a manufacturing process&nbsp;using advanced materials, robotics, data analytics&nbsp;or machine learning.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Early-career engineers are invited to submit design concepts by Dec. 8, focused on enhancing a manufacturing process&nbsp;using advanced materials, robotics, data analytics&nbsp;or machine learning."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"SAMPE emerging engineers challenge flyer\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-sampecontest.png;maxWidth=385\" /></div>\n\n<p>Source | SAMPE</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/sampe\" target=\"_blank\">SAMPE Global</a> (The Society for the Advancement of Material and Process Engineering, Diamong Bar, Calif., U.S.) has announced the launch of its 2026 Emerging Engineers Challenge.</p>\n\n<p>This year&rsquo;s theme,&nbsp;&ldquo;Innovative Frontiers in Advanced Manufacturing,&rdquo;&nbsp;calls for creative teams to demonstrate how they can&nbsp;enhance a component&rsquo;s manufacturing process&nbsp;using advanced materials, robotics, data analytics&nbsp;or machine learning.<br />\n<br />\nThe top three teams will earn the opportunity to&nbsp;present live&nbsp;on the SAMPE Stage at&nbsp;<a href=\"https://www.jec-world.events/\" target=\"_blank\">JEC World</a> in Paris&nbsp;on March 11, 2026,&nbsp;competing for international recognition and a cash prize.</p>\n\n<h3>Who can apply</h3>\n\n<ul>\n\t<li>Early-career engineers within 10 years of earning an undergraduate degree</li>\n\t<li>Teams of 2-4 members from academia, postdoc programs, or industry</li>\n\t<li>One entry per team (institutions may submit multiple teams)</li>\n</ul>\n\n<h3>How the competition works</h3>\n\n<ul>\n\t<li>Round 1: Submit a 2-minute video introducing the&nbsp;design concept by Dec. 8, 2025.</li>\n\t<li>Round 2: The top 3 teams will advance to the live final at JEC World for a 7-minute presentation and Q&amp;A.</li>\n</ul>\n\n<h3>Finalist support</h3>\n\n<ul>\n\t<li>Up to&nbsp;&euro;1,500 travel stipend per team</li>\n\t<li>A dedicated SAMPE industry mentor</li>\n\t<li>Free 1-year SAMPE membership for all finalists</li>\n</ul>\n\n<p>Find more information and submit an application at&nbsp;<a href=\"https://sampe.org/eec/\">sampe.org/eec</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/sampe-launches-2026-emerging-engineers-challenge"
      }
    ],
    "link": "https://www.compositesworld.com/news/sampe-launches-2026-emerging-engineers-challenge"
  },
  {
    "published": "Fri, 7 Nov 2025 12:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      7,
      17,
      30,
      0,
      4,
      311,
      0
    ],
    "title": "Syensqo, Bell join forces to industrialize composite part manufacture",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Syensqo, Bell join forces to industrialize composite part manufacture"
    },
    "summary": "Bell Textron leverages Syensqo&rsquo;s&nbsp;DDF technology and Cycom&nbsp;EP2750 fast-cure prepreg to deliver&nbsp;operational and sustainable benefits.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Bell Textron leverages Syensqo&rsquo;s&nbsp;DDF technology and Cycom&nbsp;EP2750 fast-cure prepreg to deliver&nbsp;operational and sustainable benefits."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-syensqo-endtoend-ddf-line.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Syensqo’s end-to-end double diaphragm forming (DDF) system.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-syensqo-endtoend-ddf-line.jpg;maxWidth=720\" /> </a></div>\n\n<p>Syensqo&rsquo;s end-to-end double diaphragm forming (DDF) system. Source | Syensqo</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/solvay-composite-materials\" target=\"_blank\">Syensqo</a> (Alpharetta, Ga., U.S.) and aerospace and defense company <a href=\"https://www.textron.com/About/Our-Businesses/Bell\" target=\"_blank\">Bell Textron&nbsp;Inc.</a> (Fort Worth, Texas, U.S.), an aerospace and defense company, have joined forces to accelerate the industrialization of composites.</p>\n\n<p>Bell is an&nbsp;early adopter of Syensqo&rsquo;s patented double diaphragm forming (DDF)&nbsp;manufacturing process, which when&nbsp;coupled with its fast-cure aerospace prepreg Cycom&nbsp;EP 2750, has proven efficient and automatable processing for high-rate, high-volume composites manufacturing.</p>\n\n<p>Bell qualified and industrialized this technology quickly, achieving high-rate production of aerospace composite parts. Implementing the process has brought major benefits such as decreased operational costs while generating positive environmental aspects such as reduced waste, energy consumption and greenhouse gas emissions. In addition, DDF has enabled the relief of autoclaves&nbsp;use for curing Bell&rsquo;s small- to medium-size parts, enabling the autoclaves&rsquo; use for larger parts instead.</p>\n\n<p>&ldquo;After more than 30 years our Syensqo-Bell relationship continues to bring innovative solutions to benefit the composite industry,&rdquo; says&nbsp;Marc Doyle, business executive vice president of Syensqo Composite Materials. &ldquo;Syensqo&rsquo;s customer support model is based on the belief that design, material and manufacturing are all interrelated and key to a successful increase in composites adoption. Our teams are structured to support this model and customer collaborations are fundamental in working toward&nbsp;a more industrialized composites industry.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/syensqo-bell-join-forces-to-industrialize-composite-part-manufacture"
      }
    ],
    "link": "https://www.compositesworld.com/news/syensqo-bell-join-forces-to-industrialize-composite-part-manufacture"
  },
  {
    "published": "Fri, 7 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      7,
      17,
      0,
      0,
      4,
      311,
      0
    ],
    "title": "Pantur integrates Reinforce3D CFIP to produce pilot, functional reinforced 3D printed parts",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Pantur integrates Reinforce3D CFIP to produce pilot, functional reinforced 3D printed parts"
    },
    "summary": "Through the Delta system installation, Pantur will&nbsp;integrate continuous fiber injection reinforcement into its additive manufacturing ecosystem, serving to increase the momentum of bringing CFIP to real industrial production.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Through the Delta system installation, Pantur will&nbsp;integrate continuous fiber injection reinforcement into its additive manufacturing ecosystem, serving to increase the momentum of bringing CFIP to real industrial production."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-reinforce3d-delta-system-min.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\" Delta system concept.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-reinforce3d-delta-system-min.png;maxWidth=720\" /> </a></div>\n\n<p>The Delta system. Source | Reinforce3D</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/reinforce-3d\" target=\"_blank\">Reinforce3D</a> (Amposta, Spain), a technology company pioneering its continuous fiber injection process (CFIP)&nbsp;for internal structural reinforcement, has announced the installation of a Delta&nbsp;system at <a href=\"https://pantur.es/en/\" target=\"_blank\">Pantur&nbsp;S.L.</a> (Barcelona), a Spanish service bureau specializing in additive manufacturing (AM) and industrial production. Through Pantur,&nbsp;Reinforce3D expands the reach of its technology across European manufacturing hubs.</p>\n\n<p>The integration combines the CFIP process &mdash; capable of injecting continuous fiber through predefined internal cavities&nbsp;&mdash;&nbsp;with Pantur&rsquo;s expertise in AM, design optimization&nbsp;and end-use part production. Through this implementation, Pantur will expand its production capabilities, exploring new opportunities to enhance mechanical performance, durability&nbsp;and weight reduction for high-demand sectors such as automotive, aerospace, electronics&nbsp;and medical devices. Furthermore,&nbsp;both teams will validate reinforced geometries, study material compatibility and optimize parameters for short- and long-run manufacturing environments.</p>\n\n<p>&ldquo;We are transforming reinforcement from a manual step into an integrated, automated process,&rdquo; explains&nbsp;Blanca Garro, CEO of Reinforce3D. &ldquo;This installation at Pantur reflects our continued momentum in bringing CFIP to real industrial production, making high-performance reinforcement accessible to manufacturers across Europe.&rdquo;</p>\n\n<p>Building on Reinforce3D&rsquo;s CFIP technology, Pantur will leverage the system to produce pilot components and functional parts that demonstrate the full mechanical and structural benefits of continuous fiber reinforcement. &ldquo;Integrating&nbsp;CFIP into our workflow allows us to move beyond conventional 3D printing, offering structural-grade components with enhanced stiffness and durability,&rdquo; says&nbsp;Carles Mart&iacute;nez, Pantur CEO.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/pantur-integrates-reinforce3d-cfip-to-produce-pilot-functional-reinforced-3d-printed-parts"
      }
    ],
    "link": "https://www.compositesworld.com/news/pantur-integrates-reinforce3d-cfip-to-produce-pilot-functional-reinforced-3d-printed-parts"
  },
  {
    "published": "Fri, 7 Nov 2025 11:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      7,
      16,
      0,
      0,
      4,
      311,
      0
    ],
    "title": "AVIC Cabin Systems UK is open for business",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AVIC Cabin Systems UK is open for business"
    },
    "summary": "Order book is now open, offering a full range of interior aircraft cabin products&nbsp;from social spaces to front row monuments, further enhanced by AVIC&rsquo;s composites competence.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Order book is now open, offering a full range of interior aircraft cabin products&nbsp;from social spaces to front row monuments, further enhanced by AVIC&rsquo;s composites competence."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-avik-uk-interiors.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-avik-uk-interiors.jpg;maxWidth=720\" /> </a></div>\n\n<p>The Emirates Lounge, which continues to be part of ACS UK&rsquo;s product portfolio. Source | Emirates for ACS UK</p>\n</div>\n\n<p>On Nov. 3,&nbsp;<a href=\"http://www.aviccabinsystems.com/\" target=\"_blank\">AVIC Cabin Systems Ltd.</a>&nbsp;(ACS,&nbsp;London, U.K.) announced that its order&nbsp;book is open and that it is offering its full range of products, from social spaces and galleys to front row monuments, feature panels and stowages (read &ldquo;<a href=\"https://www.compositesworld.com/news/avic-cabin-systems-announces-global-sales-organization\" target=\"_blank\">AVIC... announces global sales organization</a>&rdquo;).</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-avik-interiors-composites.jpg;maxWidth=720\" /> </div>\n\n<p>Source | ACS UK</p>\n</div>\n\n<p>ACS UK is a full-service manufacturing company, excelling in the manufacture of complex composite exterior and interior components, moldings, sandwich, flat panels and laminates, for a multitude of industries such as aerospace, rail, marine and automotive, and their varied and specific applications.</p>\n</div>\n</div>\n\n<p>With a full order book in June 2022, ACS UK took a strategic decision at that time to reduce its offerings to new business in order to focus upon the delivery of the programs acquired from AIM Altitude Ltd. With these products successfully delivered and customer confidence fully maintained, ACS UK is now open and ready for new business.</p>\n\n<p>&ldquo;We have been quietly but busily working in the background to safeguard future product offerings, and several key programs are already underway,&rdquo; says&nbsp;Nigel McSorely, CEO of ACS UK. &ldquo;Our ethos and focus on customer satisfaction and the delivery of high-quality equipment using highly skilled people continues. We have seen exceptional on-time delivery performance of products to Airbus and Boeing over the past few years. We are very proud of this achievement.&rdquo;</p>\n\n<p>ACS UK has been working on large orders of front row monuments, galleys and social zones for pre-existing customers. Now that many of these have been delivered, ACS UK is able to offer vital and additional capacity to the market.</p>\n\n<p>&ldquo;The advantage ACS UK has is that we are new but not new,&rdquo; McSorely says. &ldquo;We have the facilities and capacity of a new company, with the experience and expertise of an industry stalwart. ACS UK has a great depth of knowledge and skill but also the ability to grow and take on significant new contracts.&rdquo;</p>\n\n<p>ACS UK has been achieving this success from its new engineering facility in Bournemouth, U.K., and through its design base in New Zealand, and manufacturing bases in Cambridge, U.K. and China.</p>\n\n<p>Front row monuments, feature panels and bespoke social areas are particular specialties of ACS UK. The company is well known for its innovative design, meticulous engineering and specialist manufacturing processes, bringing vital differentiation to its airline customers.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/avic-cabin-systems-uk-is-open-for-business"
      }
    ],
    "link": "https://www.compositesworld.com/news/avic-cabin-systems-uk-is-open-for-business"
  },
  {
    "published": "Fri, 7 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      7,
      15,
      0,
      0,
      4,
      311,
      0
    ],
    "title": "Thermolysis wins Germany’s Materialica Award 2025 for rCF cement technology",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Thermolysis wins Germany’s Materialica Award 2025 for rCF cement technology"
    },
    "summary": "Taiwan&rsquo;s Thermolysis Co. Ltd. has been recognized for its ability to turn rCF into a high-performance building material that enhance durability, extend lifespan and reduce maintenance needs.\n\n&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Taiwan&rsquo;s Thermolysis Co. Ltd. has been recognized for its ability to turn rCF into a high-performance building material that enhance durability, extend lifespan and reduce maintenance needs.\n\n&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-thermolysis-materialica-award.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-thermolysis-materialica-award.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Thermolysis Co. Ltd.</p>\n</div>\n\n<p><a href=\"https://www.thermolysis-asia.com/en/recycled-carbon-fiber\" target=\"_blank\">Thermolysis Co. Ltd.</a>&nbsp;(Taichung City, Taiwan) has received the Materialica Design + Technology Award 2025&nbsp;in Germany for its recycled carbon fiber (rCF) cement reinforcement technology. This recognition marks Thermolysis as one of the few Asian companies honored for outstanding innovation in sustainable material applications, showcasing Taiwan&rsquo;s innovation in next-generation green construction materials on the global stage.</p>\n\n<p>The Materialica&nbsp;Design + Technology Award is&nbsp;an international competition that recognizes innovation at the intersection of materials, technology&nbsp;and design.&nbsp;It is awarded to projects in categories like Material, Process, Product and CO<sub>2</sub> Efficiency, with evaluation criteria including innovation, sustainability&nbsp;and engineering.&nbsp;The awards are presented at the eMove360&deg; event in Munich and showcase innovative contributions from various sectors.</p>\n\n<p>Thermolysis&nbsp;uses its patented microwave-assisted pyrolysis (MAP) process to recycle carbon fiber-reinforced polymer (CFRP) waste, turning discarded composite materials into clean, high-quality rCF (read &ldquo;...<a href=\"https://www.compositesworld.com/products/thermolysis-features-excfiber-for-concrete-reinforcement\">ExCfiber for concrete reinforcement</a>&rdquo;). After surface modification and advanced dispersion treatment, the fibers achieve optimal uniformity in cement, effectively preventing agglomeration. Moreover, this technology realizes a complete circular economy pathway &mdash; from waste to regeneration to performance enhancement.</p>\n\n<p>According to Thermolysis&rsquo;s internal testing, its rCF concrete&nbsp;shows a range of improvements over conventional cement including a 58.9% increase in compressive strength,&nbsp;55.8% increase in flexural strength, 45.7% increase in split tensile strength, 30.6 times&nbsp;higher impact resistance at 50 joules&nbsp;and 12.9 times&nbsp;at 75 joules. These performance gains, Thermolysis reports, enable buildings and infrastructure made with rCF concrete to achieve longer service life, fewer cracks and leaks&nbsp;and reduced maintenance frequency, resulting in substantial savings in total ownership cost over time.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/thermolysis-wins-germanys-materialica-award-2025-for-rcf-cement-technology"
      }
    ],
    "link": "https://www.compositesworld.com/news/thermolysis-wins-germanys-materialica-award-2025-for-rcf-cement-technology"
  },
  {
    "published": "Fri, 7 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      7,
      15,
      0,
      0,
      4,
      311,
      0
    ],
    "title": "Toray rCF nonwoven fabrics demonstrate CFRP recycling tech",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Toray rCF nonwoven fabrics demonstrate CFRP recycling tech"
    },
    "summary": "Toray Industries process decomposes thermoset CFRP at low temperatures, yielding rCF that retain over 95% of virgin fiber strength, cuts CO₂ emissions by more than half, suppresses&nbsp;thermal damage and better controls&nbsp;resin residue.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Toray Industries process decomposes thermoset CFRP at low temperatures, yielding rCF that retain over 95% of virgin fiber strength, cuts CO₂ emissions by more than half, suppresses&nbsp;thermal damage and better controls&nbsp;resin residue."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-toray-rcf-nonwoven.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"RCF nonwoven.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-toray-rcf-nonwoven.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Toray Industries Inc.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/toray-industries\" target=\"_blank\">Toray Industries&nbsp;Inc.</a> (Tokyo, Japan) has announced the development of&nbsp;a recycling technology that can decompose diverse carbon fiber-reinforced<br />\nplastics (CFRP) made from thermoset&nbsp;resins while retaining the strength and surface quality of those fibers. The company drew on this technology to create a recycled carbon fiber (rCF) nonwoven fabric.</p>\n\n<p>Toray has begun providing prototype samples to customers,&nbsp;with the goal of using the rCF nonwoven fabric materials for diverse performance- and decorative-driven applications, such as automobiles, construction, electrical and electronics, and daily necessities. The company will push ahead with technical assessments matching customer needs.</p>\n\n<p>Chemical recycling as a reducing agent in steel furnaces, is gaining traction for recycling CFRP. Technologies are also emerging that pyrolize CFRP waste at&nbsp;high temperatures to recover and reuse fibers, particularly for injection molding applications (read &ldquo;<a href=\"https://www.compositesworld.com/articles/trends-fueling-the-composites-recycling-movement\">Trends fueling the composites recycling movement</a>&rdquo;).&nbsp;To broaden the latter&rsquo;s reuse, Toray says there is a need for technology that can suppress the thermal damage to rCF (occurs when exposing carbon fibers to high temperatures or oxidization during pyrolysis) and to control resin residue left on the surface of rCF&nbsp;during separation.</p>\n\n<p>Toray applied its accumulated expertise in organic synthesis and polymer polymerization to innovate a decomposition agent that breaks down degradation-resistant, 3D-cross-linked thermoset resins at lower temperatures than conventional methods. The company used this agent to decompose CFRP waste from aircraft, wind turbines, automobiles&nbsp;and other sources. The rCF achieved&nbsp;from this process retains more than&nbsp;95% of the single-fiber tensile strength of petroleum-derived virgin carbon fiber. Toray expects the technology&rsquo;s CO<sub>2</sub>&nbsp;emissions to be less than half of those from manufacturing virgin carbon fiber.</p>\n\n<p>Additionally, Toray reports that rCF from this&nbsp;technology is stronger than conventional counterparts and minimizes fiber breakage in postprocessing. Its low resin residue and high surface quality enables processing for more diverse applications. In particular, efforts to disperse short fibers and process them into sheet form nonwoven fabrics have been&nbsp;successful. RCFs exhibit controllable water dispersibility, enabling the fabrication of uniform nonwoven structures as well as those with distinctive texture reminiscent of washi (traditional Japanese paper). This fabric combines the functionality of carbon fiber, including radio frequency shielding and thermal conductivity, with the aesthetic appeal of washi. Toray aims to expand applications for this new material across many industries.</p>\n\n<p>The rCF nonwoven was featured in&nbsp;interior and exterior components of Mazda Motor Corp.&rsquo;s concept car shown at&nbsp;Japan Mobility Show in Tokyo.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/toray-rcf-nonwoven-fabrics-demonstrate-cfrp-recycling-tech"
      }
    ],
    "link": "https://www.compositesworld.com/news/toray-rcf-nonwoven-fabrics-demonstrate-cfrp-recycling-tech"
  }
]