[
  {
    "published": "Fri, 11 Jul 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      18,
      0,
      0,
      4,
      192,
      0
    ],
    "title": "Florida International University leverages VABs software to optimize composite aerospace structures",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Florida International University leverages VABs software to optimize composite aerospace structures"
    },
    "summary": "AnalySwift high-fidelity modeling software enabled the university to identify optimal&nbsp;configurations for structures including wings and antennas, maximizing&nbsp;longevity, enhancing&nbsp;safety&nbsp;and expanding function.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "AnalySwift high-fidelity modeling software enabled the university to identify optimal&nbsp;configurations for structures including wings and antennas, maximizing&nbsp;longevity, enhancing&nbsp;safety&nbsp;and expanding function."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-floridainternational-vabs1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Various aerostructure cross-sections designed using VABs.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-floridainternational-vabs1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Various cross-sections designed, along with the corresponding stress distribution within each section. Source | Flordia International University</p>\n</div>\n\n<p><a href=\"https://www.fiu.edu/\" target=\"_blank\">Florida International University</a>&nbsp;(Miami, U.S.) is participating in <a href=\"https://www.compositesworld.com/suppliers/analyswift\" target=\"_blank\">AnalySwift LLC</a>&rsquo;s (West Lafayette, Ind., U.S.) Academic Partner Program (APP)&nbsp;and is using VABS&nbsp;&mdash; AnalySwift&rsquo;s high-fidelity modeling software for composites&nbsp;&mdash; for&nbsp;researching aerospace structures such as wings and antennas.&nbsp;The work is part of the university&rsquo;s Fluid-Structure Interaction (FSI) Laboratory within the Department of Mechanical and Materials Engineering, which seeks to improve aerospace structure design and facilitate stress flow based on the principles of Constructal Law.</p>\n\n<p>APP offers participating universities no-cost licenses of engineering software<br />\nprograms VABS and SwiftComp so students, researchers&nbsp;and faculty can leverage the tools in their academic research.</p>\n\n<p>The VABS program is a general-purpose, cross-sectional analysis tool for predicting structural beam properties and recovering 3D stresses, strains&nbsp;and strengths of slender composite structures. AnalySwift says it is a powerful tool for modeling composite rotorcraft (helicopter, air mobility, unmanned aerial vehicles) and wind turbine rotor blades, as well as other slender composite structures, such as propellers, landing gear&nbsp;and high-aspect ratio wings.</p>\n\n<p>&ldquo;We are pleased that Florida International University has found VABS helpful in&nbsp;their design and analysis workflow as they improve longevity and functional capabilities of aerospace structures,&rdquo; says&nbsp;Allan Wood, president and CEO of&nbsp;AnalySwift. &ldquo;As a versatile, cross-sectional analysis tool, VABS delivers high-fidelity results early on to help computationally resolve engineering challenges, reduce trial and errors&nbsp;and arrive at the best solution more quickly.&rdquo;</p>\n\n<p>Hadi Ebrahimi Fakhari, a Ph.D. candidate in mechanical engineering at the university explains their research project, which&nbsp;focuses on developing a constructal&nbsp;design approach to identify configurations for aerospace structures that maximize longevity, enhance safety&nbsp;and expand functional capabilities. &ldquo;I support this work through a combination of finite element analysis [FEA], theoretical analysis&nbsp;and experimental validation,&rdquo;&nbsp;Ebrahimi Fakhari&nbsp;explains. &ldquo;In the FSI&nbsp;Laboratory, we analyze the forces and boundary conditions generated by airflow and use them as inputs to study structural responses. Our goal is to improve designs by facilitating smooth stress distribution and preventing stress concentrations, with a primary focus<br />\nis on aerospace structures, particularly wings and antennas.&rdquo;</p>\n\n<p>Professor Pezhman Mardanpour, director of the FSI laboratory, describes how his team&nbsp;incorporated VABS into their workflow. &ldquo;They first designed the cross-section and used VABS to obtain the stiffness matrix. Then, they used another tool to determine the trimmed shape and flutter speed. Finally, they performed stress recovery using VABS once again.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/florida-international-university-leverages-vabs-software-to-optimize-composite-aerospace-structures"
      }
    ],
    "link": "https://www.compositesworld.com/news/florida-international-university-leverages-vabs-software-to-optimize-composite-aerospace-structures"
  },
  {
    "published": "Fri, 11 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      17,
      0,
      0,
      4,
      192,
      0
    ],
    "title": "Gurit introduces open-source offshore wind turbine blade model",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Gurit introduces open-source offshore wind turbine blade model"
    },
    "summary": "Gurit98m integrates into existing design and simulation frameworks, offering engineers, researchers and blade manufacturers a tool to explore performance, efficiency&nbsp;and sustainability improvements.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Gurit98m integrates into existing design and simulation frameworks, offering engineers, researchers and blade manufacturers a tool to explore performance, efficiency&nbsp;and sustainability improvements."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-gurit98m-blade-model.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Gurit98m model.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-gurit98m-blade-model.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Gurit</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gurit-uk\" target=\"_blank\">Gurit</a>&nbsp;(Zurich, Switzerland) has launched the&nbsp;Gurit98m, an open-source offshore wind turbine blade model developed in collaboration with <a href=\"https://www.en.aau.dk/\" target=\"_blank\">Aalborg University</a> (Denmark), involved in composite structure and wind blade engineering.</p>\n\n<p>The Gurit98m blade model is designed to represent the current generation of large offshore wind turbine blades, enabling the acceleration of R&amp;D and the integration of new and sustainable technologies. Available in both Ansys&nbsp;and Abaqus formats, Gurit reports that the model integrates seamlessly into existing design and simulation frameworks, offering engineers, researchers and blade manufacturers a tool to explore performance, efficiency&nbsp;and sustainability improvements.</p>\n\n<p>This open-access initiative supports Gurit&rsquo;s&nbsp;commitment to collaborative innovation and the adoption of circular materials, most notably, the transition from balsa wood to recyclable PET core materials.&nbsp;</p>\n\n<p>By making the model publicly accessible, Gurit hopes to encourage industry-wide collaboration that can&nbsp;test, validate&nbsp;and innovate more efficiently, driving faster adoption of sustainable solutions and reducing development barriers. A technical paper on the Gurit98m and its&nbsp;application demonstration&nbsp;in structural optimization research <a href=\"https://link.springer.com/article/10.1007/s00158-025-04025-8\" target=\"_blank\">can be accessed here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gurit-introduces-open-source-offshore-wind-turbine-blade-model"
      }
    ],
    "link": "https://www.compositesworld.com/news/gurit-introduces-open-source-offshore-wind-turbine-blade-model"
  },
  {
    "published": "Fri, 11 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      16,
      0,
      0,
      4,
      192,
      0
    ],
    "title": "AZL launches three Joint Partner Projects, welcomes composites leaders participation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AZL launches three Joint Partner Projects, welcomes composites leaders participation"
    },
    "summary": "New initiatives kicking off mid-July 2025 explore fire testing safety for EV battery cases, holistic TPC pressure vessel strategies and exploring and quantifying composites in space and defense.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New initiatives kicking off mid-July 2025 explore fire testing safety for EV battery cases, holistic TPC pressure vessel strategies and exploring and quantifying composites in space and defense."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\"><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-azl-jpp1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </a></div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-azl-jpp-visuals1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Key project visuals.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-azl-jpp-visuals1.png;maxWidth=720\" /> </a></div>\n\n<p>Source | AZL Aachen GmbH</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/azl-aachen-gmbh\" target=\"_blank\">AZL Aachen GmbH</a> (Aachen, Germany) is launching three Joint Partner Projects (JPP) this July spanning automotive, space and defense sectors, and invites interested parties to join.&nbsp;</p>\n\n<h3>High-value composite applications in space and defense</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-AZL-JPP-visuals2.jpg\" target=\"_blank\"><img alt=\"Space satellite\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-AZL-JPP-visuals2.jpg;maxWidth=385\" /></a></div>\n\n<p>Space satellite. Source | SpaceX on Unsplash</p>\n</div>\n\n<p>The cross-industry collaborative project &ldquo;High Value Composite Applications &ndash; A Joint Market and Technology Study on Opportunities for Fiber-Reinforced Plastics in Space &amp; Defense Applications&rdquo; brings together international companies to explore and quantify the potential of fiber-reinforced plastics (FRPs) in space and defense, two dynamics markets with a rapidly growing demand for high-performance,&nbsp;lightweight, and modular components is accelerating rapidly in both sectors. This JPP&nbsp;aims to provide participants with a consolidated market and technology roadmap, combining deep technical insights with actionable strategic data.</p>\n\n<p>The project will be executed as a pre-competitive, cost-shared initiative moderated and conducted by AZL. This format enables&nbsp;companies from across the value chain to jointly define focus topics, benefit from AZL&rsquo;s expertise in market and technology analysis&nbsp;and contribute their own perspectives throughout the process.&nbsp;</p>\n\n<p>The project will begin with a Kick-off Meeting on July 15, 2025. All participating companies will have the opportunity to introduce their organizations, share their expectations&nbsp;and help define the specific scope of the study. Companies interested in participating are invited to request the detailed project description and schedule an individual consultation with AZL&rsquo;s industrial services team.</p>\n\n<h3>Fire safety testing for EV battery casings</h3>\n\n<p>In response to the growing importance of thermal management and fire protection in electromobility, the &ldquo;Thermal Runaway Testing for Battery Casings &ndash; Benchmarking Systems for High-Gradient Heating and Hot Particle Blasting&rdquo; initiative focuses on developing and implementing a realistic and reproducible fire testing environment for structural and functional materials used in electric vehicle (EV)&nbsp;battery housing systems.</p>\n\n<p>The project centers around the development and implementation of a new test bench that combines high-gradient flame exposure and controlled hot particle impact,&nbsp;mimicking the complex conditions of thermal runaway events in modern cell technologies such as LFP and NMC. This setup enables systematic benchmarking of materials under stress conditions that reflect actual applications in automotive, but also in other segments like aerospace, where efficient development of safe battery storage systems is essential. Participating companies will not only have access to the final benchmarking results but can also contribute material configurations for testing as part of the project.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-azl-jpp-visuals4.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"EV thermal runaway testing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-azl-jpp-visuals4.png;maxWidth=720\" /> </a></div>\n\n<p>Real cell testing. Source | AZL Aachen GmbH</p>\n</div>\n\n<p>Through tailored test profiles, thermal resistance and mechanical integrity of different materials will be compared based on application-specific scenarios. Detailed test documentation, including videos and thermal data, will be provided. The resulting matrix supports materials development, qualification&nbsp;and supplier evaluation, offering both strategic and technical value.</p>\n\n<p>Within a predecessor collaboration involving a consortium of 24 industry players (including automotive OEMs like Audi, BMW, Tier suppliers&nbsp;and material producers), AZL&rsquo;s team of experts developed an application relevant instrumented test method that enables testing of materials at different flame temperatures and simultaneously measuring the material strength under fire load.</p>\n\n<p>In the project, more than 50 different materials (metals, plastics, fiber-reinforced, coated, compact, sandwich) were tested and benchmarked regarding their specific performance (survival at tensile load and 800&deg;C, 100&deg;C and 1200&deg;C flame exposure; failure; areal weight; cost per area). This new project&nbsp;builds on these results, know-how and test infrastructure implemented. It enables participants to pool resources, validate their own solutions&nbsp;and gain insight into leading alternatives in the market.&nbsp;</p>\n\n<p>The project will officially kick off on July 15, 2025. At the initial meeting, partners will align on expectations, present their priorities&nbsp;and help refine the testing focus.&nbsp;Companies interested in joining are encouraged to request detailed project information or arrange an individual consultation meeting.</p>\n\n<h3>Thermoplastic pressure vessel production</h3>\n\n<p>&ldquo;Thermoplastic Pressure Vessel Production &ndash; Benchmarking of Design-for-Manufacturing Strategies to Optimize Material Efficiency and Cost&rdquo; will rethink vessel design and production holistically &mdash;&nbsp;aligning thermoplastic material properties with optimized design&nbsp;and manufacturing strategies to unlock their full economic and technological potential.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-azl-jpp-visuals3.png\" target=\"_blank\"><img alt=\"Winding of a thermoplastic pressure tank. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-azl-jpp-visuals3.png;maxWidth=385\" /></a></div>\n\n<p>Winding of a thermoplastic pressure tank. Source | Conbility GmbH</p>\n</div>\n\n<p>This&nbsp;initiative brings together companies with shared interests to co-finance and co-shape the project. Under AZL&rsquo;s coordination, participants will analyze current technologies, develop new design concepts for hydrogen and compressed natural gas&nbsp;vessels&nbsp;and benchmark the resulting configurations in terms of weight, cost, recyclability and production KPIs. AZL&rsquo;s engineering team will provide access to simulation results, concept layouts&nbsp;and comparative evaluations based on a unified framework. Each partner can contribute input, benefit from consolidated expertise&nbsp;and gain early access to the results.&nbsp;</p>\n\n<p>The project will start on July 16, 2025. All participants are invited to engage in an interactive Kick-off Meeting to define key priorities and present their internal perspectives. Further project information or individual consultation slots are now available.</p>\n\n<hr />\n<p style=\"text-align: center;\"><em>Interested parties should reach out to Philipp Fr&ouml;hlig, head of industrial services (email: <a href=\"https://philipp.froehlig@azl-aachen-gmbh.de\" target=\"_blank\">philipp.froehlig@azl-aachen-gmbh.de</a>; phone:&nbsp;+49 241 475 735 14)</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/azl-launches-three-joint-partner-projects-welcomes-composites-leaders-participation"
      }
    ],
    "link": "https://www.compositesworld.com/news/azl-launches-three-joint-partner-projects-welcomes-composites-leaders-participation"
  },
  {
    "published": "Fri, 11 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      16,
      0,
      0,
      4,
      192,
      0
    ],
    "title": "NREL publishes carbon fiber composite deconstruction method",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "NREL publishes carbon fiber composite deconstruction method"
    },
    "summary": "Research shows that hot acetic acid cleaves all key bonds within epoxy-amine resins and stabilizes polymer chemical components, making it an&nbsp;effective EOL recycling process for carbon fiber and beyond.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Research shows that hot acetic acid cleaves all key bonds within epoxy-amine resins and stabilizes polymer chemical components, making it an&nbsp;effective EOL recycling process for carbon fiber and beyond."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-nrel-bottle-consortium.jpg;maxWidth=720\" /> </div>\n\n<p>Ajinkya Pal (left), Sydney Reiber, Stephen Dempsey and Ciaran Lahive are part of a team of researchers from the BOTTLE consortium at NREL that is developing a robust method to break down composite carbon fibers, keeping the waste out of landfills. Source |<em>&nbsp;</em>Joe DelNero, NREL</p>\n</div>\n\n<p>Deconstructing epoxy resins with hot acetic acid has the potential to provide a scalable and affordable solution for recycling carbon fiber composites, according to <a href=\"https://www.nature.com/articles/s41586-025-09067-y\" target=\"_blank\">new research</a> from the U.S. Department of Energy Bio-Optimized Technologies to keep Thermoplastics out of Landfills and the Environment (BOTTLE) multi-organization consortium.</p>\n\n<p>Carbon fiber composites&nbsp;are generally made with epoxy-amine resins. &ldquo;We have to do something intense to get the fibers out, but we also must be careful not to degrade the chemicals in the resin beyond what&rsquo;s necessary, as that would waste all the time, energy&nbsp;and raw materials that went into making them in the first place,&rdquo; says&nbsp;Stephen Dempsey, a postdoctoral researcher at the <a href=\"https://www.nrel.gov/\" target=\"_blank\">National Renewable Energy Laboratory</a>&nbsp;(NREL, Golden, Colo., U.S.) and one of the first authors of the study.</p>\n\n<p>These resins are often made of highly complex mixtures of molecules. Some of these compounds are common, and shared across many industries that use carbon fiber composites, but others are not. In addition, it is currently challenging to&nbsp;identify exactly what the resin chemistry is before recycling. A recycling method for carbon fiber composites&nbsp;must therefore be extremely robust and capable of handling diverse resin formulations.</p>\n\n<p>The BOTTLE team&rsquo;s solution ended up being surprisingly simple. Hot acetic acid, the same compound that is found in vinegar, can cleave all the key bonds within these resins. Former NREL postdoctoral researcher Ciaran Lahive (now at University of Manchester), and co-first author on this study, demonstrated this reaction during an intensive reaction screening effort for another project.</p>\n\n<p>The team learned something remarkable: Not only do the polymer networks in the resin solubilize rapidly, but the acetic acid also stabilizes their chemical components, enabling high yields of reusable chemical building blocks. Extensive optimization work from NREL interns Katie Stevenson (now at Columbia University) and Sydney Reiber (now at the University of Graz) led to a process effective on end-of-life (EOL) waste from a variety of industries.</p>\n\n<p>Importantly, the researchers also determined there was no impact on the strength of the recycled carbon fibers (rCF), which is critical to ensuring they retain their value after being extracted from the composite. To demonstrate this, they took 80 grams of a scrap mountain bike frame made of composite material and deconstructed it. Using the carbon fibers they had just extracted, they then made new composites that exhibited more than twice the strength-to-weight ratio of steel.</p>\n\n<p>Not only is the cost of rCF predicted to be quite low compared to virgin fiber, with a price of just $1.50 per kilogram, but the energy consumption is also practically zero when factoring in the recovered epoxy building blocks. The process is not limited to carbon fiber composite&nbsp;only &mdash; glass fiber composites like those found in turbine blades, boat hulls or automobile bumpers and hoods could also be treated.</p>\n\n<p>&ldquo;Long-term, this technology could be used to create value from challenging composite waste streams that are currently piling up in landfills,&rdquo; says BOTTLE CEO Gregg Beckham, the senior author of the study and a senior research fellow at NREL. &ldquo;Current technologies are not yet able to make a dent in that waste stream, but we think that this process could be useful for this application as well.&rdquo;</p>\n\n<p>The paper, &ldquo;Acetolysis of epoxy-amine resins for carbon fiber-reinforced polymer recycling,&rdquo; appears in the journal <em>Nature</em>. The other coauthors from NREL are William Michener, Hannah Alt, Kelsey Ramirez, Erik Rognerud, Clarissa Lincoln, Ryan Clarke, Nicholas Rorrer&nbsp;and Katrina Knauer.</p>\n\n<p><em>Funded by the U.S. DOE&rsquo;s Advanced Materials and Manufacturing Technologies Office and Bioenergy Technologies Office, the work was performed as part of the&nbsp;<a href=\"https://www.bottle.org/\" rel=\"noreferrer noopener\" target=\"_blank\">BOTTLE consortium</a>. Additional funding was provided as part of a BOTTLE funding opportunity announcement with the University of Delaware&rsquo;s Center for Composite Materials.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/nrel-publishes-carbon-fiber-composite-deconstruction-method"
      }
    ],
    "link": "https://www.compositesworld.com/news/nrel-publishes-carbon-fiber-composite-deconstruction-method"
  },
  {
    "published": "Fri, 11 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      15,
      0,
      0,
      4,
      192,
      0
    ],
    "title": "Altair, DAC join efforts to increase digital maturity of aerospace suppliers",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Altair, DAC join efforts to increase digital maturity of aerospace suppliers"
    },
    "summary": "Enhanced access to digital tools will support&nbsp;SMEs and startups at all levels, fostering innovation and resiliency and&nbsp;reducing&nbsp;supply chain fragmentation across Italy and Europe.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Enhanced access to digital tools will support&nbsp;SMEs and startups at all levels, fostering innovation and resiliency and&nbsp;reducing&nbsp;supply chain fragmentation across Italy and Europe."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-altair-dac-parisairshow.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-altair-dac-parisairshow.jpeg;maxWidth=720\" /> </a></div>\n\n<p>(Left to right):&nbsp;Paolo Colombo, senior director A&amp;D strategic initiatives and ecosystem, Altair; Luigi Carrino, president of the Campania Aerospace Technological District (DAC); and Salvatore Cristofori, senior sales director A&amp;D, Altair. Source | Altair, DAC</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/altair-engineering\" target=\"_blank\">Altair</a>&nbsp;(Troy, Mich., U.S.), part of Siemens Digital Industries Software, is deepening its&nbsp;ongoing collaboration with&nbsp;<a href=\"https://www.daccampania.com\" target=\"_blank\">Campania Aerospace District</a> (DAC, Napoli, Italy) to accelerate digital transformation across Italy and Europe&rsquo;s aerospace sector. The partnership aims to empower small- and medium-sized businesses (SMBs) and startups by providing access to cutting-edge technology, driving innovation and enhancing competitiveness throughout the European aerospace supply chain.</p>\n\n<p>DAC, established in 2012, constitutes an ecosystem of 300 stakeholders &mdash;&nbsp; including 32 large companies, 123 SMEs, 15 universities and research centers such as CIRA, CNR and ENEA&nbsp;and 170 partners &mdash; providing synergy&nbsp;between public and private sectors to&nbsp;tackle complex challenges. DAC focuses on advancing four core aerospace areas: commercial aviation, general aviation, space systems and vectors, and maintenance and transformation.</p>\n\n<p>Much of&nbsp;its research and activities have achieved this through the use of composite materials.&nbsp;Specifically, the TOP project (developing and applying innovative processes for manufacturing and assembling composite material aerospace structures), the TABASCO project (developing low-cost production technologies and processes for composite structures in advanced aircraft) and the REVAIA-2 Project (developing composite structures made of cellulose fibers and resins derived from natural materials).&nbsp;</p>\n\n<p>&ldquo;For DAC, the collaboration with Altair Engineering represents a strategic initiative that reflects a specific vision for supply chain development: guiding SMEs and startups toward an advanced production model based on the systematic adoption of digital tools and integration with research,&rdquo; says&nbsp;Luigi Carrino, president of DAC. &ldquo;Thanks to this agreement, we offer our member companies not only facilitated access to high-level simulation and data analysis technologies, but also training programs and concrete opportunities for technological acceleration and growth, consistent with the level of large companies.&rdquo;</p>\n\n<p>A key challenge for many OEMs&nbsp;is maintaining digital continuity across their supply chains. SMBs frequently lack the resources, expertise&nbsp;or financial capability to implement the same technologies used by larger partners &mdash; often resulting in lower efficiency, longer lead times&nbsp;and reduced product quality. The Altair-DAC initiative directly addresses this gap.</p>\n\n<p>Under the program, SMBs gain access to Altair&rsquo;s simulation, data analytics, and AI technologies at discounted rates, enabling them to digitize engineering processes, improve efficiency&nbsp;and innovate faster. Startups are offered low-cost entry in their first year, followed by participation in Altair&rsquo;s Aerospace Startup Acceleration Program from the second year and onward.&nbsp;Altair&rsquo;s technology can also further bolster&rsquo;s DAC&rsquo;s work in composites design &mdash; enabling structural&nbsp;optimization, ply level optimization and more.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/altair-dac-join-efforts-to-increase-digital-maturity-of-aerospace-suppliers"
      }
    ],
    "link": "https://www.compositesworld.com/news/altair-dac-join-efforts-to-increase-digital-maturity-of-aerospace-suppliers"
  },
  {
    "published": "Fri, 11 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      15,
      0,
      0,
      4,
      192,
      0
    ],
    "title": "SMCCreate 2025 event returns to Prague",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SMCCreate 2025 event returns to Prague"
    },
    "summary": "Industry professionals are invited to the Nov. 4-5, 2025, event discussing developments, applications, best practices and solutions in SMC and BMC.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Industry professionals are invited to the Nov. 4-5, 2025, event discussing developments, applications, best practices and solutions in SMC and BMC."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"SMCCreate logo\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-smccreate20251.png;maxWidth=720\" /> </div>\n\n<p>Source | SMCCreate</p>\n</div>\n\n<p dir=\"ltr\">The third edition of the SMCCreate&nbsp;conference, organized by the&nbsp;<a href=\"https://www.composites-germany.org/index.php/en/organization/founder-members/104-avk-federation-of-reinforced-plastics-en\" target=\"_blank\">AVK German Federation of Reinforced Plastics</a> (Frankfurt) and&nbsp;the <a href=\"https://smcbmc-europe.org/\" target=\"_blank\">European Alliance for SMC BMC</a>&nbsp;(Brussels, Belgium) is taking place at the Vienna House Diplomat in Prague, Czech Republic from Nov. 4-5, 2025. The event, conducted in English, brings&nbsp;together international experts to discuss the latest developments and applications in the field of sheet and bulk molding compound (SMC, BMC), high-performance fiber composites that are increasingly being used in a wide range of applications and end markets.</p>\n\n<p dir=\"ltr\">As in years past, SMCCreate is offering a compact, quality program. Over the course of 1.5 days,&nbsp;leading companies and research institutions such as AOC, Owens Corning, Menzolit and TU Delft will present latest findings, best practices and innovative solutions relating to the use of SMC and BMC in modern construction processes. Participants can look forward to a total of 15 presentations on the topics of market and&nbsp;trends, sustainability and design.</p>\n\n<p dir=\"ltr\">Information about the program, registration and the event is available <a href=\"https://www.avk-tv.de\" target=\"_blank\">here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/smccreate-2025-event-returns-to-prague"
      }
    ],
    "link": "https://www.compositesworld.com/news/smccreate-2025-event-returns-to-prague"
  },
  {
    "published": "Fri, 11 Jul 2025 10:30:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      14,
      30,
      0,
      4,
      192,
      0
    ],
    "title": "CMC nose, control surfaces for Space Rider TPS pass dynamic structural qualification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CMC nose, control surfaces for Space Rider TPS pass dynamic structural qualification"
    },
    "summary": "Largest melt infiltrated ceramic matrix composite part to date and complex body flap assembly achieve key milestone ahead of manufacturing the flight unit for Europe&rsquo;s first reusable space vehicle.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Largest melt infiltrated ceramic matrix composite part to date and complex body flap assembly achieve key milestone ahead of manufacturing the flight unit for Europe&rsquo;s first reusable space vehicle."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-cira-qualification.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CMC nose and body flap dynamic testing at CIRA\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-cira-qualification.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | CIRA</p>\n</div>\n\n<p>The nose and body flap of the <em>Space Rider</em>, designed by <a href=\"https://www.cira.it/en\" target=\"_blank\">CIRA</a> (Capua, Italy) and manufactured in collaboration with <a href=\"https://www.petroceramics.com/\" target=\"_blank\">Petroceramics</a> (Stezzano, Italy), have successfully passed their dynamic structural qualification campaign, confirming the full integrity of the components ahead of the flight unit's manufacturing.</p>\n\n<p>This achievement marks a key milestone for the <em>Space Rider</em>, to be the first European reusable space transportation system, developed under the <a href=\"https://spacetransportation.esa.int/space-rider/\" target=\"_blank\">European Space Agency (ESA) program</a> with <a href=\"https://www.thalesaleniaspace.com/en\" target=\"_blank\">Thales Alenia Space</a> Italy as the prime contractor. (See <a href=\"https://www.compositesworld.com/articles/cira-qualifies-cmc-structures-for-the-reusable-space-rider\" target=\"_blank\">CW</a><em><a href=\"https://www.compositesworld.com/articles/cira-qualifies-cmc-structures-for-the-reusable-space-rider\" target=\"_blank\">&rsquo;s article on the Space Rider&rsquo;s complete TPS</a></em>).</p>\n\n<p>&ldquo;The <em>Space Rider</em> nose is one of the most difficult technological challenges we have faced so far,&quot; says Giuseppe Rufolo, CIRA program manager. &ldquo;The success of these tests is the culmination of 4 years of intense work and paves the way for the completion of the <em>Space Rider</em> TPS.&rdquo;</p>\n\n<p>&ldquo;The completion of the dynamic qualification of the ceramic-based composite nose is a key milestone for the Space Rider program,&rdquo; adds Daniele Francesconi, Thales Alenia Space Italia program manager. &ldquo;This achievement is [thanks to] the successful collaboration between the research center and small- and medium-sized industries in overcoming major technological challenges, which are essential for the atmospheric re-entry of reusable space vehicles.&rdquo;</p>\n\n<p>According to Aldo Scaccia, ESA <em>Space Rider</em> space segment manager, this qualification&nbsp;represents a major advance for <em>Space Rider.&nbsp;</em>&ldquo;The nose, a crucial part of the vehicle&rsquo;s&nbsp;thermal protection system [TPS] for the hypersonic atmospheric re-entry, is essential to the mission&rsquo;s success.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/screenshot-2025-07-10-084353.jpg\" target=\"_blank\"><img alt=\"CMC nose for Space Rider TPS\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/screenshot-2025-07-10-084353.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>The nose is one of the most complex components of the vehicle&rsquo;s TPS, featuring a structure that integrates around 1,200 elements. At the heart of the system is a 130-centimeter-diameter dome made from ISiComp ceramic matrix composite (CMC) &mdash; said to be the largest ever made using liquid silicon infiltration (LSI) technology. ISiComp is a carbon fiber-reinforced carbon/silicon carbide (C/C-SiC) CMC developed jointly by CIRA and Petroceramics. Weighing just 40 kilograms, the nose can withstand temperatures of up to 1650&deg;C, maintain its aerodynamic shape with deformations of less than 1 millimeter and withstand launch loads.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-blog-cira-cmc-flap.jpg\" target=\"_blank\"><img alt=\"CMC body flap made by CIRA for Space Rider\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-blog-cira-cmc-flap.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>Measuring 900 &times; 700 millimeters with a mass of just 10 kilograms, the ISiComp body flap assembly (BFA)&nbsp;features a complex geometry capable of ensuring the aerodynamic performance and thermo-structural characteristics necessary to withstand a demanding combination of mechanical and thermal loads, with temperatures reaching up to 1650&deg;C.</p>\n\n<p>The particular configuration of the flap and the interface system, with metallic supports and bearings, creates a strong coupling of the structure with the vibro-acoustic stresses of the <em>Vega-C</em> rocket. This makes laboratory tests critical, as they must be both representative and safe for the integrity of the component.</p>\n\n<h3><strong>Efficient, robust testing and qualification</strong></h3>\n\n<p>The <em>Space Rider</em>&nbsp;project team at CIRA has developed an advanced methodology to define nominal load profiles, mitigating the amplification of dynamic stresses induced by laboratory tests. Based on load monitoring using accelerometers and FEM analysis, this methodology reduces uncertainties and generates test profiles representative of operational conditions. This approach is said to represent&nbsp;a significant evolution toward&nbsp;efficient and robust dynamic qualification, contributing to ensuring the safety and reliability of the <em>Space Rider</em> during its missions.</p>\n\n<p>The methodology was applied to the dynamic testing campaign on the &ldquo;Qualification Model&rdquo;&nbsp;of the body flap, the first component of the<em> Space Rider</em>&nbsp;TPS&nbsp;to be qualified. The dynamic testing campaign, conducted by the CIRA Space Qualification Laboratory,&nbsp;assessed&nbsp;the behavior of the nose and BFA structures under vibrational loads representative of launch conditions. Its success demonstrates the effectiveness of an implementation model that leverages synergies between design expertise and experimental capabilities.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cmc-nose-control-surfaces-for-space-rider-tps-pass-dynamic-structural-qualification"
      }
    ],
    "link": "https://www.compositesworld.com/news/cmc-nose-control-surfaces-for-space-rider-tps-pass-dynamic-structural-qualification"
  },
  {
    "published": "Fri, 11 Jul 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      14,
      0,
      0,
      4,
      192,
      0
    ],
    "title": "BlueRebirth Council to build automotive recycling value chain",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "BlueRebirth Council to build automotive recycling value chain"
    },
    "summary": "Six Japanese companies, including Toray Industries, are committed to realizing a true car-to-car recycling system, building know-how via projects, industry collaboration to achieve a stable recycled materials supply.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Six Japanese companies, including Toray Industries, are committed to realizing a true car-to-car recycling system, building know-how via projects, industry collaboration to achieve a stable recycled materials supply."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-bluerebirthcouncil.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"BlueRebirth Council infographic.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-bluerebirthcouncil.jpg;maxWidth=720\" /> </a></div>\n\n<p>The&nbsp;BlueRebirth Council&rsquo;s vision for 2035. Source | BlueReBirth Council</p>\n</div>\n\n<p>Japan-based Denso Corp. (Kariya), <a href=\"https://www.compositesworld.com/suppliers/toray-industries\" target=\"_blank\">Toray Industries&nbsp;Inc.</a> (Tokyo), Nomura Research Institute&nbsp;Ltd. (Tokyo), Honda Motor Co.&nbsp;Ltd. (Tokyo)&nbsp;Matec Inc. (Hokkaido) and Rever Corp.&nbsp;(Osaka) announce the establishment of the <a href=\"https://www.bluerebirth.jp/\" target=\"_blank\">BlueRebirth Council</a>. Initiated by these six companies, the council aims to build a manufacturing and recycling integrated value chain to realize car-to-car recycling, starting with automated precision dismantling (leveraging robotics and AI-based recognition and decision-making technologies), which will efficiently disassemble&nbsp;end-of-life vehicles (ELVs) for material recovery and recycling.</p>\n\n<p>In recent years, the automotive industry has sought to transition to a circular economy to help realize a sustainable society, taking on the significant challenge of reducing natural resource consumption by&nbsp;expanding the use of recycled materials. However, the mainstream global method remains shredding ELVs followed by material sorting, which the council says makes it very difficult to&nbsp;secure high-purity recycled materials.</p>\n\n<p>Furthermore, collaboration between manufacturing and recycling industries has not been sufficient, and as a result, initiatives to use recycled materials as automotive components &mdash; which require both high quality standards and adequate supply volumes for mass production &mdash; have not progressed. In addition, the automotive recycling industry faces challenges in promoting automation and digitalization and in addressing worker shortages by improving workplace environments.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>Toray Industries is committed to the recycling and sustainability movement, including for composite materials. This is exemplified through Toray Industries&rsquo; own work and the work of its global divisions:</p>\n\n<ul>\n\t<li>\n\t<p>Toray, Daher and Tarmac Aerosave&nbsp;have announced an <a href=\"https://www.compositesworld.com/news/toray-daher-and-tarmac-aerosave-announce-end-of-life-aircraft-recycling-program\" target=\"_blank\">End-of-Life Aircraft Recycling Program</a></p>\n\t</li>\n\t<li>\n\t<p>Toray Composite Materials America&rsquo;s&nbsp;scrap prepreg materials, <a href=\"https://www.compositesworld.com/articles/video-recycling-and-machining-carbon-fiber-scraps\" target=\"_blank\">are being repurposed</a> by Elevated Materials.</p>\n\t</li>\n\t<li>\n\t<p>Toray Industries has launched a&nbsp;bio-circular carbon fiber, which is being used in applications <a href=\"https://www.compositesworld.com/news/head-sports-launches-limited-edition-racquet-using-toray-bio-circular-fibers\" target=\"_blank\">like tennis rackets</a>.</p>\n\t</li>\n\t<li>\n\t<p>Toray Industries has developed a technology that makes it possible to recycle <a href=\"https://www.compositesworld.com/news/toray-reveals-glass-fiber-reinforced-pps-recycling-technology\" target=\"_blank\">glass fiber-reinforced<br />\n\tpolyphenylene sulfide</a>&nbsp;that performs like virgin resins.</p>\n\t</li>\n</ul>\n</div>\n</div>\n\n<p>The newly established BlueRebirth Council aims to address these challenges and, looking ahead to 2035, evolve the automotive recycling industry into a &ldquo;recycled materials manufacturing industry&rdquo; that plays a key role as part of a new resource-circulating value chain within the automotive industry. Through these efforts, the companies behind the council are committed to realizing a true car-to-car recycling system &mdash; as in, returning all auto&nbsp;parts to raw materials, using them in new vehicle production&nbsp;and creating a closed-loop recycling system.</p>\n\n<p>As specific initiatives, the council will engage in discussions and research, as well as advance technology development and demonstration projects together with participating companies, research institutions and other stakeholders, starting with the automated precision dismantling of ELVs, to build a manufacturing and recycling integrated value chain. In addition, the council will make recommendations to relevant companies and organizations.</p>\n\n<p>Automated precision dismantling is an advanced intelligent system that uses AI and sensor technologies to enable robots to operate along the optimal path, even for deformed parts. This not only ensures the quality and volume of recycled materials that are difficult to achieve with conventional methods, but also contributes to fundamentally solving worker shortages.</p>\n\n<p>Furthermore, by recording information such as material provenance and environmental impact on a digital platform and sharing it across the manufacturing and recycling value chain, the Rebirth Council can ensure a reliable and stable supply of recycled materials.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/bluerebirth-council-to-build-automotive-recycling-value-chain"
      }
    ],
    "link": "https://www.compositesworld.com/news/bluerebirth-council-to-build-automotive-recycling-value-chain"
  },
  {
    "published": "Fri, 11 Jul 2025 05:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      11,
      9,
      0,
      0,
      4,
      192,
      0
    ],
    "title": "Sensory consolidation roller for laser-based AFP enables innovative temperature measurement",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Sensory consolidation roller for laser-based AFP enables innovative temperature measurement"
    },
    "summary": "Within the InSiTe project, IFW has demonstrated embedded fiber optic sensors for continuous measurement of temperature in the area of compaction with high spatial resolution up to 0.65 millimeter.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Within the InSiTe project, IFW has demonstrated embedded fiber optic sensors for continuous measurement of temperature in the area of compaction with high spatial resolution up to 0.65 millimeter."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-ifw-sensory-roller-afp.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"sensory compaction roller for laser-based AFP using fiber optic sensors\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-ifw-sensory-roller-afp.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) |&nbsp;Institute of Production Engineering and Machine Tools (IFW)</p>\n</div>\n\n<p>As part of the <a href=\"https://www.ifw.uni-hannover.de/en/institute/news-und-veranstaltungen/news/news-details/news/innovative-method-of-temperature-measurement-for-automated-fiber-placement\" target=\"_blank\">InSiTe project</a>, funded by the German Research Foundation (DFG), a strain-sensitive consolidation roller was developed and researched at the <a href=\"https://www.ifw.uni-hannover.de/en/institute\" target=\"_blank\">Institute of Production Engineering and Machine Tools</a> (IFW) at the University of Hannover. Used for the continuous measurement of process temperatures in laser-based automated fiber placement (LAFP), the sensitivity of the consolidation roller is achieved by glass fiber sensors that are embedded in the surface area. The detection of Rayleigh backscattering of laser light introduced into the glass fiber enables strain measurement with high spatial resolution. As part of the project, fundamental knowledge about the embedding of fiber optic sensors in the elastic material of the consolidation roller has been acquired and disturbance variables from the LAFP have also been identified and compensated for.</p>\n\n<p>Using LAFP, it is possible to additively process high-performance carbon fiber-reinforced thermoplastic composite (CFRTP) tapes into lightweight, high-performance structures. This method offers in situ consolidation, where new plies of tape are heated with the laser and pressed together with those previously deposited using the consolidation roller. Compared to thermoset structures that are produced in an autoclave, such CFRTP structures offer the possibility of fusion bonding/welding methods to achieve dustless assembly (no drilling holes or fasteners) as well as improved recyclability. However, the challenge is to produce structures with equivalent mechanical properties. The quality of the end product depends in particular on the thermal-mechanical process control.</p>\n\n<p>As part of the InSiTe project, it was shown that the thermal load, when joining the material layers, changes over the course of layup, partly due to the changing process boundary conditions of this additive manufacturing technique. For example, the increasing thickness of the laminate and the associated thermal insulation from the metal tool means that the laser power in the upper laminate layers can be significantly reduced compared to the lower layers. As a result, the layup speed, and thus productivity, can be increased. Continuous knowledge of the process temperatures and control of the process variables is therefore essential for consistent quality and efficient production, IFW says.</p>\n\n<p>Currently available LAFP systems are equipped with a temperature control system that adjusts the laser power based on the temperature measured in front of the consolidation roller using infrared thermography. However, this radiation-based measuring method does not record any temperature information from the area under the consolidation roller, where the quality of the bonding of the material layers arises. The IFW has therefore designed a sensory consolidation roller with the aim of enabling the detection of temperatures in the area of the consolidation roller via a strain-sensitive surface area. For this purpose, a fiber optic sensor is applied to the consolidation roller. The measurement of Rayleigh backscattering of laser light irradiated into the optic fiber enables the analysis of its local strain state as well as correlation with the thermal load and also a high spatial resolution of the strain measurement points for up to 0.65 millimeter&nbsp;along the sensor.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-ifw-sensory-roller-afp-strain.jpg\" target=\"_blank\"><img alt=\"diagram of AFP compaction roller with fiber optic sensor\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-ifw-sensory-roller-afp-strain.jpg;maxWidth=385\" /></a></div>\n\n<p>Sensory consolidation roll for the laser-based thermoplastic AFP.&nbsp;</p>\n</div>\n\n<p>As part of the InSiTe project, the integration of the fiber optic sensor into the elastic coating of the consolidation roller and the resulting sensitivity of the surface area were initially investigated. As part of the investigation, the concept of gluing the optic fiber into a previously introduced groove on the lateral surface was pursued. For this purpose, different geometric parameters of the groove and different adhesive systems were varied. In experimental tests on simplified test specimens, it was found that embedding close to the surface with an elastic silicone adhesive leads to the highest strain sensitivity.&nbsp;</p>\n\n<p>The knowledge gained from these tests was transferred to a prototype consolidation roller for use in the LAFP. Because there is both a thermal and a mechanical load in the LAFP that can influence the strain measurement, the next step was to develop a method for compensating for the disturbance variables and validate it in process tests. At the same time, a thermodynamic model of the LAFP was developed, which is used to calibrate the sensor. The model provides temperature values that are intended for correlation with the measured and compensated strain values.</p>\n\n<p>To conclude the project and for the final evaluation of the sensor system, a validation study will be carried out in the next few weeks under real operating conditions during the production of a flat laminate at the LAFP.</p>\n\n<p>Read more &ldquo;<a href=\"https://www.ifw.uni-hannover.de/en/institute/news-und-veranstaltungen/news/news-details/news/innovative-method-of-temperature-measurement-for-automated-fiber-placement\" target=\"_blank\">Innovative method of temperature measurement for Automated Fiber Placement</a>&rdquo; or contact Maximilian Kaczemirzk at <a href=\"\" target=\"_blank\">kaczemirzk@ifw.uni-hannover.de</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/sensory-consolidation-roller-for-laser-based-afp-enables-innovative-temperature-measurement"
      }
    ],
    "link": "https://www.compositesworld.com/news/sensory-consolidation-roller-for-laser-based-afp-enables-innovative-temperature-measurement"
  },
  {
    "published": "Wed, 9 Jul 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      9,
      18,
      0,
      0,
      2,
      190,
      0
    ],
    "title": "ACMA announces revision of unified emission factors for open molding, other composite processes",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ACMA announces revision of unified emission factors for open molding, other composite processes"
    },
    "summary": "Participation, regardless of ACMA membership, is open through July 6, 2025, for revision and redesignation of the ANSI/ACMA UEF-1-2019 standard.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Participation, regardless of ACMA membership, is open through July 6, 2025, for revision and redesignation of the ANSI/ACMA UEF-1-2019 standard."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Compliance and regulations stock image\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-standards-gettyimages1.jpg;maxWidth=720\" /> </div>\n\n<p>Source | Getty Images/Alexander Sikov</p>\n</div>\n\n<p>The <a href=\"https://www.compositesworld.com/suppliers/acma-american-composites-manufacturers-association\" target=\"_blank\">American Composites Manufacturers Association</a> (ACMA, Arlington, Va., U.S.),&nbsp;an ANSI-accredited Standards Developing Organization (SDO), has announced the revision and redesignation of ANSI/ACMA UEF-1-2019 &ldquo;Estimating Emission Factors from Open Molding and Other Composite Processes.&rdquo; The project was published in the June 6, 2025, edition of the American National Standards Institute (ANSI) <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fd2v-g604.na1.hubspotlinks.com%2FCtc%2FW%2B113%2Fd2v-g604%2FMW8w2tFnwBWN5hmnsRlSYsrW6D6W6y5yymG1N3Qcf9x3m2nnW8wLKSR6lZ3p1N8qmgNt6D4bmW1LR89n5qwg6NW69t2FL50rpFgW4RVtLC7C2SyCW8ZxftR6qlfcQW5h1hHd6JkP7BW4Ysf6_5ZVYvWW4Cz1yr6Lrv6qN5KzZW3Jyc98N2PjqK2q1MycMJg_bP6fCF0W7-L9qg7pBJKHW3n4Z2w2xwLjBN8hCK9NBgRhSW5_Pjr53f9s2TW4zYrss5nQh5SW369cf48MVDv7W6GBhLh4PWtv6W6_nm-_2zWYQXW35H8sL78sFP-W7_QJkQ7r3gZnW6DQKhy185F9VW5PLgDL7Zy0KJW7Gk_Yn5V-DWJW4cq48X2JxHcSW3wPp2L4dMTqmW9k4pgS5Plh0zW5RHkDj8L4GFzdnxQz004&amp;data=05%7C02%7Cgnehls%40gardnerweb.com%7Cabd50129ad634096c23608ddba3e9ee4%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638871500322155101%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=6rTd73Gq3z%2BMy2vUOyNCbrZlpwud6V%2FqAoBcWpgMQdw%3D&amp;reserved=0\" target=\"_blank\"><em>Standards Action</em></a> (vol. 56, no. 23). Public comments on Project Initiation Notification System (PINS) are welcome through July 6, 2025.</p>\n\n<p>The &ldquo;Unified Emission Factors (UEF) for Open Molding and Other Composite Processes&rdquo; standard provides scientifically backed methods for estimating air emissions from various composites manufacturing processes, including open molding. These estimates are essential for a wide range of applications, such as:</p>\n\n<ul>\n\t<li>Emission inventories</li>\n\t<li>Environmental permit applications</li>\n\t<li>Regulatory compliance reports</li>\n\t<li>Toxics Release Inventory (TRI) reports submitted to the U.S. Environmental Protection Agency (EPA)</li>\n\t<li>Internal business planning and sustainability initiatives.</li>\n</ul>\n\n<p>Participation is open to all interested parties regardless of ACMA membership. ACMA encourages involvement in the standards development process through two key groups:</p>\n\n<ul>\n\t<li><strong>Relevant Committee:&nbsp;</strong>Responsible for drafting the revised standard and addressing public comments.</li>\n\t<li><strong>Consensus Body:&nbsp;</strong>Serves as the official voting group that reviews and approves the draft before the final 45-day ANSI public review.</li>\n</ul>\n\n<p>To express interest, individuals must complete the ACMA<strong> </strong><a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fd2v-g604.na1.hubspotlinks.com%2FCtc%2FW%2B113%2Fd2v-g604%2FMW8w2tFnwBWN5hmnsRlSYsrW6D6W6y5yymG1N3Qcf8Y3m2nnW7lCdLW6lZ3n4W288MC33RrS96W49pgz11ZFl8rW6PKnDq2dxHkpW8xXKZt1m1KTsN97Jp42vQSmMN4TZxr-z7x_DW1wTD6P19YwqTVbBvr_9d8yyxW7RLRMp6g9gm8W82xPlH56vjp9Vjrb4s9lcPtKW58_h2m1qzxWjW4kKgcQ3gpgHDW4wl8N72f2rWQVTMzsC68lJJFW4HdH8c6rbSN5W5FnBLm2xBG6WW37kqKZ8n7-KmMrfSkSqHmPxW5GKnwd2mj7TyW40NSPj4QHLjbW1MmmNz81dP1RW62P8wg2Q2D_-W7L2pcz6zz66xf8LgvKn04&amp;data=05%7C02%7Cgnehls%40gardnerweb.com%7Cabd50129ad634096c23608ddba3e9ee4%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638871500322170322%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=txy6lcE%2FOWElVJxSBOm4Sx%2B3ZOFM9ydqW0Js5nFTWBE%3D&amp;reserved=0\" target=\"_blank\">Interest Form</a>. ACMA leadership and the committee chair will finalize the composition to ensure balanced representation.</p>\n\n<p><em>For details on how to participate or to stay informed about ACMA&rsquo;s standards development efforts, visit ACMA&rsquo;s <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fd2v-g604.na1.hubspotlinks.com%2FCtc%2FW%2B113%2Fd2v-g604%2FMW8w2tFnwBWN5hmnsRlSYsrW6D6W6y5yymG1N3Qcf8F3m2nnW6N1vHY6lZ3nzW84Dk0x2SLJ2HW59_Z_S4ft3N-N1XrrldfGsXfW3mz2R47115T6W3QNSNf3JS0WbW4kdF7Z2F_P5mW88lcH43Bk_5lW8_k8Xn5GTg8sW63cJVZ8kZBgGW34GfVq4VRKG3W1K9rBL1Yyt_1W2XQ5nT8zPNV9N2VjKMdGv06bW95w0J95-Y_2qW3f-b4b6B0pWgW2-3PMS3C9wrvW3YKMKd3x8521W5d7Xl04ljCw-W23Qyt638_lpPW2gflMC7hR0m_W8B0xMq3brx9RVrKStm618LCyf20xmF804&amp;data=05%7C02%7Cgnehls%40gardnerweb.com%7Cabd50129ad634096c23608ddba3e9ee4%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638871500322185760%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=k9CQ3Jzgm9J2P1V%2BYDJjWlcs%2BZZ2kbV58jM8AJkZJw0%3D&amp;reserved=0\" target=\"_blank\">Standards in Progress</a> page or email <a href=\"mailto:Standards@ACMAnet.org\" target=\"_blank\">Standards@ACMAnet.org</a>.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/acma-announces-revision-of-the-unified-emission-factors-for-open-molding-other-composite-processes"
      }
    ],
    "link": "https://www.compositesworld.com/news/acma-announces-revision-of-the-unified-emission-factors-for-open-molding-other-composite-processes"
  }
]