[
  {
    "published": "Fri, 8 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      8,
      17,
      0,
      0,
      4,
      220,
      0
    ],
    "title": "Joby preps conforming aircraft for TIA flight testing, acquires Blade Air Mobility",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Joby preps conforming aircraft for TIA flight testing, acquires Blade Air Mobility"
    },
    "summary": "Joby Aviation is advancing toward FAA certification of its electric eVTOL aircraft while acquiring Blade Air Mobility&rsquo;s passenger business to accelerate commercialization and expand operations in the U.S. and Europe.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Joby Aviation is advancing toward FAA certification of its electric eVTOL aircraft while acquiring Blade Air Mobility&rsquo;s passenger business to accelerate commercialization and expand operations in the U.S. and Europe."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-joby-conforming-aircraft-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-joby-conforming-aircraft-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Conforming eVTOL aircraft. Source | Joby Aviation</p>\n</div>\n\n<p>In early August 2025, <a href=\"https://www.jobyaviation.com/\" target=\"_blank\">Joby Aviation</a> (Santa Cruz, Calif., U.S.) has announced recent business developments, including&nbsp;that it is preparing for final assembly of its first conforming aircraft intended for type inspection authorization (TIA) flight tests, as well as its plans to acquire&nbsp;Blade Air Mobility Inc.&rsquo;s&nbsp;(New York, N.Y., U.S.) urban air mobility (UAM) passenger business.</p>\n\n<p>TIA flight testing of a conforming aircraft is a convergence of three critical initiatives within Joby that are aligned with Federal Aviation Administration (FAA) standards: (1) relevant test plan approvals, (2) a design that meets FAA standards&nbsp;and (3) the ability to manufacture the conforming design. Having successfully progressed all three ahead of assembly &mdash; including FAA acceptance of more than half of the company&rsquo;s test plans&nbsp;&mdash;&nbsp;this milestone continues to move Joby into the final stage of FAA certification and closer to commercializing its electric eVTOL aircraft.&nbsp;</p>\n\n<p>&ldquo;Every component, every system&nbsp;and every test we have completed over the past 15 years has led us to this point,&rdquo; says&nbsp;Didier Papadopoulos, president of aircraft OEM.&nbsp;Successful tests have included static load testing on primary aerostructures &mdash; where engineers applied forces far exceeding expected flight loads &mdash; and testing of aircraft components and systems,&nbsp;incorporating important instrumentation and sensor calibration essential for TIA.&nbsp;&ldquo;We are now bringing it all together on the first of several aircraft that will be used for the final phase of FAA flight testing.&rdquo;</p>\n\n<p>Joby expects its pilots to start flying this aircraft in 2025, with FAA pilots following shortly thereafter to directly evaluate the aircraft&rsquo;s performance and safety. This testing is central to the certification process and forms a key part of the fifth, and final, stage of the type certification process.</p>\n\n<p>The company&rsquo;s <a href=\"https://www.compositesworld.com/news/joby-expands-california-and-ohio-manufacturing-capacity-adds-new-aircraft-to-fleet\" target=\"_blank\">manufacturing expansion</a> in California and Ohio, along with its close collaboration with Toyota, will enable Joby to double its production capacity to 24 aircraft per year.</p>\n\n<p>In addition to these commercialization efforts, Joby Aviation has plans to acquire all of Blade&rsquo;s passenger business, including operations in the U.S. and Europe and the Blade brand.&nbsp;Blade&rsquo;s Medical division, which was not included in the transaction and will remain a separate public company, is to partner with Joby on medical transportation.</p>\n\n<p>In addition to unlocking immediate market access and infrastructure across key urban corridors in New York City and Southern Europe, the acquisition will enable&nbsp;Joby to combine its technology with Blade&rsquo;s decade of experience delivering premium customer transportation at scale, as Joby looks ahead to carrying its first passengers <a href=\"https://www.compositesworld.com/news/joby-to-launch-evtol-aircraft-service-in-the-uae\" target=\"_blank\">in Dubai</a> in 2026.</p>\n\n<p>Blade flew more than 50,000 passengers in 2024 from a network of 12 urban terminals situated in some of the most important UAM markets globally. This includes dedicated lounge and terminal bases at John F. Kennedy International Airport and Newark Liberty Airport, as well as the West Side of Manhattan, the East Side of Manhattan and Wall Street. Blade passenger operations are expected to continue as normal, with the business continuing to be led by Blade founder and CEO Rob Wiesenthal as a wholly owned subsidiary of Joby.</p>\n\n<p>By using Blade&rsquo;s existing infrastructure and gradually transitioning a large loyal base of passengers from conventional helicopters to&nbsp;Joby aircraft, Joby expects to be able to accelerate its commercialization while reducing infrastructure investment requirements and customer acquisition costs.&nbsp;</p>\n\n<p>As part of the transaction, Joby will also become the preferred eVTOL partner to Blade&rsquo;s organ transport business &mdash; which will remain a separate public company to be renamed Strata Critical Medical&nbsp;&mdash;&nbsp;wherever Joby has operations.&nbsp;</p>\n\n<p>The transaction is expected to close in the coming weeks, subject to satisfaction or waiver of customary closing conditions.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/joby-preps-conforming-aircraft-for-tia-flight-testing-acquires-blade-air-mobility"
      }
    ],
    "link": "https://www.compositesworld.com/news/joby-preps-conforming-aircraft-for-tia-flight-testing-acquires-blade-air-mobility"
  },
  {
    "published": "Fri, 8 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      8,
      16,
      0,
      0,
      4,
      220,
      0
    ],
    "title": "Norsepower secures full-fleet rotor sail commitments",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Norsepower secures full-fleet rotor sail commitments"
    },
    "summary": "Composite wind propulsion technologies will support a series of&nbsp;methanol-ready oil and chemical tankers, as well as six newbuild tankers.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Composite wind propulsion technologies will support a series of&nbsp;methanol-ready oil and chemical tankers, as well as six newbuild tankers."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-norsepower-unionmaritime.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Boat installed with mechanical rotor sails.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-norsepower-unionmaritime.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Norsepower</p>\n</div>\n\n<p><a href=\"https://www.norsepower.com/\" target=\"_blank\">Norsepower</a>&nbsp;(Helsinki, Finland), a&nbsp;global provider of&nbsp;composite mechanical sails&nbsp;for large ships, announced two agreements in April and May for delivery of its Rotor Sails wind propulsion solutions &mdash;&nbsp;hollow, mast-like cylinders made of carbon and glass fiber composites that are&nbsp;rotated by an internal shaft (<a href=\"https://www.compositesworld.com/articles/modernizing-the-mechanical-rotor-sail-\" target=\"_blank\">learn more here</a>).</p>\n\n<p>A commitment with&nbsp;<a href=\"https://marine-offshore.bureauveritas.com/\" target=\"_blank\">Bureau Veritas Marine &amp; Offshore</a> (BV, Paris, France) will see Norsepower&rsquo;s Rotor Sails equipped to&nbsp;a series of methanol-ready oil and chemical tankers for Union Maritime. The first two vessels in this series, Buran and Ostro, were delivered in February and April 2025, respectively, following their construction at Fujian Southeast Shipbuilding. Union Maritime have two additional 18,500 DWT tankers currently under construction at Fujian Southeast Shipbuilding and two more at Wuhu Shipyard Co.&nbsp;Ltd, which will all be equipped with Norsepower Rotor Sails, with deliveries scheduled throughout 2025.</p>\n\n<p>These six vessels mark the first wave of a broader new build program&nbsp;for Union Maritime under BV class. More than 25 additional tankers are scheduled for delivery between 2026 and 2028, including a significant series at Wuhu Shipyard, with further vessels being built at other major Chinese shipyards. These vessels will either be delivered with wind propulsion systems installed or prepared for future integration, using technologies from various suppliers such as Norsepower.</p>\n\n<p>By incorporating wind propulsion systems and methanol-ready configurations, Union Maritime is aiming to improve energy efficiency and support long-term emissions reduction across its expanding fleet.</p>\n\n<p>Norsepower also secured an agreement in May 2025 to deliver six of its Rotor Sails&nbsp;for a fleet of newbuild tankers commissioned by <a href=\"https://www.gefo.com/\" target=\"_blank\">GEFO Shipping Group</a> (Hamburg, Germany). These newbuild vessels, designed by Ship Design &amp; Consult GmbH (SDC), and constructed by Nantong Xiangyu Shipbuilding,&nbsp;will be delivered between 2026 and 2028 with the rotor sails installed.</p>\n\n<p>The agreement covers six tankers across two distinct designs:</p>\n\n<ul>\n\t<li>Four 3,850 DWT&nbsp;chemical tankers, each to be equipped with one 20 &times; 4-meter&nbsp;Rotor Sails.</li>\n\t<li>Two 7,900 DWT chemical tankers, each to be equipped with one 28 &times;4-meter Rotor Sail.</li>\n</ul>\n\n<p>All six rotor sails will feature Norsepower&rsquo;s EX-compliant design, certified for use on vessels transporting flammable cargoes and compliant with all class and safety requirements. These rotor sails will be manufactured at Norsepower&rsquo;s dedicated factory in China, and delivered to the yard fully assembled, tested and ready for installation.</p>\n\n<p>&ldquo;This is a landmark agreement for Norsepower, not just because it involves two new customers and six vessels &mdash; but because it signals a fundamental shift in how wind propulsion is perceived in commercial shipping,&rdquo; notes Heikki P&ouml;ntynen, CEO of Norsepower. &ldquo;We are no longer talking about one-off pilot installations; we are now securing full-fleet commitments.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/norsepower-secures-full-fleet-commitments-with-rotor-sail-solutions"
      }
    ],
    "link": "https://www.compositesworld.com/news/norsepower-secures-full-fleet-commitments-with-rotor-sail-solutions"
  },
  {
    "published": "Fri, 8 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      8,
      15,
      0,
      0,
      4,
      220,
      0
    ],
    "title": "Beyond Gravity composites, space instruments power European MetOp weather satellites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Beyond Gravity composites, space instruments power European MetOp weather satellites"
    },
    "summary": "The first in six new satellites named MetOp-Second Generation is scheduled for launch mid-August 2025 to help precisely monitor Earth&rsquo;s weather, climate and atmospheric conditions.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The first in six new satellites named MetOp-Second Generation is scheduled for launch mid-August 2025 to help precisely monitor Earth&rsquo;s weather, climate and atmospheric conditions."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div>&nbsp;</div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-BeyondGravity-MetOp-SG-RO.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-BeyondGravity-MetOp-SG-RO.jpg;maxWidth=720\" /> </a></div>\n\n<p>Radio occultation&nbsp;(RO) instrument from Beyond Gravity.&nbsp;GRAS&rsquo;&nbsp;zenith-pointing antenna tracks a number of GPS satellites in range. This is indicated by the blue lines. The track-line changes to yellow once the signal goes into occultation as it is in range of the GAVA antenna. From these signals, profiles can be derived for the lowermost 80 kilometers of the Earth's atmosphere. The red line indicates where a rise event begins and the signal is received by the GVA antenna. Source | ESA &ndash;&nbsp;AOES Medialab</p>\n</div>\n\n<p>MetOp-Second Generation (MetOp-SG), a new generation of polar-orbiting European weather&nbsp;satellites&nbsp;manufactured by <a href=\"https://www.beyondgravity.com/en\" target=\"_blank\">Beyond Gravity</a> (Zurich, Switzerland), will be launched into space aboard the&nbsp;Ariane 6 launch vehicle Aug. 13, 2025. The 6-meter, 1-ton structures, made of carbon fiber, aluminum&nbsp;and titanium for critical connections, will&nbsp;measure humidity and temperature as well as aerosols.</p>\n\n<p>&ldquo;This weather satellite, together with its five counterparts, will significantly enhance weather forecasting accuracy and climate change monitoring,&rdquo; says Oliver Grassmann, executive VP&nbsp;satellites at Beyond Gravity. &ldquo;A key element of this mission is our radio occultation&nbsp;[RO] instrument, which provides important weather data.&rdquo;&nbsp;RO&nbsp;in space measures how radio signals from satellites bend as they pass through Earth&rsquo;s atmosphere, helping understand weather, climate and atmospheric conditions. &ldquo;The instrument will more than double the number of occultations to 2,100 per day per instrument &hellip;&nbsp;and will provide RO data until 2050.&rdquo;</p>\n\n<p>In addition to this instrument,&nbsp;Beyond Gravity provided the satellite&rsquo;s primary structure, thermal insulation and multiple&nbsp;products for the <em>Ariane 6</em> launcher. The prime contractor for the satellite is Airbus Defence and Space (Toulouse, France).</p>\n\n<p>European MetOp weather satellites have been orbiting the Earth from the North Pole to the South Pole since 2006. With this satellite, the first of six weather satellites of the latest generation, MetOp-SG, will be launched into space and will join the existing two MetOp weather satellites of the first generation already in orbit. These&nbsp;satellites will ensure the continued global observations from polar orbit. In the coming years, the other&nbsp;MetOp-SG satellites&nbsp;will be launched. With climate change driving more frequent and severe extreme weather events, precise and timely weather forecasting has never been more critical.</p>\n\n<p>In total, MetOp-SG&nbsp;consists of six satellites: three successive pairs made up of an A-type and a B-type satellite, which carry a host of different but complementary instruments. The current satellite is an A-type (MetOp-SG-A). The A-type satellites also carry Copernicus Sentinel-5 ultraviolet, visible, near-infrared and shortwave infrared to measure key air pollutants and climate-related gases. The MetOp-SG mission has been developed in a long-standing cooperation between the ESA and Eumetsat.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-metop-satellite-ariane6-fairing.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-metop-satellite-ariane6-fairing.jpg;maxWidth=385\" /></a></div>\n\n<p>Sealing the MetOp-SG-A1 satellite within the&nbsp;<em>Ariane 6</em> fairing before its launch. Source |&nbsp;ESA-CNES-ARIANESPACE/Optique vid&eacute;o du CSG&ndash;T. Leduc</p>\n</div>\n\n<p>The first MetOp-SG satellite was constructed at Beyond Gravity&rsquo;s site in Zurich. The metal-composite structure&nbsp;is wrapped in thermal insulation to protect it from high-temperature fluctuations of &plusmn;200&deg;C&nbsp;in space, keeping the interior of the satellite at a constant room temperature to ensure the smooth functioning of the instruments on board. The insulation consists of several layers of very thin metal-coated plastic and was produced in Berndorf, Austria.</p>\n\n<p>The top of the <a href=\"https://www.compositesworld.com/news/ariane-6-heavy-lift-rocket-makes-inaugural-launch\" target=\"_blank\"><em>Ariane 6</em> rocket</a>, on which MetOp-SG&nbsp;will be launched, consists of the payload fairing from Beyond Gravity made of carbon fiber composite. The fairing has a diameter of 5.4 meters. Produced at the Beyond Gravity site in Emmen, Switzerland, the two halves of the payload fairing protect the satellite from the harsh forces experienced during launch and the early flight stages.</p>\n\n<p>Beyond Gravity&rsquo;s site in Link&ouml;ping, Sweden, provided the payload adapter system for <em>Ariane 6</em> as well. The payload adapter system connects satellite and launcher during liftoff, then precisely releases the satellite into orbit once the proper altitude is reached.</p>\n\n<p>In Austria, Beyond Gravity also produced the high-temperature insulation for the rocket engines of the launcher&rsquo;s lower and upper stage as well as the engine gimbal for alignment of the rocket&rsquo;s upper stage.&nbsp;This rocket engine insulation consists of glass fabric and polymer films.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/beyond-gravity-composites-space-instruments-power-european-metop-weather-satellites"
      }
    ],
    "link": "https://www.compositesworld.com/news/beyond-gravity-composites-space-instruments-power-european-metop-weather-satellites"
  },
  {
    "published": "Fri, 8 Aug 2025 10:30:00 -0400",
    "published_parsed": [
      2025,
      8,
      8,
      14,
      30,
      0,
      4,
      220,
      0
    ],
    "title": "Women in Manufacturing presents 2025 Hall of Fame inductees",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Women in Manufacturing presents 2025 Hall of Fame inductees"
    },
    "summary": "Global trade association&nbsp;dedicated to supporting, promoting and inspiring women welcomes 12 women leaders who have championed manufacturing in their careers.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Global trade association&nbsp;dedicated to supporting, promoting and inspiring women welcomes 12 women leaders who have championed manufacturing in their careers."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-womeninmfg-halloffame-2024.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Women on stage holding awards.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-womeninmfg-halloffame-2024.jpg;maxWidth=720\" /> </a></div>\n\n<p>Women in Manufacturing&rsquo;s (WiM) 2024 Hall of Fame inductees at last year&rsquo;s WiM Summit. Source | WiM</p>\n</div>\n\n<p>The <a href=\"https://www.womeninmanufacturing.org/\" target=\"_blank\">Women in Manufacturing Association</a> (WiM, Cleveland, Ohio, U.S.), a global trade association, has announced the 12 women leaders who comprise the 2025 class of Women in Manufacturing Hall of Fame inductees.</p>\n\n<p>This sixth group of honorees will be officially welcomed to the WiM Hall of Fame as part of the 15<sup>th</sup> annual WiM Summit taking place at McCormick Place in Chicago, Ill., U.S.&nbsp;from Oct. 12-14. More than 2,500 attendees will join in the celebration of these trailblazing women in manufacturing.</p>\n\n<p>The WiM Hall of Fame honors women who have made outstanding contributions during the course of their established careers in the industry. Recipients include women who are dedicated to supporting, promoting and inspiring women in the manufacturing industry.</p>\n\n<p>&ldquo;This&nbsp;2025 class of&nbsp;outstanding women have not only advanced excellence in manufacturing but have also paved the way for future generations through their leadership and dedication to building more inclusive workplaces,&rdquo; says Allison Grealis, WiM president and founder. &ldquo;Their impact exemplifies the very mission WiM has championed for the past 15 years.&rdquo;</p>\n\n<p>The 2025 class of WiM Hall of Fame inductees are:</p>\n\n<ul>\n\t<li>Teresa Beach-Shelow, president, Superior Joining Technologies Inc.</li>\n\t<li>Amanda Lee Edwards, VP of enterprise excellence, Shaw Industries&nbsp;Inc.</li>\n\t<li>Ann Franzen, VP of manufacturing, ceilings, USG Corp.</li>\n\t<li>Dawn Garibaldi, founder and CEO, Amplify Strategy Group&nbsp;LLC</li>\n\t<li>Virginia Ashlock Harn, principal, manufacturing, CliftonLarsonAllen</li>\n\t<li>Lynn Kier, strategic communications executive, manufacturing industry, LSK Consulting</li>\n\t<li>Lora McCawley, plant manager, Siemens</li>\n\t<li>Cheryl Merchant, CEO and president, Taco Family Companies</li>\n\t<li>Jolen Stein, senior director, people services, BASF Corp.</li>\n\t<li>Cheryl Thompson, founder and CEO, CADIA</li>\n\t<li>Gina Trombley, executive VP&nbsp;of sales and marketing and chief commercial officer, Wabtec Corp.</li>\n\t<li>Yati Varshneya, director of operations excellence and engineering, Johnson Matthey</li>\n</ul>\n\n<p>Inductees were nominated by their colleagues and industry peers and selected by a judging panel of WiM&rsquo;s executive committee and leadership. The inductees were chosen based on their lifetime contributions to the advancement of women in manufacturing.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/women-in-manufacturing-presents-2025-hall-of-fame-inductees"
      }
    ],
    "link": "https://www.compositesworld.com/news/women-in-manufacturing-presents-2025-hall-of-fame-inductees"
  },
  {
    "published": "Fri, 8 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      8,
      14,
      0,
      0,
      4,
      220,
      0
    ],
    "title": "Scout Space, Dawn Aerospace complete suborbital spaceplane surveillance test flight",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Scout Space, Dawn Aerospace complete suborbital spaceplane surveillance test flight"
    },
    "summary": "First demonstration of space domain awareness (SDA) services using a rapidly deployable spaceplane like the&nbsp;composite Aurora creates promise for affordable, flexible access to&nbsp;VLEO.&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "First demonstration of space domain awareness (SDA) services using a rapidly deployable spaceplane like the&nbsp;composite Aurora creates promise for affordable, flexible access to&nbsp;VLEO.&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-auroraspace-scoutspace.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Teams surround spaceplane on runway.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-auroraspace-scoutspace.jpg;maxWidth=720\" /> </a></div>\n\n<p>Dawn Aerospace and Scout Space teams, with Scout&rsquo;s&nbsp;<em>Morning Sparrow</em> payload on board <em>Aurora</em>. Source (All Images) | Dawn Aerospace</p>\n</div>\n\n<p>As of Aug. 6,&nbsp;<a href=\"https://www.dawnaerospace.com/\" target=\"_blank\">Dawn Aerospace</a>&nbsp;(ChristChurch, New Zealand) has completed its first demonstration flight carrying a space domain awareness (SDA) payload with&nbsp;<a href=\"https://www.scout.space/\" target=\"_blank\">Scout Space</a> (Reston, Va., U.S.), a space technology firm specializing in in-space observation services, marking the first step toward&nbsp;SDA capability using a suborbital spaceplane at supersonic speeds. The flight tested integration of Scout&rsquo;s <em>Morning Sparrow</em>&nbsp;sensor suite aboard the composites-intensive <em>Aurora</em> platform, flying from a conventional runway at Tāwhaki National Aerospace Centre in New Zealand.</p>\n\n<p>This flight also marks Scout as the first commercial operator to fly on Dawn Aerospace&rsquo;s rocket-powered, high-altitude aircraft&nbsp;under a strategic partnership in which Scout will develop a tactically responsive very-low Earth orbit (VLEO) space domain awareness capability. The combination of supersonic flight testing and runway-based operations gives Scout an accelerated&nbsp;path to proving new SDA technologies that are easier, more repeatable and more affordable.</p>\n\n<p><em>Morning Sparrow</em>&nbsp;flew to a maximum altitude of 67,000 feet, and a maximum speed of Mach 1.03. In follow-on flights, <em>Morning Sparrow</em>&rsquo;s sensor suite will be used to gather data and demonstrate the sensor&rsquo;s capability to track and image VLEO objects from below &mdash; offering a responsive platform for urgent, time-sensitive intelligence-gathering and a cost-efficient alternative to conventional satellite-based SDA.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-dawn-scoutspace-flight.jpg\" target=\"_blank\"><img alt=\"Pictures of earth in very low earth orbit.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-dawn-scoutspace-flight.jpg;maxWidth=385\" /></a></div>\n\n<p><em>Aurora</em> took off from Tāwhaki National Aerospace Centre&nbsp;on July 17, 2025.</p>\n</div>\n\n<p>&ldquo;Rapidly deployable, high-performance, high-altitude platforms are notoriously few and far between,&rdquo; says&nbsp;Philip Hover-Smoot, CEO of Scout Space. <em>&ldquo;</em>Accelerating flexible access to VLEO represents a leap forward in how we think about&nbsp;taskable surveillance and space security in rapidly evolving low-orbit environments, and unlocks new options for operators looking for otherwise limited intelligence products across the increasingly important VLEO regime.<em>&rdquo;</em></p>\n\n<p>The sensor, housed in the <em>Aurora</em>&rsquo;s payload bay, was accessible up to moments before flight showcasing the ease of integration, rapid access&nbsp;and easy hardware adjustments for space-class optics into aircraft-grade environments. Shortly after <em>Aurora</em> landing back on the runway, the crew had already begun transferring flight data.</p>\n\n<div style=\"text-align: center;\"></div>\n\n<p>&ldquo;This is exactly what the<em> Aurora</em> is designed for &mdash; repeatable, tactical access to near space, supporting payloads that can&rsquo;t wait months or years for launch,&rdquo; says&nbsp;Stefan Powell, CEO of Dawn Aerospace. &ldquo;We believe spaceplanes can and will play an integral role in the future of responsive space operations by complementing traditional SDA assets.&rdquo;&nbsp;</p>\n\n<p>Scout and Dawn will continue the collaboration with a contract in place enabling Scout the option to fly <em>Sparrow</em> on <em>Aurora</em> for up to 30 flights. In parallel, Scout is developing two GEO-class Owl flight units for long-range object detection and autonomous SDA &mdash; extending its hosted-sensor heritage into full spacecraft operations.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/scout-space-dawn-aerospace-complete-suborbital-spaceplane-surveillance-test-flight"
      }
    ],
    "link": "https://www.compositesworld.com/news/scout-space-dawn-aerospace-complete-suborbital-spaceplane-surveillance-test-flight"
  },
  {
    "published": "Thu, 7 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      7,
      15,
      0,
      0,
      3,
      219,
      0
    ],
    "title": "U.S. Coast Guard MBI releases report on Titan submersible",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "U.S. Coast Guard MBI releases report on Titan submersible"
    },
    "summary": "The two-year investigation into the&nbsp;June 2023 tragedy&nbsp;that took five lives has been published, citing key findings, contributing factors to the casualty and a recommended regulatory framework to avoid future oversight.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The two-year investigation into the&nbsp;June 2023 tragedy&nbsp;that took five lives has been published, citing key findings, contributing factors to the casualty and a recommended regulatory framework to avoid future oversight."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-oceangate-titan.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-oceangate-titan.jpg;maxWidth=720\" /> </a></div>\n\n<p><em>Titan </em>atop the LARS, alongside <em>Polar Prince</em>. Source | OceanGate via &ldquo;<a href=\"https://media.defense.gov/2025/Aug/05/2003773004/-1/-1/0/SUBMERSIBLE%20TITAN%20MBI%20REPORT%20(04AUG2025).PDF\" target=\"_blank\">Report of the Marine Board of Investigation into the implosion of the submersible Titan (CG1788361) in the North Atlantic Ocean</a>...&rdquo;</p>\n</div>\n\n<p>The U.S. Coast Guard Marine Board of Investigation (MBI, Washington, D.C., U.S.) has released its&nbsp;Report of Investigation (ROI)&nbsp;on the loss of the <em>Titan</em> submersible, which imploded during a June 2023 dive to the <em>Titanic</em>, killing five people. The&nbsp;<em>Titan </em>was&nbsp;a 22-foot manned submersible with an 8-foot long carbon fiber composite pressure hull glued to titanium end sections.</p>\n\n<p>The more than&nbsp;<a href=\"https://media.defense.gov/2025/Aug/05/2003773004/-1/-1/0/SUBMERSIBLE%20TITAN%20MBI%20REPORT%20(04AUG2025).PDF\" target=\"_blank\">300-page ROI</a>&nbsp;outlines key findings and contributing factors in the casualty and includes 17 safety recommendations aimed at strengthening oversight of submersible operations, improving coordination among federal agencies and closing gaps in international maritime policy.&nbsp;</p>\n\n<p>&ldquo;This marine casualty and the loss of five lives was preventable,&rdquo; says&nbsp;Jason Neubauer, <em>Titan</em> MBI chair. &ldquo;The 2-year investigation has identified multiple contributing factors that led to this tragedy, providing&nbsp;valuable lessons learned to prevent a future occurrence. There is a need for stronger oversight and clear options for operators who are exploring new concepts outside of the existing regulatory framework. I am optimistic the ROI&rsquo;s findings and recommendations will help improve awareness of the risks and the importance of proper oversight while still providing a pathway for innovation.&rdquo;&nbsp;</p>\n\n<p>The board determined the primary contributing factors were OceanGate&rsquo;s inadequate design, certification, maintenance and inspection process for the <em>Titan</em>. Other factors cited in the report include a toxic workplace culture at OceanGate, an inadequate domestic and international regulatory framework for submersible operations and vessels of novel design, and an ineffective whistleblower process under the Seaman&rsquo;s Protection Act.&nbsp;</p>\n\n<p>The board also found OceanGate failed to properly investigate and address known hull anomalies following its 2022 <em>Titanic</em> expedition. Investigators determined the <em>Titan</em>&rsquo;s real-time monitoring system generated data that should have been analyzed and acted on during the 2022 <em>Titanic</em> expedition. However, OceanGate did not take any action related to the data, conduct any preventative maintenance or properly store the <em>Titan</em> during the extended off season before its 2023 <em>Titanic</em> expedition.&nbsp;</p>\n\n<p>MBI recommendations include restricting the Oceanographic Research Vessel designations for submersibles;&nbsp;expanding federal and international requirements to all submersibles conducting scientific or commercial dives; and requiring Coast Guard documentation for all U.S. submersibles. The board also recommended adding Coast Guard personnel capacity at Coast Guard headquarters to support new construction oversight and field inspections involving submersibles and vessels of novel design.&nbsp;</p>\n\n<p>Further recommendations include requiring operators to submit dive and emergency response plans to the local Coast Guard officer in charge, marine inspection; evaluating the Coast Guard&rsquo;s subsea search and rescue capabilities; and working with the International Maritime Organization (IMO) to define passenger submersibles and expand international safety requirements for submersibles operating on the high seas.&nbsp;The board also called for a new Occupational Safety and Health Administration and Coast Guard agreement to clarify whistleblower investigative protocols and improve interagency coordination.&nbsp;</p>\n\n<p>The Marine Board&rsquo;s report is now under review by the Commandant of the Coast Guard. Upon completion of the review, the Commandant will issue a Final Action Memorandum confirming the U.S. Coast Guard&rsquo;s position on the recommendations and any actions to be pursued. &nbsp;</p>\n\n<p>The complete Marine Board report can be <a href=\"https://media.defense.gov/2025/Aug/05/2003773004/-1/-1/0/SUBMERSIBLE%20TITAN%20MBI%20REPORT%20(04AUG2025).PDF\" target=\"_blank\">downloaded here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/us-coast-guard-mbi-releases-report-on-titan-submersible"
      }
    ],
    "link": "https://www.compositesworld.com/news/us-coast-guard-mbi-releases-report-on-titan-submersible"
  },
  {
    "published": "Thu, 7 Aug 2025 06:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      7,
      10,
      0,
      0,
      3,
      219,
      0
    ],
    "title": "Exel GFRP tubes improve QHeat geothermal energy storage",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Exel GFRP tubes improve QHeat geothermal energy storage"
    },
    "summary": "Installation&nbsp;of pultruded composite underground collector pipes have greatly enhanced the energy efficiency of Qheat&rsquo;s geothermal wells.&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Installation&nbsp;of pultruded composite underground collector pipes have greatly enhanced the energy efficiency of Qheat&rsquo;s geothermal wells.&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-exel-qheat-lounavoima-geothermal-plant.jpg\" target=\"_blank\"><img alt=\"Lounavoima geothermal plant with GFRP pipes on the ground.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-exel-qheat-lounavoima-geothermal-plant.jpg;maxWidth=385\" /></a></div>\n\n<p>Lounavoima geothermal plant. Source | Exel Composites, QHeat</p>\n</div>\n\n<p>Global composites manufacturer <a href=\"https://www.compositesworld.com/suppliers/exel-composites-plc\" target=\"_blank\">Exel Composites</a> (Vantaa, Finland) has completed an R&amp;D project with geothermal technology expert <a href=\"https://www.qheat.com/\" target=\"_blank\">QHeat</a> (Helsinki, Finland) to provide composite tubes to store excess heat energy at the Lounavoima waste incineration plant in Salo, Finland. Simulations suggest the glass fiber-reinforced polymer (GFRP) tubes enable plant operators to store 14 gigawatt-hours&nbsp;of heat in underground wells 2 kilometers down in the granite bedrock.</p>\n\n<p>Prior to installing a heat storage system, the Lounavoima plant released its excess heat into the air during the summer. When ambient temperatures fell to -20&deg;C in the Finnish winter, its emissions increased because of the supplementary oil burners needed to supply heat at peak times. The energy saved by improving the plant&rsquo;s storage efficiency equates to the heating requirements of 700 detached houses per year.</p>\n\n<p>&ldquo;Sixty percent&nbsp;of all EU heat production comes from fossil fuels, and the remaining 40%&nbsp;is still mostly combustion, like natural gas or waste incineration,&rdquo; explains Erika Salmenvaara, CEO at QHeat. &ldquo;In the context that half of global energy use is for heating, we see the environmental gains that electrification of heating can provide.</p>\n\n<p>&ldquo;It&rsquo;s not perfect,&rdquo; she continues. &ldquo;Electrification of heating puts significant strain on the world&rsquo;s aging power transmission infrastructure, but innovative engineering can help there too. Grid-enhancing technologies are advancing rapidly and, besides, heat pumps deliver up to 60% more energy efficiency than using electricity directly.&rdquo;</p>\n\n<p>Exel Composites&rsquo; R&amp;D department worked closely with QHeat&rsquo;s engineers to tailor the composite tubes to the job&rsquo;s specific environmental and performance requirements. The two teams went through several iterations, optimizing for sizing, connection method, and thermal insulation versus mechanical strength trade-offs.</p>\n\n<p>GFRP is well-suited to the pressure and temperature involved with underground applications. The insulating capacity was a great focus for the partnership, ensuring energy efficiency in heat transfer is as high as possible.</p>\n\n<p>&ldquo;Heat preservation combined with the right mechanical performance was the biggest criterion to satisfy with these pipes,&rdquo; says&nbsp;Tiina Uotila, technical sales manager at Exel Composites. &ldquo;However, we collaborated with QHeat to understand how we could make them easier to assemble and install, and to make sure that we have a defined, sustainable end-of-life route. Instead of going to landfill, these pipes will be co-processed into cement, where the reinforcement replaces raw materials and matrix replaces fuels.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/exel-gfrp-tubes-improve-qheat-geothermal-energy-storage"
      }
    ],
    "link": "https://www.compositesworld.com/news/exel-gfrp-tubes-improve-qheat-geothermal-energy-storage"
  },
  {
    "published": "Wed, 6 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      6,
      17,
      0,
      0,
      2,
      218,
      0
    ],
    "title": "Anemoi wins U.K. funding to advance CFRP rotor sail designs",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Anemoi wins U.K. funding to advance CFRP rotor sail designs"
    },
    "summary": "Seven-month project will develop&nbsp;folding sail systems for Anemoi&rsquo;s 3.5-meter-diameter&nbsp;rotor sail, and&nbsp;cover additional design optimizations that are expected to improve the aerodynamic performance of wind-assisted vessels.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Seven-month project will develop&nbsp;folding sail systems for Anemoi&rsquo;s 3.5-meter-diameter&nbsp;rotor sail, and&nbsp;cover additional design optimizations that are expected to improve the aerodynamic performance of wind-assisted vessels."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-anemoi-5-meter-diameter-folding-rotorsails.png\" target=\"_blank\"><img alt=\"Five-meter-diameter folding rotor sails.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-anemoi-5-meter-diameter-folding-rotorsails.png;maxWidth=385\" /></a></div>\n\n<p>Anemoi&rsquo;s production base of existing 5-meter-diameter folding rotor sails. U.K. CMDC funding will be used to develop the folding system for Anemoi&rsquo;s smaller, 3.5-meter-diameter versions. Source | Anemoi</p>\n</div>\n\n<p><a href=\"https://anemoimarine.com/\" target=\"_blank\">Anemoi Marine Technologies</a>&nbsp;(London, U.K.), a company developing carbon fiber-reinforced polymer (CFRP) maritime rotor sails,&nbsp;has won funding under the sixth round of the Clean Maritime Demonstration Competition (CMDC). The &pound;1.2 million project will include the development of a next-generation folding sail system tailored to Kamsarmax and Panamax&nbsp;cargo bulk carriers, as well as aerodynamic design enhancements that will significantly increase fuel savings.</p>\n\n<p>The U.K. CMDC&nbsp;has so far directed &pound;136 million in government funding to engineering innovators developing cutting-edge maritime decarbonization solutions, with the aim of driving growth for coastal communities and cementing the U.K.&rsquo;s as a clean energy leader. The CMDC funding gives Anemoi the opportunity to further strengthen its technology leadership in the rapidly growing wind-assisted propulsion sector.</p>\n\n<blockquote>\n<p>For more information, read &ldquo;<a href=\"https://www.compositesworld.com/news/anemoi-installs-composite-rotor-sails-on-sohar-max-maritime-vessel\">Anemoi&nbsp;installs 35-meter-tall composite rotor sails on Sohar Max maritime vessel</a>&rdquo;</p>\n</blockquote>\n\n<p>&ldquo;While our rotor sails are already efficient and high-performing, ongoing innovation is essential to unlock further efficiency gains, adapt to evolving vessel designs&nbsp;and meet increasingly ambitious environmental targets,&rdquo; says Clare Urmston, CEO of Anemoi. &ldquo;This investment underscores Anemoi&rsquo;s potential to support the U.K. in sustainable shipping as the maritime industry works to cut emissions.&rdquo;</p>\n\n<p>Under the 7-month project, Anemoi will design, build and test a prototype of a novel&nbsp;folding system for its 3.5-meter&nbsp;rotor sail. The result will reportedly be an &ldquo;industry first&rdquo; for rotor sails of this size, as folding systems have previously only been used on larger 5-meter&nbsp;sails. By enabling sails to be lowered during port operations, the design has the potential to&nbsp;significantly reduce operational obstacles to the uptake of wind-assisted propulsion. Operational seamlessness is a core element of Anemoi&rsquo;s offering, as the company also offers a rail deployment system, which allows the rotor sails to move along the deck of the ship.</p>\n\n<p>In addition to folding system development, the project will cover additional design optimizations, which are expected to improve the aerodynamic performance of wind-assisted vessels, delivering increased fuel savings and emissions reductions compared to Anemoi&rsquo;s current state-of-the-art rotor sails.</p>\n\n<p>The test rig will be manufactured by U.K. company Pressure Design Hydraulics Engineers, with aerodynamic enhancements developed in partnership with Cape Horn Engineering, supported by Stehr Consulting. Victoria Steamship, a U.K.-based shipbroker, will contribute insights based on its fleet of nine vessels operating globally in the bulk carrier segment, a primary market for folding rotor sails. U.K. innovation accelerator Connected Places Catapult will conduct market research and a port and vessel integration study.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/anemoi-wins-uk-funding-to-advance-cfrp-rotor-sail-designs"
      }
    ],
    "link": "https://www.compositesworld.com/news/anemoi-wins-uk-funding-to-advance-cfrp-rotor-sail-designs"
  },
  {
    "published": "Wed, 6 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      6,
      16,
      0,
      0,
      2,
      218,
      0
    ],
    "title": "CRG Defense secures $2 million contract to build hybrid military vehicle electric motors/generators",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CRG Defense secures $2 million contract to build hybrid military vehicle electric motors/generators"
    },
    "summary": "The effort also supports&nbsp;a broader initiative to accelerate hybrid-electric propulsion technologies to&nbsp;ground and air platforms, leveraging FRP structures and composite-based magnetic retention systems.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The effort also supports&nbsp;a broader initiative to accelerate hybrid-electric propulsion technologies to&nbsp;ground and air platforms, leveraging FRP structures and composite-based magnetic retention systems."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-crg-defense.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Soldier inserts battery into tactical resupply vehicle.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-crg-defense.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | U.S. Army, Sgt. Alison Strout</p>\n</div>\n\n<p><a href=\"https://www.crgdefense.com\" target=\"_blank\">CRG Defense</a>&nbsp;(previously Cornerstone Research Group, Miamisburg, Ohio, U.S.), has secured a $2 million U.S. Army contract to design and prototype a lightweight electric motor/generator system for hybrid-electric military vehicles. The effort supports a broader $17.25 million initiative to accelerate hybrid-electric propulsion technologies for next-generation ground and air platforms.</p>\n\n<p>Under the contract, CRG Defense will develop a 50-kilowatt-class permanent magnet machine optimized for high-voltage (400-800 volt) military systems. The system will be designed, sourced&nbsp;and manufactured entirely in the U.S.</p>\n\n<p>To achieve an aerospace-grade electric machine capability tailored to high torque, speed&nbsp;and packaging demands,&nbsp;the company told <em>CW</em> that it is leveraging advanced composite methods including:</p>\n\n<ul>\n\t<li>High-rate compression molded composites for efficient, scalable production</li>\n\t<li>Fiber-reinforced polymer (FRP) structures to reduce weight while maintaining durability</li>\n\t<li>Composite-based magnetic retention systems to secure permanent magnets in high-speed rotors, where the machine topology calls for it.</li>\n</ul>\n\n<p>&ldquo;This is a clean sheet design tailored to meet Army mission needs,&rdquo; says&nbsp;Jake Monat, vice president of innovation at CRG Defense. &ldquo;We&rsquo;re building domestic capacity for power-dense electric machines that begin with defense applications and scale into commercial opportunities.&rdquo;</p>\n\n<p>According to CRG Defense, few U.S. suppliers currently offer high-voltage, high-power electric motors suitable for military use. Most are either foreign-made or designed for low-voltage systems. &ldquo;This investment helps fill a critical industrial gap,&rdquo; notes&nbsp;Chris Hemmelgarn, CTO. &ldquo;We&rsquo;re looking to partner with system integrators and OEMs that need custom-built, U.S.-made electric machines for air, land&nbsp;or maritime platforms.&rdquo;</p>\n\n<p>CRG Defense brings nearly three decades of experience developing integrated power and propulsion systems, including batteries, power electronics, controls&nbsp;and ducted fan technologies. This project builds on that foundation to deliver scalable, mission-ready solutions.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/crg-defense-secures-2-million-contract-to-build-hybrid-military-vehicle-electric-motorsgenerators"
      }
    ],
    "link": "https://www.compositesworld.com/news/crg-defense-secures-2-million-contract-to-build-hybrid-military-vehicle-electric-motorsgenerators"
  },
  {
    "published": "Wed, 6 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      6,
      15,
      0,
      0,
      2,
      218,
      0
    ],
    "title": "SGL Carbon manufactures natural fiber prepregs for motorsports",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SGL Carbon manufactures natural fiber prepregs for motorsports"
    },
    "summary": "SGL Carbon supplied prepreg&nbsp;materials made from Bcomp flax fiber fabric to Japanese company Tras Ltd. for the&nbsp;Toyota Hilux&rsquo;s natural fiber body.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "SGL Carbon supplied prepreg&nbsp;materials made from Bcomp flax fiber fabric to Japanese company Tras Ltd. for the&nbsp;Toyota Hilux&rsquo;s natural fiber body."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-sglcarbon-prepregs-motorsports.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Toyota Hilux with natural fiber body.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-sglcarbon-prepregs-motorsports.jpg;maxWidth=720\" /> </a></div>\n\n<p>Toyota Hilux. Source | SGL Carbon</p>\n</div>\n\n<p>In early July 2025, <a href=\"https://www.tras.co.jp/en/company\" target=\"_blank\">Tras Ltd.</a>&nbsp;(Mishima City), a Japan-based composites company, unveiled a natural fiber body for the Toyota <em>Hilux</em>, which will compete in the Asia Cross Country Rally in Thailand from August 8-16. <a href=\"https://www.compositesworld.com/suppliers/sgl-carbon-se\" target=\"_blank\">SGL Carbon</a> (Wiesbaden, Germany), supplied the flax fiber prepreg materials for the car&rsquo;s body.</p>\n\n<p>SGL Carbon says it has been involved in developing prepregs and components made from natural fibers, such as flax, for several years. The ampliTex natural fiber fabric is manufactured by <a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a> (Fribourg, Switzerland) &mdash; with which SGL has collaborated on various projects for some time&nbsp;&mdash; followed by&nbsp;pre-impregnation&nbsp;at SGL&rsquo;s&nbsp;site in Willich, Germany.</p>\n\n<p>&ldquo;A major challenge was the comparatively high moisture absorption of the flax fibers,&rdquo; explains Dr. Thomas Meinhardt, team lead technical marketing prepregs at SGL Carbon. &ldquo;We therefore used a special transparent, fast-curing resin system that has proven particularly resistant to, and is tolerant of, the high moisture content of natural fibers. This ensures an attractive component appearance,&nbsp;as well as&nbsp;good mechanical and thermal properties of the composite material, [all of] which are particularly important in motorsports.&rdquo;</p>\n\n<p>The finished prepregs were then processed into the final components by Tras. The company specializes in manufacturing, testing&nbsp;and demonstrating car bodies made from natural fibers. &ldquo;The use of the [SGL&rsquo;s] resin system was an important improvement for us, as we often face very high humidity in Asia, yet the components must still meet the rigorous demands of racing. With this natural car body, we now have a lightweight, sustainable component that looks great, too,&rdquo; says Masanao Nitta, CEO of Tras Ltd.</p>\n\n<p>Components made from Bcomp's flax fiber technologies offer up to 85% lower CO<sub>2</sub>&nbsp;footprint from cradle to gate compared to pure carbon fiber parts, thanks to the use of renewable raw materials and the possibility of end-of-life thermal energy recovery.</p>\n\n<p>Additionally, every gram of weight counts, especially in motorsports. In combination with Bcomp&rsquo;s powerRibs&nbsp;reinforcement grid, similar stiffness and weight as virgin carbon fiber components can be achieved. Furthermore, the natural fiber components perform well in crash tests and provide very good vibration damping, making them useful for demanding motorsport applications.</p>\n\n<p>Toyota subsidiary Toyota Customizing &amp; Development (TCD)&nbsp;and its brands TRD and Modellista, which specialize in converting vehicles into sports and special models, also expressed considerable interest in the project. Due to the high quality of the product, natural fibers may be used in future developments.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/sgl-carbon-manufactures-natural-fiber-prepregs-for-motorsports"
      }
    ],
    "link": "https://www.compositesworld.com/news/sgl-carbon-manufactures-natural-fiber-prepregs-for-motorsports"
  }
]