[
  {
    "published": "Wed, 12 Nov 2025 14:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      12,
      19,
      0,
      0,
      2,
      316,
      0
    ],
    "title": "ACMA’s first Composites Evolution event addresses technologies, policies and business strategies",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ACMA’s first Composites Evolution event addresses technologies, policies and business strategies"
    },
    "summary": "Two-day program held in October connected&nbsp;composites manufacturing innovation, policy and performance to help companies future-proof their operations.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Two-day program held in October connected&nbsp;composites manufacturing innovation, policy and performance to help companies future-proof their operations."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-acma-compositesevolution-event.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Plant tour at ACMA event.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-acma-compositesevolution-event.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | ACMA</p>\n</div>\n\n<p>The <a href=\"https://www.compositesworld.com/suppliers/acma-american-composites-manufacturers-association\" target=\"_blank\">American Composites Manufacturers Association</a> (ACMA, Arlington, Va., U.S.) hosted its first-ever Composites Evolution event Oct.&nbsp;22&ndash;23, 2025, in Knoxville, Tennessee. The 2-day program brought together more than 80 participants including innovators, manufacturers&nbsp;and suppliers from across the composites value chain to explore the technologies, policies&nbsp;and business strategies redefining the future of composites manufacturing.</p>\n\n<p>From discussions on regulation and automation to strategies for tax optimization and operational efficiency, Composites Evolution delivered actionable insights and collaboration across the entire industry. Attendees heard from industry experts and tax professionals on how evolving regulations, market forces&nbsp;and clean technology incentives are reshaping how composites are produced, applied&nbsp;and valued.</p>\n\n<p>&ldquo;This event represented more than just an exchange of ideas, but a collective commitment to ensuring that composites remain at the forefront of sustainable, high-performance manufacturing,&rdquo; says&nbsp;Cindy L. Squires Esq., president and&nbsp;CEO of ACMA. &ldquo;By connecting innovation, policy and performance, we&rsquo;re helping companies future-proof their operations and stay globally competitive.&rdquo;</p>\n\n<p>Following more than 2&nbsp;years of dedicated advocacy by ACMA staff and members, recent Congressional legislation has opened new opportunities for composite manufacturers to leverage tax incentives, enhance sustainability and strengthen workforce retention. Composites Evolution provided participants with the knowledge and tools to take advantage of these developments immediately &mdash; whether through material innovation, process automation&nbsp;or compliance strategies.</p>\n\n<p>Throughout the event, participants engaged in:</p>\n\n<ul>\n\t<li>Material and&nbsp;process innovation sessions showcasing next-gen composites and automation tools that improve sustainability, quality and speed.</li>\n\t<li>Policy and regulatory guidance discussions on how EPA&rsquo;s evolving styrene rules will impact manufacturers &mdash; and how ACMA is advocating for science-based, business-friendly solutions.</li>\n\t<li>Hands-on learning and live demos featuring advanced technologies and local site tours that brought process improvements to life.</li>\n\t<li>Strategic networking that connected executives, engineers, suppliers&nbsp;and EH&amp;S experts driving change across the industry.</li>\n</ul>\n\n<p>Participants left this event with insight on reducing taxes and regulatory risk, improving throughput and product quality, and improving worker safety and retention.</p>\n\n<p>ACMA extends a sincere thank you to all exhibitors and speakers that participated in this event as well as our event sponsors, Superior and Rheo AI, for their generous support. ACMA also thanks Magnum Venus Products (MVP), the University of Tennessee Research Park at Cherokee Farm&nbsp;and Oak Ridge National Laboratory (ORNL) for opening their facilities and hosting attendees for engaging&nbsp;behind-the-scenes tours.</p>\n\n<p>&nbsp;ACMA will continue building on the success of its inaugural Composites Evolution through upcoming advocacy efforts, educational programs&nbsp;and industry events, including the 2026 Composites Fly-In and <a href=\"https://d2v-g604.na1.hubspotlinks.com/Ctc/W+113/d2v-g604/VWC12j5L1mcKW3sHlnX8J7NTFW5JQdxX5FyTXkN28qGwC3m2nnW7lCdLW6lZ3lrW97bpbG2Z0WKGVX7-r91x-6xzW2MRNtT19Qy3RW2ycrMV59H0TyW3sLpPw2V8KL8N1Xn0Bx9SKl1W6KQMbS1-hl8lW78TGyl6wghZmW7YyGC53FnW8vW2s9W3K2f7hnTW2R7gkb12x96cW7f587n8vvN9TN4XJFd4tKYXCW7phy3_1SxvHyW1JLHzq1JjsWbW3TpdFz6GPCj4W73nKQf4HrsYrW5yWXy-2fB7_TW6wDYKt5P9vClW2RpXBZ4GWdqJW9f0H6H7SSJ2dW1f6Gty1C-qlLVBJGJJ7qCTSxW1pxpQf4MmDsVdVpbWj04\" target=\"_blank\">Thermoplastic Composites Conference</a>.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/acmas-first-composites-evolution-event-addresses-technologies-policies-and-business-strategies"
      }
    ],
    "link": "https://www.compositesworld.com/news/acmas-first-composites-evolution-event-addresses-technologies-policies-and-business-strategies"
  },
  {
    "published": "Wed, 12 Nov 2025 13:00:15 -0500",
    "published_parsed": [
      2025,
      11,
      12,
      18,
      0,
      15,
      2,
      316,
      0
    ],
    "title": "Composite morphing wing advances intelligent, gap-free, step-free movement for greater efficiency",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composite morphing wing advances intelligent, gap-free, step-free movement for greater efficiency"
    },
    "summary": "Within the morphAIR project, the DLR Institute for Lightweight Construction has completed ground testing and finalized the first HyTEM morphing wing as it prepares for flight test on its PROTEUS unmanned aircraft.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Within the morphAIR project, the DLR Institute for Lightweight Construction has completed ground testing and finalized the first HyTEM morphing wing as it prepares for flight test on its PROTEUS unmanned aircraft."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-dlr-hytem-morphing-wing.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-dlr-hytem-morphing-wing.jpg;maxWidth=720\" /> </a></div>\n\n<p>Rendering of HyTEM&nbsp;morphing composite wing design being tested on DLR&rsquo;s PROTEUS unmanned vehicle. Source | DLR, CC&nbsp;BY-NC-ND 3.0</p>\n</div>\n\n<p>The <a href=\"https://www.dlr.de/en/sy\" target=\"_blank\">German Aerospace Center (DLR) Institute of&nbsp;Lightweight Systems</a>&nbsp;(Braunschweig, Germany) is preparing to flight test a&nbsp;morphing composite wing based on a novel trailing edge design developed in the Hyperelastic Trailing Edge Morphing (HyTEM) project.</p>\n\n<p>The HyTEM concept enables gap-free and step-free movement of the wing edge, enabling the wing to change its shape without creating visible transitions &ndash; a major advantage for aerodynamics. It was developed as part of the interdisciplinary research project &quot;Morphing Technologies &amp; Artificial Intelligence Research Group&quot; (<a href=\"https://www.dlr.de/en/uc/research-and-transfer/projects-and-missions/morphair\" target=\"_blank\">morphAIR</a>), which aims to demonstrate a novel wing concept designed to improve aircraft efficiency and control.</p>\n\n<p>&ldquo;Using 10 strategically placed actuators distributed across each wing half-span, we can achieve unprecedented shape adaptation and control of a fully composite wing structure,&rdquo; says Martin Radestock, project manager at DLR. &ldquo;Imagine a trailing edge that can be precisely controlled to optimize lift, drag and roll rates, all while the wing remains fully closed. Additionally, the adaptability of the design can enhance aircraft safety, as the control surface functionalities can be distributed across the entire wing to mitigate actuator malfunctions.&rdquo; The video below demonstrates a sinusoidal deflection of a trailing edge segment, spanning 0.5 meters, with five distinct control positions.</p>\n\n<div></div>\n\n<h3><strong>Ground and flight tests</strong></h3>\n\n<p>Both the conventional reference wing and the HyTEM morphing wing are made entirely of lightweight fiber-reinforced composites. DLR completed ground testing and initial flight tests on the reference wing earlier in 2025. &ldquo;These flights provided valuable data for comparison and validated our baseline setup,&rdquo; notes Radestock. Building on that momentum, the first morphing wing has now been fabricated, successfully integrated into the avionics of the unmanned test vehicle PROTEUS and all functionality tests have been completed, confirming the system&rsquo;s integrity and the interaction of the morphing mechanisms with the flight control system.</p>\n\n<p>Although morphing technologies have been studied in extensive ground and wind tunnel tests at the subsystem level over the last decade, important top-level measurements such as fuel consumption and changes in flight characteristics are missing and can only be determined through flight tests. In addition, the combination of artificial intelligence (AI)-based control with morphing technologies offers great potential for improvements in flight control and performance.</p>\n\n<p>PROTEUS has now been equipped with both the conventional and morphing wing and the upcoming flight test campaign will test the HyTEM concept in real flight conditions at the DLR Test Center for Unmanned Aircraft Systems (Nationales Erprobungszentrum f&uuml;r Unbemannte Luftfahrtsysteme) in Cochstedt, Germany.</p>\n\n<p>&ldquo;We look forward to sharing the results,&rdquo; says Radestock, &ldquo;and to pushing the boundaries of what wings can do.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/composite-morphing-wing-advances-intelligent-gap-free-step-free-movement-for-greater-efficiency"
      }
    ],
    "link": "https://www.compositesworld.com/news/composite-morphing-wing-advances-intelligent-gap-free-step-free-movement-for-greater-efficiency"
  },
  {
    "published": "Wed, 12 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      12,
      18,
      0,
      0,
      2,
      316,
      0
    ],
    "title": "Nabrawind celebrates 10 years of wind technology dedication",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Nabrawind celebrates 10 years of wind technology dedication"
    },
    "summary": "The Spanish-based company enters a phase of exponential growth driven by the large-scale implementation of its wind turbine-supporting products.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Spanish-based company enters a phase of exponential growth driven by the large-scale implementation of its wind turbine-supporting products."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-nabrawind-nabrajoint.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Nabrajoint.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-nabrawind-nabrajoint.png;maxWidth=720\" /> </a></div>\n\n<p>Nabrajoint technology. Source (All Images) | Nabrawind</p>\n</div>\n\n<p><a href=\"https://www.nabrawind.com\" target=\"_blank\">Nabrawind</a> (Pamplona, Spain),&nbsp;dedicated to the design, development, manufacturing and commercialization of advanced wind technologies for wind turbine components, celebrates its&nbsp;10<sup>th</sup> anniversary, coinciding with a recent shareholding restructuring that&nbsp;positions the company to face a new phase of expansion with confidence.</p>\n\n<p>The wind energy company expects to close its 10<sup>th</sup>&nbsp;year of operations with revenues exceeding &euro;20 million &mdash; a figure set to continue growing in the coming years as a result of the first large-scale orders for its products.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>Nabrawind focuses on creating products for blades and towers that address the logistical challenges of next-generation wind turbines, reduce the cost of energy and minimize their carbon footprint.</p>\n\n<p>Currently, the company offers several solutions:</p>\n\n<ul>\n\t<li>Nabralift &mdash; Consists on a three-column framed structure installed under the uppermost part of a WTG tubular tower and integrates a self-erection system (SES) that enables the installation of a full WTG (tower, nacelle, rotor) without using large-size cranes regardless of the final hub-height.&nbsp;</li>\n\t<li>Skylift &mdash; A&nbsp;craneless wind turbine installation system tht is&nbsp;compatible with any kind of standard wind turbine.</li>\n\t<li>Nabrabase &mdash; An elevated wind tower foundation consisting of a tripod installed under the tubular tower, resulting in a hybrid support structure.&nbsp;</li>\n\t<li>BladeRunner &mdash; A&nbsp;blade&rsquo;s maintenance and installation system. The system is&nbsp;connected directly to the blade root inserts&nbsp;or T-Bolts, which avoids applying force on its aerodynamic surface.</li>\n\t<li>Nabrajoint &mdash; Segmented blade solution with optimal load carrying capacity.</li>\n</ul>\n</div>\n</div>\n\n<p>To reach this point, Nabrawind has successfully evolved from a small R&amp;D company into a manufacturer of wind components. Its journey began in late 2015 with a strong initial investment in R&amp;D to certify the <a href=\"https://www.compositesworld.com/news/nabrawind-announces-oem-order-for-jointed-blade\" target=\"_blank\">Nabrajoint modular blade</a>&nbsp;and the company&rsquo;s Nabralift self-erecting towers.&nbsp;This initial stage culminated with the construction of full-scale prototypes, such as the Nabralift tower installed in Eslava (Navarre) in September 2018.</p>\n\n<p>Between 2019 and 2022, Nabrawind entered its commercialization phase, installing commercial prototypes of Nabralift in Morocco (reported to be the tallest tower in Africa), Nabrabase in Namibia and France, and BladeRunner in France, Spain&nbsp;and Morocco. To strengthen this growth stage, Nabrawind established Navassy in late 2020 in collaboration with fellow Navarre-based companies Comansa and Tetrace.</p>\n\n<p>More recently, between 2023 and 2025, Nabrawind certified its&nbsp;new family of Nabrabase and Nabralift towers for use with turbines up to 8 megawatts (MW), while successfully introducing BladeRunner into new markets such as the U.S.&nbsp;and Mexico.</p>\n\n<p>Currently, Nabrawind is installing seven Skylift self-erecting towers in Namibia, while simultaneously completing in China the installation of a 188-meter&nbsp;Nabralift tower designed for a 7.8-MW turbine with a 182-meter&nbsp;rotor. This same tower and turbine model will be installed in what will become the first large-scale wind farm to incorporate Nabralift towers &mdash; a project scheduled for installation in 2026.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-nabrawind-bladerunner.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Nabrawind BladeRunner.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-nabrawind-bladerunner.png;maxWidth=720\" /> </a></div>\n\n<p>Nabrawind BladeRunner.</p>\n</div>\n\n<p>In parallel, 2025 has marked the beginning of large-scale manufacturing of BladeRunners for clients with extensive fleets of wind turbines across the globe. As a result, the large-scale deployment of BladeRunner will begin in 2026&nbsp;in several countries across Latin America and Europe.</p>\n\n<p>Over the years, this growth in business volume has been accompanied by an increase in Nabrawind&rsquo;s workforce. The company started in 2015 with a team of seven people and has since grown to 68 direct employees and around 20 regular collaborators. Notably, one-third of its staff are women, and more than 50% are graduates of the Public University of Navarre (UPNA), reflecting Nabrawind&rsquo;s commitment to gender equality, local development&nbsp;and an inherently international outlook.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/nabrawind-celebrates-10-years-of-wind-technology-dedication"
      }
    ],
    "link": "https://www.compositesworld.com/news/nabrawind-celebrates-10-years-of-wind-technology-dedication"
  },
  {
    "published": "Wed, 12 Nov 2025 12:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      12,
      17,
      30,
      0,
      2,
      316,
      0
    ],
    "title": "ZeroAvia, Hybrid Air Vehicles to collaborate on hydrogen-electric Airlander",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ZeroAvia, Hybrid Air Vehicles to collaborate on hydrogen-electric Airlander"
    },
    "summary": "The companies will explore equipping a variant of the&nbsp;Airlander 10&nbsp;hybrid aircraft with ZeroAvia&rsquo;s hydrogen-electric ZA600 powertrains to enable zero-emissions flight.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The companies will explore equipping a variant of the&nbsp;Airlander 10&nbsp;hybrid aircraft with ZeroAvia&rsquo;s hydrogen-electric ZA600 powertrains to enable zero-emissions flight."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-zeroavia-hav-collab-higherres1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airlander 10 airship\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-zeroavia-hav-collab-higherres1.png;maxWidth=720\" /> </a></div>\n\n<p>Source | ZeroAvia, Hybrid Air Vehicles</p>\n</div>\n</div>\n\n<p><a href=\"https://www.zeroavia.com/\" target=\"_blank\">ZeroAvia</a>&nbsp;(Hollister, Calif., U.S. and Kemble, U.K.)&nbsp;and&nbsp;<a href=\"https://www.hybridairvehicles.com/\" target=\"_blank\">Hybrid Air Vehicles</a>&nbsp;(HAV, Bedford, U.K.) have signed a Memorandum of Understanding (MoU) to partner on the development of a hydrogen-electric variant of HAV&rsquo;s&nbsp;<em>Airlander 10.</em></p>\n\n<p><em>Airlander 10</em> is a hybrid aircraft that uses a combination of aerostatic lift, aerodynamic lift&nbsp;and vectored thrust, with a 10-ton payload and 4,000 nautical mile maximum range. The initial <em>Airlander 10</em> will be powered by four diesel engines, providing an emissions reduction of up to 90% when compared with comparable capacity aircraft. Integrating ZeroAvia&rsquo;s hydrogen-electric propulsion will deliver full zero-emission in-flight operations carrying 100+ passengers, as well as reduced maintenance costs.</p>\n\n<p>ZeroAvia reports that its first generation 600-kilowatt hydrogen-electric powertrain,&nbsp;ZA600, has already passed several regulatory milestones, secured hundreds of pre-orders and signed up launch customer airlines who are working to embed the system into more traditional fixed-wing aircraft for lower cost and more environmentally friendly flight. The company has conducted flight testing of a prototype on board a 19-seat aircraft.</p>\n\n<p>HAV says that&nbsp;<em>Airlander 10&nbsp;</em>has ample space for hydrogen storage in its hull, making it an ideal option for adopting the first generation of certified hydrogen technologies that are already close to market entry &mdash; such as hydrogen storage, low-temperature PEM fuel cell power generation&nbsp;and electric propulsion systems that are well advanced toward&nbsp;certification. This partnership will build on HAV&rsquo;s earlier R&amp;D work to explore electric propulsion for&nbsp;<em>Airlander</em>.</p>\n\n<p>As part of the agreement, the companies will also study the potential applicability of ZeroAvia&rsquo;s hydrogen-electric technology to future larger aircraft developed by HAV, and assess planned <em>Airlander 10 </em>operations to define the hydrogen fuel infrastructure requirements.</p>\n\n<p>&ldquo;ZeroAvia has led the development of hydrogen-electric propulsion systems and made impressive progress commercially, technically and with regulators,&rdquo; says Tom Grundy, CEO of HAV. &ldquo;Our intention has always been to offer our customers a fully zero-emission variant of the <em>Airlander</em>, for efficiency and environmental reasons, and this partnership with ZeroAvia will help us in this direction.&rdquo;&nbsp;</p>\n\n<p>&ldquo;<em>Airlander </em>is another exciting airframe for line-fit of our powertrains as it can open up a whole new market in air travel due to its range, efficiency and ability to operate from almost anywhere,&rdquo; says Val Miftakhov, founder and CEO of ZeroAvia. &ldquo;Like ZeroAvia, HAV&nbsp;is an aerospace innovator with exciting manufacturing and growth plans for the U.K. that can deliver hundreds of well-paid jobs in different regions in the U.K. These are two businesses expanding U.K. footprints and manufacturing plans, with a broad array of strong use cases, including in the defense arena.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/zeroavia-hybrid-air-vehicles-to-collaborate-on-hydrogen-electric-airlander"
      }
    ],
    "link": "https://www.compositesworld.com/news/zeroavia-hybrid-air-vehicles-to-collaborate-on-hydrogen-electric-airlander"
  },
  {
    "published": "Wed, 12 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      12,
      17,
      0,
      0,
      2,
      316,
      0
    ],
    "title": "AURA AERO opens U.S. headquarters, first production line at Embry Riddle",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AURA AERO opens U.S. headquarters, first production line at Embry Riddle"
    },
    "summary": "Hybrid-electric regional aircraft company aims open a second Florida site in 2028.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Hybrid-electric regional aircraft company aims open a second Florida site in 2028."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-aura-aero-production.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"AURA AERO opens first production line in Florida\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-aura-aero-production.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | AURA AERO</p>\n</div>\n\n<p>Aircraft manufacturer <a href=\"https://www.aura-aero.com/en\" target=\"_blank\">AURA AERO</a> (Toulouse, France) has cut the ribbon on an 11,000 square-foot facility at Embry‑Riddle Aeronautical University&rsquo;s Research Park in Daytona, Florida, which will serve as its U.S. headquarters and first production site. The campus will host the North American Delivery and Customer Support Center for the company&rsquo;s INTEGRAL aircraft program and lay the groundwork for the its hybrid-electric ERA aircraft.</p>\n\n<h3>INTEGRAL wood-composite trainer</h3>\n\n<p>The initial production line will build the INTEGRAL family of two-seater, aerobatic-capable training aircraft, which features a hybrid wood and carbon fiber-reinforced composite construction.&nbsp;Since 2017,&nbsp;<a href=\"https://www.air-menuiserie.com/en/\" target=\"_blank\">Air Menuiserie</a> (Saint-Vincent-Du-Boulay, France)&nbsp;has been a key partner in the development and construction of the INTEGRAL aircraft, and is applying&nbsp;its decades of wood-carbon composites expertise to the model&rsquo;s performance and safety. INTEGRAL will be offered first with a Lycoming piston engine and subsequently in a 100% electric version.</p>\n\n<p>The U.S. is&nbsp;a major market for INTEGRAL, being&nbsp;the largest training market in the world, with nearly 600 FAA-approved flight&nbsp;schools, more than 75,000 pilots and a growing demand for modern, cost-effective training aircraft with aerobatic capabilities.</p>\n\n<p>Recently certified by the European Union Aviation Safety Agency (EASA) and with FAA certification underway, the INTEGRAL family offers an advanced, efficient solution for both traditional and electric flight training, making it a strong contender in the U.S. market.</p>\n\n<h3>Electric Regional Aircraft (ERA) in 2028</h3>\n\n<p>In 2028, AURA AERO plans to open a 500,000 square-foot assembly line for its 19-seater ERA aircraft and intends to be the world&rsquo;s ﬁrst&nbsp;hybrid-electric regional aircraft manufacturer, operating assembly lines in France and the U.S. The aircraft was conceived to use a metal fuselage and carbon fiber composite wing.</p>\n\n<p>The United States has emerged as also one of the strongest markets for ERA, now accounting for more than one-third of the orders worldwide. The company expects U.S. volumes to approach half of its global total as additional commitments are finalized. Current orders and letters of intent (LOI)&nbsp;exceed&nbsp;650 ERA aircraft, totaling more than $10.5 billion.</p>\n\n<p>Florida&rsquo;s site follows a partnership signed 2&nbsp;years ago with Embry‑Riddle Aeronautical University. Space Florida, the state&rsquo;s aerospace economic development agency, played a key role in supporting the project, which is expected to create more than 1,000 high-skilled jobs in the region.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aura-aero-opens-us-headquarters-first-production-line-at-embry-riddle"
      }
    ],
    "link": "https://www.compositesworld.com/news/aura-aero-opens-us-headquarters-first-production-line-at-embry-riddle"
  },
  {
    "published": "Wed, 12 Nov 2025 11:37:30 -0500",
    "published_parsed": [
      2025,
      11,
      12,
      16,
      37,
      30,
      2,
      316,
      0
    ],
    "title": "Composites division of Neos Solutions relaunched as UK Composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composites division of Neos Solutions relaunched as UK Composites"
    },
    "summary": "Following a management buyout, the rebranded UK Composites site in Derby, U.K. designs and manufactures carbon fiber composite parts for automotive and other end markets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Following a management buyout, the rebranded UK Composites site in Derby, U.K. designs and manufactures carbon fiber composite parts for automotive and other end markets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"UK Composites site\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ukcomposites1.jpg;maxWidth=720\" /> </div>\n\n<p>Source | UK Composites</p>\n</div>\n\n<p>UK Composites (Westside Park, Derby, U.K.) is the relaunched name of what was formerly the composites division of Neos Solutions, following a management buyout.</p>\n\n<p>From a&nbsp;purpose-built 50,000-square-foot engineering and manufacturing facility, UK Composites designs and manufactures carbon fiber and composite parts for global customers, including automotive and motorsport companies such as Aston Martin F1, Lotus, Norton Motorcycles&nbsp;and Overfinch, as well as companies in the aerospace, rail, defense, healthcare, home furnishings and space sectors.</p>\n\n<p>The business was acquired with financial support from WeDo Business Finance and is now led by director Matty Lloyd, who brings more than 25 years of experience in composites. The&nbsp;management team includes production manager Sam Ryde, senior composites engineer Darren Ashford, lead project engineer Ben Dale,&nbsp;quality manager Aaron Church&nbsp;and lead designer Vinoth Periyasamy,&nbsp;alongside finance and accounts administrator Alexandra Girla.&nbsp;</p>\n\n<p>WeDo Business Finance&nbsp;has provided a finance package to support UK Composites&rsquo; expansion plans,&nbsp;as well as&nbsp;HR, IT and marketing&nbsp;services.&nbsp;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"UK Composites site and team\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-UKComposites-21.jpg;maxWidth=385\" /></div>\n\n<p>Part of the new UK Composites team. Pictured left to right: Alexandra Girla, Sam Ryde, Aaron Church, Vinoth Periyasamy, Matty Lloyd, Ben Dale.</p>\n</div>\n\n<p>UK Composites says that it plans to recruit at least 30 staff over the&nbsp;coming months, including roles for CAD designers, metrologists and engineering staff, and is looking to create&nbsp;at least three&nbsp;apprenticeships&nbsp;in each department.&nbsp;</p>\n\n<p>The business also reports that it is on course to post revenues of &pound;1.5 million&nbsp;for this financial year and aims to reach &pound;15 million within two years.&nbsp;</p>\n\n<p>&ldquo;We&rsquo;re set up for significant growth, with a vision to be the&nbsp;preferred partner for carbon fiber and&nbsp;composites&nbsp;engineering,&nbsp;manufacturing and supply across numerous sectors.&nbsp;We have ambitious plans to&nbsp;further invest in the latest technology and machinery and, most importantly, people,&rdquo; says Lloyd.</p>\n\n<p>He adds that Derby&nbsp;is an ideal&nbsp;location,&nbsp;as UK Composites&nbsp;integrates into&nbsp;a well-established regional engineering network.&nbsp;&ldquo;Our specialist composite engineering and manufacturing hub&nbsp;also&nbsp;has excellent transport links&nbsp;&mdash; we&rsquo;re&nbsp;close to the motorway network,&nbsp;East Midlands Airport&nbsp;and even a racetrack for testing,&rdquo; he says</p>\n\n<p>WeDo, which operates nationwide from its headquarters in Oldham and a network of offices, is a provider of senior secured working capital facilities through invoice, asset and trade finance to SMEs in sectors from engineering and manufacturing to recruitment, logistics and wholesale distribution.&nbsp;Its overall lending currently exceeds &pound;50m and the group aims to reach &pound;100m within&nbsp;the next three years.&nbsp;Alongside finance, the group suppports SMEs on their growth journeys&nbsp;with add-on&nbsp;services spanning outsourced accountancy, IT and back-office functions.&nbsp;</p>\n\n<p>Lloyd says, &ldquo;The support we&rsquo;ve received from WeDo has been instrumental in helping us to realize our vision. It&rsquo;s enabled us to hit the ground running and look ahead to an incredibly exciting future as a growing business.&rdquo;&nbsp;</p>\n\n<p>Chris Crank, managing director of WeDo&rsquo;s invoice finance division, adds,&nbsp;&ldquo;Matty has owned UK Composites for a number of years and until now it has been primarily a licensing business, supplying materials and consumables for the&nbsp;automotive&nbsp;sector. As a result, he has lots of existing relationships and experience.&nbsp;Having acquired the Neos facility in Derby, UK Composites is now focusing on taking a significant step into manufacturing.&nbsp;The financial support and additional services we have provided will help the team to&nbsp;deliver their plans. They have a clear vision and vast expertise, and we are excited&nbsp;to be a partner with them on their journey.&rdquo;&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/composites-division-of-neos-solutions-relaunched-as-uk-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/composites-division-of-neos-solutions-relaunched-as-uk-composites"
  },
  {
    "published": "Wed, 12 Nov 2025 11:16:08 -0500",
    "published_parsed": [
      2025,
      11,
      12,
      16,
      16,
      8,
      2,
      316,
      0
    ],
    "title": "Plasmatreat’s Elgin, Illinois lab fully operational, open for collaborative projects",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Plasmatreat’s Elgin, Illinois lab fully operational, open for collaborative projects"
    },
    "summary": "The company extends its atmospheric plasma technology to the Midwest and offers advanced surface modification and testing capabilities.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company extends its atmospheric plasma technology to the Midwest and offers advanced surface modification and testing capabilities."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-plasmatreat-21.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"plasmatreat lab\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-plasmatreat-21.jpg;maxWidth=720\" /> </a></div>\n\n<p>Plasmatreat&rsquo;s Elgin, Illinois laboratory offers a spacious environment for testing, collaboration&nbsp;and advanced surface treatment projects. Source, all images | Plasmatreat U.S.A. Inc.</p>\n</div>\n\n<p>Atmospheric plasma technology specialist&nbsp;<a href=\"https://www.compositesworld.com/suppliers/plasmatreat-usa\" target=\"_blank\">Plasmatreat</a>&nbsp;(Hayward, Calif.,&nbsp;U.S.)&nbsp;announces that its Elgin, Illinois laboratory is now fully operational, ready to support industrial partners with advanced surface modification and testing capabilities. With this expansion, the lab can now bring Plasmatreat&rsquo;s expertise and technology to the Midwest and surrounding regions.&nbsp;</p>\n\n<p>The company reports that its Elgin technology center is equipped with state-of-the-art plasma jets capable of treating both small components and large surfaces at high manufacturing speeds. The facility also features advanced instrumentation for material characterization, including <a href=\"https://www.compositesworld.com/suppliers/kruss-usa\" target=\"_blank\">Kr&uuml;ss MSA</a> and <a href=\"https://www.compositesworld.com/suppliers/brighton-science\" target=\"_blank\">Brighton Science</a> Bconnect goniometers for water contact angle measurements, an optical microscope for detailed part inspection&nbsp;and a salt spray chamber for corrosion testing of metals.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Plasmatreat-11.jpg\" target=\"_blank\"><img alt=\"plasmatreat elgin illinois lab\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Plasmatreat-11.jpg;maxWidth=385\" /></a></div>\n\n<p>The new lab extends the company&rsquo;s advanced plasma technology to the Midwest, and is conveniently located only 30 minutes from Chicago&rsquo;s O&rsquo;Hare International Airport.</p>\n</div>\n\n<p>The Elgin lab is said to deliver versatile surface engineering capabilities, such as the company&rsquo;s Openair-Plasma technology,&nbsp;for a wide range of materials including composites, plastics, metals, glass and ceramics. The company&rsquo;s comprehensive solutions include&nbsp;surface activation and cleaning that enhances adhesive bonding and paint adhesion, and advanced nanocoatings that protect metals against corrosion. The lab&rsquo;s fully integrated PTU 1212 system &mdash; featuring RD1004 and PFW10-PAD plasma jets with a 6-axis <a href=\"https://www.compositesworld.com/suppliers/kuka-robotics\" target=\"_blank\">Kuka</a>&nbsp;robot &mdash; can precisely treat both flat parts and complex 3D geometries, ensuring accurate plasma delivery every time.</p>\n\n<p>&ldquo;To encourage our partners to explore the full capabilities of the Elgin technology center, Plasmatreat is waiving lab service fees for short feasibility testing projects under eight hours through December 17,&rdquo; says&nbsp;Hardev Grewal, president and CEO of Plasmatreat North America. &ldquo;This initiative gives customers access to state-of-the-art equipment and our team&rsquo;s expertise, enabling them to learn more about plasma surface modification and accelerate the development of high-performance surface solutions.&rdquo;</p>\n\n<p>Plasmatreat invites industry partners to schedule half-day or full-day sessions to leverage the facility&rsquo;s advanced capabilities and expert support. Those interested in scheduling a lab session are encouraged to reach out to their local&nbsp;Plasmatreat <a href=\"https://www.plasmatreat.com/en/worldwide-network/north-america/sales-team-north-america\" target=\"_blank\">sales representative</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/plasmatreats-elgin-illinois-lab-fully-operational-open-for-collaborative-projects"
      }
    ],
    "link": "https://www.compositesworld.com/news/plasmatreats-elgin-illinois-lab-fully-operational-open-for-collaborative-projects"
  },
  {
    "published": "Mon, 10 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      10,
      17,
      0,
      0,
      0,
      314,
      0
    ],
    "title": "Envalior plastics, composites expertise earns two SPE Automotive Awards",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Envalior plastics, composites expertise earns two SPE Automotive Awards"
    },
    "summary": "Envalior was recognized with the Grand Innovation Award and first&nbsp;place in Enabler Technology for a roof cap design and hybrid composite battery cover, respectively.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Envalior was recognized with the Grand Innovation Award and first&nbsp;place in Enabler Technology for a roof cap design and hybrid composite battery cover, respectively."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-envalior-hybrid-ev-cover-speauto.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hybrid composite battery cover.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-envalior-hybrid-ev-cover-speauto.jpg;maxWidth=720\" /> </a></div>\n\n<p>Hybrid composite battery cover developed by Envalior&rsquo;s Tepex team in collaboration with SABIC, Siebenwurst, Ensinger and Forward Engineering. Source (All Images) | Envalior</p>\n</div>\n\n<p><a href=\"https://www.envalior.com/en-us/home\" target=\"_blank\">Envalior</a>&nbsp;(D&uuml;sseldorf, Germany) has received two awards at this year&rsquo;s <a href=\"https://www.compositesworld.com/suppliers/society-of-plastics-engineers-inc-spe-automotive-division\" target=\"_blank\">Society of Plastics Engineers (SPE) Automotive</a> Awards in Bonn, Germany. The company earned the Grand Innovation Award for &ldquo;Most Innovative Use of Plastics&rdquo; and first place in the &ldquo;Enabler Technology&rdquo; category, underscoring its work in sustainable, high-performance lightweighting solutions for the automotive industry.</p>\n\n<p>The Grand Innovation Award recognizes Envalior&rsquo;s contribution to the development of a lightweight roof cap &mdash;&nbsp;once considered an area unsuitable for plastics&nbsp;&mdash; for a premium German automotive convertible, manufactured by R&ouml;chling Automotive (Mannheim, Germany).&nbsp;Developed through close collaboration between Envalior, R&ouml;chling Automotive&nbsp;and the German automotive OEM, the roof cap combines Envalior&rsquo;s materials expertise&nbsp;&mdash; including its Tepex family of fiber-reinforced thermoplastic composites&nbsp;&mdash;with R&ouml;chling&rsquo;s advanced manufacturing and the OEM&rsquo;s demanding design requirements.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-envalior-crossmember-speauto.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-envalior-crossmember-speauto.jpg;maxWidth=385\" /></a></div>\n\n<p>Lightweight, high-performance roof crossmember made with Durethan and Tepex materials, integrated at the front of the convertible&rsquo;s fabric roof for strength and design flexibility.</p>\n</div>\n\n<p>The result is a lightweight, high-performance solution that meets stringent safety and aesthetic standards. The roof cap is also&nbsp;fully recyclable, aligning with upcoming European Union End-of-Life Vehicle Regulation (ELVR), which sets ambitious recyclability and recoverability targets for new vehicles.</p>\n\n<p>Envalior&rsquo;s second award &mdash; first place in &ldquo;Enabler Technology&rdquo; &mdash; recognizes a collaborative project between Envalior, <a href=\"https://www.compositesworld.com/suppliers/sabic-innovative-plastics-na\" target=\"_blank\">SABIC</a>, Siebenwurst, <a href=\"https://www.compositesworld.com/suppliers/ensinger-gmbh\" target=\"_blank\">Ensinger</a>&nbsp;and Forward Engineering. Together, the teams developed a hybrid composite battery cover designed to make electric vehicle (EV) battery housings lighter, safer&nbsp;and more cost-efficient to manufacture.</p>\n\n<p>The design features a sandwich architecture composed of two Tepex&nbsp;Dynalite glass fiber-reinforced polypropylene (PP) laminates and a flame-retardant, fiber-reinforced core. This configuration delivers low weight, improved heat management, enhanced safety&nbsp;and greater cost efficiency, helping extend EV range and performance.</p>\n\n<p>Together, Envalior says these dual awards showcase how advanced thermoplastics and composite technologies can redefine what&rsquo;s possible in automotive design.&nbsp;&ldquo;Winning these awards is not just about a project &mdash; it&rsquo;s about the spirit of innovation and teamwork that drives Envalior forward,&rdquo; says Sascha Bornemann, global Tepex&nbsp;business manager at Envalior.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/envalior-plastics-composites-expertise-earns-two-spe-automotive-award"
      }
    ],
    "link": "https://www.compositesworld.com/news/envalior-plastics-composites-expertise-earns-two-spe-automotive-award"
  },
  {
    "published": "Mon, 10 Nov 2025 11:28:00 -0500",
    "published_parsed": [
      2025,
      11,
      10,
      16,
      28,
      0,
      0,
      314,
      0
    ],
    "title": "Roman Stone partners with Rock Fiber, introduces basalt fibers to U.S. precast concrete market",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Roman Stone partners with Rock Fiber, introduces basalt fibers to U.S. precast concrete market"
    },
    "summary": "MiniBars reinforcement&nbsp;is four times stronger than traditional rebar and weighs 30% less, in addition to delivering&nbsp;strength,&nbsp;ductility and greener benefits.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "MiniBars reinforcement&nbsp;is four times stronger than traditional rebar and weighs 30% less, in addition to delivering&nbsp;strength,&nbsp;ductility and greener benefits."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-romanstone-minibars.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Precast duct banks and MiniBars.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-romanstone-minibars.png;maxWidth=720\" /> </a></div>\n\n<p>Main image shows Roman Stone&rsquo;s precast duct banks manufactured for data centers. In the lower left-hand corner are Rock Fiber&rsquo;s MiniBars product. The precast duct banks are&nbsp;comprised of more than 350,000 individual MiniBars&nbsp;pieces. Source | Rock Fiber Inc.</p>\n</div>\n\n<p>Precast concrete company <a href=\"https://romanstoneco.com/\" target=\"_blank\">Roman Stone</a> (Bay Shore, N.Y., U.S.) is now partnering with&nbsp;<a href=\"http://www.rockfiber.com/\" target=\"_blank\">Rock Fiber&nbsp;Inc.</a>&nbsp;(Houston, Texas, U.S.) to introduce MiniBars, a reinforcement product made from basalt fiber-reinforced macro-fibers, to the U.S. precast concrete industry.</p>\n\n<p>&ldquo;Bringing MiniBars&nbsp;to our precast portfolio will give&nbsp;the industry a smarter, faster&nbsp;and more durable way to build,&rdquo; says Daniel Murray, president and CEO of Roman Stone. &ldquo;The addition of this novel reinforcement gives us the ability to streamline our manufacturing processes and enables us to offer a more sustainable and durable product for our customers far beyond a traditional precast product.&rdquo;</p>\n\n<p>Through its own extensive engineering and testing, Roman Stone has proved that the performance of the MiniBars&nbsp;enables the company to develop, engineer&nbsp;and launch new products in less&nbsp;time versus traditional product development. Additionally, the product is substantially stronger, more durable&nbsp;and &mdash;&nbsp;most importantly &mdash; greener.</p>\n\n<p>MiniBars&nbsp;are engineered to replace or reduce traditional steel reinforcement. Designed to mix evenly throughout concrete, they provide uniform reinforcement and deliver optimal post-crack strength, impact resistance and fatigue durability, without the drawbacks of other macro-fibers.</p>\n\n<p>Composite MiniBars made with basalt fibers deliver four&nbsp;times the strength of conventional rebar at just 30% the weight of rebar, and flood the concrete matrix, delivering strength and ductility throughout while being immune to corrosion, ensuring longer service life in harsh environments such as marine, wastewater&nbsp;and de-icing salt exposure.&nbsp;Using fibers produced directly from volcanic rock, MiniBars also&nbsp;have a substantially lower carbon footprint than steel without corrosion and support longer lifecycle infrastructure.</p>\n\n<p>MiniBars also&nbsp;eliminate the need for rebar cages, saving labor and fabrication time while enabling thinner, lighter precast units.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/roman-stone-partners-with-rock-fiber-introduces-basalt-fibers-to-us-precast-concrete-market"
      }
    ],
    "link": "https://www.compositesworld.com/news/roman-stone-partners-with-rock-fiber-introduces-basalt-fibers-to-us-precast-concrete-market"
  },
  {
    "published": "Mon, 10 Nov 2025 10:59:41 -0500",
    "published_parsed": [
      2025,
      11,
      10,
      15,
      59,
      41,
      0,
      314,
      0
    ],
    "title": "Airborne, FIDAMC join forces to progress composites manufacturing automation strategies",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airborne, FIDAMC join forces to progress composites manufacturing automation strategies"
    },
    "summary": "The MOU will target challenges in automating the production of small- to medium-sized composite parts, particularly for commercial and defense markets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The MOU will target challenges in automating the production of small- to medium-sized composite parts, particularly for commercial and defense markets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airborne-fidamc.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airborne-fidamc.jpg;maxWidth=720\" /> </a></div>\n\n<p>Juan Carlos Southwood, FIDAMC&rsquo;s Felix Dominguez and Airborne&rsquo;s Marcus Kremers. Source | Airborne</p>\n</div>\n\n<p>On Oct. 29,&nbsp;<a href=\"https://www.compositesworld.com/suppliers/airborne\" target=\"_blank\">Airborne</a> (The Hague, the Netherlands) and the <a href=\"https://fidamc.es/en/\" target=\"_blank\">Foundation for Research, Development, and Application of Composite Materials</a> (FIDAMC, Madrid, Spain), a prominent research institution in composite materials, announced a memorandum of understanding (MOU) to establish a partnership for joint R&amp;D&nbsp;activities. This partnership aims to innovate and enhance manufacturing processes for composite materials, particularly for future aircraft programs in commercial and defense sectors.</p>\n\n<p>The collaboration will address the industry challenge of automating the production of small- to medium-sized composite parts, an area currently lacking suitable automation technologies for high-rate production. Joint efforts will focus on developing and implementing scalable, efficient&nbsp;and cost-effective automation solutions to increase productivity and reduce material waste in composites manufacturing.</p>\n\n<p>Key areas of collaboration include:</p>\n\n<p><strong>Automated ply placement (APP)</strong>. APP is a novel manufacturing method for high-rate production of composite parts, either in prepreg, thermoplastic or dry fiber.&nbsp;It creates tailored blanks or parts by efficiently cutting the material into the required ply shapes, picking and placing them into the laminate at high accuracy.</p>\n\n<p>The collaboration topics involve testing and modeling material properties; developing strategies for managing tackiness;&nbsp;forming laminates into 3D structures;&nbsp;assessing debulking and consolidation needs; and developing demonstrators showcasing APP capabilities.</p>\n\n<p>The partnership will also explore optimized cutting strategies;&nbsp;new gripper technologies;&nbsp;integrate sensor technologies;&nbsp;and explore multi-material laminate concepts and novel laminate strategies.</p>\n\n<p>Additionally, teams will assess innovative materials such as multilayer noncrimp fabrics (NCF), recycled fibers, nonwoven materials, and metallic laminates, and evaluate the role of consumables in process optimization.</p>\n\n<p><strong>Kit by light (KBL)</strong>. KBL is an augmented reality (AR) solution for improving the productivity of ply cutting and kitting processes, and at the same time reduce material waste. It supports the operator during ply offloading and kitting operations, and uses distinctive and patented software to create sequenced kits in one step. It also provides the capability for automated nesting on the shopfloor by the operators directly.</p>\n\n<p>Efforts will focus on demonstrating system functionality;&nbsp;gathering feedback for algorithm refinement;&nbsp;improving ergonomic aspects;&nbsp;and integrating KBL into digital factory ecosystems for enhanced efficiency and traceability.</p>\n\n<p>A joint development roadmap will be established and regularly updated in coordination with aircraft manufacturers and composites production companies to align with industry needs. Both parties will also engage in joint marketing efforts to showcase the developed technologies. FIDAMC will have the ability to use the equipment and technologies with other partners, including production companies, aircraft manufacturers&nbsp;and material companies, for further testing and development of automation solutions.</p>\n\n<p>Under the terms of the MOU, Airborne will provide expertise in automation and digitalization of composites manufacturing processes and share relevant technologies, including APP and KBL. FIDAMC will contribute research capabilities and facilities for material and technology development and testing, facilitate collaboration with universities and research centers, and disseminate research findings. FIDAMC will also lead efforts in training, material and process research, pre-qualification of materials and manufacturing techniques, and developing demonstrators to validate new composite applications, using its capabilities in molding, press equipment, structural testing, nondestructive inspection (NDI)&nbsp;and digital connectivity.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airborne-fidamc-join-forces-to-progress-composites-manufacturing-automation-strategies"
      }
    ],
    "link": "https://www.compositesworld.com/news/airborne-fidamc-join-forces-to-progress-composites-manufacturing-automation-strategies"
  }
]