[
  {
    "published": "Wed, 18 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      18,
      17,
      0,
      0,
      2,
      169,
      0
    ],
    "title": "Bcomp natural fiber composites to be used in future BMW Group production cars",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Bcomp natural fiber composites to be used in future BMW Group production cars"
    },
    "summary": "Bcomp partners with BMW Group to integrate high-performance natural fiber materials into series production models, reducing CO2 emissions for exterior and interior car parts.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Bcomp partners with BMW Group to integrate high-performance natural fiber materials into series production models, reducing CO2 emissions for exterior and interior car parts."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Bcomp-BMW-exterior-parts-1-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Exterior natural fiber automotive part.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Bcomp-BMW-exterior-parts-1-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | BMW AG</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a>&rsquo;s&nbsp;(Fribourg, Switzerland) high-performance natural fiber materials will be used extensively in <a href=\"https://www.bmwgroup.com/en.html\" target=\"_blank\">BMW Group</a>&nbsp;(Munich, Germany)&nbsp;series production for both exterior and interior components of future production cars. The flax-based materials mark a significant step in replacing parts traditionally made with carbon fiber over the past decades, Bcomp reports.</p>\n\n<p>This development represents a major milestone in the partnership between Bcomp and BMW Group, which have collaborated for several years to research and develop CO<sub>2</sub>-reduced materials, demonstrate their performance in race environments&nbsp;and now bring them to series production readiness. For example, replacing carbon fiber composites with Bcomp&rsquo;s natural fiber composites in the roof of the next-generation BMW M3 results in a CO<sub>2</sub>e reduction of around 40% in production, along with additional end-of-life benefits.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Bcomp-BMW-exterior-parts-2-min.jpg\" target=\"_blank\"><img alt=\"Natural fiber engine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Bcomp-BMW-exterior-parts-2-min.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>The roll-out of Bcomp&rsquo;s materials into series production signifies a race-to- road success. The partnership began with motorsport prototyping and has since provided notable performance and sustainability improvements across multiple racing platforms, including Formula E, DTM&nbsp;and GT4.</p>\n\n<p>In 2019, Bcomp and BMW Motorsport used CO<sub>2</sub>-reduced materials in Formula E via ampliTex and powerRibs&nbsp;flax materials to build a high-performance cooling shaft for the BMW iFE.20 race car. The 2022 BMW M4 GT4 further bridged the gap to road applications, featuring more natural fiber parts than any GT race car to date, both partners contend &mdash; inside and out.</p>\n\n<p>Bcomp and BMW Group have also developed a bespoke natural fiber color and weave pattern that meets the stringent demands of roof structures in total vehicle homologation. The public has already seen this material in the award-winning BMW M Visionary Materials Seat project.</p>\n\n<p>Bcomp&rsquo;s natural fiber composites are designed to integrate seamlessly into multiple existing manufacturing processes at scale. The vehicle roof will be made using RTM, ensuring fast and consistent production. Other interior and exterior parts will be produced using a prepreg process. This approach supports vertical integration and improved control over performance, quality&nbsp;and sustainability.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/bcomp-natural-fiber-composites-to-be-used-in-future-bmw-group-production-cars"
      }
    ],
    "link": "https://www.compositesworld.com/news/bcomp-natural-fiber-composites-to-be-used-in-future-bmw-group-production-cars"
  },
  {
    "published": "Wed, 18 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      18,
      15,
      0,
      0,
      2,
      169,
      0
    ],
    "title": "Terra Agri, Midwest Composites cut agriculture CO2 emissions with biocomposite drone canopy",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Terra Agri, Midwest Composites cut agriculture CO2 emissions with biocomposite drone canopy"
    },
    "summary": "Canopy covers use empty fruit bunch (EFB), woven jute and nonwoven kenaf to enhance durability and reduce environmental impact of drones engineered for&nbsp;enterprise agriculture in Indonesia and Malaysia.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Canopy covers use empty fruit bunch (EFB), woven jute and nonwoven kenaf to enhance durability and reduce environmental impact of drones engineered for&nbsp;enterprise agriculture in Indonesia and Malaysia."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-terraagri-midwestcomposites-terradrone.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-terraagri-midwestcomposites-terradrone.jpg;maxWidth=720\" /> </a></div>\n\n<p>The TerraDrone. Source (All Images) | Terra Agri</p>\n</div>\n\n<p><a href=\"https://terra-droneagri.com/\" target=\"_blank\">Terra Agri</a>&nbsp;(Jakarta, Indonesia), an&nbsp;agricultural service brand, has partnered with advanced composite and biocomposite provider <a href=\"https://midwestcomposites.com.my/\" target=\"_blank\">Midwest Composites LLC</a> (Wapakoneta, Ohio, U.S.) to introduce high-performance biocomposite drone canopy covers for Terra Agri&rsquo;s&nbsp;E16 and G30 models. These eco-friendly drone components are designed for industrial agriculture and help reduce CO<sub>₂</sub> emissions, and reflects Terra&rsquo;s commitment to encouraging agriculture drone development in Indonesia and Malaysia, its primary markets.</p>\n\n<p>Specifically developed for harsh agricultural environments, the biocomposite covers use renewable natural fibers including empty fruit bunch (EFB) palm pulp, woven jute and nonwoven kenaf. These eco-conscious materials outperform traditional plastics by offering improved flexibility, UV resistance&nbsp;and structural strength.</p>\n\n<p>The E16 drone&rsquo;s frame, crafted from EFB palm pulp biocomposites, weighs just 207 grams with a thickness of 1.5 millimeters,&nbsp;and delivers a flexural strength of 55.6 MPa. The&nbsp;lightweight, plant-based composite protects vital electronics such as the GPS and flight controller. Compared to standard plastic materials, it offers a CO<sub>₂</sub> emissions reduction of up to 73.2%.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-terradrone-g30-biocomposite-covers.png\" target=\"_blank\"><img alt=\"G30 drone with biocomposite canopy covers.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-terradrone-g30-biocomposite-covers.png;maxWidth=385\" /></a></div>\n\n<p>G30 drone with biocomposite canopy covers.</p>\n</div>\n\n<p>The woven jute biocomposite front cover (45% biocontent, 219.4 grams, 1.54 millimeters&nbsp;thick) and a nonwoven kenaf biocomposite&nbsp;rear cover, offer enhanced protection for high-voltage systems like the battery and power distribution board of&nbsp;the G30 drone. These eco-friendly drone parts are designed for long operational life, even under direct heat and moisture exposure, common in tropical agricultural zones.</p>\n\n<p>Unlike conventional drone canopy cover, which can crack and warp under intense sunlight, these biocomposite materials maintain flexibility and integrity. Their resistance to water ingress and bolt hole stress helps prevent in-field failure, reducing downtime and maintenance for plantation operators who rely on precision drone systems.</p>\n\n<p>&ldquo;This collaboration with Midwest Composites delivers industrial-grade drone components that are not only tougher but also significantly more sustainable,&rdquo; emphasizes&nbsp;Wilson Ong, country manager, Terra Drone Agri.&nbsp; &ldquo;The agricultural sector is under growing pressure to improve sustainability without sacrificing performance. By integrating biocomposites like EFB, jute and kenaf into drone technology, we&rsquo;re proving that eco-friendly materials can outperform conventional ones in both durability and functionality.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/terra-agri-midwest-composites-cut-agriculture-co2-emissions-with-biocomposite-drone-canopy"
      }
    ],
    "link": "https://www.compositesworld.com/news/terra-agri-midwest-composites-cut-agriculture-co2-emissions-with-biocomposite-drone-canopy"
  },
  {
    "published": "Wed, 18 Jun 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      18,
      14,
      0,
      0,
      2,
      169,
      0
    ],
    "title": "Lemki Robotics 3D printed off-road robot is made from composites, recycled materials",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Lemki Robotics 3D printed off-road robot is made from composites, recycled materials"
    },
    "summary": "The off-road robot is suited for military logistics, search and rescue, precision agriculture, infrastructure inspection and more.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The off-road robot is suited for military logistics, search and rescue, precision agriculture, infrastructure inspection and more."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </div>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-lemkirobotix.jpg;maxWidth=385\" /></div>\n\n<p>Source | Lemki Robotix</p>\n</div>\n\n<p>Following the recent launch of the <a href=\"https://iscale3d.com/project/3d-camper/\" target=\"_blank\">Discover 3D camper</a>, Ukrainian company Lemki Robotix (Uzhhorod), together with German firm iSCALE 3D (Grenzach-Wyhlen) and engineering partner Zeykan Robotics (&Scaron;těp&aacute;nov, Czech Republic), recently&nbsp;unveiled a production model&nbsp;of a fully 3D printed off-road logistics robot.&nbsp;</p>\n\n<p>The&nbsp;autonomous robot is designed for off-road conditions and built entirely using recycled materials. The sealed body is printed from glass fiber-reinforced recycled polypropylene, airless, puncture-proof,&nbsp;recycled polyurethane wheels&nbsp;and rims made of carbon fiber-reinforced nylon.</p>\n\n<p>A key innovation lies in the hollow, buoyant wheels, which not&nbsp;only improve terrain handling but also act as paddle wheels, enabling water crossing without compromising mobility.</p>\n\n<p>The robot is equipped with 360&deg; cameras, LiDAR&nbsp;and Starlink satellite connectivity for real-time remote control.&nbsp;Operation can be performed manually&nbsp;or autonomously using an onboard neural network, which interprets sensor data for intelligent navigation, even in GPS-denied zones.</p>\n\n<p>Due to its modular construction and rugged capabilities, the robot is suited for military logistics, search and rescue, precision agriculture, infrastructure inspection and remote delivery and hazardous zones.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/3d-printed-off-road-logistics-robot-made-from-recycled-materials-2"
      }
    ],
    "link": "https://www.compositesworld.com/news/3d-printed-off-road-logistics-robot-made-from-recycled-materials-2"
  },
  {
    "published": "Tue, 17 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      17,
      16,
      0,
      0,
      1,
      168,
      0
    ],
    "title": "Cygnet, Viritech recover H2 tank continuous carbon fibers in Ford FCVGen2.0 project",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Cygnet, Viritech recover H2 tank continuous carbon fibers in Ford FCVGen2.0 project"
    },
    "summary": "Partner technologies&nbsp;have demonstrated the&nbsp;viability of recycled continuous fibers and the potential for automotive tanks to be recycled at meaningful rates.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Partner technologies&nbsp;have demonstrated the&nbsp;viability of recycled continuous fibers and the potential for automotive tanks to be recycled at meaningful rates."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Cygnet-Fibre-Recovery-System.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Unwinding of continuous carbon fiber.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Cygnet-Fibre-Recovery-System.jpg;maxWidth=720\" /> </a></div>\n\n<p>Cygnet Texkimp's Fibre Recovery System unwinds continuous carbon fiber&nbsp;from a demonstrator tank. Source (All Images) | Cygnet Texkimp</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/cygnet-texkimp\" target=\"_blank\">Cygnet Texkimp</a>&nbsp;(Northwich, U.K.) and hydrogen powertrain solutions developer <a href=\"https://www.viritech.co.uk/\" target=\"_blank\">Viritech</a>&nbsp;(Nuneaton, Warwickshire, U.K.) have partnered to recover high-value, continuous carbon fibers from hydrogen pressure vessels as part of a strategy to improve circularity in the manufacture of filament-wound parts.</p>\n\n<p>The two companies have worked together within the FCVGen2.0 consortium which is led by Ford Motor Co. and partly funded by the Advanced Propulsion Centre UK (APC). The consortium <a href=\"https://www.compositesworld.com/news/cygnet-texkimp-joins-uk-project-for-hydrogen-powered-ford-e-transit-development\" target=\"_blank\">was brought together in 2023</a>&nbsp;to design, build and trial a small fleet of hydrogen fuel-cell powered Ford <em>E-Transits</em> that maximize value for fleets with high daily energy demands and zero-emissions ambitions. One of its objectives is to develop and evaluate a viable recycling route for end-of-life (EOL) fuel tank components that maintains the properties of, and develops uses for, recycled fiber, in order to accelerate the industrialization of recycling technologies in automotive.</p>\n\n<p>The partnership between Cygnet Texkimp and Viritech harnessed Cygnet Texkimp&rsquo;s Fibre Recovery System, which addresses one of the project&rsquo;s key aims: To develop a workable strategy and technical capability to reclaim maximum value from carbon fiber&nbsp;hydrogen tanks at the end of their usable life and reuse them in new applications. The system, which complements Cygnet Texkimp&rsquo;s filament winding capability, has been developed to recover continuous, high-quality carbon fibers from filament-wound parts and present them in convenient, bobbin-wound formats for reuse in the manufacture of composites.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Viritech-tank.jpg\" target=\"_blank\"><img alt=\"Viritech tank on a Cygnet Texkimp winding machine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Viritech-tank.jpg;maxWidth=385\" /></a></div>\n\n<p>Viritech tank on a Cygnet Texkimp winding machine.</p>\n</div>\n\n<p>As part of the project, Viritech is creating composite pressure vessels &mdash; using a&nbsp;novel nano-infused,&nbsp;resin-based material system&nbsp;&mdash;&nbsp; that achieve optimum efficiency in manufacture and operation, while also being readily recyclable. Cygnet&rsquo;s&nbsp;technology successfully processed Viritech&rsquo;s graphene nanomaterial and&nbsp;recovered the tank&rsquo;s carbon fibers at its&nbsp;Innovation Centre using DEECOM (<a href=\"https://www.compositesworld.com/articles/pressurized-steam-based-composites-recycling-for-full-fiber-reclamation\" target=\"_blank\">read about the recycling process</a>). The reclaimed fibers were then mechanically unwound and rewound onto bobbins, ready to be reused in conventional applications.</p>\n\n<p>Unlike many other recycling processes, rCF is typically processed in short lengths and thus is limited in its application. Cygnet&rsquo;s technology, however, recovers and unwinds continuous fibers to enable their use as an alternative to virgin fibers, i.e., more high-value applications, like&nbsp;filament winding, pultrusion, weaving, unidirectional&nbsp;prepreg and towpreg.</p>\n\n<p>&ldquo;Our partnership with Viritech demonstrates the potential for hydrogen tanks to be recycled at a meaningful rate,&rdquo; says Dr. Yan Liu, senior R&amp;D specialist at Cygnet Texkimp, who led the project. &ldquo;Our Fibre Recovery System has an essential role to play in enabling design for recycling and design for disassembly strategies that inform the manufacture of future hydrogen pressure vessel technology.&nbsp;The system closes the loop between our DEECOM fiber&nbsp;recycling solution and our extensive filament winding capability and provides end-to-end processing and recycling capability for composite fibers.&rdquo;</p>\n\n<p>The two companies are also working together to further develop the filament winding technology as part of a strategy to develop highly efficient and sustainable manufacturing and recycling solutions for hydrogen pressure vessels. This partnership is based around Cygnet Texkimp&rsquo;s fully automated, five-axis filament winding cell and Viritech&rsquo;s graphene nanomaterial system.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cygnet-viritech-recover-h2-tank-continuous-carbon-fibers-in-ford-fcvgen20-project"
      }
    ],
    "link": "https://www.compositesworld.com/news/cygnet-viritech-recover-h2-tank-continuous-carbon-fibers-in-ford-fcvgen20-project"
  },
  {
    "published": "Tue, 17 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      17,
      15,
      0,
      0,
      1,
      168,
      0
    ],
    "title": "CRP Technology obtains ISO 14001:2015 certification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CRP Technology obtains ISO 14001:2015 certification"
    },
    "summary": "3D printing company strengthens its industrial model by combining environmental sustainability, technological innovation&nbsp;and strict process control.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "3D printing company strengthens its industrial model by combining environmental sustainability, technological innovation&nbsp;and strict process control."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-crp-gear-windformxt-2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"3D printed gear.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-crp-gear-windformxt-2.jpg;maxWidth=720\" /> </a></div>\n\n<p>A gear formed with&nbsp;Windform XT 2.0 IMG. Source | CRP Technology</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/crp-technology\" target=\"_blank\">CRP Technology</a> (Modena, Italy), a company known for its Windform range of fiber-reinforced materials for selective laser sintering (SLS) 3D printing, has obtained&nbsp;ISO 14001:2015 certification, confirming the company&rsquo;s responsible and sustainable environmental management.&nbsp;</p>\n\n<p>Issued by the DNV, this certification applies to the production of plastic components using SLS&nbsp;and the production of powders intended for SLS and other similar additive manufacturing processes. The certified activities fall under IAF code 15 (rubber and plastic products) and were assessed according to the requirements of Technical Regulation RT-09.</p>\n\n<p>This new milestone adds to the EN 9100 certification already achieved by CRP Technology for its quality management system applied to the aerospace and defense sectors, further confirming the industrial model adopted by CRP Technology &mdash; one that combines technological innovation, rigorous process control, operational transparency&nbsp;and environmental responsibility.&nbsp;</p>\n\n<p>CRP Technology's commitment to sustainability also takes shape through concrete circular economy projects, such as the recovery of Windform XT 2.0 powders (Windform XT 2.0 is a carbon fiber-reinforced nylon). Once no longer suitable for SLS 3D printing, the powders are reprocessed and converted into Windform XT 2.0 IMG, which can be used in injection molding or FDM/FFF 3D printing processes in pellet form.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/crp-technology-obtains-iso-140012015-certification"
      }
    ],
    "link": "https://www.compositesworld.com/news/crp-technology-obtains-iso-140012015-certification"
  },
  {
    "published": "Tue, 17 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      17,
      15,
      0,
      0,
      1,
      168,
      0
    ],
    "title": "Aditya Birla Advanced Materials strengthens U.S. operations through Cargill facility acquisition",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aditya Birla Advanced Materials strengthens U.S. operations through Cargill facility acquisition"
    },
    "summary": "Specialty manufacturing facility in Dalton, Georgia, will expand the Indian conglomerate&rsquo;s U.S. capacity, with plans to more than double its capacity over the next couple of years.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Specialty manufacturing facility in Dalton, Georgia, will expand the Indian conglomerate&rsquo;s U.S. capacity, with plans to more than double its capacity over the next couple of years."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-adityaburla-epoxybinders.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Epoxy preform binding.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-adityaburla-epoxybinders.jpg;maxWidth=720\" /> </a></div>\n\n<p>Aditya Birla Advanced Materials serves industries with a robust range of portfolios for composite systems, whether by application or by chemistry, such as this epoxy preform binding solution shown here. Source | <a href=\"https://www.linkedin.com/posts/abgadvancedmaterials_epoxybinders-compositemanufacturing-rtm-activity-7335996314167431168-Kvak?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAACA1Tx8BEqqBflKz5cDVh8RM7oQ64SX-Q2U\" target=\"_blank\">Aditya Burla LinkedIn</a></p>\n</div>\n\n<p><a href=\"https://www.adityabirla.com/en/\" target=\"_blank\">Aditya Birla Group</a> (Mumbia),&nbsp;an Indian multinational conglomerate with an ever-evolving portfolio of <a href=\"https://www.abg-am.com/portfolio/application/composites/102?tab=1-1\" target=\"_blank\">composite systems</a>, has announced the expansion of its&nbsp;U.S. Advanced Materials business with the acquisition of Cargill Inc.&rsquo;s (Minneapolist, Minn., U.S.) 17-acre specialty chemical manufacturing facility in Dalton, Georgia. The acquisition continues Aditya Birla&rsquo;s expansion in the U.S.&rsquo; manufacturing sector, a key aspect of the company&rsquo;s growth strategy, which now totals more than $15 billion in investment. &nbsp;</p>\n\n<p>&ldquo;This acquisition represents Aditya Birla&rsquo;s strategic entry into the U.S. chemicals industry, extending the business model of our other successful U.S. manufacturing businesses including&nbsp;Novelis&nbsp;and&nbsp;Birla Carbon,&rdquo; says Kumar Mangalam Birla, chairman of Aditya Birla Group. &ldquo;Our growth strategy is anchored in a commitment leverage our deep manufacturing expertise to support the revitalization of the growing U.S. manufacturing sector.&rdquo;</p>\n\n<p>With this acquisition, the Advanced Materials business welcomes 50 employees. The business plans to expand the facility&rsquo;s current capacity of 16,000 tons per year to more than&nbsp;40,000 tons over the next 2&nbsp;years, affirming the business&rsquo;s&nbsp;commitment to local operations and job creation. The acquisition was executed through Aditya Birla Chemicals (USA) Inc., a wholly owned subsidiary of&nbsp;<a href=\"https://www.compositesworld.com/suppliers/aditya-birla-chemicals-thailand\" target=\"_blank\">Aditya Birla Chemicals (Thailand) Ltd</a>.</p>\n\n<p>According to&nbsp;Jayant Dhobley, business head of CFI, Aditya Birla Group, this move will strengthen cooperation with customers in developing next-generation products. Aditya Burla expects further&nbsp;investments at the Georgia site&nbsp;in the coming months and will introduce advanced technologies from the company&rsquo;s global operations.</p>\n\n<p>Aditya Birla Group will continue to manufacture the plant&rsquo;s current output of formulated resins, curing agents, reactive diluents and polyaspartic resins for the marine, industrial coatings&nbsp;and flooring industries, which include epoxy resins, modifiers, curing agents&nbsp;and other specialty chemicals sold under the brands Chemcure, ChemMod, Altor, Acme Shield&nbsp;and ChemRes. Additionally, the Advanced Materials business will introduce products for the automotive, renewable energy and aerospace industries, including its patented chemistries to enable recycling of epoxy composites used in wind, sports goods, pressure vessels and other applications.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aditya-birla-advanced-materials-strengthens-us-operations-through-cargill-facility-acquisition"
      }
    ],
    "link": "https://www.compositesworld.com/news/aditya-birla-advanced-materials-strengthens-us-operations-through-cargill-facility-acquisition"
  },
  {
    "published": "Mon, 16 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      16,
      17,
      0,
      0,
      0,
      167,
      0
    ],
    "title": "Epsilon Composite, Toray Carbon Fibers Europe target composites in electrical infrastructure",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Epsilon Composite, Toray Carbon Fibers Europe target composites in electrical infrastructure"
    },
    "summary": "A 15-year partnership collaborating on carbon fiber core conductors has culminated in numerous global projects like modernizing&nbsp;TenneT&rsquo;s 400-kilovolt&nbsp;high-voltage grid.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A 15-year partnership collaborating on carbon fiber core conductors has culminated in numerous global projects like modernizing&nbsp;TenneT&rsquo;s 400-kilovolt&nbsp;high-voltage grid."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"HVCRC conductor.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-epsilon-hvcrc-conductor.png;maxWidth=720\" /> </div>\n\n<p>HVCRC&nbsp;conductor, composed of a structural composite core made from carbon fiber and annealed aluminum strands. Source (All Images) | Epsilon Composite</p>\n</div>\n\n<p>Carbon fiber pultrusion company&nbsp;<a href=\"https://www.compositesworld.com/suppliers/epsilon-composite\" target=\"_blank\">Epsilon Composite</a>&nbsp;(Gaillan en M&eacute;doc, France) and&nbsp;<a href=\"https://www.toray.eu/eu/europe/network/cfe/\" target=\"_blank\">Toray Carbon Fibers Europe</a> (Lacq, France), a subsidiary of <a href=\"https://www.compositesworld.com/suppliers/toray-industries\" target=\"_blank\">Toray Industries</a> (Tokyo, Japan), have been working together for 15 years to promote the use of carbon fiber in electrical infrastructure.&nbsp;This collaboration has culminated in numerous projects worldwide as well as a major framework agreement recently signed in the Netherlands.&nbsp;</p>\n\n<p>Since the qualification of Epsilon Composite&rsquo;s HVCRC&nbsp;conductors technology in 2010 &mdash; high-capacity, high-temperature, low-sag conductors&nbsp;made of a composite core using Torayca&nbsp;carbon fiber and highly conductive trapezoidal aluminum wires&nbsp;&mdash;&nbsp;the two French companies have played a key role in modernizing and strengthening power grids globally.</p>\n\n<p>HVCRC&rsquo;s light weight, strength and high thermal stability is able to effectively replace traditional metal cables, the companies report. The composite&nbsp;cables are capable of doubling&nbsp;the capacity of existing power lines quickly. In contrast, building new, traditional lines typically takes over a decade and requires significant investment.</p>\n\n<p>Increasing transmission capacity is also essential to meet the growing global demand for electricity and to connect new renewable energy sources (such as solar and wind) in support of decarbonization efforts. HVCRC cables achieve a 30% reduction in electrical losses, enhanced grid resilience to extreme weather events&nbsp;and a reduced risk of wildfires.&nbsp;</p>\n\n<p>&ldquo;After 40 years of collaboration, including 15 years on composite cores, Epsilon Composite and Toray Carbon Fibers Europe&nbsp;demonstrate the strength of a long-standing, innovative and effective industrial partnership, placing the composites sector at the heart of the global energy transition challenge,&rdquo; says Alexandre LULL, deputy CEO of Epsilon Composite.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-tennet-grid.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-tennet-grid.png;maxWidth=385\" /></a></div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-epsilon-composite-core-mfg.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-epsilon-composite-core-mfg.png;maxWidth=720\" /> </a></div>\n\n<p>Map of the Dutch transmission grid, managed by TenneT (top) and composite core manufacturing in Epsilon Composite&rsquo;s pultrusion workshop (bottom)</p>\n</div>\n</div>\n\n<p>Several thousand kilometers of Epsilon Composite&rsquo;s cable solution has already been installed&nbsp;across the Asia-Pacific, Africa, Europe and the Americas. The composite core conductors have also recently been selected for&nbsp;several major contracts in Europe. One is from European grid operator TenneT (Arnhem, Netherlands), which selected&nbsp;the HVCRC&nbsp;technology to modernize the entire&nbsp;Dutch 400-kilovolt&nbsp;high-voltage grid until&nbsp;2030.</p>\n\n<p>Following a tender launched in 2024, TenneT selected two European cable manufacturers partnered with Epsilon Composite &mdash;Nexans and DeAngeli Prodotti &mdash; to produce HVCRC&nbsp;conductors. For this tender, the Dutch grid operator challenged suppliers to optimize not only their products but also supply chains and operations to minimize electrical losses and greenhouse gas emissions throughout the product life cycle. TenneT also required a life cycle analysis to assess the environmental impact of the products, integrating this data into the evaluation process.</p>\n\n<p>Epsilon Composite&rsquo;s proactive efforts over the years to assess and optimize the environmental impact of its production and supply chain contributed significantly to this process.</p>\n\n<p>Implementation of the framework agreement has already begun, with two pilot projects underway to qualify HVCRC&nbsp;cables manufactured by Nexans and DeAngeli Prodotti, as well as Epsilon&rsquo;s Corecheck&nbsp;technology, which ensures the integrity of the composite core at every stage of manufacturing and installation. The project is expected to continue until all remaining metallic conductors on TenneT&rsquo;s 400-kilovolt&nbsp;lines are replaced.</p>\n\n<p>&ldquo;We are convinced that this HVCRC&nbsp;technology is contributing to the future of electrification in the European and global markets,&rdquo; adds Armin Klesing, marketing and sales director at Toray Carbon Fibers Europe</p>\n\n<p>Both Epsilon Composite and Toray continue to invest in R&amp;D and production capacities to support market growth. Toray Carbon Fibers Europe is completing the construction of a sixth carbon fiber production line, set to be operational by the end of 2025. This new line will further strengthen the company&rsquo;s supply&nbsp;to the&nbsp;European market and guarantee a national supply of the material.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/epsilon-composite-toray-carbon-fibers-europe-target-composites-in-electrical-infrastructure"
      }
    ],
    "link": "https://www.compositesworld.com/news/epsilon-composite-toray-carbon-fibers-europe-target-composites-in-electrical-infrastructure"
  },
  {
    "published": "Mon, 16 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      16,
      16,
      0,
      0,
      0,
      167,
      0
    ],
    "title": "TPRC offers specialized training in TPC for engineers",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "TPRC offers specialized training in TPC for engineers"
    },
    "summary": "Three hands-on programs are available, covering the intricacies of thermoplastic composites, from intro to advanced levels.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Three hands-on programs are available, covering the intricacies of thermoplastic composites, from intro to advanced levels."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-tprc-tpc-training.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"TPRC thermoplastics training.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-tprc-tpc-training.png;maxWidth=720\" /> </a></div>\n\n<p>Source | TPRC</p>\n</div>\n\n<p>What are thermoplastic composites (TPC), why are they increasingly used and how can they be processed and applied effectively? The&nbsp;<a href=\"https://www.compositesworld.com/suppliers/thermoplastic-composites-research-center-tprc\" target=\"_blank\">ThermoPlastic composites Research Center</a>&nbsp;(TPRC,&nbsp;Enschede, Netherlands)&nbsp;provides extensive answers to these questions through training sessions, with a hands-on and practical approach in its modern lab.</p>\n\n<p>The TPRC<em>&nbsp;</em>offers three&nbsp;specialized training programs to enhance participants&rsquo; knowledge on TPC. Over the past years, this&nbsp;training has&nbsp;proven to be a great success, with growing demand and full participant lists. The currently available training sessions&nbsp;are:</p>\n\n<p><strong>Introduction to Thermoplastics</strong>. This 2-day training is focused on the key features of TPC and processing techniques. It is&nbsp;ideal for entry-level professionals or development engineers who consider potential applications of the material. The course includes practical and theoretical sessions on:</p>\n\n<ul>\n\t<li>Thermoplastic matrix types and properties</li>\n\t<li>Fibers</li>\n\t<li>Prepregs</li>\n\t<li>Processing technologies</li>\n\t<li>Characterization methods</li>\n\t<li>Principles and basics of forming and design.</li>\n</ul>\n\n<p><strong>Joining of Thermoplastic Composites</strong>. Designed for engineers aiming to improve their expertise in joining methods, this&nbsp;TPRC course focuses on the theory and application of joining techniques for TPC, with a special focus on welding methods. Over 2&nbsp;days, participants will learn about the following topics in the TPRC lab:</p>\n\n<ul>\n\t<li>Standard- and non-standard joining methods</li>\n\t<li>Fundamentals of fusion bonding</li>\n\t<li>Welding techniques, including induction and resistance welding</li>\n\t<li>Multi-material joining (joining thermoplastics to thermosets and metals)</li>\n\t<li>Joint characterization.</li>\n</ul>\n\n<p><strong>Advanced Forming of Thermoplastic Composites</strong>. All aspects of press forming of TPC&nbsp;are included in this course, with hands-on work involving material properties, effects of tool design and use of process simulation tools. This 2-day training is tailored for experienced participants and focuses mainly on the following topics:</p>\n\n<ul>\n\t<li>Equipment and press forming setups</li>\n\t<li>Tool design</li>\n\t<li>Material characterization for forming applications</li>\n\t<li>Forming simulations</li>\n\t<li>Crystallization behavior and warpage.</li>\n</ul>\n\n<p>More about the TPRC&rsquo;s specialized training programs&nbsp;<a href=\"https://tprc.nl/training?utm_source=CompositesWorld&amp;utm_medium=referral&amp;utm_campaign=PressRelease&amp;utm_term=2025-06\" target=\"_blank\">can be accessed here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/tprc-offers-specialized-training-in-tpc-for-engineers"
      }
    ],
    "link": "https://www.compositesworld.com/news/tprc-offers-specialized-training-in-tpc-for-engineers"
  },
  {
    "published": "Mon, 16 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      16,
      15,
      0,
      0,
      0,
      167,
      0
    ],
    "title": "JetZero selects Greensboro, North Carolina for first U.S. factory",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "JetZero selects Greensboro, North Carolina for first U.S. factory"
    },
    "summary": "Access to talent, infrastructure and supportive business-friendly state culture were keys to selecting this location for JetZero&rsquo;s all-wing composite Z4 aircraft, which will be able to produce 20 aircraft/month when at&nbsp;full rate.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Access to talent, infrastructure and supportive business-friendly state culture were keys to selecting this location for JetZero&rsquo;s all-wing composite Z4 aircraft, which will be able to produce 20 aircraft/month when at&nbsp;full rate."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-jetzero-greensboro-site.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Rendering of the Greensboro factory from above.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-jetzero-greensboro-site.png;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | JetZero</p>\n</div>\n\n<p><a href=\"https://www.jetzero.aero/\" target=\"_blank\">JetZero</a>&nbsp;(Long Beach, Calif., U.S.), the aerospace startup developing an all-wing airplane design, has announced Greensboro, North Carolina, as the location for its first advanced manufacturing and final assembly facility. Located on the Piedmont Triad International Airport grounds, the factory will&nbsp;produce JetZero&rsquo;s Z4 blended wing body (BWB) aircraft, designed to transform commercial aviation through fuel efficiency, engineering, and an elevated passenger and flight crew experience. The aircraft will also be&nbsp;<a href=\"https://www.compositesworld.com/news/hexcel-jetzero-partner-to-qualify-composites-for-bwb-aircraft\" target=\"_blank\">supported by composite materials</a> qualified with <a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel</a> (Stamford, Conn., U.S.).</p>\n\n<p>The new site will create more than 14,500 jobs, delivering positive economic impact on the region and providing opportunities for collaboration with academic and vocational training institutions. JetZero will be capable of producing up to 20 Z4 airplanes per month at the factory&rsquo;s full run rate, expected to be achieved by the late 2030s.</p>\n\n<p>&ldquo;North Carolina offers the ideal combination of talent, infrastructure&nbsp;and forward-thinking leadership to support our mission to reshape aviation,&rdquo; notes&nbsp;Tom O&rsquo;Leary, CEO and co-founder of JetZero.&nbsp;</p>\n\n<p>The state&rsquo;s aerospace ecosystem, access to world-class research, university and technical colleges, and commitment to bringing innovative businesses to the state were key factors in JetZero&rsquo;s selection. The company is working closely with state and local officials on workforce development and training programs. Construction on the facility is expected to begin in the first half of 2026, with first customer deliveries in the early 2030s.&nbsp;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-JetZero-airline-model.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Close-up render of the JetZero facility.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-JetZero-airline-model.png;maxWidth=720\" /> </a></div>\n\n<p>JetZero is designing its greenfield factory to leverage the latest digital and industrial AI tools.</p>\n</div>\n\n<p>JetZero is taking a clean-sheet approach to designing and building the factory. Working with <a href=\"https://www.sw.siemens.com/en-US/\" target=\"_blank\">Siemens</a>&nbsp;(Plano, Texas, U.S.), including its&nbsp;Smart Infrastructure, Electrification&nbsp;and Automation divisions, headquartered in North Carolina, JetZero is designing the greenfield factory to leverage the latest digital and industrial AI tools to ensure the most efficient and cost-effective production and operating model. Siemens also supports JetZero&rsquo;s design/build/test model for the demonstrator aircraft, a full-scale prototype slated for first flight in 2027 &mdash; its tools will enable accelerated design, adaptable manufacturing&nbsp;and digital test, shaving years of development time while upholding high quality and safety standards.</p>\n\n<p>Ultimately, the new facility in North Carolina will be the cornerstone of JetZero&rsquo;s production, enabling the company to help airlines meet growing demand for air travel at a significant operating cost advantage. JetZero reports that the Z4 will deliver up to 50% better fuel efficiency due to its all-wing design, with lift provided by the entire wingspan and lower drag compared to a tube-and-wing aircraft. The Z4 will seat ~250 passengers and fly routes of up to 5,000 nautical miles, a combination of capabilities that airlines need to serve the &ldquo;middle market&rdquo;&nbsp;between high-density single-aisle aircraft and larger twin-aisle aircraft. Demand for air travel is forecast to double by the 2040s (compared to 2019 levels), while the aviation industry also aims to decarbonize operations by 2050.</p>\n\n<p>&ldquo;You can only grow and meet demand while also decarbonizing through innovation,&rdquo; O&rsquo;Leary says. &ldquo;And while we&rsquo;re at it, let&rsquo;s make the flying experience incredible.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/jetzero-selects-greensboro-north-carolina-for-first-us-factory"
      }
    ],
    "link": "https://www.compositesworld.com/news/jetzero-selects-greensboro-north-carolina-for-first-us-factory"
  },
  {
    "published": "Mon, 16 Jun 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      16,
      14,
      0,
      0,
      0,
      167,
      0
    ],
    "title": "Carbitex flexible composites enter tactical boot market",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Carbitex flexible composites enter tactical boot market"
    },
    "summary": "Flexible footwear plates provide enhanced performance and stability for Prabos footwear serving&nbsp;military and law enforcement professionals.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Flexible footwear plates provide enhanced performance and stability for Prabos footwear serving&nbsp;military and law enforcement professionals."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-carbitex-prabos-boot.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-carbitex-prabos-boot.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Carbitex, Prabos</p>\n</div>\n\n<p><a href=\"https://www.carbitex.com/\" target=\"_blank\">Carbitex Inc.</a>&nbsp;(Kennewick, Wash., U.S.), the company that has developed flexible carbon fiber composites including patented technologies&nbsp;OmniFlex, MonoFlex and GearFlex, has expanded into the&nbsp;work and military boot segment through a close collaboration with Prabos&nbsp;(Slavicin), a heritage Czech boot manufacturer with more than&nbsp;100 years of tactical and outdoor footwear expertise.</p>\n\n<p>The collaboration introduces Carbitex&rsquo;s MonoFlex M1 technology into Prabos&rsquo; professional footwear line to advance its tactical boot performance. The flexible carbon fiber plates are engineered to provide stability and protection without the added weight and increased stiffness of traditional materials, eliminating a compromise that has burdened military personnel and tactical professionals.</p>\n\n<p>&ldquo;The integrated MonoFlex plate maximizes support, enhances energy efficiency and adds comfort for the user,&rdquo; says Filippo Sartor, vice president of global sales at Carbitex. &ldquo;We wanted to enter the military and tactical market with a game-changing technology,&nbsp;and as an innovator we&nbsp;believe that Prabos is the right choice for Carbitex.&rdquo;</p>\n\n<p>The partnership leverages Carbitex&rsquo;s track record <a href=\"https://www.compositesworld.com/articles/flexible-carbon-fiber-plates-enable-higher-performance-footwear\" target=\"_blank\">in athletic footwear innovation</a>, where its flexible carbon fiber technology has been adopted by leading brands for performance enhancement.&nbsp;</p>\n\n<p>The Carbitex-equipped Prabos collection has already made its debut at the Enforce Tac Show in Germany, featuring the Striker series with multiple configurations including the Striker Summer Mid and Low.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/carbitex-flexible-composites-enter-tactical-boot-market"
      }
    ],
    "link": "https://www.compositesworld.com/news/carbitex-flexible-composites-enter-tactical-boot-market"
  }
]