[
  {
    "published": "Tue, 17 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      17,
      16,
      0,
      0,
      1,
      168,
      0
    ],
    "title": "Cygnet, Viritech recover H2 tank continuous carbon fibers in Ford FCVGen2.0 project",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Cygnet, Viritech recover H2 tank continuous carbon fibers in Ford FCVGen2.0 project"
    },
    "summary": "Partner technologies&nbsp;have demonstrated the&nbsp;viability of recycled continuous fibers and the potential for automotive tanks to be recycled at meaningful rates.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Partner technologies&nbsp;have demonstrated the&nbsp;viability of recycled continuous fibers and the potential for automotive tanks to be recycled at meaningful rates."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Cygnet-Fibre-Recovery-System.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Unwinding of continuous carbon fiber.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Cygnet-Fibre-Recovery-System.jpg;maxWidth=720\" /> </a></div>\n\n<p>Cygnet Texkimp's Fibre Recovery System unwinds continuous carbon fiber&nbsp;from a demonstrator tank. Source (All Images) | Cygnet Texkimp</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/cygnet-texkimp\" target=\"_blank\">Cygnet Texkimp</a>&nbsp;(Northwich, U.K.) and hydrogen powertrain solutions developer <a href=\"https://www.viritech.co.uk/\" target=\"_blank\">Viritech</a>&nbsp;(Nuneaton, Warwickshire, U.K.) have partnered to recover high-value, continuous carbon fibers from hydrogen pressure vessels as part of a strategy to improve circularity in the manufacture of filament-wound parts.</p>\n\n<p>The two companies have worked together within the FCVGen2.0 consortium which is led by Ford Motor Co. and partly funded by the Advanced Propulsion Centre UK (APC). The consortium <a href=\"https://www.compositesworld.com/news/cygnet-texkimp-joins-uk-project-for-hydrogen-powered-ford-e-transit-development\" target=\"_blank\">was brought together in 2023</a>&nbsp;to design, build and trial a small fleet of hydrogen fuel-cell powered Ford <em>E-Transits</em> that maximize value for fleets with high daily energy demands and zero-emissions ambitions. One of its objectives is to develop and evaluate a viable recycling route for end-of-life (EOL) fuel tank components that maintains the properties of, and develops uses for, recycled fiber, in order to accelerate the industrialization of recycling technologies in automotive.</p>\n\n<p>The partnership between Cygnet Texkimp and Viritech harnessed Cygnet Texkimp&rsquo;s Fibre Recovery System, which addresses one of the project&rsquo;s key aims: To develop a workable strategy and technical capability to reclaim maximum value from carbon fiber&nbsp;hydrogen tanks at the end of their usable life and reuse them in new applications. The system, which complements Cygnet Texkimp&rsquo;s filament winding capability, has been developed to recover continuous, high-quality carbon fibers from filament-wound parts and present them in convenient, bobbin-wound formats for reuse in the manufacture of composites.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Viritech-tank.jpg\" target=\"_blank\"><img alt=\"Viritech tank on a Cygnet Texkimp winding machine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Viritech-tank.jpg;maxWidth=385\" /></a></div>\n\n<p>Viritech tank on a Cygnet Texkimp winding machine.</p>\n</div>\n\n<p>As part of the project, Viritech is creating composite pressure vessels &mdash; using a&nbsp;novel nano-infused,&nbsp;resin-based material system&nbsp;&mdash;&nbsp; that achieve optimum efficiency in manufacture and operation, while also being readily recyclable. Cygnet&rsquo;s&nbsp;technology successfully processed Viritech&rsquo;s graphene nanomaterial and&nbsp;recovered the tank&rsquo;s carbon fibers at its&nbsp;Innovation Centre using DEECOM (<a href=\"https://www.compositesworld.com/articles/pressurized-steam-based-composites-recycling-for-full-fiber-reclamation\" target=\"_blank\">read about the recycling process</a>). The reclaimed fibers were then mechanically unwound and rewound onto bobbins, ready to be reused in conventional applications.</p>\n\n<p>Unlike many other recycling processes, rCF is typically processed in short lengths and thus is limited in its application. Cygnet&rsquo;s technology, however, recovers and unwinds continuous fibers to enable their use as an alternative to virgin fibers, i.e., more high-value applications, like&nbsp;filament winding, pultrusion, weaving, unidirectional&nbsp;prepreg and towpreg.</p>\n\n<p>&ldquo;Our partnership with Viritech demonstrates the potential for hydrogen tanks to be recycled at a meaningful rate,&rdquo; says Dr. Yan Liu, senior R&amp;D specialist at Cygnet Texkimp, who led the project. &ldquo;Our Fibre Recovery System has an essential role to play in enabling design for recycling and design for disassembly strategies that inform the manufacture of future hydrogen pressure vessel technology.&nbsp;The system closes the loop between our DEECOM fiber&nbsp;recycling solution and our extensive filament winding capability and provides end-to-end processing and recycling capability for composite fibers.&rdquo;</p>\n\n<p>The two companies are also working together to further develop the filament winding technology as part of a strategy to develop highly efficient and sustainable manufacturing and recycling solutions for hydrogen pressure vessels. This partnership is based around Cygnet Texkimp&rsquo;s fully automated, five-axis filament winding cell and Viritech&rsquo;s graphene nanomaterial system.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cygnet-viritech-recover-h2-tank-continuous-carbon-fibers-in-ford-fcvgen20-project"
      }
    ],
    "link": "https://www.compositesworld.com/news/cygnet-viritech-recover-h2-tank-continuous-carbon-fibers-in-ford-fcvgen20-project"
  },
  {
    "published": "Tue, 17 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      17,
      15,
      0,
      0,
      1,
      168,
      0
    ],
    "title": "CRP Technology obtains ISO 14001:2015 certification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CRP Technology obtains ISO 14001:2015 certification"
    },
    "summary": "3D printing company strengthens its industrial model by combining environmental sustainability, technological innovation&nbsp;and strict process control.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "3D printing company strengthens its industrial model by combining environmental sustainability, technological innovation&nbsp;and strict process control."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-crp-gear-windformxt-2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"3D printed gear.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-crp-gear-windformxt-2.jpg;maxWidth=720\" /> </a></div>\n\n<p>A gear formed with&nbsp;Windform XT 2.0 IMG. Source | CRP Technology</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/crp-technology\" target=\"_blank\">CRP Technology</a> (Modena, Italy), a company known for its Windform range of fiber-reinforced materials for selective laser sintering (SLS) 3D printing, has obtained&nbsp;ISO 14001:2015 certification, confirming the company&rsquo;s responsible and sustainable environmental management.&nbsp;</p>\n\n<p>Issued by the DNV, this certification applies to the production of plastic components using SLS&nbsp;and the production of powders intended for SLS and other similar additive manufacturing processes. The certified activities fall under IAF code 15 (rubber and plastic products) and were assessed according to the requirements of Technical Regulation RT-09.</p>\n\n<p>This new milestone adds to the EN 9100 certification already achieved by CRP Technology for its quality management system applied to the aerospace and defense sectors, further confirming the industrial model adopted by CRP Technology &mdash; one that combines technological innovation, rigorous process control, operational transparency&nbsp;and environmental responsibility.&nbsp;</p>\n\n<p>CRP Technology's commitment to sustainability also takes shape through concrete circular economy projects, such as the recovery of Windform XT 2.0 powders (Windform XT 2.0 is a carbon fiber-reinforced nylon). Once no longer suitable for SLS 3D printing, the powders are reprocessed and converted into Windform XT 2.0 IMG, which can be used in injection molding or FDM/FFF 3D printing processes in pellet form.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/crp-technology-obtains-iso-140012015-certification"
      }
    ],
    "link": "https://www.compositesworld.com/news/crp-technology-obtains-iso-140012015-certification"
  },
  {
    "published": "Tue, 17 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      17,
      15,
      0,
      0,
      1,
      168,
      0
    ],
    "title": "Aditya Birla Advanced Materials strengthens U.S. operations through Cargill facility acquisition",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aditya Birla Advanced Materials strengthens U.S. operations through Cargill facility acquisition"
    },
    "summary": "Specialty manufacturing facility in Dalton, Georgia, will expand the Indian conglomerate&rsquo;s U.S. capacity, with plans to more than double its capacity over the next couple of years.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Specialty manufacturing facility in Dalton, Georgia, will expand the Indian conglomerate&rsquo;s U.S. capacity, with plans to more than double its capacity over the next couple of years."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-adityaburla-epoxybinders.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Epoxy preform binding.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-adityaburla-epoxybinders.jpg;maxWidth=720\" /> </a></div>\n\n<p>Aditya Birla Advanced Materials serves industries with a robust range of portfolios for composite systems, whether by application or by chemistry, such as this epoxy preform binding solution shown here. Source | <a href=\"https://www.linkedin.com/posts/abgadvancedmaterials_epoxybinders-compositemanufacturing-rtm-activity-7335996314167431168-Kvak?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAACA1Tx8BEqqBflKz5cDVh8RM7oQ64SX-Q2U\" target=\"_blank\">Aditya Burla LinkedIn</a></p>\n</div>\n\n<p><a href=\"https://www.adityabirla.com/en/\" target=\"_blank\">Aditya Birla Group</a> (Mumbia),&nbsp;an Indian multinational conglomerate with an ever-evolving portfolio of <a href=\"https://www.abg-am.com/portfolio/application/composites/102?tab=1-1\" target=\"_blank\">composite systems</a>, has announced the expansion of its&nbsp;U.S. Advanced Materials business with the acquisition of Cargill Inc.&rsquo;s (Minneapolist, Minn., U.S.) 17-acre specialty chemical manufacturing facility in Dalton, Georgia. The acquisition continues Aditya Birla&rsquo;s expansion in the U.S.&rsquo; manufacturing sector, a key aspect of the company&rsquo;s growth strategy, which now totals more than $15 billion in investment. &nbsp;</p>\n\n<p>&ldquo;This acquisition represents Aditya Birla&rsquo;s strategic entry into the U.S. chemicals industry, extending the business model of our other successful U.S. manufacturing businesses including&nbsp;Novelis&nbsp;and&nbsp;Birla Carbon,&rdquo; says Kumar Mangalam Birla, chairman of Aditya Birla Group. &ldquo;Our growth strategy is anchored in a commitment leverage our deep manufacturing expertise to support the revitalization of the growing U.S. manufacturing sector.&rdquo;</p>\n\n<p>With this acquisition, the Advanced Materials business welcomes 50 employees. The business plans to expand the facility&rsquo;s current capacity of 16,000 tons per year to more than&nbsp;40,000 tons over the next 2&nbsp;years, affirming the business&rsquo;s&nbsp;commitment to local operations and job creation. The acquisition was executed through Aditya Birla Chemicals (USA) Inc., a wholly owned subsidiary of&nbsp;<a href=\"https://www.compositesworld.com/suppliers/aditya-birla-chemicals-thailand\" target=\"_blank\">Aditya Birla Chemicals (Thailand) Ltd</a>.</p>\n\n<p>According to&nbsp;Jayant Dhobley, business head of CFI, Aditya Birla Group, this move will strengthen cooperation with customers in developing next-generation products. Aditya Burla expects further&nbsp;investments at the Georgia site&nbsp;in the coming months and will introduce advanced technologies from the company&rsquo;s global operations.</p>\n\n<p>Aditya Birla Group will continue to manufacture the plant&rsquo;s current output of formulated resins, curing agents, reactive diluents and polyaspartic resins for the marine, industrial coatings&nbsp;and flooring industries, which include epoxy resins, modifiers, curing agents&nbsp;and other specialty chemicals sold under the brands Chemcure, ChemMod, Altor, Acme Shield&nbsp;and ChemRes. Additionally, the Advanced Materials business will introduce products for the automotive, renewable energy and aerospace industries, including its patented chemistries to enable recycling of epoxy composites used in wind, sports goods, pressure vessels and other applications.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aditya-birla-advanced-materials-strengthens-us-operations-through-cargill-facility-acquisition"
      }
    ],
    "link": "https://www.compositesworld.com/news/aditya-birla-advanced-materials-strengthens-us-operations-through-cargill-facility-acquisition"
  },
  {
    "published": "Mon, 16 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      16,
      17,
      0,
      0,
      0,
      167,
      0
    ],
    "title": "Epsilon Composite, Toray Carbon Fibers Europe target composites in electrical infrastructure",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Epsilon Composite, Toray Carbon Fibers Europe target composites in electrical infrastructure"
    },
    "summary": "A 15-year partnership collaborating on carbon fiber core conductors has culminated in numerous global projects like modernizing&nbsp;TenneT&rsquo;s 400-kilovolt&nbsp;high-voltage grid.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A 15-year partnership collaborating on carbon fiber core conductors has culminated in numerous global projects like modernizing&nbsp;TenneT&rsquo;s 400-kilovolt&nbsp;high-voltage grid."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"HVCRC conductor.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-epsilon-hvcrc-conductor.png;maxWidth=720\" /> </div>\n\n<p>HVCRC&nbsp;conductor, composed of a structural composite core made from carbon fiber and annealed aluminum strands. Source (All Images) | Epsilon Composite</p>\n</div>\n\n<p>Carbon fiber pultrusion company&nbsp;<a href=\"https://www.compositesworld.com/suppliers/epsilon-composite\" target=\"_blank\">Epsilon Composite</a>&nbsp;(Gaillan en M&eacute;doc, France) and&nbsp;<a href=\"https://www.toray.eu/eu/europe/network/cfe/\" target=\"_blank\">Toray Carbon Fibers Europe</a> (Lacq, France), a subsidiary of <a href=\"https://www.compositesworld.com/suppliers/toray-industries\" target=\"_blank\">Toray Industries</a> (Tokyo, Japan), have been working together for 15 years to promote the use of carbon fiber in electrical infrastructure.&nbsp;This collaboration has culminated in numerous projects worldwide as well as a major framework agreement recently signed in the Netherlands.&nbsp;</p>\n\n<p>Since the qualification of Epsilon Composite&rsquo;s HVCRC&nbsp;conductors technology in 2010 &mdash; high-capacity, high-temperature, low-sag conductors&nbsp;made of a composite core using Torayca&nbsp;carbon fiber and highly conductive trapezoidal aluminum wires&nbsp;&mdash;&nbsp;the two French companies have played a key role in modernizing and strengthening power grids globally.</p>\n\n<p>HVCRC&rsquo;s light weight, strength and high thermal stability is able to effectively replace traditional metal cables, the companies report. The composite&nbsp;cables are capable of doubling&nbsp;the capacity of existing power lines quickly. In contrast, building new, traditional lines typically takes over a decade and requires significant investment.</p>\n\n<p>Increasing transmission capacity is also essential to meet the growing global demand for electricity and to connect new renewable energy sources (such as solar and wind) in support of decarbonization efforts. HVCRC cables achieve a 30% reduction in electrical losses, enhanced grid resilience to extreme weather events&nbsp;and a reduced risk of wildfires.&nbsp;</p>\n\n<p>&ldquo;After 40 years of collaboration, including 15 years on composite cores, Epsilon Composite and Toray Carbon Fibers Europe&nbsp;demonstrate the strength of a long-standing, innovative and effective industrial partnership, placing the composites sector at the heart of the global energy transition challenge,&rdquo; says Alexandre LULL, deputy CEO of Epsilon Composite.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-tennet-grid.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-tennet-grid.png;maxWidth=385\" /></a></div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-epsilon-composite-core-mfg.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-epsilon-composite-core-mfg.png;maxWidth=720\" /> </a></div>\n\n<p>Map of the Dutch transmission grid, managed by TenneT (top) and composite core manufacturing in Epsilon Composite&rsquo;s pultrusion workshop (bottom)</p>\n</div>\n</div>\n\n<p>Several thousand kilometers of Epsilon Composite&rsquo;s cable solution has already been installed&nbsp;across the Asia-Pacific, Africa, Europe and the Americas. The composite core conductors have also recently been selected for&nbsp;several major contracts in Europe. One is from European grid operator TenneT (Arnhem, Netherlands), which selected&nbsp;the HVCRC&nbsp;technology to modernize the entire&nbsp;Dutch 400-kilovolt&nbsp;high-voltage grid until&nbsp;2030.</p>\n\n<p>Following a tender launched in 2024, TenneT selected two European cable manufacturers partnered with Epsilon Composite &mdash;Nexans and DeAngeli Prodotti &mdash; to produce HVCRC&nbsp;conductors. For this tender, the Dutch grid operator challenged suppliers to optimize not only their products but also supply chains and operations to minimize electrical losses and greenhouse gas emissions throughout the product life cycle. TenneT also required a life cycle analysis to assess the environmental impact of the products, integrating this data into the evaluation process.</p>\n\n<p>Epsilon Composite&rsquo;s proactive efforts over the years to assess and optimize the environmental impact of its production and supply chain contributed significantly to this process.</p>\n\n<p>Implementation of the framework agreement has already begun, with two pilot projects underway to qualify HVCRC&nbsp;cables manufactured by Nexans and DeAngeli Prodotti, as well as Epsilon&rsquo;s Corecheck&nbsp;technology, which ensures the integrity of the composite core at every stage of manufacturing and installation. The project is expected to continue until all remaining metallic conductors on TenneT&rsquo;s 400-kilovolt&nbsp;lines are replaced.</p>\n\n<p>&ldquo;We are convinced that this HVCRC&nbsp;technology is contributing to the future of electrification in the European and global markets,&rdquo; adds Armin Klesing, marketing and sales director at Toray Carbon Fibers Europe</p>\n\n<p>Both Epsilon Composite and Toray continue to invest in R&amp;D and production capacities to support market growth. Toray Carbon Fibers Europe is completing the construction of a sixth carbon fiber production line, set to be operational by the end of 2025. This new line will further strengthen the company&rsquo;s supply&nbsp;to the&nbsp;European market and guarantee a national supply of the material.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/epsilon-composite-toray-carbon-fibers-europe-target-composites-in-electrical-infrastructure"
      }
    ],
    "link": "https://www.compositesworld.com/news/epsilon-composite-toray-carbon-fibers-europe-target-composites-in-electrical-infrastructure"
  },
  {
    "published": "Mon, 16 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      16,
      16,
      0,
      0,
      0,
      167,
      0
    ],
    "title": "TPRC offers specialized training in TPC for engineers",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "TPRC offers specialized training in TPC for engineers"
    },
    "summary": "Three hands-on programs are available, covering the intricacies of thermoplastic composites, from intro to advanced levels.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Three hands-on programs are available, covering the intricacies of thermoplastic composites, from intro to advanced levels."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-tprc-tpc-training.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"TPRC thermoplastics training.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-tprc-tpc-training.png;maxWidth=720\" /> </a></div>\n\n<p>Source | TPRC</p>\n</div>\n\n<p>What are thermoplastic composites (TPC), why are they increasingly used and how can they be processed and applied effectively? The&nbsp;<a href=\"https://www.compositesworld.com/suppliers/thermoplastic-composites-research-center-tprc\" target=\"_blank\">ThermoPlastic composites Research Center</a>&nbsp;(TPRC,&nbsp;Enschede, Netherlands)&nbsp;provides extensive answers to these questions through training sessions, with a hands-on and practical approach in its modern lab.</p>\n\n<p>The TPRC<em>&nbsp;</em>offers three&nbsp;specialized training programs to enhance participants&rsquo; knowledge on TPC. Over the past years, this&nbsp;training has&nbsp;proven to be a great success, with growing demand and full participant lists. The currently available training sessions&nbsp;are:</p>\n\n<p><strong>Introduction to Thermoplastics</strong>. This 2-day training is focused on the key features of TPC and processing techniques. It is&nbsp;ideal for entry-level professionals or development engineers who consider potential applications of the material. The course includes practical and theoretical sessions on:</p>\n\n<ul>\n\t<li>Thermoplastic matrix types and properties</li>\n\t<li>Fibers</li>\n\t<li>Prepregs</li>\n\t<li>Processing technologies</li>\n\t<li>Characterization methods</li>\n\t<li>Principles and basics of forming and design.</li>\n</ul>\n\n<p><strong>Joining of Thermoplastic Composites</strong>. Designed for engineers aiming to improve their expertise in joining methods, this&nbsp;TPRC course focuses on the theory and application of joining techniques for TPC, with a special focus on welding methods. Over 2&nbsp;days, participants will learn about the following topics in the TPRC lab:</p>\n\n<ul>\n\t<li>Standard- and non-standard joining methods</li>\n\t<li>Fundamentals of fusion bonding</li>\n\t<li>Welding techniques, including induction and resistance welding</li>\n\t<li>Multi-material joining (joining thermoplastics to thermosets and metals)</li>\n\t<li>Joint characterization.</li>\n</ul>\n\n<p><strong>Advanced Forming of Thermoplastic Composites</strong>. All aspects of press forming of TPC&nbsp;are included in this course, with hands-on work involving material properties, effects of tool design and use of process simulation tools. This 2-day training is tailored for experienced participants and focuses mainly on the following topics:</p>\n\n<ul>\n\t<li>Equipment and press forming setups</li>\n\t<li>Tool design</li>\n\t<li>Material characterization for forming applications</li>\n\t<li>Forming simulations</li>\n\t<li>Crystallization behavior and warpage.</li>\n</ul>\n\n<p>More about the TPRC&rsquo;s specialized training programs&nbsp;<a href=\"https://tprc.nl/training?utm_source=CompositesWorld&amp;utm_medium=referral&amp;utm_campaign=PressRelease&amp;utm_term=2025-06\" target=\"_blank\">can be accessed here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/tprc-offers-specialized-training-in-tpc-for-engineers"
      }
    ],
    "link": "https://www.compositesworld.com/news/tprc-offers-specialized-training-in-tpc-for-engineers"
  },
  {
    "published": "Mon, 16 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      16,
      15,
      0,
      0,
      0,
      167,
      0
    ],
    "title": "JetZero selects Greensboro, North Carolina for first U.S. factory",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "JetZero selects Greensboro, North Carolina for first U.S. factory"
    },
    "summary": "Access to talent, infrastructure and supportive business-friendly state culture were keys to selecting this location for JetZero&rsquo;s all-wing composite Z4 aircraft, which will be able to produce 20 aircraft/month when at&nbsp;full rate.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Access to talent, infrastructure and supportive business-friendly state culture were keys to selecting this location for JetZero&rsquo;s all-wing composite Z4 aircraft, which will be able to produce 20 aircraft/month when at&nbsp;full rate."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-jetzero-greensboro-site.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Rendering of the Greensboro factory from above.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-jetzero-greensboro-site.png;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | JetZero</p>\n</div>\n\n<p><a href=\"https://www.jetzero.aero/\" target=\"_blank\">JetZero</a>&nbsp;(Long Beach, Calif., U.S.), the aerospace startup developing an all-wing airplane design, has announced Greensboro, North Carolina, as the location for its first advanced manufacturing and final assembly facility. Located on the Piedmont Triad International Airport grounds, the factory will&nbsp;produce JetZero&rsquo;s Z4 blended wing body (BWB) aircraft, designed to transform commercial aviation through fuel efficiency, engineering, and an elevated passenger and flight crew experience. The aircraft will also be&nbsp;<a href=\"https://www.compositesworld.com/news/hexcel-jetzero-partner-to-qualify-composites-for-bwb-aircraft\" target=\"_blank\">supported by composite materials</a> qualified with <a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel</a> (Stamford, Conn., U.S.).</p>\n\n<p>The new site will create more than 14,500 jobs, delivering positive economic impact on the region and providing opportunities for collaboration with academic and vocational training institutions. JetZero will be capable of producing up to 20 Z4 airplanes per month at the factory&rsquo;s full run rate, expected to be achieved by the late 2030s.</p>\n\n<p>&ldquo;North Carolina offers the ideal combination of talent, infrastructure&nbsp;and forward-thinking leadership to support our mission to reshape aviation,&rdquo; notes&nbsp;Tom O&rsquo;Leary, CEO and co-founder of JetZero.&nbsp;</p>\n\n<p>The state&rsquo;s aerospace ecosystem, access to world-class research, university and technical colleges, and commitment to bringing innovative businesses to the state were key factors in JetZero&rsquo;s selection. The company is working closely with state and local officials on workforce development and training programs. Construction on the facility is expected to begin in the first half of 2026, with first customer deliveries in the early 2030s.&nbsp;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-JetZero-airline-model.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Close-up render of the JetZero facility.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-JetZero-airline-model.png;maxWidth=720\" /> </a></div>\n\n<p>JetZero is designing its greenfield factory to leverage the latest digital and industrial AI tools.</p>\n</div>\n\n<p>JetZero is taking a clean-sheet approach to designing and building the factory. Working with <a href=\"https://www.sw.siemens.com/en-US/\" target=\"_blank\">Siemens</a>&nbsp;(Plano, Texas, U.S.), including its&nbsp;Smart Infrastructure, Electrification&nbsp;and Automation divisions, headquartered in North Carolina, JetZero is designing the greenfield factory to leverage the latest digital and industrial AI tools to ensure the most efficient and cost-effective production and operating model. Siemens also supports JetZero&rsquo;s design/build/test model for the demonstrator aircraft, a full-scale prototype slated for first flight in 2027 &mdash; its tools will enable accelerated design, adaptable manufacturing&nbsp;and digital test, shaving years of development time while upholding high quality and safety standards.</p>\n\n<p>Ultimately, the new facility in North Carolina will be the cornerstone of JetZero&rsquo;s production, enabling the company to help airlines meet growing demand for air travel at a significant operating cost advantage. JetZero reports that the Z4 will deliver up to 50% better fuel efficiency due to its all-wing design, with lift provided by the entire wingspan and lower drag compared to a tube-and-wing aircraft. The Z4 will seat ~250 passengers and fly routes of up to 5,000 nautical miles, a combination of capabilities that airlines need to serve the &ldquo;middle market&rdquo;&nbsp;between high-density single-aisle aircraft and larger twin-aisle aircraft. Demand for air travel is forecast to double by the 2040s (compared to 2019 levels), while the aviation industry also aims to decarbonize operations by 2050.</p>\n\n<p>&ldquo;You can only grow and meet demand while also decarbonizing through innovation,&rdquo; O&rsquo;Leary says. &ldquo;And while we&rsquo;re at it, let&rsquo;s make the flying experience incredible.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/jetzero-selects-greensboro-north-carolina-for-first-us-factory"
      }
    ],
    "link": "https://www.compositesworld.com/news/jetzero-selects-greensboro-north-carolina-for-first-us-factory"
  },
  {
    "published": "Mon, 16 Jun 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      16,
      14,
      0,
      0,
      0,
      167,
      0
    ],
    "title": "Carbitex flexible composites enter tactical boot market",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Carbitex flexible composites enter tactical boot market"
    },
    "summary": "Flexible footwear plates provide enhanced performance and stability for Prabos footwear serving&nbsp;military and law enforcement professionals.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Flexible footwear plates provide enhanced performance and stability for Prabos footwear serving&nbsp;military and law enforcement professionals."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-carbitex-prabos-boot.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-carbitex-prabos-boot.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Carbitex, Prabos</p>\n</div>\n\n<p><a href=\"https://www.carbitex.com/\" target=\"_blank\">Carbitex Inc.</a>&nbsp;(Kennewick, Wash., U.S.), the company that has developed flexible carbon fiber composites including patented technologies&nbsp;OmniFlex, MonoFlex and GearFlex, has expanded into the&nbsp;work and military boot segment through a close collaboration with Prabos&nbsp;(Slavicin), a heritage Czech boot manufacturer with more than&nbsp;100 years of tactical and outdoor footwear expertise.</p>\n\n<p>The collaboration introduces Carbitex&rsquo;s MonoFlex M1 technology into Prabos&rsquo; professional footwear line to advance its tactical boot performance. The flexible carbon fiber plates are engineered to provide stability and protection without the added weight and increased stiffness of traditional materials, eliminating a compromise that has burdened military personnel and tactical professionals.</p>\n\n<p>&ldquo;The integrated MonoFlex plate maximizes support, enhances energy efficiency and adds comfort for the user,&rdquo; says Filippo Sartor, vice president of global sales at Carbitex. &ldquo;We wanted to enter the military and tactical market with a game-changing technology,&nbsp;and as an innovator we&nbsp;believe that Prabos is the right choice for Carbitex.&rdquo;</p>\n\n<p>The partnership leverages Carbitex&rsquo;s track record <a href=\"https://www.compositesworld.com/articles/flexible-carbon-fiber-plates-enable-higher-performance-footwear\" target=\"_blank\">in athletic footwear innovation</a>, where its flexible carbon fiber technology has been adopted by leading brands for performance enhancement.&nbsp;</p>\n\n<p>The Carbitex-equipped Prabos collection has already made its debut at the Enforce Tac Show in Germany, featuring the Striker series with multiple configurations including the Striker Summer Mid and Low.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/carbitex-flexible-composites-enter-tactical-boot-market"
      }
    ],
    "link": "https://www.compositesworld.com/news/carbitex-flexible-composites-enter-tactical-boot-market"
  },
  {
    "published": "Fri, 13 Jun 2025 15:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      19,
      0,
      0,
      4,
      164,
      0
    ],
    "title": "Archer raises $850 million, accelerates U.S. eVTOL rollout",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Archer raises $850 million, accelerates U.S. eVTOL rollout"
    },
    "summary": "The additional funds&nbsp;further support Archer&rsquo;s liquidity position of approximately $2 billion in anticipation of Midnight&rsquo;s commercialization.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The additional funds&nbsp;further support Archer&rsquo;s liquidity position of approximately $2 billion in anticipation of Midnight&rsquo;s commercialization."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-archeraviation.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Midnight static image.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-archeraviation.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | Archer Aviation</p>\n</div>\n\n<p>On June 13, <a href=\"https://archer.com/\" target=\"_blank\">Archer Aviation Inc.</a> (Santa Clara, Calif., U.S.) raised an additional $850 million&nbsp;following the announcement by the current U.S. administration to implement&nbsp;eVTOL Integration Pilot Program<em>&nbsp;</em>focused on accelerating the deployment of eVTOL aircraft in the U.S.</p>\n\n<p>Archer intends to closely coordinate with the administration, Department of Transportation (DOT) and the Federal Aviation Administration (FAA) on how this can integrate into Archer&rsquo;s plans to ramp its operations in the U.S. ahead of the LA 28 Olympic Games at which Archer will serve as the <a href=\"https://www.compositesworld.com/news/archer-to-provide-midnight-evtol-for-2028-olympic-paralympics\" target=\"_blank\">official air taxi provider</a> of the Olympic Games and Team USA.&nbsp;</p>\n\n<p>Archer will be at the 2025 Paris Air Show showcasing its <em>Midnight</em> aircraft and hosting delegations from more than 20 countries. Archer CEO and founder Adam Goldstein is set to meet with the U.S.&nbsp;Secretary of Transportation, Sean P. Duffy, and acting FAA administrator, Chris Rocheleau, while at the show.</p>\n\n<p>The financing provided for the purchase and sale of 85,000,000 shares of Archer&rsquo;s Class A common stock at a price of $10.00 per share in a registered direct offering. The net proceeds from the offering announced will be used for general corporate purposes, with a focus on the build out of Archer&rsquo;s commercial capabilities, including infrastructure to support Archer&rsquo;s recently announced initiatives, both in the U.S. and Archer&rsquo;s &ldquo;Launch Edition&rdquo; markets, and the development of an AI-based aviation software platform.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/archer-raises-850-million-accelerates-us-evtol-rollout"
      }
    ],
    "link": "https://www.compositesworld.com/news/archer-raises-850-million-accelerates-us-evtol-rollout"
  },
  {
    "published": "Fri, 13 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      17,
      0,
      0,
      4,
      164,
      0
    ],
    "title": "Dura Composites calls for reconsideration of U.K. Building Safety Act fire regulations",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Dura Composites calls for reconsideration of U.K. Building Safety Act fire regulations"
    },
    "summary": "With incorrect enforcement hampering vital remedial work,&nbsp;Dura Composites provides checklist for specifiers seeking composite and metal products for high-rise building projects.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "With incorrect enforcement hampering vital remedial work,&nbsp;Dura Composites provides checklist for specifiers seeking composite and metal products for high-rise building projects."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-dura-composite-decking.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composite decking.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-dura-composite-decking.png;maxWidth=720\" /> </a></div>\n\n<p>An example of Dura Composites&rsquo; composite terrace decking with&nbsp;A1 fire classification. Source | Dura Composites</p>\n</div>\n\n<p>Manufacturer of composite and metal solutions for civil infrastructure <a href=\"https://www.compositesworld.com/suppliers/dura-composites\" target=\"_blank\">Dura Composites</a>&nbsp;(Clacton-on-Sea, U.K.) is&nbsp;calling for an urgent rethink of the U.K.&rsquo;s safety regulations relating to decking and cladding for high-rise buildings, and how they are implemented. The company is also putting pressure on industry regulators to enforce tighter rules about fire testing.</p>\n\n<p>According to the company, there is currently a level of confusion surrounding the exact criteria that different products need to comply with for buildings over the height of 11 meters. While cladding requires a classification of A2-s1,d0, <a href=\"https://www.gov.uk/government/publications/fire-safety-approved-document-b\" target=\"_blank\">Approved Document B</a> states that for flooring, a classification of A2fl-s1 should be achieved.</p>\n\n<p>However in practice, remedial designers are grouping these two very different products together and requesting an A2-s1d0 fire classification for all. Unless there is an imperforate substrate under it which extends to the full area of the balcony where A2fl-s1 materials are fitted, then A2fl-s1 is allowed.</p>\n\n<p>In other cases, Dura Composites has concerns that officials aren&rsquo;t upholding products to regulations stringently enough. Common issues include products not being tested by a UKAS-accredited test facility or in the right orientation, not being tested for the correct field of application, and not being tested in the right color, all of which are stated in the BS EN13501 fire classification standards and can affect the fire-resistance of decking, potentially putting occupants in danger, and leaving those in charge liable.</p>\n\n<p>Furthermore, some decking providers are circumventing the official UKAS accreditation, by having products tested in other countries with less strict requirements, before transporting them to the U.K.</p>\n\n<p>&ldquo;It&rsquo;s looking likely the government won&rsquo;t meet its target to start or complete remedial works on all buildings by July 2027,&rdquo; says Lee Cavalier, decking and cladding manager at Dura Composites. &ldquo;A big factor behind this is the rules themselves, both in terms of clarity over what is required, and actually enforcing these standards. Clearer rules and processes would prevent accidents and be fairer on suppliers, contractors and buyers. When manufacturers aren&rsquo;t clear on the ratings required for their own products, it&rsquo;s no surprise that awareness among housebuilders, developers and contractors is low.&rdquo;</p>\n\n<p>What should specifiers be asking? Dura Composites says that specifiers can protect themselves by asking the following questions about products, testing and installation for high-rise buildings:</p>\n\n<ul>\n\t<li>Is the certificate provider UKAS-accredited?</li>\n\t<li>Has every component of the product received a fire rating? Different aspects of a product may perform differently, so there should be a fire rating for each individual component.</li>\n\t<li>Do the fire rating and test certificate match the field of application?</li>\n\t<li>Does the installation guide advise on installation methods to match the field of application?</li>\n\t<li>Each product should be installed using a specific method to achieve its stated fire rating.</li>\n\t<li>Has the right orientation been tested? Different orientations may impact the fire rating of the product. Decking products should be tested horizontally, and cladding products should be tested in their intended orientation.</li>\n\t<li>Have all of the available colors been tested? Different colors of a product may impact its fire rating.</li>\n\t<li>Does the fire certificate state which colors are covered, specifically in section 4&nbsp;of the field of application? For example, only a single color is listed followed by &ldquo;no variation allowed.&rdquo;</li>\n</ul>\n\n<p>Uncertainty over regulations isn&rsquo;t the only thing holding up successful remediation work, Dura notes. It was recently announced that the Building Safety Regulator has missed its target to clear the backlog of Gateway 2 approvals by April. While&nbsp;thorough processes are important, this is yet another factor preventing remedial work that is crucial to residents&rsquo; safety.</p>\n\n<p>Dura Composites has submitted its concerns to the Building Safety Regulator and is encouraging other manufacturers to join the cause, asking for more transparency over fire safety standards for high-rise decking and cladding.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dura-composites-calls-for-reconsideration-of-uk-building-safety-act-fire-regulations"
      }
    ],
    "link": "https://www.compositesworld.com/news/dura-composites-calls-for-reconsideration-of-uk-building-safety-act-fire-regulations"
  },
  {
    "published": "Fri, 13 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      16,
      0,
      0,
      4,
      164,
      0
    ],
    "title": "GFRP Tech, FRP Institute USA establish the GFRP Institute South Africa",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "GFRP Tech, FRP Institute USA establish the GFRP Institute South Africa"
    },
    "summary": "The South African institute is dedicated to enhancing the region&rsquo;s education in GFRP composite materials for construction.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The South African institute is dedicated to enhancing the region&rsquo;s education in GFRP composite materials for construction."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-gfrp-institute.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"GFRP rebar being laid down.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-gfrp-institute.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Through the GFRP Institute, professionals across the industry can adhere to the highest quality standards when working with and designing structures using glass fiber-reinforced polymer (GFRP) materials. Source | GFRP Tech</p>\n</div>\n\n<p>Allen Fiford, CEO of&nbsp;<a href=\"https://gfrptech.co.za/\" target=\"_blank\">GFRP Tech</a>&nbsp;(Johannesburg, South Africa), and Richard Krolewski, CEO of <a href=\"https://www.frp-institute.org/\" target=\"_blank\">FRP Institute USA</a>, are joining forces to enhance the education and application of glass fiber-reinforced polymer (GFRP) composite materials through the establishment of the GFRP Institute South Africa.</p>\n\n<p>The newly formed GFRP Institute is the first dedicated institute in the region aimed at promoting best practices, quality standards and compliance within the GFRP composites industry, while focusing on promoting the application of these products within the South African construction industry.</p>\n\n<p>The institute will further serve as a hub for education, training&nbsp;and research. &ldquo;Our immediate focus is to bridge the knowledge gap regarding these composite materials in the construction sector,&rdquo;&nbsp;says Fiford.</p>\n\n<p>FRP Institute USA is a trade group formed in 2022 to promote the increased use of fiber-based polymer (FRP) reinforcement in concrete infrastructure such as bridges, roadways, seawalls and related structures. The FRP Institute collaborates with federal agencies, state DOTs, AASHTO, standards-setting groups and academia to increase awareness of FRPs, certify manufacturers, standardize specifications, test FRP materials and develop technical educational programming.</p>\n\n<p>GFRP Tech&nbsp;supplies GFRP&nbsp;products for the concrete manufacturing industry and specializes in providing structural GFRP products to specific niche markets in the construction and engineering industries.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gfrp-tech-frp-institute-usa-establish-the-gfrp-institute-south-africa"
      }
    ],
    "link": "https://www.compositesworld.com/news/gfrp-tech-frp-institute-usa-establish-the-gfrp-institute-south-africa"
  }
]