[
  {
    "published": "Tue, 20 May 2025 20:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      21,
      0,
      0,
      0,
      2,
      141,
      0
    ],
    "title": "CEAD launches the Maritime Application Center dedicated to industrial 3D printing boat hulls",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CEAD launches the Maritime Application Center dedicated to industrial 3D printing boat hulls"
    },
    "summary": "The MAC is an LFAM-powered production facility equipped with&nbsp;highly automated, digitally driven manufacturing processes and built around a collaborative model to develop the boats of the future.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The MAC is an LFAM-powered production facility equipped with&nbsp;highly automated, digitally driven manufacturing processes and built around a collaborative model to develop the boats of the future."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-mac-fishing-boat-print.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-mac-fishing-boat-print.jpg;maxWidth=720\" /> </a></div>\n\n<p>Fishing boat print at the MAC. Source (All Images) | CEAD B.V.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/cead-bv\" target=\"_blank\">CEAD&nbsp;B.V.</a> (Delft, Netherlands) has launched the Maritime Application Center (MAC), an initiative focused on accelerating the adoption of automated, sustainable production in the maritime sector. The MAC is positioned as a innovation hub where advanced manufacturing, material development&nbsp;and application engineering converge to tackle the complexity of boatbuilding and related maritime components.</p>\n\n<p>The MAC is a 2,300-square-meter space right&nbsp;around the corner of CEAD&rsquo;s headquarters&nbsp;where boats are to be developed and produced through a highly automated, digitally driven manufacturing process. MAC&rsquo;s launch introduces the company&rsquo;s two-fold vision for marine.&nbsp;First, to provide production capacity supporting shipbuilders and maritime manufacturers who are not yet ready to adopt large-scale 3D printing in-house, but are eager to reap the benefits of a highly automated production process. Second, to accelerate application development and therefore adoption of large-scale 3D printing technology in the maritime industry by working closely with industry partners and existing CEAD customers &mdash;&nbsp;sharing knowledge, co-developing solutions and pushing the boundaries of what&rsquo;s possible together.</p>\n\n<p>The MAC aims to demonstrate what the boat factory of the future looks like: a high-output, compact, automated facility where just two to three operators could produce more than&nbsp;100&nbsp;boats per year, depending on the specific factory configuration. At the MAC, CEAD is currently scaling production capacity to manufacture at least 100 boats per year, to supply the market and to actively demonstrate technical feasibility, efficiency and profitability of this factory model.&nbsp;</p>\n\n<h3>Overcoming traditional shipbuilding complexities</h3>\n\n<p>Shipbuilding today requires the combined efforts of an entire shipyard ecosystem, relying heavily on skilled labor, large-scale infrastructure and complicated, interconnected value streams. Many shipyards have spent decades optimizing for cost and specialization, creating highly segmented workflows and centralized resources. However, recent growth in demand is straining shipyards already facing surge in employee retirements, aging infrastructure and day-to-day operational inefficiencies, making it difficult to scale or adapt quickly to market demands. There is also an increasing demand to lower the maritime industry&rsquo;s impact on greenhouse gas emissions, as targets set by the International Maritime Organization (IMO) requires organizations to transition toward&nbsp;more sustainable manufacturing approaches.</p>\n\n<p>CEAD believes that the current conditions within the maritime sector make it particularly well-suited for large-scale 3D printing technology, which addresses many of the bottlenecks the industry currently faces. For example, large-scale 3D printing technology enables the production of boat hulls directly from a digital file, eliminating time-consuming, waste-generating steps and reduces&nbsp;reliance on skilled manual labor. In doing so, it helps lower costs, shorten lead times and enables manufacturers to quickly adapt to changing market demands in both design and production capacity.&nbsp;</p>\n\n<p>CEAD has developed a dedicated system, based on its extrusion technology, specifically designed to 3D print boat hulls in an automated manner. With this dedicated machine, the company says it has&nbsp;created a production technology that enables boatbuilding in a manner &ldquo;not feasible with standard robotic 3D printers.&rdquo; These machines form the foundation of a production facility with the flexibility to scale output as demand grows. Unlike traditional shipyards, this boat factory also operates without the need of heavy infrastructure, zoning or labor demands, making it viable in light industrial or even urban environments like the city of Delft.</p>\n\n<div class=\"article_sidebar\">\n<h3>CEAD&rsquo;s history in composites 3D printing</h3>\n\n<p>Since its start in 2014, CEAD has placed R&amp;D, as well as customer success, at the core of its mission. The company is known for&nbsp;composite large-format 3D printing technologies that enable the automated production of large, complex composite parts. It&rsquo;s commitment to R&amp;D is evident in the portfolio that CEAD has developed, including robotic-&nbsp;and gantry-based solutions, a range of pellet extruders and additional functionalities such as ATLAM, scan-2-mill, datalogging&nbsp;and more.&nbsp;</p>\n\n<p>The MAC is a direct result of CEAD&rsquo;s vision to go beyond delivering a machine, but to offer complete, integrated systems that provide an end-to-end solution for its customers. The MAC embodies this approach, where broad-based research is aimed at enabling the successful and accelerated adoption of large-scale 3D printing within the maritime industry.</p>\n</div>\n\n<h3>Innovation through partnerships</h3>\n\n<p>Recognizing the complexity of 3D printing entire boats, the MAC is built on a collaborative model. CEAD works closely with industry partners and provides a platform to learn and grow. Together, partners can explore everything from 3D printing design for boat hulls, material development for marine environments to process optimization and software innovations.</p>\n\n<blockquote>\n<p>The MAC is <a href=\"https://ceadgroup.com/contact/?utm_source=Referral&amp;utm_medium=MAC+Article-1&amp;utm_campaign=Maritime\" target=\"_blank\">open to collaborations</a> to shape the future of maritime manufacturing.</p>\n</blockquote>\n\n<p>&ldquo;We bring deep expertise in large-scale 3D printing technology, but true innovation happens when we combine that with the knowledge our industry partners have: whether it&rsquo;s about boat design, regulatory requirements&nbsp;or real-world performance,&rdquo; emphasizes&nbsp;Charl&eacute;ne van Wingerden, chief business development officer at CEAD.&nbsp;&ldquo;It&rsquo;s that exchange of expertise that makes collaboration so powerful.&rdquo;</p>\n\n<h3>Application focus: 3D printing industrial boat hulls</h3>\n\n<p>At the heart of the MAC&rsquo;s activities is a clear focus: developing and refining the process of 3D printing hulls for the professional maritime sector. It is currently&nbsp;targeting boats up to 12 meters in length, intended for industrial or defense applications, such as workboats, for example (patrol boats, fishing boats, supply boats, etc.)&nbsp;and unmanned surface vessels (USVs). The team is engaged in hands-on experimentation, exploring every aspect of the application.</p>\n\n<p>The company recently launched CEAD HDPro, a new material engineered to outperform conventional HDPE in heavy-duty maritime applications. These efforts led to the successful production of its first&nbsp;full-scale fishing boat using CEAD HDPro, completed in just 88 hours of printing time.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-mac-fuel-tank-print.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-mac-fuel-tank-print.png;maxWidth=720\" /> </a></div>\n\n<p>Fuel tank print.</p>\n</div>\n\n<p>&ldquo;It&rsquo;s an exciting learning process. We&rsquo;re learning by doing: testing, tweaking and printing in real-time. We have to figure out new things, but that&rsquo;s exactly how real innovation happens,&rdquo; says Maarten Logtenberg, CTO at CEAD. &ldquo;The MAC is intended as a place to educate, while continuing to learn and evolve ourselves.&rdquo;</p>\n\n<h3>Targeting a future of local, automated&nbsp;and green manufacturing</h3>\n\n<p>In order to reach the targets set by the IMO to reduce carbon emissions in the maritime industry, collaboration and innovation are essential, CEAD says. Large-scale 3D printing technology can empower&nbsp;shipbuilders and operators to produce vessels and components where they&rsquo;re needed and when they&rsquo;re needed. Additionally, the MAC&rsquo;s setup can be readily replicated at strategic locations around the world,&nbsp;closer to the point of use in nontraditional, compact environments.</p>\n\n<p>The MAC serves as a blueprint for an approach CEAD calls a &ldquo;CEAD-powered microfactory&rdquo;&nbsp;These high-output, compact, automated production facilities are build around CEAD&rsquo;s technology where the machines are tailored to specific applications. Thanks to the modularity of the&nbsp;systems, this microfactory model is not limited to one sector, but applicable across industries. While the MAC is specifically designed for the maritime industry, other microfactories have already been realized, such as the recently launched <a href=\"https://www.compositesworld.com/news/haddy-opens-lfam-microfactory-in-florida-for-localized-agile-composite-parts-production\" target=\"_blank\">Haddy facility in Florida</a>.</p>\n\n<div class=\"article_sidebar\">\n<p>The MAC, though already operational, will officially open its doors on June 20, 2025. CEAD invites&nbsp;maritime professionals, shipbuilders, designers&nbsp;and OEMs to attend&nbsp;the launch or learn&nbsp;more about the initiative. Interested parties can request an invitation by emailing <a href=\"mailto:mac@ceadgroup.com\" target=\"_blank\">mac@ceadgroup.com</a> directly.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cead-launches-the-maritime-application-center-dedicated-to-industrial-3d-printing-boat-hulls"
      }
    ],
    "link": "https://www.compositesworld.com/news/cead-launches-the-maritime-application-center-dedicated-to-industrial-3d-printing-boat-hulls"
  },
  {
    "published": "Mon, 19 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      19,
      17,
      0,
      0,
      0,
      139,
      0
    ],
    "title": "Archer to provide Midnight eVTOL for 2028 Olympics, Paralympics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Archer to provide Midnight eVTOL for 2028 Olympics, Paralympics"
    },
    "summary": "Archer seeks to integrate air taxi support&nbsp;across LA&nbsp;through transporting LA28&rsquo;s VIPs, fans and stakeholders to key venues.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Archer seeks to integrate air taxi support&nbsp;across LA&nbsp;through transporting LA28&rsquo;s VIPs, fans and stakeholders to key venues."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-archer-la28-rendering.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Rendering of Midnight air taxi at LA28.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-archer-la28-rendering.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Archer Aviation</p>\n</div>\n\n<p>On May 15, <a href=\"https://archer.com/\" target=\"_blank\">Archer Aviation</a> (Santa Clara, Calif., U.S.) announced that it ha been selected as the official air taxi provider of the Los Angeles&nbsp;2028 (LA28) Olympic and Paralympic Games and Team USA. Through this exclusive partnership, the two will look to integrate Archer&rsquo;s <em>Midnight</em> eVTOL aircraft across the LA28 games in a variety of ways, such as transporting VIPs, fans and stakeholders, while electrifying vertiport takeoff and landing hubs for key venues and providing support for emergency services and security.</p>\n\n<p>Archer and LA28 will introduce the company&rsquo;s <em>Midnight</em> eVTOL aircraft to Los Angeles, which is expected to host more than&nbsp;15 million visitors and broadcast to billions of viewers globally over the course of the games. The partnership includes support for Team USA through LA28.</p>\n\n<p><em>Midnight</em> is Archer&rsquo;s piloted electric air taxi designed to carry up to four passengers. It uses composite materials&nbsp;to support <a href=\"https://www.compositesworld.com/news/archer-aviation-plans-to-work-with-hexcel-to-advance-evtol-production-capabilities\" target=\"_blank\">its infrastructure</a> &mdash; from the vehicle&rsquo;s <a href=\"https://www.compositesworld.com/news/archer-successfully-completes-multiple-battery-pack-drop-tests-for-midnight-aircraft\" target=\"_blank\">battery enclosures</a>&nbsp;to its airframe.&nbsp;The eVTOL aircraft is built with redundant, fault-tolerant systems, including 12 total engines and propellers, enabling Archer to target certification with the Federal Aviation Administration (FAA) at similar levels of safety as commercial airliners. <em>Midnight</em> is made at Archer&rsquo;s manufacturing facilities in San Jose, California, and Covington, Georgia.</p>\n\n<div class=\"article_sidebar\">\n<p>The LA28 games will mark LA&rsquo;s&nbsp;third time to host the Olympic Games, previously hosted in 1984 and 1932, and the first time to host the Paralympic Games.</p>\n\n<p>The LA28 games are independently operated by a privately funded, non-profit organization with revenue from corporate partners, licensing agreements, hospitality and ticketing programs and a significant contribution from the International Olympic Committee.</p>\n</div>\n\n<p>Whether a Los Angeles resident, or a visitor, Archer&rsquo;s goal is for passengers to be able to go to a vertiport takeoff and landing hub near a key venue and then fly 10-20 minutes in <em>Midnight</em> to their destination of choice within Archer&rsquo;s LA network. Archer&rsquo;s planned network in LA includes vertiports at key venues that are central to the LA28 games, including the stadium in Inglewood and the LA Memorial Coliseum. Additionally, the network is planned to include critical visitor hubs, including LA International Airport, Hollywood, Orange County&nbsp;and Santa Monica.</p>\n\n<p>&ldquo;Our vision is to fundamentally re-imagine the Olympic and Paralympic Games experience, and this partnership represents an opportunity to deliver something unprecedented,&rdquo; says LA28 chairperson and president Casey Wasserman.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/archer-to-provide-midnight-evtol-for-2028-olympic-paralympics"
      }
    ],
    "link": "https://www.compositesworld.com/news/archer-to-provide-midnight-evtol-for-2028-olympic-paralympics"
  },
  {
    "published": "Mon, 19 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      19,
      16,
      0,
      0,
      0,
      139,
      0
    ],
    "title": "Tata AutoComp, Katcon Global form strategic JV for composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Tata AutoComp, Katcon Global form strategic JV for composites"
    },
    "summary": "Joint venture in Mexico&nbsp;is to specialize in lightweight applications for passenger and commercial vehicles, agricultural tractors and more for the North America market.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Joint venture in Mexico&nbsp;is to specialize in lightweight applications for passenger and commercial vehicles, agricultural tractors and more for the North America market."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tata-katcon1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Automotive components.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tata-katcon1.png;maxWidth=720\" /> </a></div>\n\n<p>Tata&nbsp;specializes in&nbsp;the design, development, manufacturing and supply of autocomponent products, including binacles for tractors (top left), battery covers for electric vehicles (top right), light commercial vehicle front panels (bottom left) and more. Source | Tata AutoComp.</p>\n</div>\n\n<p><a href=\"https://tataautocomp.com/\" target=\"_blank\">Tata AutoComp Systems Ltd.</a>&nbsp;(Pune, India), an Indian automotive components manufacturer,&nbsp;and&nbsp;<a href=\"https://katcon.com/\" target=\"_blank\">Katcon Global</a>&nbsp;(Monterrey, Mexicao), a company specializing in exhaust systems, thermal insulation and advanced materials components, have announced a joint venture in&nbsp;Mexico&nbsp;to manufacture advanced composites, with a focus on serving the North American market. The venture will specialize in lightweight applications for passenger and commercial vehicles, agricultural tractors, off-road vehicles&nbsp;and specialized non-automotive segments.</p>\n\n<p>This collaboration builds upon a 13-year successful partnership between Tata AutoComp and Katcon in&nbsp;India, particularly in the field of exhaust systems and emission after-treatment solutions. In this new venture, Tata AutoComp brings its technology leadership and customer relationships, while Katcon&nbsp;contributes&nbsp;operational excellence, regulatory expertise and strong local execution capabilities.</p>\n\n<p>The joint venture is a step aligned with both companies' strategic vision to&nbsp;expand global footprints&nbsp;and&nbsp;serve global customers&nbsp;through advanced, sustainable materials.</p>\n\n<p>&ldquo;This is the first time we [Tata] are entering a partnership where we are contributing the core technology &mdash; what we see as a reverse model compared to our previous alliances,&rdquo; says Arvind Goel, vice chairman of TataComp Systems Ltd. &ldquo;Our Composite Division, recently recognized with the Deming&nbsp;Award, brings technology, including&nbsp;patented formulations&nbsp;and&nbsp;in-house capabilities&nbsp;for composite compounds and sheet manufacturing.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/tata-autocomp-katcon-global-form-strategic-jv-for-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/tata-autocomp-katcon-global-form-strategic-jv-for-composites"
  },
  {
    "published": "Mon, 19 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      19,
      15,
      0,
      0,
      0,
      139,
      0
    ],
    "title": "Isodan mobile recycling plant supports fiberglass, composites processing at Greater Renewable of Iowa",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Isodan mobile recycling plant supports fiberglass, composites processing at Greater Renewable of Iowa"
    },
    "summary": "Now operational, the containerized plant enables GRI to process up to 20,000 pounds of end-of-life wind blades per shift, opening the way for repurposing opportunities.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Now operational, the containerized plant enables GRI to process up to 20,000 pounds of end-of-life wind blades per shift, opening the way for repurposing opportunities."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-Isodan-containerized-plant.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-Isodan-containerized-plant.jpg;maxWidth=720\" /> </a></div>\n\n<p>Isodan Engineering containerized recycling plant installed at GRI. Source (All Images) | Isodan Engineering ApS</p>\n</div>\n\n<p>In October 2024, Greater Renewable of Iowa (GRI) acquired an&nbsp;<a href=\"https://www.compositesworld.com/suppliers/isodan-engineering-aps\" target=\"_blank\">Isodan Engineering ApS</a>&nbsp;(Holeby, Denmark) containerized plant &mdash; a mobile solution for recycling fiberglass&nbsp;and other composite materials. After mobilization, setup and assistance,&nbsp;the plant is now fully operational and processing wind blades at the GRI facility in Ogden.</p>\n\n<p>Isodan Engineering&rsquo;s containerized plants aim to repurpose composite materials, driving&nbsp;circularity and eliminating disposal of wind blades in landfills. The system is&nbsp;capable of producing materials between 3-30 millimeters in length that are placed into&nbsp;supersacks for ease in material handling in a dust-free environment. The recycling plants process approximately&nbsp;20,000 pounds per shift.</p>\n\n<p>On April 8, 2025,&nbsp;representatives from a government agency and engineering department of a local university were present to see the Isodan recycling plant in operation at the GRI facility in Iowa,&nbsp;followed by&nbsp;an open dialogue to explore ways of repurposing these reprocessed wind blades into&nbsp;new products. Presentations on studies and numerous tests on possible ways to repurpose them were presented and discussed.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gri-isodan-discussions.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gri-isodan-discussions.jpg;maxWidth=385\" /></a></div>\n\n<p>Discussions held in early April considering repurposing opportunities.</p>\n</div>\n\n<p>One way in which recycled wind blades are being reused is as an energy source for the production of&nbsp;portland cement &mdash; a common type of cement used globally. This process replaces raw materials such as sand and clay, reducing CO<sub>₂</sub> emissions and conserving natural resources. In addition, researchers in China have developed methods to integrate processed blade materials into asphalt, enhancing road durability and reducing waste. Due to the large amounts of fines and dust in processed wind blades, caution for repurposing methods is advised to minimize possible health risk.</p>\n\n<p>Also discussed was fiberglass and concrete roofing concept developer&nbsp;<a href=\"https://www.stbungalowllc.com/\" target=\"_blank\">ST Bungalow</a>&rsquo;s&nbsp;(Garrison, N.Y., U.S.) patented design for a <a href=\"https://www.compositesworld.com/news/us-grant-is-awarded-for-patented-sip-composites-formwork-system\" target=\"_blank\">stay-in-place&nbsp;(SIP) formwork system</a> currently being 3D printed and tested at the University of Maine&rsquo;s Advanced Structures and Composites Center under grant money awarded by the U.S. Department of Energy (DOE). This geometry, with a vaulted shape&nbsp;form, can reinforce concrete flatwork, reducing the amount&nbsp;of concrete and steel reinforcement required. These permanent structures &mdash; ranging from 4-8 meters in size&nbsp;&mdash; comprise a minimum of 30% recycled fiber-reinforced polymers, presenting an&nbsp;opportunity for consumption of large&nbsp;amounts of processed wind blades.</p>\n\n<p>In addition to these examples, Isodan says&nbsp;assessments are being explored for processed blade fibers use in manufacturing composite building materials, components for vehicles and sports equipment, offering alternative lightweight and durable material alternatives. Conenor Ltd. (Lahti, Finland) is cited as one such company that features patented processes in this regard.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/isodan-mobile-recycling-plant-supports-fiberglass-composites-processing-at-greater-renewable-of-iowa"
      }
    ],
    "link": "https://www.compositesworld.com/news/isodan-mobile-recycling-plant-supports-fiberglass-composites-processing-at-greater-renewable-of-iowa"
  },
  {
    "published": "Mon, 19 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      19,
      14,
      0,
      0,
      0,
      139,
      0
    ],
    "title": "Industrial Fan Services designs CFRP centrifugal fan impellers",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Industrial Fan Services designs CFRP centrifugal fan impellers"
    },
    "summary": "Compared to metallic options, the company has found CFRP impellers boast higher strength and operational life for industrial settings.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Compared to metallic options, the company has found CFRP impellers boast higher strength and operational life for industrial settings."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CFRP fan impeller.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-wdbgroup-cfrp-impellers.jpg;maxWidth=720\" /> </div>\n\n<p>Source |&nbsp;Industrial Fan Services Ltd.</p>\n</div>\n\n<p><a href=\"https://wdbgroup.co.uk/industrial-fan-services-ltd/\" target=\"_blank\">Industrial Fan Services Ltd.</a> (WDB Group, Halesowen, U.K.), a company designing, manufacturing and supplying high-performance industrial fans, has announced&nbsp;the latest advancement in its&nbsp;range of centrifugal fans &mdash; the development of carbon fiber-reinforced polymer (CFRP) impellers. These impellers boast higher&nbsp;strength compared to existing high-tensile materials.</p>\n\n<p>The introduction of CFRP impellers offers a substantial increase in operational life, especially critical for applications involving high stress and cycling operations, the company reports. Traditional high-tensile steel impellers require inspection every 6 months, particularly in demanding applications like glass tempering fans. In contrast, CFRP impellers eliminate the need for these frequent checks, reducing maintenance downtime and operational disruptions.</p>\n\n<p>In addition to high strength, CFRP impellers offer corrosion resistance, making them ideal for use in harsh environments. Moreover, their cost is more favorable than with more exotic materials required in the petrochemical and pharmaceutical industries.</p>\n\n<p>Industrial Fan Services designs and manufacture a large range of light-, medium-&nbsp;and heavy-duty centrifugal fans suitable for all industries. It specializes in multi-vane, backward lamina, backward aerofoil, backward curved and high-pressure fans, to name a few.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/industrial-fan-services-designs-cfrp-centrifugal-fan-impellers"
      }
    ],
    "link": "https://www.compositesworld.com/news/industrial-fan-services-designs-cfrp-centrifugal-fan-impellers"
  },
  {
    "published": "Fri, 16 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      17,
      0,
      0,
      4,
      136,
      0
    ],
    "title": "Exel Composites supports resilience of biomimetic hydrokinetic system by EEL Energy",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Exel Composites supports resilience of biomimetic hydrokinetic system by EEL Energy"
    },
    "summary": "Exel adapted carbon fiber&nbsp;profiles originally designed for wind turbines to meet the&nbsp;low-drag, high-flexibility and long-term fatigue performance demands of this renewable energy system&rsquo;s nature-inspired membrane.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Exel adapted carbon fiber&nbsp;profiles originally designed for wind turbines to meet the&nbsp;low-drag, high-flexibility and long-term fatigue performance demands of this renewable energy system&rsquo;s nature-inspired membrane."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hydrokinetic system in action.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eelenergy-hydrokinetic-system.jpg;maxWidth=720\" /> </div>\n\n<p>Source (All Images) | EEL Energy</p>\n</div>\n\n<p>A recent case study describes how a collaboration with <a href=\"https://www.compositesworld.com/suppliers/exel-composites-plc\" target=\"_blank\">Exel Composites</a> (Vantaa, Finland) supported the development of a biomimetic hydrokinetic system for generating electricity developed by deep tech startup&nbsp;<a href=\"https://www.eel-energy.fr/en/\" target=\"_blank\">EEL Energy</a>&nbsp;(Paris, France).&nbsp;</p>\n\n<p>EEL Energy seeks&nbsp;to redefine how we&nbsp;harness energy from nature. Specializing in&nbsp;hydrokinetic machines, the company&rsquo;s&nbsp;patented undulating membrane draws inspiration from the movements of fish tails. This biomimetic design captures kinetic energy from water currents, providing a sustainable method for generating electricity that is efficient and nondisruptive to aquatic ecosystems.</p>\n\n<p>The undulating membrane traces its origins to research in the medical field by Jean-Baptiste Drevet in 1996. He leveraged a polymer membrane that mimicked the undulating movement of marine animals to propel fluids, functioning as a pump that creates flow similar to the human heart. This technology has proven effective in medical devices and is adaptable for use in renewable energy generation. The vortices created by turbulent flow in water can be captured by a flexible membrane and the undulating motion used to drive an electrical generator</p>\n\n<p>&ldquo;Our membrane used to be made up of a semi-rigid structure covered in a rubber layer,&rdquo; explains&nbsp;Xavier Peroutka, CEO at EEL. &ldquo;The rubber acted as a sail, capturing the pressure from the water&rsquo;s current and transmitting it to the membrane&rsquo;s skeleton. As the membrane deformed, strain energy was generated and transformed into electricity through electromagnetic converters positioned on the membrane.</p>\n\n<p>&ldquo;Coils of wire placed within the structure moved relative to magnets embedded in the system during deformation,&rdquo; continues Peroutka.&nbsp;&ldquo;This movement induces an electrical current through electromagnetic induction, converting the membrane&rsquo;s mechanical energy into electrical energy.&rdquo;</p>\n\n<p>However, as EEL embarks on bringing hydrokinetic energy production to market, it faces significant challenges. The underwater environment is particularly demanding, necessitating materials that can withstand extreme stress and pressure.</p>\n\n<p>&ldquo;Hydrokinetic generation exerts up to 30 times more mechanical stress on equipment than wind energy production,&rdquo; notes&nbsp;Peroutka. &ldquo;Despite the challenges, it&rsquo;s worth persevering.&nbsp;While&nbsp;a wave power generator relies on intermittent wave action and solar and wind depend on favorable weather conditions, hydrokinetic generators can produce energy constantly throughout their life by leveraging the water currents in rivers or tidal flow. The predictability of hydrokinetic energy generation is needed by communities across the globe.&rdquo;</p>\n\n<h3>Seeking material expertise</h3>\n\n<p>Initially, EEL reinforced its membrane with fiberglass, but this original design revealed a critical flaw: delamination. Under the harsh cyclic loading of the underwater conditions, the membrane underwent large deformations, inducing high strains in the structure. The strain caused the layers of the membrane to separate, enabling water to infiltrate and compromise its functionality.</p>\n\n<p>Recognizing the serious implications of this issue &mdash; where a failure of the membrane during operation could jeopardize the entire hydrokinetic system &mdash; EEL sought the expertise of materials specialist Exel Composites&nbsp;to develop a solution capable of withstanding the continuous mechanical stress required for effective operation.&nbsp;</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>EEL Hydrokinetic generators</h3>\n\n<p><strong>30-kilowatt version</strong></p>\n\n<ul>\n\t<li>Membrane size : 5 &times; 7 meters</li>\n\t<li>Rated Power: 30 kilowatts&nbsp;@ 2.8 meters/second</li>\n\t<li>Annual production: 105-150 megawatt-hours</li>\n\t<li>Min. water depth: 4.5 meters</li>\n\t<li>Water velocity: 1.2-3.0 meters/second</li>\n\t<li>Current seam: 3.5 meters</li>\n</ul>\n\n<p><strong>300-kilowatt version</strong></p>\n\n<ul>\n\t<li>Membrane Size: 10 &times;&nbsp;15 meters</li>\n\t<li>Rated power: 300 kilowatts at&nbsp;3.2 meters/second</li>\n\t<li>Annual production: 0.8-1.2 gigawatt-hours</li>\n\t<li>Min. water depth: 10 meters</li>\n\t<li>Water velocity: 1.5-3.5 meters/second</li>\n\t<li>Current seam: 6 meters</li>\n</ul>\n</div>\n</div>\n\n<p>For Exel, specializing in&nbsp;pultruded and pull-wound composite materials, this challenge illustrated the complexity of creating a solution that was both durable, while balancing flexibility and resilience. The quest for a material that could endure the rigors of underwater energy generation became the focal point of the collaboration.</p>\n\n<p>Interestingly, the solution didn&rsquo;t require inventing something new. Rather, it resided in a proven material already designed to withstand the rigors of renewable energy production. One that can resist bending without breaking under the demands of the environment.</p>\n\n<p>&ldquo;The key to our successful collaboration was recognizing that our carbon fiber flats, originally designed for wind turbine blades, could be repurposed for EEL&rsquo;s hydrokinetic membranes,&rdquo; explains&nbsp;Neil Dykes, R&amp;D&nbsp;manager at Exel Composites. &ldquo;These flats provide the stiffness and strength required to withstand harsh wind conditions, making them ideal for this application.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eelenergy-hydrokinetic-system-above.jpg\" target=\"_blank\"><img alt=\"Hydrokinetic system construction.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eelenergy-hydrokinetic-system-above.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>Exel used multiple layers of discrete carbon flat profiles, the same as those developed for wind turbine applications. These carbon fiber flats are stacked to create beams which were strategically integrated into the membrane. Three bars were placed across it at 50%, 80%&nbsp;and 100% of its length. This arrangement prevents bulging and limits overall deformation, ensuring the membrane maintains structural integrity and operates optimally.</p>\n\n<p>Excessive deformation, particularly uneven bulging outside the intended undulatory motion, can significantly reduce energy capture efficiency. When the membrane deforms, it disrupts the smooth oscillating flow of water over its surface, diminishing the area available for energy conversion and leading to suboptimal mechanical energy transfer to the electromagnetic converters.</p>\n\n<h3>How did carbon flats improve the design?</h3>\n\n<p>The integration of these carbon fiber flats was crucial for enhancing the membrane&rsquo;s mechanical performance. By increasing stiffness and resistance to deformation, they help preserve the membrane&rsquo;s shape during operation, ensuring effective energy capture while adhering to biomimetic design principles.</p>\n\n<p>The high strength and stiffness provided by the carbon fiber flats supplied by Exel Composites resolved the delamination issues previously encountered with glass fiber-reinforced composites (GFRP), which compromised the membrane&rsquo;s effectiveness.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<blockquote>\n<p>Inspired by fish tails, EEL Energy&rsquo;s membrane flexes continuously with the current &mdash; more than 6,000 times a day &mdash; making fatigue resistance a critical hurdle.</p>\n</blockquote>\n</div>\n\n<p>Notably, the&nbsp;mechanical properties of Exel&rsquo;s&nbsp;carbon fiber-reinforced polymer (CFRP) composites were essential to the membrane&rsquo;s success. With an E-modulus of approximately 120 GPa, CFRP exhibits higher stiffness than traditional GFRP, which is only a third of CFRP&nbsp;stiffness. This high stiffness ensures the membrane retains its shape under operational stress, preventing excessive deformation and energy loss.</p>\n\n<p>CFRP&rsquo;s tensile strength of 2,500 MPa, compared to GFRP&rsquo;s&nbsp;1,000 MPa also enables the former&nbsp;to withstand greater forces without failure. Additionally, CFRP&rsquo;s compressive strength, at 1,500 MPa, is much greater than the 600 MPa typical of GFRP. This increased strength, combined with CFRP&rsquo;s optimal fatigue resistance, ensures the membrane can handle the cyclic loading conditions experienced during operation, supporting up to 6,000 full reversal cycles per day. This durability is key for maintaining high efficiency in energy capture over the long term.</p>\n\n<h3>The future of EEL hydrokinetics</h3>\n\n<p>With these challenges resolved, EEL is now shifting its focus to the development of the main hydrokinetic generator, a crucial step toward commercialization after nearly a decade of membrane refinement. This transition also opens new opportunities for Exel Composites&rsquo;&nbsp;carbon flats, which could be pivotal in meeting future performance demands.</p>\n\n<p>EEL&rsquo;s current project includes developing a medium-sized hydrokinetic generator designed to generate 50 kilowatts&nbsp;per hour. This generator targets isolated communities across the Americas, where many areas face significant energy access challenges due to geographic isolation from the main grid. The vast expanse of this region leaves numerous rural populations disconnected from centralized power sources. EEL aims to support local governments by providing consistent, reliable hydrokinetic energy tailored to the communities&rsquo; needs, eliminating reliance on expensive and polluting hydrocarbon generators.</p>\n\n<p>In parallel, EEL is developing a larger hydrokinetic generator aimed at energy producers such as EDF and Octopus, targeting an output of 1 megawatt&nbsp;per hour. These installations are envisioned as hydrokinetic farms located in rivers and coastal areas. A single hydrokinetic generator could power 796 North American homes, and generator farms with multiple generators could enhance regional energy capacity.</p>\n\n<p>EEL says its&nbsp;hydrokinetic technology promises predictable, sustainable energy, reducing reliance on fossil fuel-powered generators prevalent in remote areas. As the company prepares for commercialization, ongoing discussions with electricity providers and local governments demonstrate its commitment to supporting communities in the shift toward&nbsp;cleaner energy sources.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/exel-composites-supports-resilience-of-biomimetic-hydrokinetic-system-by-eel-energy"
      }
    ],
    "link": "https://www.compositesworld.com/news/exel-composites-supports-resilience-of-biomimetic-hydrokinetic-system-by-eel-energy"
  },
  {
    "published": "Fri, 16 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      16,
      0,
      0,
      4,
      136,
      0
    ],
    "title": "Hexagon Agility reaches milestone with additional orders supporting X15-N natural gas trucks",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexagon Agility reaches milestone with additional orders supporting X15-N natural gas trucks"
    },
    "summary": "Additional natural gas fuel system orders at a value of&nbsp;$4.3 million&nbsp;include more than&nbsp;20 Class 8 fleets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Additional natural gas fuel system orders at a value of&nbsp;$4.3 million&nbsp;include more than&nbsp;20 Class 8 fleets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hexagonagility-heavyduty-trucks-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orange heavy-duty truck.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hexagonagility-heavyduty-trucks-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Hexagon Agility</p>\n</div>\n\n<p><a href=\"http://hexagonagility.com/\" target=\"_blank\">Hexagon Agility</a>&nbsp;(Costa Mesa, Calif., U.S.), a subsidiary of <a href=\"https://www.compositesworld.com/suppliers/hexagon-composites-asa\" target=\"_blank\">Hexagon Composites ASA</a> (&Aring;lesund, Norway) providing natural gas (CNG/RNG) fuel systems, has over the past months received new orders for natural gas fuel systems installations on trucks powered by <a href=\"https://www.cummins.com/\" target=\"_blank\">Cummins</a>&rsquo; (Columbus, Ind., U.S.) X15N natural gas engine, designed specifically for the North American heavy-duty commercial truck market.</p>\n\n<p>The new orders are valued at $4.3 million and include more than&nbsp;20 Class 8 fleets (read &ldquo;<a href=\"https://www.compositesworld.com/news/hexagon-agility-receives-wave-of-rng-fuel-system-orders-for-class-8-trucks\">Hexagon Agility receives wave of RNG fuel system orders for Class 8 trucks</a>&rdquo;). This brings the total accumulated value of orders that Hexagon Agility has received for natural gas fuel systems for X15N-powered trucks to $20 million, including the UPS order announced in May 2024 and orders announced in October 2024.</p>\n\n<p>At the end of April 2025, Daimler Truck North America announced it had opened orders for Freightliner Cascadia trucks equipped with the Cummins X15N. Daimler, Kenworth and Peterbilt, three leading Class 8 truck OEMs in North America, now offer natural gas truck options powered by the X15N engine.</p>\n\n<p>&ldquo;Despite freight market and macro-economic uncertainty, we see a strong uptick in the interest for natural gas solutions,&rdquo; says Eric Bippus, chief commercial officer at Hexagon Composites. &ldquo;The 15-liter engine [X15N]&nbsp;is now enabling fleets to access the fuel cost and emissions reduction benefits of natural gas, with performance that matches diesel in both power and range. Equipped with a fuel system from Hexagon Agility, Class 8 trucks with the X15N can achieve a range of up to 1,200 miles. This has unlocked a whole new segment of the truck market previously constrained to just diesel fuel.&rdquo;</p>\n\n<p>With power ratings up to 500 horsepower&nbsp;(~370 kilowatts) and torque up to 1,850 pound-foot, the X15N engine is reported to meet&nbsp;the needs of long-haul/heavy-load demands for high horsepower and offers a range of up to 1,200 miles (2,000 kilometers), matching the capabilities of diesel.</p>\n\n<p>Natural gas trucking is supported by a robust network of more than&nbsp;1,600 public and private CNG/RNG fueling stations across key transport corridors in North America.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexagon-agility-reaches-milestone-with-additional-orders-supporting-x15-n-natural-gas-trucks"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexagon-agility-reaches-milestone-with-additional-orders-supporting-x15-n-natural-gas-trucks"
  },
  {
    "published": "Fri, 16 May 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      15,
      30,
      0,
      4,
      136,
      0
    ],
    "title": "Joby flies two eVTOL aircraft simultaneously in testing milestone",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Joby flies two eVTOL aircraft simultaneously in testing milestone"
    },
    "summary": "The latest in the company&rsquo;s flight testing program targets certification testing acceleration and support of its passenger-carrying goals by 2026.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The latest in the company&rsquo;s flight testing program targets certification testing acceleration and support of its passenger-carrying goals by 2026."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-joby-twoaircraft-flight-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-joby-twoaircraft-flight-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Two Joby air taxis (N541JX and N544JX) fly simultaneously in the skies over Marina, California. Source | Joby Aviation</p>\n</div>\n\n<p><a href=\"https://www.jobyaviation.com/\" target=\"_blank\">Joby Aviation Inc.</a>&nbsp;(Santa Cruz, Calif., U.S.) has successfully flown&nbsp;two of its electric vertical takeoff and landing (eVTOL) aircraft simultaneously for the first time, marking another important milestone in the company&rsquo;s flight testing program.</p>\n\n<p>The two-aircraft flight, completed in Marina, California on May 9, is further demonstration of the maturity of Joby&rsquo;s test program, and comes just two weeks after the company reached another testing landmark &mdash;&nbsp;successfully completing flights with a full transition from vertical to cruise flight, and back again, with a pilot onboard.</p>\n\n<p>&ldquo;Our air taxi is designed, manufactured and assembled here in the U.S., with employing&nbsp;engineers and other experts across 40 different U.S. states,&rdquo; says JoeBen Bevirt, founder and CEO of Joby.&nbsp;&ldquo;With six aircraft in our test fleet, flying multiple aircraft at a time will play an important role in accelerating our certification testing and supporting our plans to carry our first passengers next year [2026].&rdquo;</p>\n\n<p>Joby has partnered with Delta Air Lines and Uber to bring its service to the U.S. and expects Los Angeles and New York City to be launch markets. Service is planned to start shortly after Joby receives type certification from the Federal Aviation Administration (FAA).&nbsp;&nbsp;</p>\n\n<p>Outside the U.S., Joby recently announced a partnership with Virgin Atlantic to bring its service to the U.K. and has partnered with ANA Holdings Inc., Japan&rsquo;s largest airline, to bring its service to Japan.</p>\n\n<p>Joby&rsquo;s&nbsp;<a href=\"https://joby-site.cdn.prismic.io/joby-site/aBu0USdWJ-7kRuZx_2025Q1-Report.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Q1 2025 Shareholder Letter</a>&nbsp;celebrates&nbsp;a second consecutive quarter of record progress toward certifying its aircraft with the FAA and reiterated plans to start passenger operations in Dubai in early 2026. The company has completed more than 40,000 miles of test flights across multiple aircraft, including demonstration flights in New York City, Japan, and Korea.</p>\n\n<p>The sixth aircraft to join Joby&rsquo;s flight test program is currently undergoing final functional checks, having been powered on for the first time in April 2025. Two aircraft are positioned at Edwards Air Force Base where they are completing testing in conjunction with the company&rsquo;s defense customers.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/joby-flies-two-evtol-aircraft-simultaneously-in-testing-milestone"
      }
    ],
    "link": "https://www.compositesworld.com/news/joby-flies-two-evtol-aircraft-simultaneously-in-testing-milestone"
  },
  {
    "published": "Fri, 16 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      15,
      0,
      0,
      4,
      136,
      0
    ],
    "title": "MVP, Composites One grow partnership into Mexico",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "MVP, Composites One grow partnership into Mexico"
    },
    "summary": "Customers in Mexico will gain direct access to equipment, services, technical knowledge and reliable delivery brought by both companies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Customers in Mexico will gain direct access to equipment, services, technical knowledge and reliable delivery brought by both companies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-mvp-compone-mexico.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Mexico map with logos.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-mvp-compone-mexico.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Magnum Venus Products (MVP)</p>\n</div>\n\n<p>In early March 2025, <a href=\"https://www.compositesworld.com/suppliers/magnum-venus-products\" target=\"_blank\">Magnum Venus Products</a> (MVP, Knoxville, Tenn., U.S.) and <a href=\"https://www.compositesworld.com/suppliers/composites-one\" target=\"_blank\">Composites One</a> (Schaumburg, Ill., U.S.) expanded a longstanding partnership&nbsp;into Mexico. For decades, MVP and Composites One have worked together to serve the composites industry across the U.S., delivering not only high-performance equipment and materials, but also hands-on training, technical expertise&nbsp;and dedicated customer support. With this expansion, manufacturers in Mexico will now benefit from the same combination of innovation, reliability&nbsp;and industry knowledge.</p>\n\n<p>As part of this expanded relationship, MVP officially recognizes Composites One as its authorized distributor in Mexico. This designation strengthens the infrastructure needed for MVP to support more efficient, productive manufacturing operations. MVP offers a full range of solutions &mdash; from straightforward systems that help manufacturers transition from manual processes to fully automated technologies that maximize throughput and precision. Through this partnership, customers in Mexico will gain direct access to MVP&rsquo;s equipment and the expert support needed to scale with confidence.</p>\n\n<p>&ldquo;Through our joint efforts, we&rsquo;ll be able to deliver a tangible competitive advantage to customers in a market that is ripe for growth,&rdquo; says Joan Tracy, MVP director of international sales.</p>\n\n<p>Composites One is one of the largest distributor of composite materials in North America, serving more than&nbsp;9,000 customers across industries such as marine, aerospace, wind energy, transportation&nbsp;and construction. With a network of more than 40 distribution centers throughout the U.S. and Canada, Composites One has built its reputation on service, technical knowledge and reliable delivery. The move into Mexico reflects both companies&rsquo; strategic commitment to supporting the growing composites market in the region.</p>\n\n<p>&ldquo;We see potential in Mexico and are committed to investing in this market as part of our strategic growth plan,&rdquo; says&nbsp;Dave Smith, chief commercial officer of Composites One.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/mvp-composites-one-grow-partnership-into-mexico"
      }
    ],
    "link": "https://www.compositesworld.com/news/mvp-composites-one-grow-partnership-into-mexico"
  },
  {
    "published": "Fri, 16 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      14,
      0,
      0,
      4,
      136,
      0
    ],
    "title": "Swinburne highlights composites and Industry 4.0 activities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Swinburne highlights composites and Industry 4.0 activities"
    },
    "summary": "Swinburne University of Technology&rsquo;s facilities and research expertise have attained milestone developments in a UAV wingbox, customized carbon fiber components, digital manufacturing and 3D printing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Swinburne University of Technology&rsquo;s facilities and research expertise have attained milestone developments in a UAV wingbox, customized carbon fiber components, digital manufacturing and 3D printing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-swinburne-manufacturingweek.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-swinburne-manufacturingweek.jpg;maxWidth=720\" /> </a></div>\n\n<p>At Australian Manufacturing Week, Swinburne&nbsp;showcased its capabilities in everything from advanced manufacturing, high-rate and automated production, advanced joining techniques and digital transformation, to custom carbon fiber&nbsp;products, thermoplastic composites and 3D printed parts. Source | Swinburne University of Technology <a href=\"https://www.linkedin.com/school/swinburne-university-of-technology/posts/?feedView=all\" target=\"_blank\">LinkedIn</a></p>\n</div>\n\n<p><a href=\"https://www.swinburne.edu.au/\" target=\"_blank\">Swinburne University of Technology</a>&rsquo;s (Melbourne, Australia) experts have attained several milestones in space, aerospace and automotive applications featuring the use of composite materials, as well as novel approaches to high-rate manufacturing,&nbsp;digital twins and&nbsp;joining complex components. These activities are further bolstered through Swinburne&rsquo;s support of&nbsp;Australia&rsquo;s $270.5 million research initiative that aims to&nbsp;transform healthcare, aerospace and construction through additive manufacturing.</p>\n\n<p><strong>Uncrewed aerial vehicle (UAV) wingbox.&nbsp;</strong>Developed at the <a href=\"https://www.compositesworld.com/news/swinburne-csiro-testlab-grows-composites-competency-via-industrial-scale-3d-printing\" target=\"_blank\">Swinburne-CSIRO National Industry 4.0 Testlab</a>, this drone wingbox highlights innovations in stamp forming and automated manufacturing processes for joining thermoplastic composite (TPC) parts. The wingbox&nbsp;uses aerospace-grade TPC&nbsp;like LMPAEK for high-performance and lightweight structures, said to be a first for Australian aerospace applications.</p>\n\n<p>The automated production process features a digital twin to simulate and optimize every stage, from cutting to welding and final assembly. </p>\n\n<p><strong>Customized carbon fiber&nbsp;road bike frame.&nbsp;</strong>Also manufactured at the Industry 4.0 Testlab, Swinburne experts guided R&amp;D, design, engineering and production. The bike frame demonstrates Swinburne&rsquo;s ability to develop products from concept to scaled production, showcasing highly intricate geometrical shapes that can be tailored to specific user needs, and highlights the university&rsquo;s capability in manufacturing custom carbon fiber&nbsp;components for aerospace, space&nbsp;and defense (detection and protection) applications.</p>\n\n<p><strong>Digital </strong><strong>manufacturing</strong>. Swinburne&rsquo;s Testlab provides&nbsp;fully digitally supported engineering and manufacturing solutions for parts, processes and entire systems in automotive, aerospace, production and more.</p>\n\n<p>The university highlights the capabilities of its Factory of the Future, its industry&nbsp;portal for advanced manufacturing, which focuses on digital transformation for small-to-medium enterprises.&nbsp;Located on the ground floor of Swinburne&rsquo;s $100 million Advanced Manufacturing and Design Centre (AMDC Building), the Factory of the Future includes capabilities/services in Industry 4.0/5.0 (digital manufacturing), design to manufacture, applied AI and machine learning, software engineering and rapid prototyping, applied R&amp;D and servitization.</p>\n\n<p>The Australian Research Council (ARC) Industrial Transformation Research Hub in Future Digital Manufacturing (Digital Manufacturing Hub) is also homed at Swinburne.&nbsp;</p>\n\n<p><strong>3D printed parts from the Factory of the Future.&nbsp;</strong>Swinburne also features expertise in additive manufacturing. In particular it mentions a disc made of&nbsp;AlSi12 alloy 3D printed vis selective laser melting;&nbsp;a CubSat that has been topologically optimized,&nbsp;meaning the&nbsp;design has been adjusted to use the least amount of material while still maintaining strength and performance; and a copper-coated toilet door push plate using a&nbsp;Cold Spray Additive Manufacturing process.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/swinburne-highlights-composites-and-industry-40-activities"
      }
    ],
    "link": "https://www.compositesworld.com/news/swinburne-highlights-composites-and-industry-40-activities"
  }
]