[
  {
    "published": "Wed, 7 May 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      7,
      18,
      0,
      0,
      2,
      127,
      0
    ],
    "title": "Boeing to put NASA X-66 X-Plane on hold",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Boeing to put NASA X-66 X-Plane on hold"
    },
    "summary": "NASA and Boeing are evaluating a new approach to the agency&rsquo;s sustainable flight demonstrator&nbsp;project, one that would put the X-66 on ice&nbsp;amid a thin-wing rethink.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "NASA and Boeing are evaluating a new approach to the agency&rsquo;s sustainable flight demonstrator&nbsp;project, one that would put the X-66 on ice&nbsp;amid a thin-wing rethink."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-x66-artist-concept.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"SFD X-Plane design.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-x66-artist-concept.png;maxWidth=720\" /> </a></div>\n\n<p>Artist&rsquo;s concept of the X-66 aircraft.&nbsp;Boeing and NASA have already collaborated on wind tunnel tests, computational fluid dynamics modeling, and structural design and analysis aimed at exploring how best to approach fuel-efficient, sustainable designs. Source | <a href=\"https://www.nasa.gov/image-article/new-look-at-nasa-boeing-sustainable-experimental-airliner/\" target=\"_blank\">NASA</a></p>\n</div>\n\n<p>The X-66 Sustainable Flight Demonstrator (SFD), an&nbsp;X-Plane project with a high-mounted truss-braced thin wing&nbsp;launched in January 2023, is being put on the back burner. Boeing&rsquo;s (Arlington, Va., U.S.) April 24 announcement that it is making moves to pause the&nbsp;NASA-led&nbsp;(Washington, D.C., U.S.) project have been followed by <a href=\"https://www.nasa.gov/aeronautics/nasa-boeing-new-thin-wing-aircraft/\" target=\"_blank\">a report by the agency</a>&nbsp;that both partners are &ldquo;currently evaluating an updated approach ...&nbsp;that would focus on demonstrating thin-wing technology with broad applications for multiple aircraft configurations.&rdquo;</p>\n\n<p>To become&nbsp;NASA&rsquo;s largest X-Plane, the demonstrator was specifically focused on helping the U.S. achieve net-zero aviation emissions by 2050, informing future single-aisles&nbsp;with a new wing rendering &mdash; extra-long, thin wings stabilized by diagonal struts known as the transonic&nbsp;truss-braced wing (TTBW) concept. <a href=\"https://www.compositesworld.com/news/nasa-picks-boeings-transonic-truss-based-wing-for-sustainable-flight-demonstrator-project\" target=\"_blank\">Boeing was working with&nbsp;NASA</a> to build, test&nbsp;and fly a full-scale version, with wing assembly&nbsp;supported by Boeing company Aurora Flight Sciences (Bridgeport, W.Va., U.S.). Though materials were never confirmed, both Boeing and Aurora have extensive composites expertise that could potentially inform the future wing design.</p>\n\n<p>According to an <em>Aviation Week</em> article, the X-66 was previously expected to fly in 2028. Now, Boeing has proposed work on the X-66 &ldquo;would pause for later consideration based on thin-wing testbed results and further truss-braced configuration studies.&rdquo;&nbsp;Under this proposal, all aspects of the X-66 flight demonstrator&rsquo;s design, as well as hardware acquired or modified for it, would be retained while the long, thin-wing technology is being investigated with more focus. NASA and Boeing would also continue to collaborate on research into the transonic truss-braced wing concept.</p>\n\n<p><a href=\"https://aviationweek.com/aerospace/emerging-technologies/boeing-puts-nasa-x-66-plan-ice-future-x-plane-fears-grow\" target=\"_blank\"><em>Aviation Week</em> reports</a> that from Boeing&rsquo;s perspective, this move is part of a &ldquo;pragmatic program revision,&rdquo; one that simultaneously seeks to redirect resources to certify the delayed&nbsp;737 MAX and 777-9 while avoiding &ldquo;premature commitment&nbsp;to a thin-wing configuration that may not work out in the long term.&rdquo;</p>\n\n<p>In summary: While the X-66 program is in limbo, the thin-win seems to live on.</p>\n\n<p>&ldquo;We have learned a lot in the past few years partnering with NASA on the X-66 program that will influence the future generations of airplane design,&rdquo; a Boeing spokesperson tells <em>CW</em>. &ldquo;That learning has shown us the value of thin-wings and associated technology. Going forward, we will focus efforts on maturing the technology to support thin-wing design. What we learn with this approach can be applied across multiple products, including potential truss-braced wing configurations and beyond.&rdquo;</p>\n\n<p>There are still concerns that the program pause will be detrimental to the ambitious X-Plan project in the long-term. This is reinforced by the termination of the NASA&nbsp;<a href=\"https://www.compositesworld.com/articles/nasa-all-electric-experimental-aircraft-to-begin-ground-testing\" target=\"_blank\">X-57</a> experimental electric aircraft in 2023, followed by the agency&rsquo;s&nbsp;<a href=\"https://www.compositesworld.com/articles/digital-design-multi-material-structures-enable-a-quieter-supersonic-nasa-x-plane\" target=\"_blank\">X-59</a> supersonic demonstrator that is years behind schedule. But it is clear that there is still a lot to be determined. For the moment, Boeing&rsquo;s X-66 facility in Palmdale, California, is set to wind down over the next few months.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/boeing-to-put-nasa-x-66-x-plane-on-hold"
      }
    ],
    "link": "https://www.compositesworld.com/news/boeing-to-put-nasa-x-66-x-plane-on-hold"
  },
  {
    "published": "Wed, 7 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      7,
      17,
      0,
      0,
      2,
      127,
      0
    ],
    "title": "SPE ACCE 2025 brings in Casey Putsch as second keynote",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SPE ACCE 2025 brings in Casey Putsch as second keynote"
    },
    "summary": "Founder and president of the Genius Garage Educational Programs, as well as a car builder and YouTube personality, Putsch will deliver his own experience on how composites can contribute to&nbsp;the mass production of stylish and affordable vehicles.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Founder and president of the Genius Garage Educational Programs, as well as a car builder and YouTube personality, Putsch will deliver his own experience on how composites can contribute to&nbsp;the mass production of stylish and affordable vehicles."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-speacce25-secondkeynote-putsch.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-speacce25-secondkeynote-putsch.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Casey Putsch with Omega Car in Genius Garage. Source | SPE ACCE</p>\n</div>\n\n<p>The executive planning committee for the <a href=\"http://www.speautomotive.com/acce\" target=\"_blank\">SPE&nbsp;Automotive Composites<strong> </strong>Conference &amp; Expo</a> (SPE ACCE) is announcing the second keynote speaker for the Sept. 3-5, 2025 event in Novi, Michigan. Casey Putsch, founder and president of the Genius Garage Educational Programs, as well as a car builder, racing driver, watchmaker and automotive YouTube personality, will present &ldquo;Composites enable innovative, efficient and recyclable vehicles and can help to change the nature of mass production.&rdquo;</p>\n\n<p>The presentation will outline the Omega Car design and engineering philosophy which is centered around experimental composites for the sake of efficiency from manufacturing, its intended use&nbsp;and ultimate recyclability.&nbsp; Putsch will highlight how, through the intelligent use of composites in automotive manufacturing, he was able to engineer and build a car that has a reduced carbon footprint per mile while using a diesel internal combustion engine. Putsch designed a diesel car that achieved 104.72 miles per gallon in its first test &mdash;&nbsp;making it from New York to Los Angeles&nbsp;on one tank &mdash;&nbsp;and goes zero to 60&nbsp;in 5&nbsp;seconds.</p>\n\n<p>Putsch will also speak about this experimental project, including what is said to be&nbsp;the only full-scale flying Pterosaur model in the world.&nbsp;This is a replica of a Quetzalcoatlus Northropi using flexible membrane wings and various composite structures which created the 38-foot-wingspan flying model.&nbsp;</p>\n\n<p>Putsch will also speak about the use of composites through his automotive builds and restorations, including a turbine powered Batmobile.&nbsp; The build used a Vietnam-era drone anti-submarine helicopter engine and replicated the hero car from the 1989 Tim Burton film.</p>\n\n<p>In conclusion, he will speak about the history of composites in the automotive industry, including the famous Chaparral race cars of the 1960s that inspired him to create the Omega Car and to take a blank canvas look at the automotive industry and the nature of mass production.&nbsp;</p>\n\n<p>&ldquo;Hybrids and electric vehicles have a purpose but they&rsquo;re not a solution for everything,&rdquo; says&nbsp;Putsch.&nbsp;&ldquo;Composite technologies can contribute to the mass production of stylish and affordable vehicles that are energy efficient and better for the environment with traditional internal combustion engines [ICE] technology. People want a car they can afford and fix themselves and we have the ability to provide that large-scale and we should.&rdquo;</p>\n\n<p>Read about SPE ACCE 2025&rsquo;s <a href=\"https://www.compositesworld.com/news/sce-acce-2025-keynote-speaker-promotes-automotive-circularity\" target=\"_blank\">first keynote here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spe-acce-2025-brings-in-casey-putsch-as-second-keynote"
      }
    ],
    "link": "https://www.compositesworld.com/news/spe-acce-2025-brings-in-casey-putsch-as-second-keynote"
  },
  {
    "published": "Wed, 7 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      7,
      16,
      0,
      0,
      2,
      127,
      0
    ],
    "title": "Quantum Fuel Systems, OneH2 develop 930-bar hydrogen tanks",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Quantum Fuel Systems, OneH2 develop 930-bar hydrogen tanks"
    },
    "summary": "High-pressure Type 4 cylinders are installed&nbsp;in hydrogen trailers with cascading function&nbsp;for simplified mobile refueling and gas distribution.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "High-pressure Type 4 cylinders are installed&nbsp;in hydrogen trailers with cascading function&nbsp;for simplified mobile refueling and gas distribution."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-oneh2-hydrogen-trailer.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"OneH2 hydrogen trailer.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-oneh2-hydrogen-trailer.jpg;maxWidth=720\" /> </a></div>\n\n<p>The OneH2 hydrogen trailer features 930-bar hydrogen Type 4 cylinders developed in collaboration with Quantum Fuel Systems. Source |&nbsp;Quantum Fuel Systems</p>\n</div>\n\n<p><a href=\"https://qtww.com/\" target=\"_blank\">Quantum Fuel Systems LLC</a> (Lake Forest, Calif., U.S.), a vertically integrated company gaseous energy storage systems, has announced the development of a 930-bar hydrogen Type 4 cylinder, in partnership with hydrogen production, storage and distribution company <a href=\"https://oneh2.com/\" target=\"_blank\">OneH2 Inc.</a> (Longview, N.C., U.S.). These cylinders are integrated into modules by OneH2, which are then installed in hydrogen trailers for mobile refueling and gas distribution.</p>\n\n<p>Each OneH2 trailer is equipped to transport large volumes of gaseous hydrogen at high pressures to support mobile refueling of cars, trucks&nbsp;and material-handling equipment. The trailer features a configurable set of 930-bar cylinders, tailored to meet specific capacity requirements. Each cylinder can store up to 27 kilograms (gross) of automotive fuel-cell grade hydrogen, enabling a total trailer capacity of up to 486 kilograms.&nbsp;The solution eliminates&nbsp;the need for on-board compression or additional compression systems at the retail fueling site.</p>\n\n<p>&ldquo;There is no other hydrogen cylinder of this size and pressure currently certified on the market,&rdquo; claims Mark Arold, president of mobility at Quantum. &ldquo;Working closely with OneH2, we&rsquo;ve helped realize their vision and supported the hydrogen economy by advancing its supply infrastructure. Designing a safe, reliable&nbsp;and efficient over-the-road delivery system is no small feat.&rdquo;</p>\n\n<p>The trailer&rsquo;s cylinders are designed and rigorously tested to meet international standards governing the design, construction&nbsp;and testing of Type 4 composite cylinders. They operate under a special permit issued by the U.S. Department of Transportation.</p>\n\n<p>The system also incorporates a patented cascading function that allows each cylinder to act as its own cascading bank, maximizing hydrogen use.&nbsp; &ldquo;OneH2&rsquo;s cascading technology intelligently draws from multiple cylinders to refuel vehicles, significantly reducing the amount of inaccessible hydrogen left in storage,&rdquo; explains Dhairy Patel, senior product engineer at OneH2.</p>\n\n<p>OneH2 operates a rapidly growing fleet of trailers supporting mission-critical hydrogen operations.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/quantum-fuel-systems-oneh2-develop-930-bar-hydrogen-tanks"
      }
    ],
    "link": "https://www.compositesworld.com/news/quantum-fuel-systems-oneh2-develop-930-bar-hydrogen-tanks"
  },
  {
    "published": "Wed, 7 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      7,
      15,
      0,
      0,
      2,
      127,
      0
    ],
    "title": "Diehl Aviation to establish facility in Romania",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Diehl Aviation to establish facility in Romania"
    },
    "summary": "The aviation supplier expands production capacity to meet industry growth and enhance competitiveness.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The aviation supplier expands production capacity to meet industry growth and enhance competitiveness."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Map of Europe with a flag marking Romania.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-diehl-romania-location.jpg;maxWidth=720\" /> </div>\n\n<p>Source | Diehl Aviation</p>\n</div>\n\n<p><a href=\"https://www.diehl.com/aviation/en/\" target=\"_blank\">Diehl Aviation</a>&nbsp;(&Uuml;berlingen, Germany) is strengthening its global presence with the establishment of a new production site in Romania, supporting the increasing demand of the aviation industry. The facility will primarily manufacture products and components for passenger aircraft, ensuring reliable deliveries amid rising production rates.</p>\n\n<p>As the company is in its first steps with the new site, Diehl is unable to provide details regarding capabilities at this time. Regardless, the company told <em>CW</em> that it plans for the new location to be very flexible &mdash; this means that various&nbsp;products from its&nbsp;portfolio can also be manufactured here.</p>\n\n<p>Diehl Aviation is known in the composites community for its maturation of thermoplastic composite products geared toward aerospace, including the <a href=\"https://www.compositesworld.com/news/diehl-aviation-matures-recyclable-composite-eco-bin\" target=\"_blank\">Eco Bin</a> that recently won a Crystal Cabin Award, and <a href=\"https://www.compositesworld.com/news/diehl-aviation-9t-labs-present-eco-bracket\" target=\"_blank\">Eco Brackets</a> presented in June 2024 with 9T Labs.</p>\n\n<p>For the new site, Romania was chosen for its strategic position between Eastern and Western Europe, providing access to suppliers and skilled talent. As an EU member, Romania offers political and economic stability, seamless market integration&nbsp;and a highly skilled workforce. The country&rsquo;s competitive operational costs, strong infrastructure&nbsp;and business-friendly environment further enhance its attractiveness.</p>\n\n<p>Beyond expanding production capacity, the&nbsp;facility will optimize Diehl Aviation&rsquo;s cost structure. Establishing a diversified production footprint in Romania enhances supply chain resilience and operational flexibility, ensuring sustained growth in the global aviation market. While production capacity will be expanded in Romania, the development, industrialization and maturation of products will remain at Diehl Aviation&rsquo;s German sites, ensuring continued technological leadership and innovation.</p>\n\n<p>&ldquo;Our new facility in Romania is a strategic investment in the future of Diehl Aviation,&rdquo; says&nbsp;J&ouml;rg Schuler, CEO of Diehl Aviation. &ldquo;As aircraft production rates increase, we are committed to providing our customers with the highest-quality products at competitive costs.&rdquo;</p>\n\n<p>Diehl Aviation expects to break ground on the new facility in 2025.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/diehl-aviation-to-establish-facility-in-romania"
      }
    ],
    "link": "https://www.compositesworld.com/news/diehl-aviation-to-establish-facility-in-romania"
  },
  {
    "published": "Wed, 7 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      7,
      14,
      0,
      0,
      2,
      127,
      0
    ],
    "title": "Rocket Lab Neutron rocket to support U.S. Space Force NSSL",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Rocket Lab Neutron rocket to support U.S. Space Force NSSL"
    },
    "summary": "Space rocket company to join&nbsp;$5.6 billion National Security Space Launch (NSSL) program, an opportunity to on-ramp its carbon fiber composite Neutron vehicle.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Space rocket company to join&nbsp;$5.6 billion National Security Space Launch (NSSL) program, an opportunity to on-ramp its carbon fiber composite Neutron vehicle."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-rocketlab-neutron-nssl.png\" target=\"_blank\"><img alt=\"Neutron rocket.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-rocketlab-neutron-nssl.png;maxWidth=385\" /></a></div>\n\n<p>Source | Rocket Lab USA</p>\n</div>\n\n<p>In March 2025&nbsp;<a href=\"https://www.rocketlabusa.com/\" target=\"_blank\">Rocket Lab USA&nbsp;Inc.</a>&nbsp;(Long Beach, Calif., U.S.) was selected by the&nbsp;U.S. Space Force to compete for the Department of Defense&rsquo;s (DOD) high-priority national security missions for its National Security Space Launch (NSSL) Phase 3 Lane 1 program. The firm-fixed price, indefinite delivery/indefinite-quantity (IDIQ) contract has a 5-year ordering period that will run through to June 2029 with a maximum value of $5.6 billion.&nbsp;</p>\n\n<p>Rocket Lab&rsquo;s launch vehicle for the program will be <em>Neutron</em>, its 13-ton reusable carbon fiber composite medium-lift launch vehicle being rapidly developed to meet the demand for high-assurance national security missions, and for single and multi-satellite constellation deployment. Designed to deploy payloads up to 13,000 kilograms, <em>Neutron</em> is being brought to the market at a high development pace.</p>\n\n<p>Under the program, Rocket Lab can compete for missions <a href=\"https://www.ssc.spaceforce.mil/Newsroom/Article-Display/Article/4137680/space-systems-command-on-ramps-two-new-providers-to-national-security-space-lau\" target=\"_blank\">with four other providers</a> including&nbsp;SpaceX,&nbsp;Blue Origin, Stoke Space Technologies, and United Launch Alliance (ULA).</p>\n\n<p>With <em>Neutron</em>&rsquo;s first launch scheduled for the second half of 2025, Rocket Lab met the program&rsquo;s eligibility requirements to be selected to compete for the NSSL program, and upon a successful flight on <em>Neutron</em>, will be eligible to further compete for individual task orders awarded within the NSSL program.&nbsp;<em>Neutron</em>&rsquo;s debut launch from Launch Complex 3 in Wallops Island, Virginia, will be the first launch vehicle to support the NSSL program from the region.</p>\n\n<p>As one of only five launch providers selected for the DOD&rsquo;s program, eligibility for NSSL Lane 1 includes stringent requirements that aim to develop a diversified, competitive and reliable domestic launch base to provide launch services for its national security missions. The program plans to award a minimum of 30 missions within its contracting period through to 2029, with the potential for an extension through to 2034. As part of the on-ramp to the NSSL program, Rocket Lab receives a $5 million task order to perform a capabilities assessment that demonstrates the company&rsquo;s tailored approach to mission assurance for launches awarded through the NSSL program.</p>\n\n<p>&ldquo;Supporting assured access to space for the nation&rsquo;s most important missions has always been the goal with our <em>Neutron</em> rocket, and we&rsquo;re incredibly proud to selected by the U.S. Space Force to demonstrate this commitment for the NSSL,&rdquo; says Sir Peter Beck, Rocket Lab founder and CEO.&nbsp;</p>\n\n<p>The company has achieve 63 <em>Electron</em> launches to date and is one of only two U.S. launch providers to have launched multiple payloads to orbit so far in 2025.&nbsp;</p>\n\n<p><em>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/news/rocket-lab-awarded-haste-launch-contract-for-us-dod\">Rocket Lab awarded HASTE launch contract for U.S. DOD</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rocket-lab-neutron-rocket-to-support-us-space-force-nssl"
      }
    ],
    "link": "https://www.compositesworld.com/news/rocket-lab-neutron-rocket-to-support-us-space-force-nssl"
  },
  {
    "published": "Tue, 6 May 2025 09:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      6,
      13,
      0,
      0,
      1,
      126,
      0
    ],
    "title": "ReSComp Engineering hosts free webinar on composites structures behavior under loading",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ReSComp Engineering hosts free webinar on composites structures behavior under loading"
    },
    "summary": "Webinar sessions for&nbsp;May 8 and May 13 are now open to the scientific community and composites professionals.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Webinar sessions for&nbsp;May 8 and May 13 are now open to the scientific community and composites professionals."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-rescomp-webinar.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Testing a composite specimen.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-rescomp-webinar.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | ReSComp Engineering</p>\n</div>\n\n<p>The scientific community and professionals in the field of composite materials are invited to attend a free webinar on &ldquo;Reliability of Composite Structures under Cyclic Loading,&rdquo;&nbsp;organized by <a href=\"https://www.rescomp.it/\" target=\"_blank\">ReSComp Engineering</a> (Vicenza, Italy), with two sessions scheduled to accommodate both Western and Eastern audiences.</p>\n\n<p>Webinar dates (Italian time) are as follows:</p>\n\n<ul>\n\t<li>May 8, 2025, at 9:00 CET</li>\n\t<li>May 13, 2025, at 17:00 CET</li>\n</ul>\n\n<p>This <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSddFSC-3Hw_n9aCUd4dT8xvJnXfqF67_-Gcc7KNqP7nLOwsmg/viewform\" target=\"_blank\">no-cost online event</a> will offer valuable insights into the behavior and design of composite structures subjected to fatigue loading. Topics covered will include:</p>\n\n<ul>\n\t<li>An introduction to damage mechanics of composites under fatigue</li>\n\t<li>Preliminary and advanced design strategies and tools</li>\n\t<li>Structural health monitoring (SHM) techniques</li>\n\t<li>Real-world application examples</li>\n</ul>\n\n<p>ReSComp Engineering is <a href=\"https://www.compositesworld.com/news/rescomp-engineering-is-spun-off-from-university-of-padova\" target=\"_blank\">a University of Padova spin-off</a> dedicated to enhancing the reliability and safety of advanced mechanical structures. Founded on more than 20 years of&nbsp;research by the Composite Group under Professor Marino Quaresimin, ReSComp seeks to deliver breakthrough solutions in&nbsp;advanced composite design and SHM across&nbsp;aerospace, automotive, wind energy, hydrogen storage&nbsp;and other markets.</p>\n\n<p>This webinar will also serve as a primer for the upcoming <a href=\"http://static.gest.unipd.it/composites-design2025/\" target=\"_blank\">Intensive Course on Advanced Design with Composite Materials</a>, which will be held from June 16-20, 2025, in Vicenza, Italy, with options for in-person or remote attendance.</p>\n\n<p>Register for the webinar <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSddFSC-3Hw_n9aCUd4dT8xvJnXfqF67_-Gcc7KNqP7nLOwsmg/viewform\" target=\"_blank\">here</a>. Reach out to&nbsp;Marino Quaresimin&nbsp;for questions at <a href=\"https://rescomp@rescomp.it\" target=\"_blank\">rescomp@rescomp.it</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rescomp-engineering-hosts-free-webinar-on-composites-structures-behavior-under-loading"
      }
    ],
    "link": "https://www.compositesworld.com/news/rescomp-engineering-hosts-free-webinar-on-composites-structures-behavior-under-loading"
  },
  {
    "published": "Mon, 5 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      5,
      17,
      0,
      0,
      0,
      125,
      0
    ],
    "title": "Clean Sky 2 outer wing box demonstrator validates OOA LRI, shimless assembly and SHM",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Clean Sky 2 outer wing box demonstrator validates OOA LRI, shimless assembly and SHM"
    },
    "summary": "Full-scale wing box project achieves TRL 5 with 2% weight reduction and 4% reduction in recurring production costs through improved manufacturing efficiency and assembly processes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Full-scale wing box project achieves TRL 5 with 2% weight reduction and 4% reduction in recurring production costs through improved manufacturing efficiency and assembly processes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cleansky2-herwingt-updates.png;maxWidth=385\" /></div>\n\n<p>The&nbsp;Outer Wing Box in its testing configuration. Source | Clean Sky 2</p>\n</div>\n\n<p>A milestone has been achieved with the&nbsp;testing of the Clean Sky 2 outer wing box&nbsp;(OWB) full-scale demonstrator which has achieved technology readiness level&nbsp;(TRL) 5,&nbsp;validating its&nbsp;feasibility for future applications and providing a foundation for advancements in&nbsp;aerospace manufacturing that will enable weight reduction and more efficient assembly techniques.</p>\n\n<p>The OWB demonstrator project &mdash; <a href=\"https://www.clean-aviation.eu/clean-sky-2/demonstrators/key-demonstrators/adaptive-wing-integrated-demonstrator-flying-test-bed-outer-wing-box\" target=\"_blank\">which ran between 2014 and 2024</a>&nbsp;&mdash; is representative&nbsp;of a regional aircraft wing configuration that aimed&nbsp;to validate emerging technologies such as out-of-autoclave liquid resin infusion&nbsp;(OOA LRI), in situ consolidation of thermoplastic composites, shimless&nbsp;assembly and structural health monitoring (SHM) sensor systems. It was a collaborative effort&nbsp;involving multiple aerospace industry leaders and research institutions, including&nbsp;Hellenic Aerospace Industry&nbsp;(HAI), the University of Nottingham in VADIS, the University of Naples (UNINA), ItalSystem Srl and&nbsp;and the Italian Aerospace Research Centre (CIRA)&nbsp;in Air Green 2. The topic manager was&nbsp;Leonardo.</p>\n\n<p>The full-scale OWB demonstrator,&nbsp;the structural core of an aircraft wing (and a key interface with the aircraft fuselage), is approximately 9.1 meters in width at the root rib of about 1.3 meters, and a width at the tip rib of about 0.7 meter. It includes several components manufactured via LRI/OOA processes, comprising:</p>\n\n<ul>\n\t<li>One stiffened upper panel including a removable panel</li>\n\t<li>One stiffened lower panel manufactured in one shot by a co-infusion of skin, stringers and rib feet</li>\n\t<li>Two LRI spars</li>\n\t<li>Fourteen LRI ribs</li>\n\t<li>Four&nbsp;metallic ribs.</li>\n</ul>\n\n<p>The primary goal of the OWB demonstrator was to validate advanced manufacturing processes and&nbsp;innovative assembly methodologies at full-scale level, as&nbsp;Vittorio Ascione, Clean Sky 2 REG IADP project manager at Leonardo&nbsp;notes.</p>\n\n<p>&ldquo;To have the assurance of the assessment of some technologies, you need to reach the full scale that will be used on the aircraft,&rdquo;&nbsp;Ascione&nbsp;says. &ldquo;Because by means of testing at full scale, you can find new issues that you never would be able to detect or foresee with a small scale demonstrator.&nbsp;Having a full-scale demonstrator included in the process gave us that assurance that all worked well, and the assessment of technologies was really complete. This was the first time that we had produced a more than 9-meter-long demonstrator &mdash;&nbsp;in itself a significant achievement &mdash;&nbsp;adding the possibility to check these new technologies at full size.&rdquo;</p>\n\n<p>However, developing large, integrated composite panels presented numerous challenges. Key technologies used to overcome these challenges included, OOA,&nbsp;LRI,&nbsp;shimless assembly,&nbsp;determinant assembly&nbsp;and part-to-part assembly:</p>\n\n<h3>OOA LRI process</h3>\n\n<p>This process was designed to manufacture large integral stiffened composite panels with greater efficiency and&nbsp;reduced environmental impact. Unlike traditional autoclave-based composites manufacturing, the use of OOA LRI, compared to a&nbsp;traditional composite process that uses prepreg in an autoclave, enables components to be &ldquo;cured&rdquo;&nbsp;using less energy&nbsp;(as pressurization during curing is not necessary), and large refrigerators are not required to maintain the composite material before starting production. This approach resulted in a&nbsp;2% weight reduction, which would &mdash;&nbsp;when applied to an in-service OWB&nbsp;&mdash;&nbsp;translate into fuel savings and emissions reductions.</p>\n\n<h3><strong>Shimless assembly</strong></h3>\n\n<p>The development of shimless assembly techniques necessitated the seamless integration of scanning, reverse engineering&nbsp;and CAM software.</p>\n\n<p>&ldquo;Traditionally, wing box assembly involves using shims to close gaps between ribs and panels. This process is time-consuming and expensive,&rdquo; explains Giuseppe Totaro, Clean Sky 2 REG IADP OWB demo leader at Leonardo. &ldquo;Our new approach uses digital twins and precise machining to create a shimless configuration.&rdquo;</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>GKN Fokker (<a href=\"https://www.gknaerospace.com/about-us/gkn-fokker/\" target=\"_blank\">acquired by GKN Aerospace</a>, Redditch, U.K.) announced it&nbsp;received the AFP&nbsp;layup tool for the Clean Aviation project HERWINGT&nbsp;on April 28. GKN Fokker has developed a laser AFP in situ consolidation (ISC) process for a lower cover for the outer wing box (OWB).&nbsp;</p>\n\n<p>This lower cover will have stringers that will be co-consolidated in a &ldquo;one-shot&rdquo; during the ISC layup of the skin. The self-heated tool has been developed together with Grunewald GmbH &amp; Co. KG. The stringers are provided by Xelis GmbH (<a href=\"https://www.compositesworld.com/news/avanco-composites-bundles-lightweight-composites-expertise-into-new-corporate-structure\" target=\"_blank\">part of Avanco&nbsp;Composites</a>) and are produced with continuous compression molding (CCM) technology.</p>\n\n<p>In the coming months, production trials will be executed to prepare for manufacturing the lower cover for the full-scale OWB, which will be assembled and tested by Leonardo.</p>\n</div>\n</div>\n\n<p>Shimless assembly is based on the study of tolerance propagation, and on a &ldquo;determinant assembly approach&rdquo; (DAA)&nbsp;This is a manufacturing and assembly methodology that ensures parts fit together with minimal adjustments, reducing the need for shims, rework&nbsp;or manual fitting during the assembly process. The DAA&nbsp;relies on&nbsp;precise engineering, digital design and tolerance management&nbsp;to create components that align perfectly when assembled. This approach, developed in Project VADIS (Variance Aware Determinate Assembly Integrated System), allows tolerances to be optimized by increasing them where possible with a reduction in manufacturing costs.</p>\n\n<p>This challenge was also addressed through the refinement of&nbsp;automatic software routines, ensuring compatibility with existing industry tools, such as Catia. Using reverse engineering, automatic software routines were developed to scan panel surfaces and determine final rib surfaces for precise part-to-part assembly &mdash; a method of creating assemblies by joining two or more parts, where the parts can either touch or intrude into each other, and can be used to create a new part or subassembly.</p>\n\n<p>The final demonstrator, measuring&nbsp;more than 9 meters in length, successfully demonstrated the efficiency of this approach by reducing the need for shims and enabling&nbsp;one-pass finished hole execution&nbsp;instead of multiple passes, leading to a&nbsp;4% reduction in manufacturing costs.</p>\n\n<h3><strong>Structural health monitoring (SHM)</strong></h3>\n\n<p>A key feature in the project was the integration of&nbsp;SHM&nbsp;piezoelectric sensors and optical fibers&nbsp;which were strategically embedded in the wing box&nbsp;in order to&nbsp;monitor the stresses and condition&nbsp;of the OWB structure. This was successfully tested, proving its effectiveness in&nbsp;detecting, localizing and tracking damage propagation&nbsp;in the composite structure, ensuring long-term reliability and safety.</p>\n\n<p>&ldquo;We collaborated with the Air Green 2 consortium to install electric sensors inside the complex wing box. This was done at full scale to validate the technologies, which was particularly significant given the 9.1-meter demonstrator length,&rdquo;&nbsp;says Leonardo&rsquo;s Ascione.</p>\n\n<p>This technology not only enhances aircraft safety by enabling real-time monitoring, it also helps with predictive maintenance&nbsp;by facilitating the collection of data that can be used to forecast when maintenance and repairs might be needed in the future.</p>\n\n<p>Following rigorous testing, including a&nbsp;full-scale&nbsp;static bending test, the project successfully validated these technologies, confirming a&nbsp;strong correlation between experimental data and numerical models. This validation was critical in achieving&nbsp;TRL 5, demonstrating the feasibility of these technologies for future aerospace applications.</p>\n\n<h3><strong>Future applications and next steps</strong></h3>\n\n<p>The success of the&nbsp;OWB demonstrator paves the way for further advancements in European aerospace&nbsp;manufacturing: The processes developed throughout the course of the project &mdash;&nbsp;notably the full-scale LRI manufacturing process for full-scale stiffened panels with integrated stringers, ribs and spars &mdash;&nbsp;can be applied not just for regional aircraft but for other aircraft sizes too (both larger and smaller), where production costs and environmental impact requirements are more challenging.</p>\n\n<p>&ldquo;The technologies developed have already been applied to other Clean Aviation projects,&rdquo;&nbsp;says Ascione. &ldquo;The LRI&nbsp;process is particularly suitable for wing, horizontal&nbsp;and vertical tail configurations with thicker composite structures.&rdquo;</p>\n\n<p>The development of the LRI process to produce stiffened wing panels will be continued in the Clean Aviation&nbsp;<a href=\"https://www.compositesworld.com/news/herwingt-project-to-design-novel-composite-wing-configuration-for-future-regional-aircraft\" target=\"_blank\">HERWINGT&nbsp;project</a>, where a different formulation of the resin will be studied to increase performance in terms of&nbsp;glass transition temperature&nbsp;and lighting strike protection.</p>\n\n<p>The part-to-part assembly technology, developed in OWB, has proven to hold potential, and will be further developed in upcoming national research projects.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/clean-sky-2-outer-wing-box-demonstrator-validates-ooa-lri-shimless-assembly-and-shm"
      }
    ],
    "link": "https://www.compositesworld.com/news/clean-sky-2-outer-wing-box-demonstrator-validates-ooa-lri-shimless-assembly-and-shm"
  },
  {
    "published": "Mon, 5 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      5,
      16,
      0,
      0,
      0,
      125,
      0
    ],
    "title": "Piasecki Aircraft grows UAV offerings with Kaman Kargo purchase",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Piasecki Aircraft grows UAV offerings with Kaman Kargo purchase"
    },
    "summary": "An agreement has been met in which Piasecki obtains Kaman&rsquo;s Kargo UAV program, with an immediate focus to transition it from prototype to production by late 2026.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "An agreement has been met in which Piasecki obtains Kaman&rsquo;s Kargo UAV program, with an immediate focus to transition it from prototype to production by late 2026."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-piasecki-kargouav.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-piasecki-kargouav.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Piasecki Aircraft Corp./<a href=\"https://www.newswire.com/news/piasecki-aircraft-acquires-kaman-air-vehicles-kargo-uav-program-22563596\" target=\"_blank\">News Wire</a></p>\n</div>\n\n<p><a href=\"https://piasecki.com/\" target=\"_blank\">Piasecki Aircraft Corp.</a> (Essington, Pa., U.S.) has acquired <a href=\"https://kaman.com/brands/kaman-air-vehicles/\" target=\"_blank\">Kaman Air Vehicles</a>&rsquo; (Bloomfield, Conn., U.S.) Kargo&nbsp;unmanned aerial vehicle (UAV)&nbsp;program. Already demonstrated in&nbsp;U.S. Marine Corps and U.S. Army military evaluation programs, trusted sources like <a href=\"https://aviationweek.com/defense/aircraft-propulsion/piasecki-acquires-heavy-lift-kargo-uav-kaman?check_logged_in=1\" target=\"_blank\"><em>Aviation Week</em> say</a> Piasecki is planning to &ldquo;accelerate development to have a production-ready vehicle prepared by late 2026.&rdquo;</p>\n\n<p>According to <a href=\"https://www.ainonline.com/aviation-news/defense/2025-04-28/piasecki-acquires-kamans-kargo-uav-program\" target=\"_blank\">ainonline.com</a>, Kaman has been working on the Kargo UAV since 2021-2022, progressing its performance targets &mdash; including a payload of up to 1,400 pounds, a range of 1,100 nautical miles and speeds up to 100 knots. The medium-lift, uncrewed logistics aircraft is designed for&nbsp;autonomous cargo delivery in contested and remote areas for both defense and commercial applications thanks to its robust&nbsp;construction, adaptability&nbsp;and a small logistical footprint.&nbsp;A <a href=\"https://www.thedroningcompany.com/blog/kaman-kargo-uav\" target=\"_blank\">2023 article</a> on the Kaman UAV by The Droning Company highlights the aircraft&rsquo;s fuselage &ldquo;composed largely of a composite shell around a lightweight aluminum structure, with the pod fitted underneath between two landing skids.&rdquo;&nbsp;</p>\n\n<p>Under the terms of the agreement, Kaman is selling all of its IP and two full-scale prototypes. <a href=\"https://www.airframer.com/news_story.html?report=33939\" target=\"_blank\"><em>Airframer</em></a> notes that all R&amp;D and operational work will now be relocated to Piasecki&rsquo;s Heliplex facility in Coatesville, Pennsylvania. The addition to Piasecki&rsquo;s&nbsp;existing rotorcraft portfolio will enhance&nbsp;its ability to deliver cutting-edge cargo transport solutions with agile logistics.</p>\n\n<p>&ldquo;This acquisition is a perfect fit for Piasecki&rsquo;s long-term vision for a family of autonomous VTOL UAS solutions to address a diverse range of customer mission requirements in both government and commercial markets,&rdquo; CEO John Piasecki has told many sources. &ldquo;Kaman&rsquo;s Kargo&nbsp;UAV program&nbsp;has already achieved significant milestones.&rdquo;</p>\n\n<p>This includes recently demonstrating&nbsp;autonomous lift capabilities for the U.S. Army and completed full flight testing using Near Earth Autonomy&rsquo;s Peregrine system.&nbsp;It has also completed the aforementioned&nbsp;military contracts.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/piasecki-aircraft-grows-uav-offerings-with-kaman-kargo-purchase"
      }
    ],
    "link": "https://www.compositesworld.com/news/piasecki-aircraft-grows-uav-offerings-with-kaman-kargo-purchase"
  },
  {
    "published": "Mon, 5 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      5,
      15,
      0,
      0,
      0,
      125,
      0
    ],
    "title": "Boeing sees early positive results in Q1 2025 report",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Boeing sees early positive results in Q1 2025 report"
    },
    "summary": "Company says that results, including&nbsp;$19.5 billion revenue,&nbsp;backlog growth of $545 billion and 737 production increase, indicate Boeing is moving in the right direction.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Company says that results, including&nbsp;$19.5 billion revenue,&nbsp;backlog growth of $545 billion and 737 production increase, indicate Boeing is moving in the right direction."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-boeing-787-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Boeing 787 Dreamliner.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-boeing-787-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>The Boeing Co. (Arlington, Va., U.S.) has recorded first quarter (Q1) 2025 results. The company cites a&nbsp;revenue of&nbsp;$19.5&nbsp;billion, primarily reflecting 130 commercial deliveries and the growth of total company backlog to $545 billion, including more than 5,600 commercial airplanes. The company reports that 737 production also gradually increased this quarter, which is still expected to reach 38/month in 2025. Overall, Boeing says Q1 2025 results reflect&nbsp;improved operational performance and commercial delivery volume. Results also reflect tariffs enacted only as of&nbsp;March 31.</p>\n\n<p>&ldquo;Our company is moving in the right direction as we start to see improved operational performance across our businesses from our ongoing focus on safety and quality,&rdquo; says&nbsp;Kelly Ortberg, Boeing president and CEO. &ldquo;We continue to execute our plan, are seeing early positive results and remain committed to making the fundamental changes needed to fully recover the company's performance while navigating the current environment.&rdquo;</p>\n\n<p>Operating cash flow was&nbsp;($1.6) billion&nbsp;in Q1, reflecting higher commercial deliveries, as well as working capital timing (Table 2). Cash and investments in marketable securities totaled&nbsp;$23.7 billion, compared to&nbsp;$26.3 billion&nbsp;at the beginning of the quarter, primarily driven by the free cash flow use in the quarter (Table 3). Debt was&nbsp;$53.6 billion, down from&nbsp;$53.9 billion&nbsp;at the beginning of the quarter due to the pay down of maturing debt. The company maintains access to credit facilities of&nbsp;$10.0 billion, which remain undrawn.</p>\n\n<p>Total company backlog at quarter end was&nbsp;$545 billion.</p>\n\n<h2><strong>Segment results</strong></h2>\n\n<p>In Boeing&rsquo;s <strong>Commercial Airplanes </strong>segment, t<span style=\"font-size: 1.1rem; letter-spacing: 0.008em;\">he 737 program gradually increased production in Q1 2025 and maintains plans to reach 3</span><span style=\"font-size: 1.1rem; letter-spacing: 0.008em;\">8/month. The 787 program continued to stabilize production at five/month in the quarter and still expects to increase to seven/month in 2025. The 777X program also began expanded FAA certification flight testing, and the company still anticipates first delivery of the 777-9 in 2026.</span></p>\n\n<p>Commercial Airplanes booked 221 net orders in Q1, including 20 777-9 and 20 787-10 airplanes for Korean Air and 50 737-8 airplanes for BOC Aviation. This segment delivered 130 airplanes (2024: 83) and backlog included more than&nbsp;5,600 airplanes valued at&nbsp;$460 billion.</p>\n\n<p>Airbus says Commercial Airplanes Q1&nbsp;revenue of&nbsp;$8.1&nbsp;billion (2024: $4.7)&nbsp;and operating margin of 6.6% (2024: 24.6%) primarily reflect higher deliveries compared to 2024.</p>\n\n<p>The <strong>Defense, Space &amp; Security</strong> segment was selected by the U.S. Air Force for a contract to design, build and deliver the F-47, its next-generation fighter aircraft. This order is not included in backlog at the end of Q1 pending completion of the source selection and evaluation review process. Backlog at Defense, Space &amp; Security was&nbsp;$62 billion, of which 29% represents orders from customers outside the U.S. Its revenue was&nbsp;$6.3 billion, and an operating margin of 2.5% reflects stabilizing operational performance.</p>\n\n<p><strong>Global Services</strong> delivered the 100th 767-300 Boeing Converted Freighter to SF Airlines and received a modification contract from the U.S. Air Force to integrate electronic warfare systems for the F-15 Eagle. In April, the company entered an agreement to sell portions of its Digital Aviation Solutions business, and the transaction is expected to close by the end of 2025 subject to regulatory approval and customary closing conditions.</p>\n\n<p>Overall, this segment&rsquo;s revenue ($5.1 billion), earnings and operation margins (18.6%) remained similar to 2024, highlighting a favorable performance and mix according to Boeing.</p>\n\n<p>Boeing provides charts and figures on its Q1 2025 results <a href=\"https://boeing.mediaroom.com/2025-04-23-Boeing-Reports-First-Quarter-Results\" target=\"_blank\">here</a>.</p>\n\n<p><em>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/news/airbus-q1-2025-demonstrates-production-progress-despite-headwinds\" target=\"_blank\">Airbus Q1 2025 demonstrates production progress despite headwinds</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/boeing-sees-early-positive-results-in-q1-2025-report"
      }
    ],
    "link": "https://www.compositesworld.com/news/boeing-sees-early-positive-results-in-q1-2025-report"
  },
  {
    "published": "Mon, 5 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      5,
      14,
      0,
      0,
      0,
      125,
      0
    ],
    "title": "TAVieDA project team cuts aircraft door production time using thermoplastic composites, welding",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "TAVieDA project team cuts aircraft door production time using thermoplastic composites, welding"
    },
    "summary": "Fraunhofer groups, Trelleborg and Airbus develop&nbsp;modular, fully automated assembly system concept&nbsp;to replace metals and time-consuming assembly that shows potential for scalability.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Fraunhofer groups, Trelleborg and Airbus develop&nbsp;modular, fully automated assembly system concept&nbsp;to replace metals and time-consuming assembly that shows potential for scalability."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tavieda-clamping-element.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Clamping element.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tavieda-clamping-element.jpg;maxWidth=720\" /> </a></div>\n\n<p>Clamping element developed at Fraunhofer IWU for automated clamping and joining of thermoplastic carbon fiber composites in aircraft doors (such as a crossbeam). Source (All Images)&nbsp;| Fraunhofer IWU</p>\n</div>\n\n<p>The TAVieDA research project by the&nbsp;Fraunhofer Institute for Machine Tools and Forming Technology (IWU, Chemnitz, Germany), the&nbsp;Fraunhofer Institute for Structural Durability and System Reliability (LBF, Darmstadt), Trelleborg (Sweden) and Airbus Helicopters (Marignane, France) demonstrates how replacing&nbsp;aluminum, titanium&nbsp;and thermosets&nbsp;primarily with carbon fiber-reinforced thermoplastic polymers&nbsp;(CFRTP) can reduce the manufacturing time for passenger aircraft doors.</p>\n\n<p>Aircraft doors are still primarily manufactured by hand. A particularly time-consuming aspect is assembling the door structures using screws and rivets. Numerous intermediate steps are required to prevent direct contact between different materials &mdash; which would otherwise lead to corrosion. Using CFRTP primarily could weld these structures together&nbsp;automatically without separating layers, partners note, dropping manufacturing time from 110 hours to 4 hours.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<blockquote>\n<p>Learn more about thermoplastic composites welding <a href=\"https://www.compositesworld.com/topics/welding\" target=\"_blank\">here</a>.</p>\n</blockquote>\n</div>\n\n<p>Another key factor in shortening assembly times is the modular design for different aircraft door variants. The project team specifically looked for components across various door models that could be standardized &mdash; and found success, for example, with the crossbeam. The researchers designed a fully automated assembly line for the most common models and developed fixtures and clamping elements suitable for resistance and ultrasonic welding technologies.</p>\n\n<p>&ldquo;Together with our colleagues at Airbus, we closely analyzed all door structures to adapt the geometries for automatic clamping and joining,&rdquo; says Dr. Rayk Fritzsche, project lead at Fraunhofer IWU. &ldquo;As a result, we could reorganize and fully automate the individual assembly steps. This way, we slash the lead time to a fraction of what it used to be.&rdquo; Manual labor is now only required to install the locking mechanism.</p>\n\n<p>Two almost identical assembly and joining lines ensure redundancy if one line is unavailable. Thanks to standardization measures, batches of 10 doors can now be organized, enabling fully automated line retooling at the end of each shift to accommodate the following model series. With a production capacity of 4,000 doors per year, partners agree that the&nbsp;new material and production concept leads&nbsp;to significant scalability benefits.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-tavieda-output-cost-model.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Cost modeling of TAVieDA project.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-tavieda-output-cost-model.jpg;maxWidth=720\" /> </a></div>\n\n<p>As part of a new approach, cost modeling was integrated directly into the simulation environment, allowing for simultaneous calculation of unit costs alongside simulation results.</p>\n</div>\n\n<p>Maxi Grobis, from IWU&rsquo;s factory planning, simulation&nbsp;and evaluation team, simulated all technical and economic aspects of the new assembly line &mdash;factors that often influence each other. Key technical assessment criteria included product and process complexity, opportunities and risks of automation (especially concerning flexibility and adaptability), and overall system availability across a chain of individual automated systems.</p>\n\n<p>Automating just for automation&rsquo;s sake wasn&rsquo;t an option. &ldquo;To deliver a truly integrated solution, we analyzed the entire door production and assembly process and translated it into a dynamic cost model,&rdquo; Grobis emphasizes. &ldquo;What works technically also has to make sense in terms of capital expenditure, machine hourly rates, maintenance effort, energy costs, capital commitment and depreciation. Focusing solely on labor cost savings or shorter lead times would be shortsighted.&rdquo;</p>\n\n<p>Considering all technical, logistical&nbsp;and financial factors, there is a clear recommendation to implement the newly developed automation solution. Grobis notes that her integrated simulation approach also reduced planning time by about 25%.&nbsp;</p>\n\n<p>&ldquo;Thinking about economics from the beginning saves unnecessary revision loops during planning,&rdquo; she concludes.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/-tavieda-project-team-cuts-aircraft-door-production-time-using-thermoplastic-composites-welding"
      }
    ],
    "link": "https://www.compositesworld.com/news/-tavieda-project-team-cuts-aircraft-door-production-time-using-thermoplastic-composites-welding"
  }
]