[
  {
    "published": "Fri, 30 May 2025 00:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      4,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "People in composites: May 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "People in composites: May 2025"
    },
    "summary": "IACMI, Ilium Composites, Wrexham University, 47G and Thermwood Corp. have shared new hires and promotions in the composites industry.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "IACMI, Ilium Composites, Wrexham University, 47G and Thermwood Corp. have shared new hires and promotions in the composites industry."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article_sidebar\">\n<h3>IACMI names new chief commercialization officer</h3>\n\n<p>On May 28, <a href=\"https://www.compositesworld.com/suppliers/institutef\" target=\"_blank\">IACMI &ndash; The Composites Institute</a> (Knoxville, Tenn., U.S.) announced that&nbsp;Jason Gibson, Ph.D., will join IACMI on June 2 as its chief commercialization officer (CCO). He will succeed Dale Brosius, who is retiring following 10 years as the institute&rsquo;s founding CCO.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Jason Gibson.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-iacmi-jasongibson-highres.jpg;maxWidth=385\" /></div>\n\n<p>Jason Gibson, IACMI&rsquo;s chief commercialization officer (CCO).</p>\n</div>\n\n<p>Gibson brings more than 20 years of leadership in composites innovation, technology commercialization&nbsp;and cross-sector collaboration to this pivotal role. As CCO, he will lead efforts to commercialize advanced composites technologies, guide strategic direction and coordinate high-impact collaborative projects aligned with IACMI&rsquo;s mission to advance sustainable U.S. manufacturing. He will also serve as executive director of IACMI&rsquo;s Consortium Council.</p>\n\n<p>&ldquo;Jason has a proven track record in the area of applied innovation, industry collaboration and a commitment to workforce development,&rdquo; says&nbsp;IACMI CEO Chad Duty. &ldquo;As a results-driven professional, he is the right leader at the right time to build on the strong foundation Dale has created and to take our commercialization strategy into the next decade.&rdquo;</p>\n\n<p>Gibson joins IACMI after more than two decades at Composites One, where he most recently served as chief applications engineer. There, he led the development and commercialization of technologies such as aerospace-certified thermoplastic composites, graphene-enhanced resins for hydrogen storage&nbsp;and next-generation lightweight defense materials. His work consistently bridged research and market readiness, often involving collaborations with OEMs, national laboratories&nbsp;and academic research institutions.</p>\n\n<p>&ldquo;I am thrilled to join IACMI and contribute to its mission of accelerating the development and adoption of advanced composites,&rdquo; says&nbsp;Gibson. &ldquo;IACMI is at the heart of our nation&rsquo;s composites innovation ecosystem. I look forward to advancing technologies that can drive real impact across energy, defense and sustainability while fostering the workforce needed to support them.&rdquo;</p>\n\n<p>Gibson holds a Ph.D. in mechanical engineering from the University of Central Florida, and Masters of Science&nbsp;degrees in both mechanical engineering and industrial and systems engineering, along with a Bachelor of Science&nbsp;in aeronautical and astronautical engineering &mdash; all from Ohio State University.</p>\n\n<p>Gibson will follow Dale Brosius, who has served as CCO since 2015 and was named executive VP&nbsp;in 2023 following one year as IACMI&rsquo;s interim CEO. Brosius was the first employee hired at IACMI following its establishment by the U.S. Department of Energy (DOE), and his leadership has been foundational in shaping the institute&rsquo;s commercialization vision, collaborative approach&nbsp;and national impact.</p>\n\n<p>Over the past 10 years, Brosius has led more than&nbsp;60 technical innovation projects involving over 90 IACMI member organizations. These projects, supported by DOE and cost-sharing partners, represented a combined $150-plus&nbsp;million in R&amp;D investment and significantly advanced TRLs in key sectors such as additive manufacturing, automotive composites, wind energy&nbsp;and recycling. His leadership directly contributed to the commercialization of more than 25 new products and technologies.</p>\n\n<p>&ldquo;Dale has been instrumental in building IACMI into an internationally recognized institute for composites innovation,&rdquo; adds&nbsp;Duty. &ldquo;He has been a tireless advocate for innovation and collaboration and has played a pivotal role in creating the roadmap for composites commercialization in the U.S. We are grateful for his leadership and are honored to celebrate his legacy.&rdquo;</p>\n\n<p>Brosius will officially retire from his role as CCO at the end of June and will continue supporting IACMI during the leadership transition.</p>\n</div>\n\n<h3><strong>Thermwood announces executive leadership promotions</strong></h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/thermwood\" target=\"_blank\">Thermwood Corp.</a> (Dale, Ind., U.S.) announces the promotion of two key executives as part of its continued focus on innovation, growth&nbsp;and long-term leadership development.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Jason Susnjara.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-peoplenews-thermwood-jasonsusnjara-highres.jpg;maxWidth=385\" /></div>\n\n<p>Jason Susnjara, president of Thermwood.</p>\n</div>\n\n<p>Jason Susnjara has been promoted to president of Thermwood,&nbsp;succeeding&nbsp; David Hildenbrand, who recently retired after 47 years of distinguished service. With more than 30 years at the company, Susnjara has held a wide range of leadership roles across multiple departments, gaining a comprehensive understanding of the company&rsquo;s operations.</p>\n\n<p>Since 2019, he has served as executive VP, where he played a key role in guiding Thermwood&rsquo;s strategic direction and growth. He also serves on the company&rsquo;s board of directors.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Jennifer Watt\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-peoplenews-thermwood-jenniferwatt-highres.jpeg;maxWidth=385\" /></div>\n\n<p>Jennifer Watt, Thermwood executive VP.</p>\n</div>\n\n<p>Jennifer Watt has been promoted to executive VP. Since 2019, Watt has served as the company&rsquo;s chief legal officer, where she has led Thermwood&rsquo;s legal and corporate governance efforts with distinction.</p>\n\n<p>Watts holds a Juris Doctor from Chicago-Kent College of Law and a Bachelor of Science in business from the Indiana University Kelley School of Business. She is a licensed attorney in both Indiana and Illinois and serves on Thermwood&rsquo;s board of directors.</p>\n\n<div class=\"article_sidebar\">\n<h3><strong>Ilium Composites welcomes business development manager&nbsp;</strong></h3>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"José María Rodríguez Ramírez.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-illium-josémaría.jpg;maxWidth=385\" /></div>\n\n<p>Jos&eacute; Mar&iacute;a Rodr&iacute;guez Ram&iacute;rez, Ilium Composites business development manager.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/ilium-composites\" target=\"_blank\">Ilium Composites</a> (Hidd, Bahrain)&nbsp;announces the appointment of Jos&eacute; Mar&iacute;a Rodr&iacute;guez Ram&iacute;rez as business development manager, strengthening the company&rsquo;s strategic growth plans for its advanced composite material solutions across global markets.</p>\n\n<p>Based in Europe and reporting directly to managing director Luma Aljishi, Rodr&iacute;guez Ram&iacute;rez brings a combination of technical expertise, commercial acumen and international experience to Ilium. With more than&nbsp;25 years of experience in the polymer and composite materials industries, he has held senior roles in R&amp;D, technical sales, business development&nbsp;and project management at&nbsp;companies including Fiberline Composites, Owens Corning and DSM.</p>\n\n<p>Rodr&iacute;guez Ram&iacute;rez has consistently delivered optimal results throughout his career, including driving significant sales growth, developing and implementing structured business strategies, managing complex customer relationships and leading cross-functional teams. His strong technical foundation in composites technologies, particularly in resin infusion, pultrusion&nbsp;and reinforcement manufacturing, matches his robust commercial focus, making him ideally suited to support Ilium&rsquo;s expansion plans.</p>\n\n<p>At Ilium,Rodr&iacute;guez Ram&iacute;rez will play a pivotal role in identifying and developing new business opportunities, enhancing customer relationships&nbsp;and supporting the launch of innovative products. His appointment aligns with Ilium&rsquo;s commitment to delivering high-quality, customized composite solutions that meet customers&rsquo;&nbsp;evolving needs worldwide.</p>\n\n<p>Rodr&iacute;guez Ram&iacute;rez&nbsp;holds an Master&nbsp;of Science&nbsp;in chemistry from the University of Barcelona, a Bachelor&nbsp;of Science&nbsp;in business from the Universitat Oberta de Catalunya, and a Master&rsquo;s degree in Paint Technology. Fluent in English, Spanish&nbsp;and Catalan, with working proficiency in Dutch and French, he is well-positioned to support Ilium&rsquo;s international client base.</p>\n</div>\n\n<h3>&nbsp;</h3>\n\n<h3><strong>Wrexham University appoints researchers for&nbsp;Enterprise Engineering and Optics Centre project</strong></h3>\n\n<p>Two researchers in hydrogen engineering and composite materials have been appointed at <a href=\"https://wrexham.ac.uk/\" target=\"_blank\">Wrexham University</a> (Wales), as part of the institution&rsquo;s Enterprise Engineering and Optics Centre (EEOC) project.</p>\n\n<p>Barry Johnston has joined Wrexham University as research associate in hydrogen engineering, while Dr. Meysam Anamagh has been appointed as research Fellow in composite materials engineering.</p>\n\n<p>Their appointments will play a pivotal role in conducting cutting-edge research in the new EEOC, which is currently being built at the university&rsquo;s Plas Coch campus. Green hydrogen will also be developed on-site as part of the EEOC project, thanks to the installation of a hydrogen electrolyzer as part of the build, which will contribute to sustainable practices in industry.</p>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-eeoc-barryjohnson-meysamanamagh.png;maxWidth=720\" /> </div>\n\n<p>Barry Johnston and Dr. Meysam Anamagh.</p>\n</div>\n\n<p>&ldquo;I&rsquo;m delighted to have been appointed to the role, particularly at what is an optimistic time for green hydrogen production, here in North Wales,&rdquo; says Johnston.&nbsp;&ldquo;My areas of focus will be on seeking out opportunities in hydrogen research and collaborating with industry partners with an emphasis on decarbonation.&rdquo;</p>\n\n<p>Meanwhile, Anamagh will play a key role in carrying out research, collaborating with industry partners and securing funding to advance the field of composite structures.</p>\n\n<p>&ldquo;As a newly established entity within the university, my role presents a valuable opportunity to collaboratively build a versatile and forward-thinking composite research center,&rdquo; Anamagh&nbsp;notes. &ldquo;In my role, my focus will be on the design, manufacturing&nbsp;and evaluation of composite structures &mdash; specifically, my current research is centered on novel designs for hydrogen composite tanks used in automotive and aerospace applications. The overarching goal is to develop more sustainable hydrogen tanks for future applications, including aircraft and vehicles.&rdquo;</p>\n\n<p>According to&nbsp;Richard Day, professor of composites engineering and pro vice-chancellor for research at Wrexham University, both individuals bring with them extensive research experience in their fields.</p>\n\n<div class=\"article_sidebar\">\n<h3>Utah leaders join 47G board of directors</h3>\n\n<p><a href=\"https://www.linkedin.com/company/47g/\" target=\"_blank\">47G | Utah Aerospace &amp; Defense</a>&nbsp;(Salt Lake City, Utah, U.S.) has announced the&nbsp;appointment of Utah Senator Ann Millner and Governor&rsquo;s Office of Economic Opportunity (GOEO) executive director Jefferson Moss to its board of directors. With deep roots in higher education, public service and economic development, both individuals bring invaluable perspective to 47G&rsquo;s work advancing Utah&rsquo;s fast-growing aerospace and defense industries.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Ann Millner.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-47g-annmillner.jpg;maxWidth=385\" /></div>\n\n<p>Utah Senator Ann Millner.</p>\n</div>\n\n<p>Millner is a longtime champion of Utah&rsquo;s aerospace and defense ecosystem. As both president and vice president at Weber State University, she built critical relationships with Hill Air Force Base and local defense contractors, supporting collaborative research, workforce development and regional economic alignment. Under her leadership, Weber State is reported to have contributed to one of the first statewide cluster reports quantifying the economic benefits of Utah&rsquo;s defense sector.</p>\n\n<p>&ldquo;Utah&rsquo;s defense and aerospace industries are central to our economic future and national security,&rdquo; says&nbsp;Millner. &ldquo;From advanced air mobility and AI to critical minerals, we are at a pivotal point where strategic partnerships and workforce alignment will determine our long-term success. 47G is doing the work to position Utah as a national leader in innovation and industry growth, and I am honored to support this mission as a member of the board.&rdquo;</p>\n\n<p>In her role as co-chair of the legislative aerospace and defense caucus, Millner has played a key part in shaping policy conversations around Utah&rsquo;s emerging aviation technologies. She has also been actively engaged in 47G&rsquo;s Project Alta, a statewide initiative exploring the feasibility and readiness of advanced air mobility in Utah ahead of the 2034 Winter Olympic Games.</p>\n\n<p>Millner currently serves as chair of Talent Ready Utah. In this capacity, she oversees efforts made by education and industry partnerships to build a highly skilled workforce while providing students with increased career and education opportunities. She continues to advocate for strengthening the education-to-employment pipeline and addressing gaps in engineering, production and maintenance roles that are critical to the needs of defense and aerospace companies.</p>\n\n<p>&ldquo;We need to think differently about how we build and support these industries,&rdquo; Millner adds. &ldquo;Employers want graduates who are ready to contribute from day one. That means aligning our educational institutions with workforce demands and ensuring we have a business environment that fosters innovation while protecting our national interests.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Jefferson Moss.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-peoplenews-47g-jeffersonmoss.jpg;maxWidth=385\" /></div>\n\n<p>Governor&rsquo;s Office of Economic Opportunity (GOEO) executive director Jefferson Moss.</p>\n</div>\n\n<p>Joining her on the board is former state representative Jefferson Moss, a leader in higher education, innovation and public-private partnerships. Moss was recently appointed by Utah Governor Spencer Cox as the executive director of the GOEO. In this capacity, Moss will oversee the state&rsquo;s economic development strategy and initiatives.</p>\n\n<p>&ldquo;Utah has an opportunity to lead the nation in cutting-edge research, advanced manufacturing and defense technology,&rdquo; says&nbsp;Moss. &ldquo;From policy to capital to talent, 47G is helping connect the right partners to accelerate progress. I&rsquo;m excited to help shape that future and drive meaningful outcomes for the industries and people of Utah.&rdquo;</p>\n\n<p>In his role as associate commissioner for innovation and commercialization at the Utah System of Higher Education, Moss mobilized Utah&rsquo;s research institutions and capital networks to accelerate market-ready solutions. He also leads the Utah Innovation Fund, which supports early stage companies spun out of the state&rsquo;s colleges and universities. His efforts have expanded access to venture capital, strengthened Utah&rsquo;s commercialization infrastructure&nbsp;and driven forward-thinking public policy through the Nucleus Institute &mdash; an entity designed to address the pressing need for a more connected approach to workforce development, innovation&nbsp;and commercialization.</p>\n\n<p>&ldquo;Senator Millner and Jefferson Moss are visionary leaders who understand the long-term investments needed to ensure Utah continues to thrive as a national hub for aerospace and defense,&rdquo; concludes&nbsp;Aaron Starks, president and CEO of 47G. &ldquo;Their leadership will help strengthen our efforts to align policy, capital and talent with industry needs.&rdquo;</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/people-in-composites-may-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/people-in-composites-may-2025"
  },
  {
    "published": "Wed, 28 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      28,
      17,
      0,
      0,
      2,
      148,
      0
    ],
    "title": "Space Walker relocates flagship branch for next phase of spaceplane development",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Space Walker relocates flagship branch for next phase of spaceplane development"
    },
    "summary": "The move to&nbsp;Minamisoma City supports the startup&rsquo;s future mass production of reusable composite launch vehicles, supporting Japan&rsquo;s future competitiveness in the space industry.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The move to&nbsp;Minamisoma City supports the startup&rsquo;s future mass production of reusable composite launch vehicles, supporting Japan&rsquo;s future competitiveness in the space industry."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-SpaceWalker-new-flagship-branch.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"New branch building.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-SpaceWalker-new-flagship-branch.jpg;maxWidth=720\" /> </a></div>\n\n<p>New flagship branch in&nbsp;Minamisoma&nbsp;City. Source (All Images) | Space Walker</p>\n</div>\n\n<p>On May 23,&nbsp;<a href=\"https://www.space-walker.co.jp/en\" target=\"_blank\">Space Walker Inc.</a>&nbsp;(Tokyo, Japan) announced the relocation of its flagship branch and business from Chiyoda Ward, Tokyo, to Minamisoma City,&nbsp;Fukushima Prefecture, with the purpose of further advancing its <a href=\"https://www.compositesworld.com/news/space-walker-raises-45-million-for-composite-spaceplane-business-developments\" target=\"_blank\">composites-intensive spaceplane development</a> and preparing a future mass production system. The company notes that while the flagship branch was relocated, its head office remains in Shimbashi,&nbsp;Minato-ku, Tokyo, where the Administrative Division continues to operate.</p>\n\n<p>With the establishment of a development and production base, the company aims to anchor its space transportation technology and promote the regional industry, providing an optimized environment to develop, test and manufacture spaceplanes. Space Walker&rsquo;s flagship branch specifically aims to advance social implementation of winged reusable launch vehicles while strengthening local industry infrastructure.</p>\n\n<p>Minamisoma&nbsp;City offers&nbsp;infrastructure that supports R&amp;D of robotics and advanced technology, which contributed to this decision. Space Walker says it is an&nbsp;area that is actively involved in fostering new industries, including space-related industries. Another critical factor for the new location is its sea access to the town of Taiki in Hokkaido, which Space Walker is considering as a launch pad. Under these circumstances, Space Walker will establish a development and production base in Minamisoma to promote space transportation technology and industrial infrastructure, as well as to contribute to the formation of a new industrial base deeply rooted in the region.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-spacewalker-raijinproject.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-spacewalker-raijinproject.png;maxWidth=720\" /> </a></div>\n\n<p>Space Walker&rsquo;s RaiJin and FuJin&nbsp;launch missions.</p>\n</div>\n\n<p>Space Walker is developing a winged, reusable, suborbital spaceplane for launch in the 2030s. Currently, it is progressing the&nbsp;<a href=\"https://space-walker.co.jp/en/spaceplane/plane2028\" target=\"_blank\">RaiJin Mission</a>, a small suborbital satellite launch, in March 2028.&nbsp;In spaceplane development, key components such as methane engines, composite material tanks&nbsp;and systems technology play an important role. Space Walker aims to commercialize these component units to strengthen the Japanese space industry&rsquo;s competitiveness. Head office relocation and development and production base establishment addresses these additional objectives:</p>\n\n<ul>\n\t<li>Establishing individual factories for technical testing, development&nbsp;and manufacturing of spaceplanes and various components in collaboration with local enterprises in Minamisoma City, to compose a core base for production and development systems.</li>\n\t<li>Expand employment of highly skilled technicians (engineers, manufacturing technicians, test operation staff, etc.) in the region, as well as throughout Japan and overseas.</li>\n\t<li>Promote training of next-generation space engineers in cooperation with universities and research institutions in the region and beyond</li>\n\t<li>Provide learning opportunities and events using the space industry, and collaborate with local manufacturing industries, among other options, to provide opportunities to enter the space industry from various perspectives, thus increasing regional recognition.</li>\n</ul>\n\n<p>Currently, Minamisoma&nbsp;City is actively promoting the aerospace industry under the national project &ldquo;Fukushima Innovation Coast Initiative,&rdquo; and has established the Fukushima Robot Test Field (RTF)&nbsp;and the Space Industry Promotion Office. The relocation of Space Walker&rsquo;s flagship branch to Minamisoma means that the company will follow in those same steps.</p>\n\n<p>Space Walker is a startup certified by the Tokyo University of Science that conducts R&amp;D of winged reusable rockets (spaceplanes) to provide a sustainable means of space transportation. The company is also engaged in the development, manufacturing&nbsp;and sales of next-generation composite material tanks that contribute to decarbonization.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/space-walker-relocates-flagship-branch-for-next-phase-of-spaceplane-development"
      }
    ],
    "link": "https://www.compositesworld.com/news/space-walker-relocates-flagship-branch-for-next-phase-of-spaceplane-development"
  },
  {
    "published": "Wed, 28 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      28,
      16,
      0,
      0,
      2,
      148,
      0
    ],
    "title": "FACC optimizes inspection processes through augmented reality",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FACC optimizes inspection processes through augmented reality"
    },
    "summary": "Cooperation with students from the University of Applied Sciences Upper Austria leads to successful use of AR, increasing the efficiency of components testing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Cooperation with students from the University of Applied Sciences Upper Austria leads to successful use of AR, increasing the efficiency of components testing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-facc-ai-inspection.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"FACC and Upper Austria students pose with inspected components.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-facc-ai-inspection.jpg;maxWidth=720\" /> </a></div>\n\n<p>Left to right:&nbsp;Tomas Geri (FACC), Thomas Ecker (FACC), Lena D&ouml;berl (student FH Upper Austria), Paul Nasc (student FH Upper Austria) and Franz Obermair (FH Upper Austria). Source | FACC AG</p>\n</div>\n\n<p><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.facc.com&amp;esheet=52783801&amp;newsitemid=20220718005475&amp;lan=en-US&amp;anchor=FACC&amp;index=2&amp;md5=5bfa230c491305979c57e1234ec1a3f0\" rel=\"nofollow\" target=\"_blank\">FACC</a>&rsquo;s&nbsp;(Ried im Innkreis, Austria) quality engineering team recently implemented a&nbsp;digitally supported inspection solution using augmented reality (AR), which has now been successfully tested in cooperation with students of the Smart Production and Management&nbsp;degree program at the University of Applied Sciences Upper Austria. FACC says that the novel testing method is not specifically tied to any material, however, composite materials being the company&rsquo;s main focus, it is clear that the system could be used for these kinds of applications.</p>\n\n<p>&ldquo;With the newly developed digital inspection, we are establishing an additional efficient and precise inspection method that offers significant advantages compared to conventional inspection methods,&rdquo; says CEO Robert Machtlinger, emphasizing the added value of the research project for FACC.</p>\n\n<p>With AR, digital information is integrated into the user&rsquo;s environment in real time. This is done using a tablet on which the live image of a component is superimposed with the digital content generated by a software program. The AR software, which was specially developed for industrial applications, projects inspection instructions as digital 3D overlays directly onto the respective test object. &ldquo;By automatically navigating to each inspection point and the mandatory confirmation of conformity, we minimize the risk of errors and deviations,&rdquo; explains Thomas Ecker, program engineer and head of the student project at FACC. &ldquo;This enables us to detect errors at an early stage and ensures product quality.&rdquo;</p>\n\n<p>According to FACC, the AR-supported solution offers a much faster inspection, especially for large and complex components. The automated documentation of the test results and the structured process improve quality assurance. FACC also sees potential for other areas of application in production and also in maintenance and repair work. The successful company project together with the University of Applied Sciences Upper Austria illustrates the potential of practice-oriented research and shows how digitization can be further advanced in the aviation industry.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/facc-optimizes-inspection-processes-through-augmented-reality"
      }
    ],
    "link": "https://www.compositesworld.com/news/facc-optimizes-inspection-processes-through-augmented-reality"
  },
  {
    "published": "Wed, 28 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      28,
      15,
      0,
      0,
      2,
      148,
      0
    ],
    "title": "EuCIA publishes declaration of the European Circular Composites Alliance",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "EuCIA publishes declaration of the European Circular Composites Alliance"
    },
    "summary": "Voluntary initiative intends to set&nbsp;and achieve targets on the use of recovered and recycled composites, develop standards for circular product design and provide a forum for industry voices.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Voluntary initiative intends to set&nbsp;and achieve targets on the use of recovered and recycled composites, develop standards for circular product design and provide a forum for industry voices."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eucia-circularity-chart.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composites circularity model.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eucia-circularity-chart.png;maxWidth=720\" /> </a></div>\n\n<p>Composites can be reused both in closed-loop and open-loop processes. Source |&nbsp;EuCIA publication, &ldquo;Composites are circular materials.&rdquo;</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://eucia.eu/\" target=\"_blank\">European Composites Industry Association</a>&nbsp;(EuCIA, Brussel, Belgium) has published the declaration of the European Circular Composites Alliance (ECCA), a new voluntary initiative designed to advance the circularity of composite materials and fully exploit the potential of recycled composites. Stakeholders across the value chain in Europe are now being invited to sign the declaration, speak with one voice&nbsp;and drive collective action to realize a circular economy for composite materials.</p>\n\n<p>Preparations for the official launch of the ECCA are ongoing, and the kick-off meeting is expected to take place in Q4 2025.</p>\n\n<p>The ECCA was launched by EuCIA, in partnership with <a href=\"https://www.compositesworld.com/suppliers/jec-composites\" target=\"_blank\">JEC</a> (Paris, France) <a href=\"https://www.compositesworld.com/news/eucia-jec-group-launch-european-circular-composites-alliance\" target=\"_blank\">during JEC World 2025</a> in Paris. Industry response has been overwhelmingly positive, and the letter of intent was signed by more than 100 organizations.</p>\n\n<p>The published declaration of the alliance presents the core objectives of the ECCA and sets out deliverables focused on five areas:</p>\n\n<ul>\n\t<li><em>Design for circularity and recycling</em>:&nbsp;Develop or revise guidelines for composite products</li>\n\t<li><em>Collection and sorting</em>: Target improved composites waste collection and zero landfilling of composites waste</li>\n\t<li><em>Recycled content</em>: Increase the uptake of recycled composites in new products</li>\n\t<li><em>Recycling status, R&amp;D and investment needs</em>: Identify untapped potential and guide investment planning;</li>\n\t<li><em>Monitoring</em>: Set up a voluntary system to monitor volumes of recycled composites used in European products.</li>\n</ul>\n\n<p>The declaration also outlines the structure and governance of the alliance and its code of ethics and conduct.</p>\n\n<p>&ldquo;Achieving the full circularity of composite materials will require the collaboration of all stakeholders,&rdquo; states EuCIA&rsquo;s president, Professor Roberto Frassine. &ldquo;ECCA members will commit to this goal, working together to fully establish the circular economy for composites by implementing strategies for greater reuse, repair, repurposing and recycling, and enhancing the uptake of recycled composites in new products. Composite materials play a key role in enabling sustainable technologies across countless applications and we are committed to building circular and competitive value chains in Europe to support this.&rdquo;</p>\n\n<p>To read the declaration and join the alliance <a href=\"https://www.eucia.eu/ecca\" target=\"_blank\">visit this link</a>. There is no membership fee.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/eucia-publishes-declaration-of-the-european-circular-composites-alliance"
      }
    ],
    "link": "https://www.compositesworld.com/news/eucia-publishes-declaration-of-the-european-circular-composites-alliance"
  },
  {
    "published": "Wed, 28 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      28,
      14,
      0,
      0,
      2,
      148,
      0
    ],
    "title": "The French Oil Mill Machinery Co. celebrates 125 years",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "The French Oil Mill Machinery Co. celebrates 125 years"
    },
    "summary": "To this day, the hydraulic press and processing equipment manufacturer remains under family ownership, its legacy steeped in continuous innovation and global impact.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "To this day, the hydraulic press and processing equipment manufacturer remains under family ownership, its legacy steeped in continuous innovation and global impact."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-frenchoilmill-125years-1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Tayte French Lutz looks at a painting of past chairmen.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-frenchoilmill-125years-1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) |&nbsp;French Oil Mill Machinery Co.</p>\n</div>\n\n<p>The <a href=\"https://www.compositesworld.com/suppliers/french-oil-mill-machinery\" target=\"_blank\">French Oil Mill Machinery Co.</a> (Piqua, Ohio, U.S.)&nbsp;has marked its 125<sup>th</sup> anniversary, celebrating a&nbsp;rare legacy of continuous family ownership and manufacturing innovation. Founded in 1900 by Alfred Willard French, Sr., the company has grown from an engineering endeavor into a global manufacturer of custom hydraulic presses and processing equipment used across the composite, laminate, oilseed, plastic&nbsp;and rubber industries.</p>\n\n<p>To celebrate the occasion, the company hosted a private open house on May 21, at its Piqua, Ohio, headquarters and manufacturing facility, where operations have continued for more than a century. Invited guests included company leadership, employees and their families, shareholders&nbsp;and special partners who gathered to honor the company&rsquo;s rich history and ongoing commitment to innovation and global impact.</p>\n\n<p>The event featured a reception, self-guided tours of the manufacturing operations, and a debut of the company&rsquo;s history museum &mdash; a permanent exhibit of artifacts, photographs&nbsp;and machinery that helped shape the global oilseed and rubber industries. In addition, guests were able to view a recently commissioned portrait honoring the late chairman and CEO, Daniel P. French, who passed away in 2023 after more than 50&nbsp;years of service and leadership.</p>\n\n<p>&ldquo;Less than one percent of businesses founded in 1900 are still operating today, and fewer than 3% of family businesses reach a fourth generation of leadership,&rdquo; says&nbsp;Tayte French Lutz, chairman of the board and CEO. &ldquo;That perspective makes this milestone especially meaningful for our family, our employees, our shareholders and the Piqua community that has supported us for 125 years.&rdquo;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-frenchoilmill-125years-2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-frenchoilmill-125years-2.jpg;maxWidth=720\" /> </a></div>\n\n<p>Company leadership, employees and their families, shareholders&nbsp;and special partners attended the company&rsquo;s anniversary open house.</p>\n</div>\n\n<p>Founded on the principles of progressive thinking, inspired creativity and a strong work ethic, French is true to its mission:&nbsp;&ldquo;We make machines to make people&rsquo;s lives better.&rdquo;&nbsp;The company has supported customers in more than 80 countries across diverse industries, including aerospace, defense, food, medical, sporting goods, sustainable energy and more.</p>\n\n<p>Still headquartered in Piqua, the company continues to drive innovation with the same dedication to quality and craftsmanship established at its founding. Over the decades, the company has been awarded numerous patents, contributed to wartime efforts&nbsp;and received prestigious honors, including the President&rsquo;s &ldquo;E&rdquo; and &ldquo;E&rdquo; Star Awards for Exports.</p>\n\n<p>The 125<sup>th</sup> Anniversary Open House was a celebration not only of French&rsquo;s history, continuous innovation&nbsp;and leadership, but of the employees, global customers and community who have helped write its story.</p>\n\n<p>&ldquo;Our legacy is written in steel, precision&nbsp;and perseverance,&rdquo; adds Lutz. &ldquo;But our greatest legacy is not behind us, it lies in the future we continue to shape.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/the-french-oil-mill-machinery-co-celebrates-125-years"
      }
    ],
    "link": "https://www.compositesworld.com/news/the-french-oil-mill-machinery-co-celebrates-125-years"
  },
  {
    "published": "Tue, 27 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      27,
      17,
      0,
      0,
      1,
      147,
      0
    ],
    "title": "Tech-Fab Europe publishes LCA study on glass fiber fabrics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Tech-Fab Europe publishes LCA study on glass fiber fabrics"
    },
    "summary": "The association&rsquo;s study reveals the&nbsp;benefits of strengthening European supply chain for glass fiber fabrics to help decarbonize in line with EU net-zero targets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The association&rsquo;s study reveals the&nbsp;benefits of strengthening European supply chain for glass fiber fabrics to help decarbonize in line with EU net-zero targets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-techfab-fiberglass-lca.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"LCA report cover.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-techfab-fiberglass-lca.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Tech-Fab Europe</p>\n</div>\n\n<p><a href=\"https://tech-fab-europe.eu/\" target=\"_blank\">Tech-Fab Europe</a>&nbsp;(Frankfurt, Germany), the association for European technical textiles producers and a&nbsp;member of EuCIA (Brussels, Belgium), has published a life cycle assessment (LCA) study on glass fiber fabrics. This publication clearly highlights the environmental benefits of building a strong European supply chain for these products, citing that a robust glass fiber supply chain is&nbsp;essential to enable European manufacturers to create sustainable composites solutions for numerous markets.</p>\n\n<p>The new report, &ldquo;Life cycle assessment of glass fibre fabrics,&rdquo; was produced as part of a Tech-Fab Europe project to develop association-level LCAs of key technical textiles products. The cradle-to-gate analysis was performed by PwC. Tech-Fab&nbsp;Europe&rsquo;s members represent approximately 95% of the European production of glass fiber fabrics.</p>\n\n<p>The study revealed a few key findings:</p>\n\n<ul>\n\t<li>From raw material extraction to the factory gate, producing 1 kilogram of glass fiber&nbsp;fabric in Europe generates, on average, greenhouse gas emissions of 2.21 kilograms of CO<sub>2</sub>eq and a primary energy demand of 39 megajoules.</li>\n\t<li>The majority of the impact is driven by the production of glass fiber, which accounts for 89% of the carbon footprint of the final product.</li>\n\t<li>European composites manufacturers can significantly reduce their environmental impacts by using glass fiber&nbsp;fabrics produced in Europe.</li>\n</ul>\n\n<p>&ldquo;From wind energy, construction&nbsp;and automotive, to sports and leisure&nbsp;and more, composite products based on glass fiber&nbsp;fabrics are enabling numerous industries to decarbonize in line with EU net-zero targets,&rdquo; explains&nbsp;R&eacute;mi Bagard, glass fiber&nbsp;fabrics expert and member of the Tech-Fab Europe Sustainability Working Group. &ldquo;This LCA further demonstrates the sustainability of Europe&rsquo;s glass fabric industry and reinforces the need to support its continued growth and competitiveness. Our customers can also feed this data into their own LCA calculations as they strive to design more sustainable composite products.&rdquo;</p>\n\n<p>The report can be requested by emailing&nbsp;<a href=\"https://communication@tech-fab-europe.eu\" target=\"_blank\">communication@tech-fab-europe.eu</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/tech-fab-europe-publishes-lca-study-on-glass-fiber-fabrics"
      }
    ],
    "link": "https://www.compositesworld.com/news/tech-fab-europe-publishes-lca-study-on-glass-fiber-fabrics"
  },
  {
    "published": "Tue, 27 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      27,
      16,
      0,
      0,
      1,
      147,
      0
    ],
    "title": "HRC highlights automotive material innovation, scalable manufacturing and sustainable systems",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "HRC highlights automotive material innovation, scalable manufacturing and sustainable systems"
    },
    "summary": "The composites company is meeting the transition to electrification and vehicle lightweighting&nbsp;via hybrid monocoques, use of thermoplastic composites and carbon fiber and recycling.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The composites company is meeting the transition to electrification and vehicle lightweighting&nbsp;via hybrid monocoques, use of thermoplastic composites and carbon fiber and recycling."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hybrid monocoque. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-hrc-hybrid-monocoque.png;maxWidth=720\" /> </div>\n\n<p>Hybrid monocoque. Source (All Images) | HRC</p>\n</div>\n\n<p>As global automakers accelerate efforts toward electrification and vehicle lightweighting, carbon fiber composites are increasingly being adopted in structural and aesthetic automotive applications.&nbsp;<a href=\"https://www.compositesworld.com/suppliers/hrc\" target=\"_blank\">HRC</a>&nbsp;(Jiangshu, China) says it is meeting this demand&nbsp;through a combination of advanced materials development (including the use of thermoplastic composites), efficient manufacturing technologies&nbsp;and closed-loop recycling systems.</p>\n\n<p>HRC&rsquo;s operations span across&nbsp;five countries.&nbsp;Vertically integrated capabilities &mdash;&nbsp;R&amp;D, engineering and design, serial production, and recycling and reuse &mdash; supports OEMs across the entire composites life cycle, enabling scalable and sustainable solutions for next-generation mobility platforms.</p>\n\n<h3><strong>Hybrid carbon fiber monocoque for structural lightweighting</strong></h3>\n\n<p>Exclusively developed and manufactured by HRC, the hybrid monocoque is one example of the company&rsquo;s automotive composites proficiency. It&nbsp;achieves a 30% weight reduction compared to conventional steel-aluminum body structures, with a reported lightweight coefficient of 0.95. To meet structural performance targets, the monocoque incorporates more than&nbsp;a dozen advanced joining technologies, including the use of PMI inserts at critical zones to ensure enhanced handling stability and crash safety performance under extreme working conditions, balancing the triple technical goals of lightweight, safety and driving pleasure.</p>\n\n<p>According to HRC, as the largest carbon fiber monocoque in series production, the hybrid structure creates a new precedent for the use of carbon fiber as a primary structural material in high-end mass production models in automotive.&nbsp;</p>\n\n<h3><strong>Thermoplastic composite parts for high-volume applications</strong></h3>\n\n<p>Thermoplastic composite (TPC) processing is a method with significant potential for mass production HRC reports, offering advantages in efficiency, cost-effectiveness&nbsp;and sustainability. Ideal for mass-producing large structural components like door panels and power battery pack shells, this process features short molding cycle times, recyclability&nbsp;and optimal impact resistance.</p>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hrc-doormodule-min.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hrc-doormodule-min.png;maxWidth=720\" /> </a></div>\n\n<p>Thermoplastic composite (TPC) door module.</p>\n</div>\n\n<p>HRC&rsquo;s TPC door module exemplifies the application of this technology in mass-production programs. The component uses a combined compression and injection molding process, eliminating the need for secondary gluing operations typical of traditional composites fabrication.</p>\n\n<p>The process is fully automated, ensuring high levels of product consistency, dimensional stability and production efficiency. By integrating structural functionality and decorative surfaces into a single forming cycle, the solution supports reduced part count and assembly complexity.</p>\n\n<p>This approach not only improves throughput and repeatability but also aligns with circular economy objectives, as the materials can be reprocessed at end of life &mdash; supporting OEMs in meeting sustainability and lightweighting targets simultaneously.</p>\n\n<h3>Surface-grade performance components</h3>\n\n<p>Beyond structural components, HRC is exploring design-driven uses of carbon fiber. In applications where structural performance meets aesthetic demands, HRC develops carbon fiber components that combine mechanical function with distinctive visual appeal.</p>\n\n<p>The full carbon fiber wheel hub, for example, reduces mass by more than&nbsp;40% compared to conventional metal wheels, effectively lowering the load on the vehicle&rsquo;s suspension system and improving both handling and acceleration.</p>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-hrc-wheels.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Carbon fiber wheel hub.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-hrc-wheels.png;maxWidth=720\" /> </a></div>\n\n<p>Carbon fiber wheel hub.</p>\n</div>\n\n<p>The rear bumper lower trim assembly, fully designed with aerodynamic principles, combines track-level performance with a distinctive visual identity. The component features sharp, tall&nbsp;and streamlined diffuser fins on the left and right lower bumper fins, paired with distinctive carbon fabric textures makes the product stands out dynamically or when stationary.</p>\n\n<p>The aerodynamic winglet structures are defined by thin, towering cross-sections and sharp contours, engineered to contribute both to aerodynamic efficiency and styling. The exposed carbon fiber weave pattern delivers high-performance character of the part, giving it a strong visual impact.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hrc-reardiffuser.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hrc-reardiffuser.png;maxWidth=720\" /> </a></div>\n\n<p>Rear bumper lower trim assembly.</p>\n</div>\n\n<h3><strong>Recycled composites, closed-loop systems</strong></h3>\n\n<p>HRC also emphasizes its implementation of a&nbsp;closed-loop system covering development, industrial application, recycling&nbsp;and reuse of composite materials. It uses its patented&nbsp;microwave pyrolysis technology to transform carbon fiber wasted into&nbsp;recycled carbon fiber (rCF). Through advanced thermoplastic processes, this material is then turned into cost-effective and eco-friendly automotive components (<a href=\"https://www.compositesworld.com/news/hrcs-holistic-closed-loop-system-supports-composites-recycling\" target=\"_blank\">learn more about the closed-loop system here</a>).</p>\n\n<p>The final rCF&nbsp;thermoplastic automotive parts demonstrates HRC&rsquo;s &ldquo;waste-to-product&rdquo;&nbsp;green manufacturing business model and proves the compatibility of high-end composites with circular economy principles.</p>\n\n<p>As the automotive industry navigates rapid transitions in electrification, sustainability and smart manufacturing, lightweighting remains central to improving vehicle range, performance&nbsp;and safety. HRC continues to invest in material innovation, scalable manufacturing&nbsp;and sustainable systems &mdash;enabling OEMs to meet evolving performance requirements without compromise.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hrc-highlights-automotive-material-innovation-scalable-manufacturing-and-sustainable-systems"
      }
    ],
    "link": "https://www.compositesworld.com/news/hrc-highlights-automotive-material-innovation-scalable-manufacturing-and-sustainable-systems"
  },
  {
    "published": "Tue, 27 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      27,
      14,
      0,
      0,
      1,
      147,
      0
    ],
    "title": "Damen, CEAD explore composite 3D printing potential via HDPE Workboat project",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Damen, CEAD explore composite 3D printing potential via HDPE Workboat project"
    },
    "summary": "Dutch innovators collaborate to investigate large-format 3D printing for functional shipbuilding at the recently opened Maritime Application Center.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Dutch innovators collaborate to investigate large-format 3D printing for functional shipbuilding at the recently opened Maritime Application Center."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-damen-hdpe-workboat-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-damen-hdpe-workboat-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>HDPE Workboat. Source | CEAD, Damen Shipyards Group</p>\n</div>\n\n<p>Damen Compact Crafts (DCCr, Gorinchem, Netherlands), part of the <a href=\"https://www.damen.com/\" target=\"_blank\">Damen Shipyards Group</a>, and <a href=\"https://www.compositesworld.com/suppliers/cead-bv\" target=\"_blank\">CEAD B.V.</a> (Delft, Netherlands)&nbsp;are launching a collaboration to develop a 3D printed HDPE Workboat (HWB) using CEAD&rsquo;s HDPro fiber-reinforced composite material. The project will take place at CEAD&rsquo;s <a href=\"https://www.compositesworld.com/news/cead-launches-the-maritime-application-center-dedicated-to-industrial-3d-printing-boat-hulls\" target=\"_blank\">Maritime Application Center (MAC)</a> in Delft, which was &ldquo;founded to accelerate exactly these kinds of innovations.&rdquo; Through this initiative, the two Dutch companies are joining forces to explore the potential of large-format additive manufacturing (LFAM) for the maritime industry.</p>\n\n<p>With this project, Damen aims to investigate how 3D printing technology can contribute to the faster, more sustainable&nbsp;and more flexible production of functional vessels. The HWB is being designed as a versatile vessel, suitable for a wide range of operations, including inspection, support, patrol&nbsp;and logistical tasks. By 3D printing the hull of the boat, not only is more design freedom achieved, but it also opens the possibility of integrating recycled and renewable materials.</p>\n\n<p>For this project, CEAD contributes its expertise in large-format 3D printing and is developing print technologies capable of processing optimal HDPE blends. The project serves as a prime example of how technological innovation and market knowledge can reinforce one another.</p>\n\n<p>&ldquo;Innovation and standardization are part of our DNA at Damen,&rdquo; notes Nick Pruissen, managing director at DCCr. &ldquo;3D printing allows us to respond more quickly and flexibly to what our customers really need.&rdquo; The success of the 3D printed HWB could open the door to broader applications of additive manufacturing in shipbuilding.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/damen-cead-explore-composite-3d-printing-potential-via-hdpe-workboat-project"
      }
    ],
    "link": "https://www.compositesworld.com/news/damen-cead-explore-composite-3d-printing-potential-via-hdpe-workboat-project"
  },
  {
    "published": "Mon, 26 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      26,
      16,
      0,
      0,
      0,
      146,
      0
    ],
    "title": "WPS OCMC extend service life of petrochemical burner lances",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "WPS OCMC extend service life of petrochemical burner lances"
    },
    "summary": "Monolithic ceramics combined with oxide ceramic matrix composites (OCMC) overcome challenges with traditional metal components used in petrochemical crackers, achieving three times longer operational lifespan.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Monolithic ceramics combined with oxide ceramic matrix composites (OCMC) overcome challenges with traditional metal components used in petrochemical crackers, achieving three times longer operational lifespan."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-burnerlances-h2-walterpritzkow-1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"OCMC burner lances.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-burnerlances-h2-walterpritzkow-1.png;maxWidth=720\" /> </a></div>\n\n<p>Traditional metallic burner lances are severely damaged after 6 months of operation.&nbsp;Source (All Images) | Walter E.C. Pritzkow Spezialkeramik (WPS)</p>\n</div>\n\n<p><a href=\"https://www.keramikblech.com/en/company/\" target=\"_blank\">Walter E.C. Pritzkow Spezialkeramik</a> (WPS, Filderstadt, Germany), a company focused&nbsp;on the develop&shy;ment and design of light&shy;weight struc&shy;tures made of ceramics, has developed a solution in&nbsp;collaboration with <a href=\"https://www.compositesworld.com/suppliers/basf-se\" target=\"_blank\">BASF</a> (Ludwigshafen, Germany) consisting of tubes that combine monolithic ceramics with an oxide ceramic matrix composite&nbsp;(OCMC), creating hybrid burner lances that are advancing operations at BASF facilities worldwide.</p>\n\n<p>For decades, petrochemical crackers have faced continuous challenges with metallic burner lances, particularly as hydrogen is increasingly incorporated into processes. The catalytic properties of nickel-based alloys accelerate coking, a damaging carbon buildup that obstructs critical flow passages and leads to overheating, corrosion and ultimately, component failure during removal.</p>\n\n<p>Unlike metal components that require replacement approximately every 6 months, WPS&rsquo; ceramic hybrid burner lances have been operating continuously for more than&nbsp;18 months without issues, with projected service life extending to 10-12 years based on similar operating conditions in other applications.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-burnerlances-h2-walterpritzkow-2.png;maxWidth=385\" /></div>\n\n<p>Close-up of WPS&rsquo; CMC burner lances after 18 months of continuous operation.</p>\n</div>\n\n<p>According to the company, what makes this solution effective is the application of OCMC&nbsp;where traditional monolithic ceramics would fail. While monolithic ceramics offer the needed chemical inertness, they lack the crack-stopping mechanisms and thermal shock resistance required in cracker environments. Monolithic components would crack during initial heating cycles due to thermal stresses. The combination of the monolithic ceramic with the fiber-reinforced structure of OCMC&nbsp;provides the necessary damage tolerance and thermal shock resistance while maintaining the chemical inertness that makes ceramics ideal for these harsh environments.</p>\n\n<p>This approach delivers multiple benefits to chemical plant operators. First, OCMC components eliminate the catalytic reactions that damage metal parts during operation. They also withstand the high temperatures that occur during decoking processes, which reduces the risk of failure. Additionally, the system incorporates commercially available metal connections that make the ceramic burner lances integrate seamlessly with current systems as a retrofitable solution.</p>\n\n<p>WPS&rsquo;&nbsp;exclusive license for this patented technology by BASF positions the company&nbsp;as the sole provider of this solution. WPS continues to work with BASF to optimize the metal-ceramic connection to simplify the installation process for plant operators.</p>\n\n<p>Walter E.C. Pritzkow Spezialkeramik has more than&nbsp;30 years of experience with OCMC for extreme environments. The company is seeing interest in the technology spreading throughout the petrochemical industry as more companies recognize the potential benefits for their global operations to increase efficiency, reduce maintenance schedules&nbsp;and enable the transition to greener, more sustainable operations.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/wps-ocmc-extend-service-life-of-petrochemical-burner-lances"
      }
    ],
    "link": "https://www.compositesworld.com/news/wps-ocmc-extend-service-life-of-petrochemical-burner-lances"
  },
  {
    "published": "Mon, 26 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      26,
      16,
      0,
      0,
      0,
      146,
      0
    ],
    "title": "Boeing announces historic widebody aircraft order from Qatar Airways",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Boeing announces historic widebody aircraft order from Qatar Airways"
    },
    "summary": "Agreement for 210 airplanes sets a record for Boeing, in addition to it being the Middle Eastern airliner&rsquo;s largest order of 787 Dreamliners.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Agreement for 210 airplanes sets a record for Boeing, in addition to it being the Middle Eastern airliner&rsquo;s largest order of 787 Dreamliners."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-boeing-qtr-widebodies-in-flight.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Widebody aircraft in flight.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-boeing-qtr-widebodies-in-flight.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Airbus</p>\n</div>\n\n<p>Qatar Airways (Doha, Qatar) will be purchasing up to 210 widebody jets from Boeing (Arlington, Va., U.S.), which sets new records as the largest widebody order for Boeing, including the largest order for 787 <em>Dreamliners</em> and Qatar Airways largest-ever order. This purchase, which also includes additional orders for Boeing&rsquo;s new 777-9, will support approximately 400,000 jobs in the U.S. The order includes:</p>\n\n<ul>\n\t<li>130 787 <em>Dreamliners</em>,<strong>&nbsp;</strong>Boeing&rsquo;s&nbsp;long-range, ultra-efficient widebody airplane family. Ten orders were previously booked as unidentified.</li>\n\t<li>30 777-9s, Boeing&rsquo;s twin-engine airplane that is designed to set new standards in efficiency.</li>\n\t<li>Options for an additional&nbsp;50 787&nbsp;and&nbsp;777X&nbsp;airplanes.</li>\n</ul>\n\n<p>&ldquo;After two consecutive years of record-breaking commercial performance and with this historic Boeing aircraft order we&rsquo;re not simply chasing scale, we&rsquo;re building strength that will allow us to continue to deliver our products and customer experiences,&rdquo; says Qatar Airways Group CEO&nbsp;Engr.&nbsp;Badr Mohammed Al-Meer.</p>\n\n<p>Qatar Airways currently operates more than 150 Boeing airplanes, including 777 and 787 passenger jets and 777 Freighters. With this purchase, Qatar Airways will become the largest 787 <em>Dreamliner</em> operator in the&nbsp;Middle East.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/boeing-announces-historic-widebody-aircraft-order-from-qatar-airways"
      }
    ],
    "link": "https://www.compositesworld.com/news/boeing-announces-historic-widebody-aircraft-order-from-qatar-airways"
  }
]