[
  {
    "published": "Tue, 3 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      3,
      16,
      0,
      0,
      1,
      154,
      0
    ],
    "title": "The AMRC announces U.K. open-access TPC tape development",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "The AMRC announces U.K. open-access TPC tape development"
    },
    "summary": "Dedicated research platform, available to businesses and researchers at the AMRC&rsquo;s&nbsp;Factory of the Future facility, features Cygnet Texkimp&rsquo;s hybrid line and tape slitter on a pilot scale.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Dedicated research platform, available to businesses and researchers at the AMRC&rsquo;s&nbsp;Factory of the Future facility, features Cygnet Texkimp&rsquo;s hybrid line and tape slitter on a pilot scale."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-AMRC-Cygnet-openaccess-line.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-AMRC-Cygnet-openaccess-line.jpg;maxWidth=720\" /> </a></div>\n\n<p>The AMRC evaluates thermoplastic tape processing capability at Cygnet Texkimp. Source (All Images) | Cygnet Texkimp</p>\n</div>\n\n<p>The <a href=\"https://www.amrc.co.uk/\" target=\"_blank\">University of Sheffield Advanced Manufacturing Research Centre</a> (AMRC, Sheffield, U.K.) has announced what is said to be the U.K.&rsquo;s first open-access hybrid fiber-reinforced thermoplastic tape development capability to accelerate innovation in sustainable composites technologies.</p>\n\n<p>The dedicated research platform will feature a dual-mode thermoplastic processing line, designed and built by fiber&nbsp;handling and converting technology specialist <a href=\"https://www.compositesworld.com/suppliers/cygnet-texkimp\" target=\"_blank\">Cygnet Texkimp</a> (Northwich, U.K.) to provide direct melt and slurry-based processing capability for a wide range of polymers and applications.</p>\n\n<p>The dual-mode line enables industrial-grade polymers such as polypropylene, nylons and polyetheretherketone (PEEK)&nbsp;to be processed from pellets using Cygnet&rsquo;s&nbsp;direct melt impregnation technology or powdered polymers to be processed using water-based slurries. The line is modular in design and achieves&nbsp;rapid conversion between these two operating modes.</p>\n\n<p>The line also incorporates Cygnet Texkimp&rsquo;s Flatline creel and fiber&nbsp;spreading technologies to maximize the range of fibers that can be processed, and to facilitate the development of novel composite tapes for downstream processing into composite components for industry. Specifically, the Flatline creel and fiber&nbsp;spreading system enables&nbsp;the processing of carbon, glass, recycled and natural fibers. It can also be configured to produce composite tapes in a variety of widths from 45-180 millimeters&nbsp;and with a specific fiber and polymer weight per meter.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-CygnetTexkimp-hybrid-line.JPG\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hybrid TPC line rendering.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-CygnetTexkimp-hybrid-line.JPG;maxWidth=720\" /> </a></div>\n\n<p>AMRC open-access thermoplastic development capability features Cygnet Texkimp hybrid line.</p>\n</div>\n\n<p>&ldquo;This open-access capability will provide material and tape suppliers, as well as downstream composites manufacturers the opportunity to develop novel tapes for their end-users,&rdquo; explains Dr. Gary Foster, senior technical fellow &ndash;thermoplastic composites at the AMRC. &ldquo;Leveraging the AMRC&rsquo;s expertise in advanced manufacturing and materials processing, this initiative will facilitate more in-depth research into sustainable composites and provide a better understanding of key processing parameters.&rdquo;</p>\n\n<blockquote>\n<p><a href=\"https://www.compositesworld.com/topics/thermoplastics\" target=\"_blank\">Thermoplastic composites</a> offer several advantages, including recyclability, high performance, adaptability and efficiency.&nbsp;</p>\n</blockquote>\n\n<p>The hybrid line will be installed at the AMRC&rsquo;s Factory of the Future facility where businesses and researchers will be able to develop new processing methodologies for novel thermoplastic composite intermediate tapes on a small-industrial scale with support from the AMRC.</p>\n\n<p>&ldquo;The AMRC&rsquo;s thermoplastics research capability will provide a world-class test bed for businesses to explore the opportunities offered by these novel composites and adds considerable capacity and expertise to the U.K.&rsquo;s composites manufacturing capability,&rdquo; adds Andy Whitham, director of process development at Cygnet Texkimp. &ldquo;Our hybrid line provides extensive control of the processing parameters for thermoplastic materials development. It will allow organizations to fully develop new processes and products on a small-industrial scale and prove out their concepts before investing in machinery.&rdquo;</p>\n\n<p>The line and tape slitter will be installed toward&nbsp;the end of 2025 and will operate from early 2026. Industry and supply chain organizations interested in accessing the AMRC&rsquo;s thermoplastic development capability can get in touch <a href=\"https://www.amrc.co.uk/pages/talk-to-us\" target=\"_blank\">here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/the-amrc-announces-uk-open-access-tpc-tape-development"
      }
    ],
    "link": "https://www.compositesworld.com/news/the-amrc-announces-uk-open-access-tpc-tape-development"
  },
  {
    "published": "Tue, 3 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      3,
      15,
      0,
      0,
      1,
      154,
      0
    ],
    "title": "Rocket Lab continues building access to space with latest launch vehicle missions",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Rocket Lab continues building access to space with latest launch vehicle missions"
    },
    "summary": "Successful execution of multiple customer missions&nbsp;with reusable composite Neutron and Electron rockets as well as new partnerships highlight Rocket Lab&rsquo;s expertise.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Successful execution of multiple customer missions&nbsp;with reusable composite Neutron and Electron rockets as well as new partnerships highlight Rocket Lab&rsquo;s expertise."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-rocketlabs-65th-launch.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-rocketlabs-65th-launch.jpg;maxWidth=720\" /> </a></div>\n\n<p>Lift-off for <em>Electron</em>&rsquo;s 65<sup>th</sup> launch.&nbsp;Source (All Images) | Rocket Lab</p>\n</div>\n\n<p>Throughout May 2025, <a href=\"https://www.rocketlabusa.com/\" target=\"_blank\">Rocket Lab USA&nbsp;Inc.</a>&nbsp;(Long Beach, Calif., U.S.) has made numerous strides in scheduled rocket launches for customers and&nbsp;building partnerships.&nbsp;The end-to-end space company delivers launch services, spacecraft, satellite components and on-orbit management. Rocket Lab&rsquo;s reusable launch vehicles &mdash;&nbsp;<em>Neutron</em> and <em>Electron</em> &mdash;&nbsp;as well as satellite bus structural panels and assemblies, primary structures, solar panel substrates and tanks are supported by flight-proven carbon fiber composites.</p>\n\n<p><strong>U.S. Air Force Research Laborary (AFRL)</strong>. On <a href=\"https://rocketlabcorp.com/updates/rocket-lab-partners-with-u-s-air-force-for-neutron-launch-for-re-entry-mission/\" target=\"_blank\">May 8</a>, Rocket Labs announced the launch of&nbsp;<em>Neutron</em> for the U.S. AFRL for a Rocket Cargo mission that is scheduled for a return-to-Earth launch no earlier than 2026.</p>\n\n<p>The launch contract will see <em>Neutron</em> execute a Rocket Cargo survivability experiment under the AFRL Rocket Experimentation for Global Agile Logistics (REGAL) solicitation, an effort by the Department of Defense to create a rocket-based point-to-point transportation system to quickly and rapidly deliver cargo around the world with commercial launch providers. AFRL&rsquo;s experiment will be launched by <em>Neutron</em> and re-enter Earth&rsquo;s atmosphere, in a demonstration of re-entry capability for future REGAL missions.</p>\n\n<p><strong>NASA</strong>. The company was selected by NASA (Washington, D.C., U.S.) on <a href=\"https://rocketlabcorp.com/updates/rocket-lab-to-launch-nasa-astrophysics-science-mission-on-electron-to-study-galaxy-evolution/\" target=\"_blank\">May 14</a> to&nbsp;launch its Aspera mission, an astrophysics science mission designed to study the formation and evolution of galaxies and provide new insights into how the universe works.</p>\n\n<p>Rocket Lab will launch the Aspera spacecraft on <em>Electron</em> from Rocket Lab Launch Complex 1 no earlier than Q1 2026. Through the use of a telescope to study ultraviolet light, Aspera will examine hot gas in the space between galaxies, called the intergalactic medium, that is thought to contribute to the birth of stars and planets. Aspera will be the first NASA astrophysics mission to gather and map these ultraviolet light signatures.</p>\n\n<p>Aspera joins the list of NASA science missions awarded to Rocket Lab including the CAPSTONE mission launched to the Moon by Electron and operated by Rocket Lab&rsquo;s <em>Lunar Photon</em> spacecraft; NASA&rsquo;s hurricane monitoring TROPICS mission launched across two <em>Electron</em> launches in May 2023; the agency&rsquo;s PREFIRE climate change-focused mission studying melting ice caps in the Antarctic; and other small satellite science and technology missions launched on <em>Electron</em> since 2018.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-rocketlabs-composites-capabilities.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-rocketlabs-composites-capabilities.png;maxWidth=720\" /> </a></div>\n\n<p>Rocket Lab composites capabilities.</p>\n</div>\n\n<p><strong>Institute for Q-shu Pioneers of Space Inc. (iQPS)</strong>. On May 17, Rocket Labs launched its third mission with Japanese customer iQPS&nbsp;(Fukoaka). &ldquo;The Sea God Sees&rdquo;&nbsp;mission successfully launched on <em>Electron</em> from Rocket Lab Launch Complex 1 in Mahia, New Zealand, carrying&nbsp;iQPS&rsquo; QPS-SAR-10, a synthetic aperture radar (SAR) Earth-imaging satellite, to a 575-kilometer&nbsp;low Earth orbit, where it was deployed as part of iQPS&rsquo; growing constellation. The mission was launched just weeks&rsquo; after&nbsp;Rocket Lab&rsquo;s previous launch for iQPS was deployed on March 15.</p>\n\n<p>This mission in particular was&nbsp;the third overall launch for iQPS and the second in a multilaunch contract to launch eight missions for the company in 2025 and 2026. Four more launches are scheduled for launch in 2025, with the remaining two scheduled for 2026. Rocket Lab&rsquo;s next mission for iQPS is scheduled to launch from no earlier than June 2025.</p>\n\n<p><strong>BlackSky</strong>. On <a href=\"https://rocketlabcorp.com/updates/rocket-lab-schedules-next-launch-in-series-of-multiple-missions-for-blacksky/\" target=\"_blank\">May 22</a>, Rocket Lab reported that its next scheduled mission for real-time space-based intelligence company BlackSky (Herndon, Va., U.S.) would cement&nbsp;<em>Electron </em>as the most prolific launcher for BlackSky&rsquo;s constellation to date. The mission, &ldquo;Full Stream Ahead,&rdquo; is the second in a series of four <em>Electron</em> launches booked by BlackSky to deploy its Gen-3 satellites to orbit this year, and the 10th&nbsp;overall launch for the company.</p>\n\n<p>The launch successfully took place on <a href=\"https://rocketlabcorp.com/updates/rocket-lab-successfully-launches-10th-electron/\" target=\"_blank\">June 3</a> from&nbsp;Mahia, New Zealand, deploying the&nbsp;Gen-3 satellite to a 470-kilometer circular Earth orbit. It is the seventh&nbsp;<em>Electron</em> mission of 2025, its 65<sup>th</sup>&nbsp;launch overall&nbsp;and will bring the total number of satellites delivered to space by Rocket Lab to 226.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rocket-lab-continues-building-access-to-space-with-latest-launch-vehicle-missions"
      }
    ],
    "link": "https://www.compositesworld.com/news/rocket-lab-continues-building-access-to-space-with-latest-launch-vehicle-missions"
  },
  {
    "published": "Tue, 3 Jun 2025 08:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      3,
      12,
      0,
      0,
      1,
      154,
      0
    ],
    "title": "Japan certifies Proteus tidal turbine, now exporting power to national grid",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Japan certifies Proteus tidal turbine, now exporting power to national grid"
    },
    "summary": "Following installation in the Naru Strait, the&nbsp;composite-bladed, 1.1-megawatt turbine has met all national requirements for safety and performance, a milestone to further tidal generation capacity.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Following installation in the Naru Strait, the&nbsp;composite-bladed, 1.1-megawatt turbine has met all national requirements for safety and performance, a milestone to further tidal generation capacity."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-proteusmarine-ar1100.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-proteusmarine-ar1100.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Proteus Marine Renewable LinkedIn</p>\n</div>\n\n<p>Marine energy technology and offshore services provider&nbsp;<a href=\"https://proteusmr.com/\" target=\"_blank\">Proteus Marine&nbsp;Renewables</a>&nbsp;(Bristol, U.K.)&nbsp;has received certification from&nbsp;Japan&rsquo;s Ministry of Economy, Trade and Industry (METI), the national authority responsible for regulating energy infrastructure and technology, for the company&rsquo;s AR1100 1.1-megawatt tidal turbine. The certification confirms the system meets Japan&rsquo;s regulatory standards for power generation, marking another important step forward for tidal energy in the country. The turbine is now successfully exporting power to the national grid.</p>\n\n<p>This achievement follows a rigorous review and testing process by METI, verifying the AR1100&rsquo;s operational safety and reliability. Certification was granted after successful performance demonstrations under a range of tidal conditions, including safe shutdown procedures, grid compliance&nbsp;and emergency response capabilities.</p>\n\n<blockquote>\n<p><a href=\"https://www.compositesworld.com/news/proteus-marine-renewables-installs-japans-first-11-megawatt-tidal-turbine\" target=\"_blank\">Read more about the tidal turbine generator</a>.</p>\n</blockquote>\n\n<p>This milestone builds on the earlier success of the AR500 pilot project in 2021, where a 500-kilowatt&nbsp;device achieved 97% turbine availability in Japanese waters. Leveraging its modular design, Proteus upgraded the turbine with advanced pitch and yaw control systems and other key enhancements, boosting performance and efficiency to achieve a 1.1-megawatt&nbsp;rated capacity.</p>\n\n<p>As a Series 2 turbine, the AR1100 represents the next stage in Proteus&rsquo; roadmap for scaling tidal power and serves as the forerunner to the AR3000 &mdash; the company&rsquo;s most powerful turbine to date, scheduled for deployment in 2028.&nbsp;</p>\n\n<p>This deployment forms part of a long-standing collaboration between Proteus and Kyuden Mirai Energy Co.&nbsp;Inc. (KME) that is the representative company for this project, aimed at supporting Japan&rsquo;s renewable energy transition and demonstrating how tidal energy can become a reliable part of Japan&rsquo;s future energy mix.</p>\n\n<p>Following the success of this deployment, Proteus and KME are now exploring additional opportunities to expand tidal generation capacity in Japan.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/japan-certifies-proteus-tidal-turbine-now-exporting-power-to-national-grid"
      }
    ],
    "link": "https://www.compositesworld.com/news/japan-certifies-proteus-tidal-turbine-now-exporting-power-to-national-grid"
  },
  {
    "published": "Mon, 2 Jun 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      2,
      18,
      0,
      0,
      0,
      153,
      0
    ],
    "title": "SPE Thermoforming Division highlights construction equipment composite hood innovation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SPE Thermoforming Division highlights construction equipment composite hood innovation"
    },
    "summary": "Plastics Unlimited solved challenges with a customer&rsquo;s directional drill fiberglass hood, enabling a solution that maintains vibrant appearances and performance&nbsp;even under harsh environmental conditions.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Plastics Unlimited solved challenges with a customer&rsquo;s directional drill fiberglass hood, enabling a solution that maintains vibrant appearances and performance&nbsp;even under harsh environmental conditions."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-spe-plasticsunlimited-hood.jpeg\" target=\"_blank\"><img alt=\"Resulting orange hood.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-spe-plasticsunlimited-hood.jpeg;maxWidth=385\" /></a></div>\n\n<p>Source | Plastics Unlimited</p>\n</div>\n\n<p>The <a href=\"https://www.compositesworld.com/suppliers/spe-society-of-plastics-engineers\" target=\"_blank\">Society of Plastics Engineers</a>&nbsp;(SPE, Danbury, Conn., U.S.) Thermoforming Division highlights an entry from&nbsp;<a href=\"https://www.plasticsunlimited.com/\" target=\"_blank\">Plastics Unlimited</a> (Preston,&nbsp;Iowa, U.S.) for its&nbsp;biennial parts competition that improved the composite hood of a customer&rsquo;s horizontal directional drills, construction equipment that is used to&nbsp;install underground utilities like pipes and cables without disturbing the ground surface.&nbsp;</p>\n\n<p>The rear hood developed for the OEM&rsquo;s directional drills faced a major issue: the&nbsp;existing orange gelcoated fiberglass hoods, exposed constantly to UV rays, would fade over time &mdash; turning a dull, chalky white. The customer approached Plastics Unlimited for a solution, resulting in replacing the original gelcoated fiberglass with a co-extruded ABS with acrylic cap to maintain vibrant appearances and performance&nbsp;even under harsh environmental conditions.&nbsp;</p>\n\n<p>According to Plastics Unlimited, the new hood uses a process that bonds two materials into a&nbsp;single, high-performance structure. The outer layer is a 0.350-inch-thick, color-matched, co-extruded ABS with an acrylic cap, providing a Class A finish. This passes stringent accelerated weathering and corrosion tests, ensuring the orange color stays bright and fade-resistant. The structural backing, however,&nbsp;is still&nbsp;fiberglass, to ensure the delivery of high strength and to endure&nbsp;extreme temperatures &mdash; ideal for engine enclosures. Combined, the plastics and composites material systems offers durability, impact resistance and weight savings.</p>\n\n<p>The production part uses&nbsp;tooling consisting of a single-cavity, temperature-controlled aluminum mold, optimized for consistent quality and cycle time.</p>\n\n<p>Plastics Unlimited notes that no&nbsp;attachment points are visible from the Class A side, preserving a clean, professional appearance. Mounting brackets and screens are adhered to the B-side using structural adhesive. Moreover, assembly fixtures were designed and manufactured in-house to ensure tight customer tolerance requirements were met.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spe-thermoforming-division-highlights-construction-equipment-composite-hood-innovation"
      }
    ],
    "link": "https://www.compositesworld.com/news/spe-thermoforming-division-highlights-construction-equipment-composite-hood-innovation"
  },
  {
    "published": "Mon, 2 Jun 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      2,
      14,
      0,
      0,
      0,
      153,
      0
    ],
    "title": "AMSL Aero makes H2 testing milestones for hybrid Vertiia eVTOL",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AMSL Aero makes H2 testing milestones for hybrid Vertiia eVTOL"
    },
    "summary": "Bankstown and Wellington fuel cell work has helped to verify Vertiia&rsquo;s powertrain while also feeding electricity into the airport grid, bringing the composites-intensive Australian aircraft closer to flight.\n\n&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Bankstown and Wellington fuel cell work has helped to verify Vertiia&rsquo;s powertrain while also feeding electricity into the airport grid, bringing the composites-intensive Australian aircraft closer to flight.\n\n&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Vertiia aircraft on the ground.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-amslaero-vertiia.png;maxWidth=720\" /> </div>\n\n<p>Source |&nbsp;AMSL Aero Pty Ltd.&nbsp;</p>\n</div>\n\n<p><a href=\"https://www.amslaero.com/\" target=\"_blank\">AMSL Aero</a>&nbsp;(Sydney), an Australian&nbsp;zero-emission aircraft designer and<br />\nmanufacturer, announces the successful completion of its first year of hydrogen fuel cell testing at Bankstown Airport, positioning its long-range electric vertical takeoff and landing (eVTOL) aircraft, <em>Vertiia</em>,&nbsp;for emission-free flight testing within 12 months.</p>\n\n<p><em>Vertiia</em> features an electric motor with a battery, a hydrogen fuel cell and a composite tank. According to <a href=\"https://amtil.com.au/zero-emission-electric-hydrogen-flight/#:~:text=AMSL%20Aero%20uses%20many%20of,Lawrence%20Hargrave%2C%20was%20tested%20thoroughly.\" target=\"_blank\">a February 2025&nbsp;article</a> by AMTIL&rsquo;s <em>Australian Manufacturing Technology</em> (<em>AMT</em>) magazine, AMSL Aero&rsquo;s decision to go the hybrid route supports reduced operating costs, zero emissions and to enable long range (~1,000 kilometers). The eVTOL aircraft will be used for essential services in Australia such as medical, transfers, passenger and freight services.</p>\n\n<p>So far AMSL Aero has seen positive results based on tests at one of Australia&rsquo;s busiest airports. Results reveal that since mid-2024, AMSL Aero has used more than 200 kilograms of hydrogen. That is enough to fill an Olympic swimming pool at atmospheric pressure and successfully power its 100-kilowatt fuel cell test bench.</p>\n\n<p>The test bench works as a fully functional mock-up of the hydrogen powertrain for <em>Vertiia</em>, which reportedly&nbsp;made Australian aviation history in late 2024 by making its first free flights. AMSL Aero has won orders for <em>Vertiias</em> from general aviation operators including Bankstown Airport-based Aviation Logistics.</p>\n\n<div class=\"article_sidebar\">\n<h3>Make strides in eVTOL tech with composites innovation</h3>\n\n<p><em>AMT</em>&rsquo;s interview with AMSL Aero co-founder, chief engineer and <em>Vertiia</em> inventor Andrew Moore also delves into the aircraft&rsquo;s local design, manufacture and how fiber-reinforced composite materials are playing a vital role.</p>\n\n<p><em>Vertiia</em>&rsquo;s&nbsp;carbon fiber composite components are manufactured by various local Australian companies, including&nbsp;Innovation Composites, CST Composites and Quickstep Holdings, and are being used in &ldquo;unique areas,&rdquo; according to Moore which &ldquo;allows them to do things not viable for other design concepts.&rdquo; This has included selecting unique manufacturing methods.</p>\n\n<p>&ldquo;The engineers at AMSL Aero propose a combination of conventional aerospace materials, such as carbon fiber&nbsp;composites, but using them in a slightly unconventional way. Some methods adopted along the way include infusion methods for certain parts,&rdquo; Moore tells <em>AMT</em>.&nbsp;&ldquo;We have used film winding for structural components and other more traditional aerospace manufacturing methods, like pre-impregnated composites under a vacuum.&rdquo;</p>\n\n<p>Read the complete interview <a href=\"https://amtil.com.au/zero-emission-electric-hydrogen-flight/#:~:text=AMSL%20Aero%20uses%20many%20of,Lawrence%20Hargrave%2C%20was%20tested%20thoroughly.\" target=\"_blank\">here</a>.</p>\n</div>\n\n<p>&ldquo;In just one year, our engineering team has successfully demonstrated the practical applications of hydrogen in aviation,&rdquo; says&nbsp;Chris Smallhorn, chairman of AMSL Aero. &ldquo;Our collaboration with Bankstown Airport is instrumental in our ongoing mission to offer longer-distance flights that cut both the cost and carbon footprint of travel across Australia and elsewhere.&rdquo;</p>\n\n<p>Simon Coburn, hydrogen lead at AMSL Aero, says&nbsp;the 200 kilograms&nbsp;of hydrogen used was sufficient to export 30 kilowatts&nbsp;of electricity into the airport grid for three working weeks and slash the airport&rsquo;s power bill by about 1.8 megawatt-hours&nbsp;</p>\n\n<p>AMSL Aero has also deployed the test bench to Wellington Aerodrome in rural NSW for recharging <em>Vertiia</em> between test flights.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/amsl-aero-makes-h2-testing-milestones-for-hybrid-vertiia-evtol"
      }
    ],
    "link": "https://www.compositesworld.com/news/amsl-aero-makes-h2-testing-milestones-for-hybrid-vertiia-evtol"
  },
  {
    "published": "Fri, 30 May 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      18,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "Vertical performs piloted VX4 eVTOL flight in open airspace",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Vertical performs piloted VX4 eVTOL flight in open airspace"
    },
    "summary": "Successful wingborne flight following approval from the UK Civil Aviation Authority (CAA) completes Phase 3 of Vertical&rsquo;s path toward certification and commercial operation.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Successful wingborne flight following approval from the UK Civil Aviation Authority (CAA) completes Phase 3 of Vertical&rsquo;s path toward certification and commercial operation."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-vertical-vx4-prototype-flight-openair-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-vertical-vx4-prototype-flight-openair-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>The VX4 prototype soars across the U.K. countryside from Cotswold Airport. Source | Vertical Aerospace</p>\n</div>\n\n<p>On May 27,&nbsp;<a href=\"https://vertical-aerospace.com/\" target=\"_blank\">Vertical Aerospace</a>&nbsp;(London, U.K.) achieved piloted wingborne flight of a winged electric vertical takeoff and landing (eVTOL) aircraft in open airspace. The landmark flight of the VX4 prototype, piloted by chief test pilot Simon Davies, saw the aircraft takeoff, fly and land like a conventional aircraft, with lift generated by the wing.</p>\n\n<p>Soaring across the U.K. countryside from Cotswold Airport,&nbsp;the VX4 prototype demonstrated controlled wingborne flight in open airspace for the first time, marking a critical step toward commercial deployment as part of Vertical&rsquo;s&nbsp;Flightpath 2030 strategy.</p>\n\n<p>Notably, the UK Civil Aviation Authority (CAA) approved the flight through open airspace at Cotswold Airport by extending Vertical&rsquo;s Permit to Fly. This followed a rigorous review of tens of thousands of pages of safety and technical documentation.</p>\n\n<p>&ldquo;Our performance predictions were spot on, and the aircraft took off as a natural extension of all the ground tests and preparation we&rsquo;ve done,&rdquo; says Davies.</p>\n\n<p>Vertical&rsquo;s piloted winged eVTOL prototype has been developed under a design organization&nbsp;approval (DOA) from the CAA. A DOA&nbsp;is required to hold a type certificate, required for commercial passenger operations. The CAA is working closely with the European Union Aviation Safety Agency (EASA) for its concurrent validation and certifying the VX4 to the highest safety standards required for commercial use.</p>\n\n<div class=\"article_sidebar\">\n<h3>Vertical Aerospace milestones and future goals</h3>\n\n<p><strong>Phase 1</strong>: Tethered: The VX4 prototype will perform stabilized hover while loosely tethered to the ground. <em>Completed September 2024.&nbsp;</em></p>\n\n<p><strong>Phase 2</strong>: Thrustborne: The VX4 prototype will takeoff and land vertically and conduct low speed flight maneuvers with lift generated by the propellers.&nbsp;<em>Completed February 2025.</em></p>\n\n<p><strong>Phase 3</strong>: Wingborne: The VX4 prototype will takeoff, fly and land like a conventional aircraft, with lift generated by the wing.&nbsp;<em>Completed May 2025.</em></p>\n\n<p><strong>Phase 4</strong>: Transition: The VX4 prototype will transition between thrustborne and wingborne flight, and vice versa. <em>Expected before year-end 2025.</em></p>\n</div>\n\n<p>Vertical&rsquo;s recent flight achievement has been supported by early U.K. government&nbsp;investment through programs including the Aerospace Technology Institute (ATI) and the Future Flight Challenge. These initiatives have contributed to the development of Vertical&rsquo;s technology and flight test campaign, and form part of wider efforts to advance the U.K.&rsquo;s net-zero and aerospace ambitions.</p>\n\n<p>What is the significance of wingborne flight? During this Phase 3 testing, the VX4 aircraft&nbsp;operates like a conventional aircraft, using lift generated by its wings&nbsp;rather than relying solely on rotor thrust. This low-power, quiet&nbsp;and range-efficient mode of flight is key to making electric air travel practical, scalable and economically viable.&nbsp;</p>\n\n<p>It also leads the company to its next milestone:&nbsp;a full piloted transition flight, expected in the second half of 2025. This will demonstrate the VX4&rsquo;s ability to shift seamlessly between vertical lift and forward cruise &mdash;&nbsp;the operating mode it will use in passenger service.</p>\n\n<p>During the wingborne flight phase, the VX4 will reach speeds of up to 150 miles per hour (120 knots) and altitudes close to 2,000 feet under real-world conditions. Engineers captured more than 30,000 in-flight data parameters, confirming the aircraft performed well across stability, control&nbsp;and energy use.</p>\n\n<p>To prepare for piloted wingborne flights, Vertical has completed thousands of hours of lab, simulation&nbsp;and high speed ground testing, including:</p>\n\n<ul>\n\t<li>7.2 million fatigue cycles on each propeller blade to simulate lifespan loads over the flight test campaign.</li>\n\t<li>15.2-meter&nbsp;battery pack drop test, comparable to fuel-tank testing in traditional rotorcraft.</li>\n\t<li>Full-scale thermal runaway propagation test on a VX4 sub-pack, indicating safe flight and landing is possible even in the event of a battery fire.</li>\n\t<li>More than 3,000 hours of component and integration testing on flight control computers to ensure system reliability and performance.</li>\n</ul>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/vertical-performs-piloted-vx4-evtol-flight-in-open-airspace"
      }
    ],
    "link": "https://www.compositesworld.com/news/vertical-performs-piloted-vx4-evtol-flight-in-open-airspace"
  },
  {
    "published": "Fri, 30 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      17,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "GVP tanks pass extreme fire tests, confirm market readiness",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "GVP tanks pass extreme fire tests, confirm market readiness"
    },
    "summary": "Full-size, high-pressure Type 3&nbsp;composite&nbsp;tank test results conclude safe containment during severe fire scenarios, concluding the final stage of GVP&rsquo;s certification program.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Full-size, high-pressure Type 3&nbsp;composite&nbsp;tank test results conclude safe containment during severe fire scenarios, concluding the final stage of GVP&rsquo;s certification program."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gvp-tank-fire-test-before.png\" target=\"_blank\"><img alt=\"Type 3 tank prior to testing. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gvp-tank-fire-test-before.png;maxWidth=385\" /></a></div>\n\n<p>Type 3 tank prior to testing. Source (All Images) | Gas Vessel Production (GVP)</p>\n</div>\n\n<p><a href=\"https://www.gasvp.com/\" target=\"_blank\">Gas Vessel Production</a> (GVP, Buttrio, UD, Italy), a European-based engineering and production company focused on the manufacture&nbsp;and commercialization of the world&rsquo;s largest high-pressure composite tanks for clean gas transport, has&nbsp;successfully completed a series of full-scale fire tests, demonstrating the high fire resistance and structural integrity of its technology under the most extreme conditions.</p>\n\n<p>GVP&rsquo;s high-capacity, lightweight Type 3 composite tanks are designed for scalable transport and storage of hydrogen, CNG, CO<sub>2</sub>&nbsp;and other industrial gases. Testing was conducted in compliance with ADR Regulations (Section 6.9.2.7.1.5), one of the most stringent fire test standards for pressure vessels worldwide.</p>\n\n<p>The full-size prototype underwent initial exposure to an oil pool fire, followed by subsequent direct flame contact from multiple LPG burners evenly distributed around the tank. Testing conditions included:&nbsp;</p>\n\n<ul>\n\t<li>External surface temperatures exceeding 800&deg;C, reaching up to 1000&deg;C</li>\n\t<li>Heat flux greater than 75 kilowatts/square meter&nbsp;</li>\n\t<li>Sustained fire exposure for more than&nbsp;30 minutes.</li>\n</ul>\n\n<p>According to GVP, the prototype tank&rsquo;s internal temperature&nbsp;rose by only 1-2&deg;C. In addition, no leaks, venting&nbsp;or structural failure occurred during or after testing. These results further confirmed&nbsp;the robustness and thermal resilience of GVP&rsquo;s composite tank design, ensuring safe containment even in the most severe fire exposure scenarios.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gvp-tank-fire-test-during.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-gvp-tank-fire-test-during.png;maxWidth=720\" /> </a></div>\n</div>\n\n<p>The fire test concludes the final stage of GVP&rsquo;s prototype certification program, which already includes extreme pressure performance, resistance to vacuum conditions, high-cycle fatigue durability, optimal blunt impact resistance and high fire safety.</p>\n\n<p>&ldquo;This milestone confirms the safety and market readiness of our tanks,&rdquo; says Giovanni Fratti, CTO of GVP. &ldquo;We&rsquo;re proud to contribute to the next generation of clean gas logistics.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gvp-tanks-pass-extreme-fire-tests-confirm-market-readiness"
      }
    ],
    "link": "https://www.compositesworld.com/news/gvp-tanks-pass-extreme-fire-tests-confirm-market-readiness"
  },
  {
    "published": "Fri, 30 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      16,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "Agile Ultrasonics breaks new ground for ultrasonic composites welding in space manufacturing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Agile Ultrasonics breaks new ground for ultrasonic composites welding in space manufacturing"
    },
    "summary": "Continuous ultrasonic welding (CUW) innovation presents the flexibility crucial for future lunar and deep-space missions, but also for composites joining in defense and commercial aerospace.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Continuous ultrasonic welding (CUW) innovation presents the flexibility crucial for future lunar and deep-space missions, but also for composites joining in defense and commercial aerospace."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-agileultrasonics-cuw-trial.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-agileultrasonics-cuw-trial.jpg;maxWidth=720\" /> </a></div>\n\n<p>Chris Skocik, Agile Ultrasonics engineering manager, is loading the company&rsquo;s vacuum chamber in preparation for an ultrasonic weld trial joining CFRTP&nbsp;at the company&rsquo;s facility in Columbus, Ohio. Source | Agile Ultrasonics</p>\n</div>\n\n<p><a href=\"https://www.agileultrasonics.com/\" target=\"_blank\">Agile Ultrasonics</a>&nbsp;(Columbus, Ohio, U.S.), a company developing advanced ultrasonic welding solutions for thermoplastic composites (TPC), and a key player in the &ldquo;Structural Materials Joining in Space&rdquo;&nbsp;project, funded by <a href=\"https://ohiofrn.org/\" target=\"_blank\">Ohio Federal Research Network</a> (OFRN), is tackling the challenge of achieving reliable TPC&nbsp;welding in the harsh, environmental conditions of space. This project is an enabler for in-space manufacturing, servicing&nbsp;and repair &mdash;technologies that NASA and other industry leaders could use for the future of deep-space exploration.</p>\n\n<p>Agile Ultrasonics&rsquo; expertise extends beyond space applications, with a strong foundation&nbsp;in developing, designing&nbsp;and manufacturing advanced robotic end effectors for critical polymer composites joining. As Jim Stratton, president of Agile Ultrasonics highlights, the company&rsquo;s technology has been installed in top-tier aerospace and is being evaluated for use in U.S. Air Force, and NASA programs. Agile&rsquo;s innovations include continuous ultrasonic welding (CUW) without the need for energy directors, film layers&nbsp;or other inserts &mdash; an advancement that enhances efficiency and reliability while expanding material selection options for component designers.&nbsp;Additionally, the company&rsquo;s solutions enable precise shaping and compacting of high-performance carbon fiber-reinforced thermoplastic (CFRTP) composites, supporting both terrestrial- and space-based applications.</p>\n\n<h3>Overcoming the challenges of space welding</h3>\n\n<p>Traditional ultrasonic welding techniques often require additional materials, such as energy directors or resin inserts, which introduce complexities in space where weight and automation are critical concerns. To address this challenge, and through the aforementioned OFRN project, Agile Ultrasonics has developed CUW&nbsp;without the need for energy directors or film layer inserts, a process that can be used to eliminate auxiliary materials while ensuring high-performance joints in TPCs such as LM-PAEK, PEEK or PEKK prepregs, which are widely used in aerospace structures.</p>\n\n<p>&ldquo;The &lsquo;Structural Materials Joining in Space&rsquo;&nbsp;project that Agile has been awarded by Parallax Research seeks to develop baseline ultrasonic welds of TPCs in extreme space conditions. No data is currently known to exist for this type of ultrasonic welding,&rdquo;&nbsp;Stratton explains.</p>\n\n<p>To test its technology, Agile has designed and built a custom vacuum chamber capable of simulating&nbsp;the extreme thermal fluctuations of space, ranging from -190&deg;C to +120&deg;C. This chamber enables real-time, in-weld temperature monitoring using a sensor array that provides critical data to correlate thermal profiles with mechanical strength. According to Stratton, these insights are essential for refining welding parameters and ensuring the long-term reliability of TPC&nbsp;welds in space environments.</p>\n\n<p>Notably, the CUW technology represents an opportunity for&nbsp;space-based and terrestrial composites manufacturing. Unlike conventional ultrasonic welding systems, Agile has commercialized its technology as a modular, adaptable robot-agnostic end effector.&nbsp;This flexibility could be crucial for future lunar and deep-space missions, where robotic assembly and repair may be necessary for constructing and maintaining spacecraft structures and habitats.</p>\n\n<p><em>&ldquo;</em>Agile created the option of applying this highly adaptable, modular, low-power, machine-driven robotic system to structural element manipulation, joining and repurposing of composite materials on-orbit or on the lunar surface,&rdquo; Stratton elaborates. &ldquo;By correlating weld test data with corresponding weld temperature data, we will advance understanding of the environmental impact on welds as they occur.&rdquo;</p>\n\n<p>Beyond space applications, Agile&rsquo;s CUW technology has&nbsp;potential for defense and commercial aerospace where the ability to create high-strength, lightweight composite joints &mdash; without adhesives or reinforcements &mdash; can be significant for advanced aerospace structures. Current efforts include maturing the technology to support advanced air mobility (AAM) systems and potentially autonomous&nbsp;collaborative platforms (ACP) for AFRL through Midwestern Regional Network funding.</p>\n\n<h3>Industry collaboration and commercialization</h3>\n\n<p>Agile Ultrasonics&rsquo; success is built on strategic supply chain partnerships including material and robotic systems makers, Tier 1 aerospace, NASA, the U.S. Air Force&nbsp;and research institutions&nbsp;including the University of Dayton Research Institute (UDRI), The Ohio State University, Central State University and Oak Ridge National Laboratory (ORNL). These collaborations have been&nbsp;critical in bridging the gap between research and real-world applications.</p>\n\n<p>Support from the OFRN Round 6 program has accelerated Agile&rsquo;s commercialization efforts, enabling&nbsp;the company to demonstrate its advancements in ultrasonic welding technology to key aerospace stakeholders. The funding has also enabled crucial testing, process refinement and validation studies that strengthen Agile&rsquo;s composites joining leadership.</p>\n\n<p>&ldquo;OFRN 6 has provided leverage for Agile to grow its existing business with NASA and helped Parallax demonstrate to its funding source that the support Agile has received through OFRN 6 is producing jobs, breakthrough technology&nbsp;and follow-on programs as proposed at the outset,&rdquo; Stratton notes. &ldquo;Further, the work being done under OFRN 6 has helped Agile gain traction with the U.S. Air Force.&nbsp;Agile recently received an award from the Air Force Research Lab [AFRL]&nbsp;Midwest Regional Network to apply its continuous ultrasonic welding of thermoplastic composites to an AFRL-funded program.&rdquo;</p>\n\n<p>Agile Ultrasonics continues to refine its CUW process. Stratton believes that it will not only play&nbsp;a vital role in the&nbsp;long-term vision of sustainable space exploration, but also unlock&nbsp;new opportunities for high-performance composites in aviation, AAM&nbsp;and defense through continued collaboration and industry support.</p>\n\n<p>&ldquo;We have worked almost daily with our stakeholders at NASA&rsquo;s Glenn Research Center in Cleveland, NASA&rsquo;s Langley Research Center in Hampton, Virginia, and NASA&rsquo;s Goddard Space Flight Center in Greenbelt, Maryland. We have hosted multiple face-to-face visits at our facility and collaborated extensively on ultrasonic welding projects within and outside of OFRN 6,&rdquo; Stratton emphasizes. &ldquo;Our objective is to advance Agile&rsquo;s technology so that it becomes an integral part of the supply chain as a go-to platform for joining, shaping, compacting, sealing&nbsp;or consolidating TPCs. An immense effort will be required to achieve this level of commercial success.&rdquo;</p>\n\n<p><em>Air Force Research Lab<strong>&nbsp;</strong>AFRL-2025-2496.&nbsp;Distribution statement A: Approved for Public Release: distribution is unlimited.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/agile-ultrasonics-breaks-new-ground-for-ultrasonic-composites-welding-in-space-manufacturing"
      }
    ],
    "link": "https://www.compositesworld.com/news/agile-ultrasonics-breaks-new-ground-for-ultrasonic-composites-welding-in-space-manufacturing"
  },
  {
    "published": "Fri, 30 May 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      15,
      30,
      0,
      4,
      150,
      0
    ],
    "title": "Northrop Grumman Series D investment advances MLV Eclipse co-developed with Firefly",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Northrop Grumman Series D investment advances MLV Eclipse co-developed with Firefly"
    },
    "summary": "A $50 million investment further supports Eclipse, a platform&nbsp;built upon the success of Firefly&rsquo;s carbon fiber Alpha and Northrop Grumman&rsquo;s Antares rocket with a leap in power, performance&nbsp;and payload capacity.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A $50 million investment further supports Eclipse, a platform&nbsp;built upon the success of Firefly&rsquo;s carbon fiber Alpha and Northrop Grumman&rsquo;s Antares rocket with a leap in power, performance&nbsp;and payload capacity."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-firefly-grumman-eclipse.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Eclipse launch vehicle rendering.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-firefly-grumman-eclipse.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Firefly Aerospace</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/northrop-grumman-tactical-space-space-components\" target=\"_blank\">Northrop Grumman Corp.</a> (Falls Church, Va., U.S.) has invested $50 million into <a href=\"https://fireflyspace.com/\" target=\"_blank\">Firefly Aerospace</a>&nbsp;(Cedar, Texas, U.S.) to further advance production of a co-developed medium launch vehicle (MLV), now known as Eclipse. The companies continue to make progress in the development of Eclipse flight hardware with qualification testing underway and more than 60 Miranda engine hot fire tests performed to date.</p>\n\n<p>&ldquo;Northrop Grumman&rsquo;s investment further solidifies our&nbsp;partnership to build the first stage of <em>Antares 330</em> and jointly develop Eclipse,&rdquo; says&nbsp;Jason Kim, CEO of Firefly Aerospace. &ldquo;Eclipse represents two powerful forces coming together to transform the launch market with decades of flight heritage, a rapid, iterative approach&nbsp;and bold innovation. With a 16 metric ton to orbit capability, Eclipse is a sweet spot for programs like NSSL Lane 1 and a natural fit to launch proliferated constellations in LEO, MEO, GEO&nbsp;and TLI.&rdquo;</p>\n\n<p>Built upon Grumman&rsquo;s Antares and Firefly&rsquo;s <em>Alpha</em> rocket,&nbsp;<a href=\"https://fireflyspace.com/eclipse/\" target=\"_blank\">Eclipse</a>&nbsp;offers what partners say is&nbsp;a significant leap in power, performance, production cadence and payload capacity. The MLV&nbsp;retains the flight-proven avionics from the Antares program with additional upgrades, including a larger 5.4-meter payload fairing. Eclipse also uses the same first stage Firefly is developing for <em>Antares 330</em> and retains scaled-up versions of <em>Alpha</em>&rsquo;s propulsion systems and carbon fiber composite structures, enabling the team to rapidly build and test Eclipse with significant production efficiencies and economies of scale.</p>\n\n<p>Firefly also used the same tap-off cycle architecture from <em>Alpha</em>&rsquo;s Reaver and Lightning engines for Eclipse&rsquo;s Miranda and Vira engines, and completed mission duty cycle with a 206-second Miranda hot fire, matching the longest time the engine will burn during a flight. Following several development test campaigns, flight hardware has been manufactured for the common dome propellant tanks, engine bay and interstage.</p>\n\n<p>&ldquo;Eclipse gives customers the right balance between payload capacity and affordability,&rdquo; notes&nbsp;Wendy Williams, vice president and general manager, launch and missile defense systems, Northrop Grumman. &ldquo;Our partnership with Firefly builds on our capacity to provide crucial spaced-based communication, observation&nbsp;and exploration for civil and national security customers.&rdquo;</p>\n\n<p>Eclipse is equipped to deliver 16,300 kilograms of cargo to low Earth orbit or 3,200 kilograms of cargo to geosynchronous transfer orbit. Eclipse will first launch from Wallops Island, Virginia, as early as 2026 and is able to support space station resupply, commercial spacecraft, critical national security missions and scientific payloads for the domestic and international markets.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/northrop-grumman-series-d-investment-advances-mlv-eclipse-co-developed-with-firefly"
      }
    ],
    "link": "https://www.compositesworld.com/news/northrop-grumman-series-d-investment-advances-mlv-eclipse-co-developed-with-firefly"
  },
  {
    "published": "Fri, 30 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      30,
      15,
      0,
      0,
      4,
      150,
      0
    ],
    "title": "JEC Group to launch series of composites events in the Middle East",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "JEC Group to launch series of composites events in the Middle East"
    },
    "summary": "A 3-year strategic agreement with the region targets the organization of a one-day JEC Talks in June 2025 and a JEC Forum Middle East in 2026 in the effort to build on Saudi&nbsp;Arabia&rsquo;s proliferating composites space.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A 3-year strategic agreement with the region targets the organization of a one-day JEC Talks in June 2025 and a JEC Forum Middle East in 2026 in the effort to build on Saudi&nbsp;Arabia&rsquo;s proliferating composites space."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tradeshow-blurred-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Blurred trade show.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tradeshow-blurred-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/jec-composites\" target=\"_blank\">JEC Group</a>&nbsp;(Paris, France) announces a&nbsp;strategic collaboration agreement with the&nbsp;OSP&nbsp;and&nbsp;IFC Promosalons, the representative of JEC in the Middle East. The agreement aims to organize a series of events dedicated to composite materials held in Saudi Arabia for the first time starting in June 2025. The events will facilitate the creation of opportunities for local and international companies and accelerate the adoption of sustainable materials across multiple industries in the region.&nbsp;</p>\n\n<p>This 3-year agreement formalizes the long-term cooperation with OSP, and aims to:</p>\n\n<ul>\n\t<li>Enhance and increase awareness of the sustainability and efficiency of polymer-based applications.</li>\n\t<li>Promote nonmetallic materials as enablers of industrial diversification.</li>\n\t<li>Facilitate innovative technologies being transferred and increasing industrial partnerships between local and international stakeholders.</li>\n</ul>\n\n<p>With the Saudi Vision 2030 roadmap and large-scale investments in advanced materials, Saudi Arabia is actively diversifying its economy through innovation. Fiber-reinforced composites are central to this transformation, with applications in mobility, building and&nbsp;construction, renewable energy, oil and&nbsp;gas, infrastructure&nbsp;and more.</p>\n\n<p>JEC looks forward to being part of this momentum, creating strong business opportunities, driving innovation&nbsp;and supporting industrial development in the region. &ldquo;This agreement is a significant milestone for JEC,&rdquo; says&nbsp;Thomas Lepretre, VP sales, events and operations, JEC Group.&nbsp;&ldquo;It reflects our shared ambition to accelerate innovation and collaboration in the Middle East, and to supply our communities with networking opportunities in all geographical areas. We are looking forward to working with the OSP to build bridges between companies in the region and potential suppliers and customers abroad.&rdquo;</p>\n\n<p>Accordingly, the partnership&nbsp;paves the way for the launch of two major new events in the Kingdom. JEC Talks Middle East, an&nbsp;invitation-only event held on June 24, 2025, is offering a high-level insight day to explore Saudi Arabia&rsquo;s and the region&rsquo;s composites ecosystem. JEC Forum Middle East, scheduled for June 23-24, 2026, in Riyadh, Saudia Arabia, will be the first edition of a business meeting-based event gathering the entire regional and international composites value chain.</p>\n\n<p><em>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/news/jec-group-launches-jec-forum-southeast-asia-for-2026\">JEC Group launches JEC&nbsp;Forum Southeast Asia for 2026</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/jec-group-to-launch-series-of-composites-events-in-the-middle-east"
      }
    ],
    "link": "https://www.compositesworld.com/news/jec-group-to-launch-series-of-composites-events-in-the-middle-east"
  }
]