[
  {
    "published": "Thu, 27 Nov 2025 00:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      27,
      5,
      0,
      0,
      3,
      331,
      0
    ],
    "title": "ICS 2025 brings high-impact format with focus on business acceleration, global collaboration",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ICS 2025 brings high-impact format with focus on business acceleration, global collaboration"
    },
    "summary": "Starting next week on Dec. 2 in the U.K., ICS features a strategic location move, focused format, hassle-free exhibiting, an international forum program&nbsp;and structured networking/matchmaking&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Starting next week on Dec. 2 in the U.K., ICS features a strategic location move, focused format, hassle-free exhibiting, an international forum program&nbsp;and structured networking/matchmaking&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-ICS-event.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Close-up of attendees at an event.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-ICS-event.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | ICS</p>\n</div>\n\n<p>The <a href=\"https://internationalcompositessummit.com/\" target=\"_blank\">International Composites Summit (ICS)</a>&nbsp;is opening its doors next week at The Drum, Wembley, in the U.K., positioning itself as a focused business acceleration platform for the global composites community rather than a traditional trade show.</p>\n\n<p>Taking place Dec. 2-3, 2025, ICS will bring together international leaders and decision-makers from across the composites supply chain, including raw material suppliers, manufacturers, technology providers, OEMs&nbsp;and end users from sectors such as aerospace, automotive, marine, construction&nbsp;and energy.</p>\n\n<p>&ldquo;We do not see ICS as just another trade show. We are building it as a business acceleration platform for the composites industry,&rdquo; says&nbsp;Gemma Hardy, managing director of Fluency and ICS organizer. &ldquo;Our goal is not simply to fill exhibition stands. It is to create connections that move forward into projects, partnerships, investment&nbsp;and real growth across the whole supply chain.&rdquo;</p>\n\n<h3>Strategic move to Wembley</h3>\n\n<p>After several successful editions in Milton Keynes, ICS has&nbsp;relocated to The Drum at Wembley, situated adjacent to the iconic Wembley Stadium. The move is a strategic response to exhibitor and visitor feedback, reflecting the event&rsquo;s increasingly international footprint.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Christmas in London</h3>\n\n<p>With ICS taking place at the start of December, visitors can combine 2 days of focused industry engagement with time in London during the festive season. Wembley&rsquo;s London Designer Outlet is located next to The Drum, while central London shopping districts such as Oxford Street and Bond Street, the Christmas lights, Hyde Park Winter Wonderland and West End theaters are all within easy reach by tube.</p>\n</div>\n</div>\n\n<p>&ldquo;Based on feedback from previous years, we knew we needed a venue that matched the scale, professionalism and&nbsp;global outlook of the composites industry,&rdquo; explains&nbsp;Hardy. &ldquo;Wembley offers excellent national and international transport links, making it easier for overseas delegates to attend, and gives us a setting that reflects the ambition of our community.&rdquo;</p>\n\n<p>The Drum is embedded within Brent Civic Centre, a modern circular building, a short walk from Wembley Stadium station. Delegates arriving by train follow the same route used by football fans heading to the national stadium, with views of the famous arch framing the event environment.</p>\n\n<h3>A boutique show with big ambitions</h3>\n\n<p>ICS deliberately positions itself as a focused, boutique event rather than a large generalist expo. The emphasis is on quality of interaction and targeted networking rather than scale for its own sake.</p>\n\n<p>Past editions have already delivered tangible outcomes for participants. Companies have reported securing international distributors, new R&amp;D partners and multi-million pound contracts based on connections made at the summit.</p>\n\n<blockquote>\n<p>Registration for ICS 2025 is free for visitors. For more information and to register&nbsp;visit the <a href=\"https://internationalcompositessummit.com/\" target=\"_blank\">ICS website</a>.</p>\n</blockquote>\n\n<p>&ldquo;We know from feedback that ICS delivers proven return on investment,&rdquo; notes&nbsp;Hardy. &ldquo;What excites me most is seeing small innovators meeting major OEMs and turning ideas into tangible outcomes through collaboration and joint development. That is exactly what this platform is designed to enable.&rdquo;</p>\n\n<h3>Hassle-free exhibiting</h3>\n\n<p>To reduce the burden on busy teams and make it easier for startups and SMEs to participate, ICS has adopted a simple exhibition format. Exhibitors are offered a standard pod-style stand with a branded backdrop, optional screen and integrated storage, with design and production handled by the organizing&nbsp;team if required.</p>\n\n<p>&ldquo;Exhibitions can be hard work. We wanted to remove as much of that headache as possible,&rdquo; states&nbsp;Hardy. &ldquo;Our plug-and-play pods mean exhibitors can arrive with a laptop and some literature, then focus on networking and meetings instead of stand build logistics.&rdquo;</p>\n\n<p>This level, low-cost entry format is intended to create a more inclusive floor plan where early stage innovators and global groups share the same visual footprint, encouraging genuine dialogue across the supply chain.</p>\n\n<h3>International forum program and sustainability focus</h3>\n\n<p>ICS 2025 will feature an international conference program, with speakers and panellists from Europe, the Middle East and North America. Keynotes and panels will explore themes such as sustainability, circularity, market development, investment, construction&nbsp;and smart materials.</p>\n\n<p>Confirmed contributors include:</p>\n\n<ul>\n\t<li>Mjed Hashem from NEOM in Saudi Arabia, who will share insights on the role of composites in flagship projects such as The Line and wider smart city developments.</li>\n\t<li><em>CW</em>&rsquo;s Ginger Gardiner, who will chair the sustainability panel and lead a practical session on how companies can raise their profile and &ldquo;get into the press&rdquo; more effectively.</li>\n\t<li>Chris Skinner, VP marketing and R&amp;D at Owens Corning, who will deliver a keynote on sustainable glass fiber&nbsp;production and participate in the sustainability panel.</li>\n</ul>\n\n<p>&ldquo;When I started in composites, we were largely telling our stories to each other,&rdquo; says&nbsp;Hardy. &ldquo;Today, end users are listening. They want to understand life cycle cost, sustainability and performance. ICS is about bringing the industry together to shout about what we can achieve and to connect that innovation with real applications.&rdquo;</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Black Friday offer</h3>\n\n<p>ICS will also introduce a Black Friday offer available from this Friday and running until the end of 2025. Companies will be able to secure a pod on the ICS Innovation Hub at JEC World 2026 with a substantial discount. The standard pod package will be reduced from &pound;4,750 to &pound;3,750, and the pod package with a TV will be reduced from &pound;4,950 to &pound;3,950. Bookings can be made online from Friday or directly with the team during the summit.</p>\n</div>\n</div>\n\n<h3>Structured networking, active matchmaking</h3>\n\n<p>Networking is built into the ICS format consciously. The exhibition space features open seating and meeting areas, and the Fluency team provides participants with proactive matchmaking support before and during the event.</p>\n\n<p>If an exhibitor or visitor shares a wish list of target organizations or people, the organizers will actively invite those companies and, where possible, make introductions on-site. This tailored approach has already delivered results, with companies reporting new contacts and ongoing discussions following introductions facilitated by the ICS team.</p>\n\n<p>An informal networking evening on Dec. 2 at The White Horse, a short walk from The Drum, will bring together exhibitors, sponsors&nbsp;and ticket holders for relaxed conversation, live indie acoustic music&nbsp;and a seasonal buffet in a pub setting.</p>\n\n<p>&ldquo;The industry asked us for this event, and we have put our heart and soul into making it happen,&rdquo; concludes&nbsp;Hardy. &ldquo;I would encourage everyone across the composites supply chain to join us at Wembley, help us grow the network&nbsp;and use ICS to accelerate your business and your own development.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ics-2025-brings-high-impact-format-with-focus-on-business-acceleration-global-collaboration"
      }
    ],
    "link": "https://www.compositesworld.com/news/ics-2025-brings-high-impact-format-with-focus-on-business-acceleration-global-collaboration"
  },
  {
    "published": "Wed, 26 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      26,
      18,
      0,
      0,
      2,
      330,
      0
    ],
    "title": "NIAR wraps up structural testing for MQ-9B aircraft",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "NIAR wraps up structural testing for MQ-9B aircraft"
    },
    "summary": "GA-ASI&rsquo;s remotely piloted composite aircraft completed its&nbsp;third lifetime since the program&rsquo;s start in 2022,&nbsp;forming the basis for in-service inspections of structural aircraft components.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "GA-ASI&rsquo;s remotely piloted composite aircraft completed its&nbsp;third lifetime since the program&rsquo;s start in 2022,&nbsp;forming the basis for in-service inspections of structural aircraft components."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-niar-mq9b-testing.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"MQ-9B testing at NIAR.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-niar-mq9b-testing.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | NIAR</p>\n</div>\n\n<p>Wichita State University&rsquo;s (WSU) <a href=\"https://www.compositesworld.com/suppliers/national-institute-for-aviation-research\" target=\"_blank\">National Institute for Aviation Research</a> (NIAR) recently completed a long-term full-scale fatigue test program with <a href=\"https://www.ga-asi.com/\" target=\"_blank\">General Atomics Aeronautical Systems&nbsp;Inc.</a> (GA-ASI, San Diego, Calif., U.S.) for the MQ-9B remotely piloted aircraft (RPA).</p>\n\n<p>MQ-9B is GA-ASI&rsquo;s most advanced RPA and includes the <em>SkyGuardian</em>&nbsp;and <em>SeaGuardian</em>&nbsp;models as well as the new Protector RG Mk1 that is currently being delivered to the United Kingdom&rsquo;s Royal Air Force (RAF). The MQ-9B <em>SkyGuardian&nbsp;</em>is mostly notable for its <a href=\"https://www.compositesworld.com/news/ga-asi-installs-first-composite-v-tail-from-gkn-aerospace-onto-mq-9b-rpa\" target=\"_blank\">composite V-tail</a> manufactured by GKN Aerospace (Redditch, U.K.), though GA-ASI&rsquo;s&nbsp;broader line of unmanned aircraft systems (UAS) all largely make use of composite materials.</p>\n\n<p>The program, which began Dec. 13, 2022, was for the third and final lifetime of the MQ-9B, which includes a total of 120,000 operating hours (40,000-plus flight hours per aircraft life). This test verifies the structural integrity of the airframe and is a key milestone in validating design.</p>\n\n<p>The aim of the test program is to identify any potential structural deficiencies ahead of fleet usage and assist in developing inspection and maintenance schedules for the airframe. Test results will be used as documentation for certification and will form the basis for in-service inspections of structural components.</p>\n\n<p>&ldquo;The completion of our full-scale fatigue test validates years of GA-ASI design and analysis efforts,&rdquo; says&nbsp;GA-ASI&nbsp;president David R. Alexander. &ldquo;The first two lifetimes simulated the operation of the aircraft under normal conditions, and the third intentionally inflicted damage to the airframe&rsquo;s critical components to demonstrate.&rdquo;</p>\n\n<p>Testing was conducted by NIAR&rsquo;s Full-Scale Structural Test Lab located at NIAR&rsquo;s Aircraft Structural Test and Evaluation Center in Park City, Kansas.</p>\n\n<p>&ldquo;We are thrilled to wrap up this 3-year test program with General Atomics,&rdquo; adds Brandon Baier, director of NIAR&rsquo;s Full-Scale Structural Test Lab. &ldquo;The partnership between NIAR and GA-ASI test engineers was one of the most unique and impressive I have experienced. Both parties worked together consistently and seamlessly to keep the program on track.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/niar-wraps-up-structural-testing-for-mq-9b-aircraft"
      }
    ],
    "link": "https://www.compositesworld.com/news/niar-wraps-up-structural-testing-for-mq-9b-aircraft"
  },
  {
    "published": "Wed, 26 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      26,
      17,
      0,
      0,
      2,
      330,
      0
    ],
    "title": "Technology trailblazers recognized at ATI Aerospace Technology & Innovation Awards 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Technology trailblazers recognized at ATI Aerospace Technology & Innovation Awards 2025"
    },
    "summary": "Awards for Airbus, Darvick, GKN Aerospace, iCOMAT, Safran Electrical and Power and Sora Aviation highlight work that is shaping net-zero aviation in the U.K.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Awards for Airbus, Darvick, GKN Aerospace, iCOMAT, Safran Electrical and Power and Sora Aviation highlight work that is shaping net-zero aviation in the U.K."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ati2025-awards.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ATI awards for 2025.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ati2025-awards.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | Aerospace Technology Institute (ATI)</p>\n</div>\n\n<p>Six pioneering organizations and research projects in U.K. aerospace have been celebrated in the third annual Aerospace Technology &amp; Innovation Awards, hosted by the <a href=\"https://www.ati.org.uk/\" target=\"_blank\">Aerospace Technology Institute</a> (ATI, Cranfield, U.K.). The awards spotlight innovation, collaboration and progress toward net-zero aviation, with categories that recognize startups, impactful R&amp;D and the ATI Project of the Year.</p>\n\n<p>The 2025 winners are:</p>\n\n<ul>\n\t<li>Innovation Award&nbsp;for the most exciting emerging technology &ndash;&nbsp;<strong><a href=\"https://www.compositesworld.com/suppliers/icomat\" target=\"_blank\">iCOMAT</a></strong></li>\n\t<li>Shaping the Future Award for advancing zero-carbon emission flight &ndash;<a href=\"https://www.airbus.com/en\" target=\"_blank\"><strong>Airbus</strong></a></li>\n\t<li>Making the Difference Award for most impactful small R&amp;D project &ndash;<a href=\"https://www.soraaviation.com/\" target=\"_blank\"><strong>Sora Aviation</strong></a></li>\n\t<li>ATI Hub Breakthrough Award&nbsp;for most promising startup &ndash;&nbsp;<strong>Darvick</strong></li>\n\t<li>Team Award&nbsp;for successful collaboration and partnership &ndash; The AeroMC team led by&nbsp;<a href=\"https://www.safran-group.com/companies/safran-electrical-power\" target=\"_blank\"><strong>Safran Electrical and Power</strong></a></li>\n\t<li>ATI Project of the Year &ndash;&nbsp;<strong><a href=\"https://www.compositesworld.com/suppliers/gkn-fokker-aerospace\" target=\"_blank\">GKN Aerospace</a></strong>&nbsp;for the ELCAT project.</li>\n</ul>\n\n<p>The winners were announced in front of 450 delegates during the 2-day ATI Conference 2025, held at the ICC Wales in Newport from Nov. 4-5.</p>\n\n<p>&ldquo;This is the third edition of our awards and we were overwhelmed by the quality of the applications again this year,&rdquo; says&nbsp;Sophie Lane, chief relationships officer of ATI. &ldquo;Our winners tell us that the awards really do matter, and that the spotlight on their project or company has helped them to attract partners and funding. I would like to congratulate the six winners, as well as the many Highly Commended entries, and look forward to seeing how their innovations, technologies and collaborations make an impact on the global aerospace sector.&rdquo;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-ATI2025-event.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-ATI2025-event.jpg;maxWidth=720\" /> </a></div>\n\n\n</div>\n\n<h3>Innovation Award &ndash;<strong>&nbsp;iCOMAT</strong></h3>\n\n<p>ICOMAT has commercialised and patented the Rapid Tow Shearing (RTS) process, which is an automated composites manufacturing technology that can place wide composite tapes along curved paths without defects. In addition to lightweighting and performance benefits, the automation of the RTS process facilitates high-rate production, meeting the demands of traditional aerospace as well as fast-growing sectors such as eVTOL aircraft.</p>\n\n<p>The judging panel felt that this innovation has very high impact potential, significantly enhancing the U.K. aerospace sector by revolutionizing the design and manufacture of composite components.&nbsp;<em>Read:&nbsp;<a href=\"https://www.compositesworld.com/articles/industrializing-rapid-tape-shearing-for-high-rate-3d-composite-structures\">Industrializing rapid tape shearing for high-rate, 3D composite structures</a>.</em></p>\n\n<p>The judges awarded Highly Commended to:</p>\n\n<ul>\n\t<li>ITP Aero, and its partners the Manufacturing Technology Centre and University of Nottingham, for a laser beam welding solution that takes an innovative approach compared to traditional joining methods.</li>\n\t<li>TT Electronics, for its Altitude DC high-voltage power conversion solution that reduces development time and cost, allows faster iterations, simplifies integration&nbsp;and accelerates qualification.</li>\n</ul>\n\n<h3>Shaping the Future Award &ndash;&nbsp;<strong>Airbus</strong></h3>\n\n<p>The ZEST1 project led by Airbus explored fuel cell-compatible hydrogen storage and distribution solutions. It tackled several technical challenges, including integration, the ability to adapt disruptive technologies to aeronautical standards and the development of different aircraft architectures.</p>\n\n<p>The judges noted that ZEST1 has made good progress to cement the foundations for zero-emission hydrogen&nbsp;flight technology at aircraft system level. It is a technology development that not only matures technology in liquid hydrogen aviation but also provides infrastructure to support future technology work by Airbus and others.</p>\n\n<p>The judges awarded Highly Commended to:</p>\n\n<ul>\n\t<li>The AeroMC project from Safran Electrical and Power, which developed a Factory of the Future in Pitstone with a pilot line to prove out high-volume production of electric motors.</li>\n</ul>\n\n<h3>Making the Difference Award &ndash;&nbsp;<strong>Sora Aviation</strong></h3>\n\n<p>High computational costs currently limit early design access to only the largest firms, creating barriers for SMEs and slowing innovation. The SoraAero project overcomes this with an AI tool that rapidly generates and evaluates preliminary designs. By reducing reliance on high-fidelity CFD and wind tunnel testing, the Sora Aviation solution could accelerate market entry by up to 24 months.</p>\n\n<p>The judging panel noted how Sora is already applying early toolchain outputs to its design process, providing valuable validation of design choices and enabling engineers to identify implications early and avoid costly late-stage redesigns. Judges also noted how Sora&rsquo;s work to develop a 30-seat eVTOL has attracted significant foreign investment into the U.K. and has directly created and sustained high-value engineering roles across the company and its partners.</p>\n\n<h3>ATI Hub Breakthrough Award &ndash;&nbsp;<strong>Darvick</strong></h3>\n\n<p>There is currently a shortage of facilities that can replicate the extreme environments required for validating equipment for cryogenic aircraft. Darvick is developing advanced material testing capability for mechanical validation in harsh environments and extreme temperatures.</p>\n\n<p>The judging panel agreed that Darvick is addressing a critical gap and showing strong innovation in creating a unique test capability that is fundamental to understanding how materials behave with exposure to hydrogen.</p>\n\n<p>The judges awarded Highly Commended to:</p>\n\n<ul>\n\t<li>MatNex for its AI-driven material discovery, combining machine learning, high-performance computing&nbsp;and rapid lab validation.</li>\n\t<li>The Metralis system by K3Metrology, a large-volume measurement system for aerospace and manufacturing.</li>\n</ul>\n\n<h3>Team Award &ndash; The AeroMC team led by&nbsp;<strong>Safran Electrical and Power</strong></h3>\n\n<p>The AeroMC project, led by Safran Electrical and Power with partners the Manufacturing Technology Centre and WMG, was created to design a Factory Of The Future and implement the first building block: a semi-automated pilot line at Safran Electrical and Power Pitstone. The team has successfully completed a series of project phases and workshops to ensure that the pilot line is suitable for current and future manufacturing needs.</p>\n\n<p>The judges noted that the ways of working have been so successful that the partners are now collaborating on a new project, retaining the same team members, as well as looking to implement wider benefits across Safran UK.</p>\n\n<p>The judges awarded Highly Commended to:</p>\n\n<ul>\n\t<li>The team from Airbus and Dassault Syst&egrave;mes that collaborated on the Smarter Testing project, which developed some methods for combining virtual testing with physical validation tests.</li>\n\t<li>The Green Aviation Insights (GAIN) team led by NATS for taking a shared challenge across five countries and implementing an operation tool within a year.</li>\n</ul>\n\n<h3>ATI Project of the Year &ndash;&nbsp;<strong>GKN Aerospace</strong>&nbsp;(ELCAT)</h3>\n\n<p>The ELCAT project brought together GKN Aerospace and U.K. universities to transform aerospace assembly through advanced automation, digitalization and collaborative innovation. Early exploitation of automated solutions developed under ELCAT have already achieved direct measurable savings within GKN Aerospace manufacturing facilities in the U.K.</p>\n\n<p>The judges agreed that ELCAT is a project that directly supports the aerospace industry&rsquo;s journey to net zero by rethinking how advanced manufacturing systems are designed, deployed&nbsp;and used.</p>\n\n<p>The judges awarded Highly Commended to:</p>\n\n<ul>\n\t<li>The REINSTATE project led by Rolls-Royce, which developed engine health monitoring sensing, in situ maintenance and inspection, adaptive repair and digital life cycle engineering techniques;</li>\n\t<li>The CONVERGENCE project of Moog Controls, which integrated digital twin technology, advanced automation and real-time analytics into a high-precision production line;</li>\n\t<li>Honeywell Aerospace&rsquo;s ECLAIR project, which set out to reduce the environmental footprint of aircraft through improved air management technologies.</li>\n</ul>\n\n<p>Meet the winners of this year&rsquo;s Aerospace Technology &amp; Innovation Award winners announced at ATI Conference 2025 <a href=\"https://www.youtube.com/playlist?list=PLoSOpTAwAbVQCGIQnsgDbHbNm2Xy2_A_U\" target=\"_blank\">through ATI&rsquo;s Youtube channel</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/technology-trailblazers-recognized-at-ati-aerospace-technology-innovation-awards-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/technology-trailblazers-recognized-at-ati-aerospace-technology-innovation-awards-2025"
  },
  {
    "published": "Wed, 26 Nov 2025 11:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      26,
      16,
      0,
      0,
      2,
      330,
      0
    ],
    "title": "Dream Chaser spaceplane completes critical pre-flight milestones",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Dream Chaser spaceplane completes critical pre-flight milestones"
    },
    "summary": "High-speed tow trials, EMI checks and command link verification have advanced the reusable aircraft program&nbsp;toward its first runway landing in 2026.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "High-speed tow trials, EMI checks and command link verification have advanced the reusable aircraft program&nbsp;toward its first runway landing in 2026."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-sierraspace-chaser-drive.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Spaceplane being towed by a truck.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-sierraspace-chaser-drive.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | Sierra Space</p>\n</div>\n\n<p>Defense tech company <a href=\"https://www.sierraspace.com/\" target=\"_blank\">Sierra Space</a>&rsquo;s (Louisville, Colo., U.S.) <a href=\"https://www.compositesworld.com/news/ornl-sierra-space-create-novel-csic-tps-for-reusable-space-vehicles\" target=\"_blank\">composites-intensive</a> <em>Dream Chaser</em> spaceplane&nbsp;has successfully completed a series of critical pre-flight tests at NASA&rsquo;s Kennedy Space Center (KSC), marking continued progress toward the aircraft&rsquo;s&nbsp;first free-flyer mission.</p>\n\n<p>As part of its comprehensive testing campaign, <em>Dream Chaser</em> underwent electromagnetic interference and electromagnetic compatibility (EMI/EMC) testing at NASA&rsquo;s Space Systems Processing Facility (SSPF). These tests verified the spacecraft&rsquo;s ability to operate within expected electromagnetic environments throughout various missions.</p>\n\n<p>The spacecraft also completed rigorous tow testing at KSC and Space Florida&rsquo;s Launch and Landing Facility. For this phase, a Freightliner <em>Cascadia</em> truck, provided by Daimler Truck North America (Portland, Ore., U.S.), towed the spaceplane at high speeds to simulate critical dynamics and validate autonomous navigational parameters during runway landing operations.</p>\n\n<p>Additionally, <em>Dream Chaser</em> successfully demonstrated the ability to receive telemetry and distribute commands between the spacecraft and Mission Control in Louisville, Colorado, over NASA&rsquo;s Tracking and Data Relay Satellite System network.&nbsp;This key milestone tested the spacecraft&rsquo;s readiness for real-time command and control during flight operations.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-sierraspace-nasa.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-sierraspace-nasa.jpg;maxWidth=720\" /> </a></div>\n</div>\n\n<p>The testing campaign concluded with a post-landing recovery rehearsal, which demonstrated the &ldquo;safing&rdquo; of vehicle systems and timely access to sensitive payloads.</p>\n\n<p>Sierra Space expects <em>Dream Chaser </em>to move to its final round of acoustic testing in December 2025. Following this, modifications for national security applications will be explored and performed in Colorado. These enhancements will aim to expand Dream Chaser&rsquo;s versatility and demonstrate its ability to fulfill a wide array of mission requirements.</p>\n\n<p><em>Dream Chaser</em> is on track for its first launch to low Earth orbit, targeted in Q4 of 2026, through a demonstration mission under the CRS-2 contract with a runway landing at Vandenberg Space Force Base.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dream-chaser-spaceplane-completes-critical-pre-flight-milestones"
      }
    ],
    "link": "https://www.compositesworld.com/news/dream-chaser-spaceplane-completes-critical-pre-flight-milestones"
  },
  {
    "published": "Wed, 26 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      26,
      15,
      0,
      0,
      2,
      330,
      0
    ],
    "title": "Matlantis report indicates AI turning point for materials science",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Matlantis report indicates AI turning point for materials science"
    },
    "summary": "Industry report, based on a survey of 300 U.S. researchers, finds materials and engineering R&amp;D&nbsp;at an AI inflection point, signaling an urgent need for faster, trusted tools.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Industry report, based on a survey of 300 U.S. researchers, finds materials and engineering R&amp;D&nbsp;at an AI inflection point, signaling an urgent need for faster, trusted tools."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-matlantis-gen-materials.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Chemistry.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-matlantis-gen-materials.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Matlantis Inc.</p>\n</div>\n\n<p><a href=\"https://matlantis.com/en/\" target=\"_blank\">Matlantis Inc.</a>&nbsp;(Cambridge, Mass., U.S.),&nbsp;the U.S. hub of the materials discovery arm of Japan&rsquo;s AI company<a href=\"https://www.preferred.jp/en/\" target=\"_blank\">&nbsp;Preferred Networks&nbsp;Inc.</a>&nbsp;(PFN, Tokyo), has announced the release of a research report titled <em>&ldquo;</em><a href=\"https://matlantis.com/en/resources/useful/accelerating-discovery-ai-trends-in-materials-rd/\" target=\"_blank\">The State of AI‑Accelerated Materials R&amp;D</a><em>&rdquo;</em>&nbsp;that is based on a survey of 300 materials science and engineering professionals across the U.S. The report reveals an inflection point: Materials R&amp;D has entered its mainstream AI era, with nearly half (46%) of all simulation workloads now running on AI or machine learning methods.</p>\n\n<p>Yet this acceleration comes with significant growing pains. An overwhelming 94% of R&amp;D teams reported abandoning at least one project in the past year because the simulations ran out of time or computing resources, leaving potential discoveries unrealized. The findings underscore the industry&rsquo;s urgent need for faster simulation capabilities to keep pace with surging innovation demands.</p>\n\n<p>At the same time, the economic stakes for accelerating R&amp;D have never been clearer. According to the survey, organizations are saving roughly $100,000 per project on average by leveraging computational simulation in place of purely physical experiments. This proven ROI is driving heavy investment in new tools and workflows. Researchers are also eager to speed up their work even if it means accepting minor trade-offs in precision &mdash; 73% of respondents said they would trade a small amount of accuracy for a 100-times increase in simulation speed.</p>\n\n<p>&ldquo;This is the quiet crisis of modern R&amp;D: the experiments that never happen,&rdquo; says&nbsp;Daisuke Okanohara, CEO of Matlantis. &ldquo;Our study shows nearly every materials research team has had to leave promising projects on the shelf, not for lack of ideas, but because their tools couldn&rsquo;t keep up. It&rsquo;s a stark wake-up call that traditional trial-and-error methods are too slow and costly for today&rsquo;s pace of innovation. We&rsquo;re at a turning point where the industry must embrace faster, smarter approaches to ensure crucial discoveries don&rsquo;t get left behind.&rdquo;</p>\n\n<p>The report also highlights that trust and security remain paramount. Every team surveyed expressed concerns about protecting intellectual property when using external or cloud-based tools, and only 14% felt &ldquo;very confident&rdquo; in the accuracy of AI-driven simulations. In sum, materials scientists are hungry for speed and efficiency, but solutions must also earn their confidence.</p>\n\n<p>For Matlantis, the survey&rsquo;s findings validate the urgency of its mission. The company&rsquo;s <a href=\"https://www.compositesworld.com/news/matlantis-upgrades-universal-atomistic-simulator-for-materials-discovery-opens-dedicated-us-office\" target=\"_blank\">cloud-native Matlantis platform </a>was built to accelerate materials discovery through AI-accelerated, high-speed simulations without compromising on scientific fidelity or data security. By integrating advanced neural-network potentials with proven physics, Matlantis enables researchers to iterate rapidly while maintaining confidence in the results.&nbsp;</p>\n\n<p>&ldquo;At Matlantis, we anticipated this inflection point and designed our platform to deliver acceleration and efficiency without sacrificing accuracy or security,&rdquo; Okanohara says. &ldquo;Our AI technology lets scientists run high-fidelity simulations in hours instead of months, with the assurance that those results can be trusted. As R&amp;D teams race to develop sustainable batteries, catalysts, semiconductors and more, Matlantis is here to ensure they can carry those projects through to breakthrough results rather than abandoning them mid-stream.&rdquo;</p>\n\n<p>The full findings and analysis are detailed in the&nbsp;report, which is available for download on&nbsp;<a href=\"https://www.globenewswire.com/Tracker?data=qb_kKsnXXcOHkE-AmebBYWkJO6q9dvUqoYVh-Ecv1F-dly1Hw8yFHhiwPbEfxxpszdhYxJ5SKeA7KDixEaxdsBDFRRD1eRsW2GQh4n2yf0mvLCgHJcK3sBNlgABUmr5huFFTOXl7fzTPiVxjtqI2OinMBQJkIovH1-jJ4_S5mD9ZhNDZjvI-hF5jTWHTtVvu\" rel=\"nofollow\" target=\"_blank\" title=\"\">Matlantis&rsquo;&nbsp;website</a>.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/matlantis-report-indicates-ai-turning-point-for-materials-science"
      }
    ],
    "link": "https://www.compositesworld.com/news/matlantis-report-indicates-ai-turning-point-for-materials-science"
  },
  {
    "published": "Tue, 25 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      25,
      17,
      0,
      0,
      1,
      329,
      0
    ],
    "title": "FIDAMC hosts Aerospace Thermoplastics International Summit in Madrid",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FIDAMC hosts Aerospace Thermoplastics International Summit in Madrid"
    },
    "summary": "Leading representatives from aerospace industry, public institutions, technology centers and universities discussed the challenges and opportunities that will shape future airframes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Leading representatives from aerospace industry, public institutions, technology centers and universities discussed the challenges and opportunities that will shape future airframes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-fidamc-tpc-summit.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerospace International Thermoplastics Summit at FIDAMC in October 2025\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-fidamc-tpc-summit.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | FIDAMC</p>\n</div>\n\n<p>Sustainability and production rate were the two main themes that emerged from the <a href=\"https://fidamc.es/en/summit/\" target=\"_blank\">Aerospace International Thermoplastics Summit</a> hosted by <a href=\"https://www.compositesworld.com/search?q=FIDAMC\" target=\"_blank\">FIDAMC</a> (Foundation for Research, Development and Application of Composite Materials) in Madrid, Spain&nbsp;on Oct. 30, 2025. The meeting also discussed planning by FIDAMC and its partners for the Thermoplastic Composites Development Centre being constructed in Cadiz, Spain.</p>\n\n<p>The 1-day summit, conceived as a space for strategic and technical exchange, attracted more than&nbsp;100 participants, mainly from Europe. It was <a href=\"https://fidamc.es/en/ernesto-gonzalez-ceo-de-fidamc-el-siguiente-salto-tecnologico-pertenece-a-los-termoplasticos/\" target=\"_blank\">opened by Ernesto Gonz&aacute;lez Dur&aacute;n</a>, CEO of FIDAMC, who stressed that &ldquo;we are living in times of profound transformation in the aviation sector.&rdquo;&nbsp;This was followed by a <a href=\"https://fidamc.es/en/innovacion-y-sostenibilidad-ricardo-rojas-airbus-inaugura-el-aerospace-thermoplastics-international-summit/\" target=\"_blank\">keynote presentation from Ricardo Rojas</a>, president of Commercial Aircraft at Airbus Spain, and six panel discussions on specific topics (see below).</p>\n\n<h3>Airbus Spain sees&nbsp;need for new TPC</h3>\n\n<p>Riojas highlighted the strength of the aeronautical sector and Spain&rsquo;s key role in its growth. &ldquo;Airbus anticipates the need for more than 43,000 aircraft in the next 20 years,&rdquo; he said, &ldquo;which will require increased production and addressing challenges in the supply chain, talent&nbsp;and innovation.&rdquo; Riojas&nbsp;then highlighted the importance of investment in R&amp;D, digitalization and&nbsp;new thermoplastic composite (TPC) materials. He also acknowledged FIDAMC&rsquo;s role as a &ldquo;bridge between research and industry&rdquo;&nbsp;for developing the technologies that will shape the next decade.</p>\n\n<h3>Round table 1 &ndash;&nbsp;<a href=\"https://fidamc.es/en/claves-de-la-estrategia-aeroespacial-y-oportunidades-de-financiacion/\" target=\"_blank\">Aerospace strategy and funding</a></h3>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<blockquote>\n<p>&ldquo;Aerospace&nbsp;is undergoing global expansion, driven by the need for technological sovereignty and sustainability.&rdquo;</p>\n</blockquote>\n</div>\n\n<p>This panel<strong>&nbsp;</strong>included Juan Francisco Reyes (CDTI &ndash; Horizon Europe NCP), Jos&eacute; Javier Mart&iacute;n Ca&ntilde;izares (regional government of Andalusia), Jaume Marcos (president of PAE) and H&eacute;ctor Guerrero (Ministry of Science, Innovation and Universities &ndash; PERTE Aerospace).</p>\n\n<p>They agreed that aerospace is undergoing global expansion, driven by the need for technological sovereignty and sustainability.&nbsp;Spain is supporting technology developments through various initiatives:</p>\n\n<ul>\n\t<li><strong>National:</strong>&nbsp;PERTE Aerospace&rsquo;s investment of&nbsp;more than &euro;2.8 billion&nbsp;and the future Alliance for Spanish Aerospace, aimed at strengthening public-private collaboration.</li>\n\t<li><strong>Regional:</strong> Andalusia Aerospace Strategy&rsquo;s&nbsp;investment of&nbsp;&euro;574 million until 2027&nbsp;and creation of the Net Zero Jerez Aeronautical Hub for sustainable aviation in Jerez.</li>\n\t<li><strong>Europe:</strong> Clean Aviation and CESAR programs.</li>\n</ul>\n\n<h3>Round table 2 &ndash;&nbsp;<a href=\"https://fidamc.es/en/desafios-futuros-para-los-fabricantes-de-equipos-originales-oem-vision-desde-airbus-boeing-e-itp-aero/\" target=\"_blank\">Future challenges for OEMs</a></h3>\n\n<p>This&nbsp;panel&nbsp;discussed the main market drivers and included Susana Carballo (Airbus), Carlos Bello (Boeing)&nbsp;and Jos&eacute; Francisco Beltr&aacute;n Par&iacute;s (ITP Aero). The speakers highlighted sustainability and production rate as the two main needs to support the large quantity of composites-intensive commercial that will be required. The OEMs saw that TPC&nbsp;addressed these needs through recyclability, and increased production rates, via stamping, in situ consolidation&nbsp;and welded assembly. Defense and space applications also had to consider cybersecurity and cost reduction in space systems.</p>\n\n<h3><strong>Round table 3 &ndash; <a href=\"https://fidamc.es/en/el-reto-de-la-industrializacion-de-los-materiales-termoplasticos/\" target=\"_blank\">Challenges to industrialize thermoplastic composites</a></strong></h3>\n\n<p>This was led by experts from Tier 1 fabricators: Enrique S&aacute;nchez (Aernnova Composites), Ra&uacute;l Arranz (Aciturri) and Salvador Romero (GKN Fokker). They agreed that TPC offer advantages in repairability, recyclability&nbsp;and weight reduction, but still require investment in equipment and training to achieve the necessary production scale. Areas with high potential benefit, but which still need to be matured, include automated fiber placement (AFP), welding and variable-thickness parts.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Watch the videos for all of the session <a href=\"https://www.youtube.com/playlist?list=PLWEZrR64Cahep8m0ushqoX7qvMJaSrP-b\" target=\"_blank\">here</a>.</h3>\n</div>\n</div>\n\n<p>The discussion highlighted the challenge that fabricators will only make investments to industrialize these technologies if OEMs make commitments to use TPC, but these commitments will only happen if production readiness is demonstrated. Collaboration between manufacturers, technology centers&nbsp;and OEMs is needed to accelerate industrial adoption.</p>\n\n<h3><strong>Round table 4&nbsp;&ndash; <a href=\"https://fidamc.es/en/innovacion-en-equipos-la-industria-del-termoplastico-da-pasos-hacia-el-futuro/\" target=\"_blank\">Innovation in equipment</a></strong></h3>\n\n<p>The discussion included&nbsp;I&ntilde;igo Idareta (Mtorres), Andr&eacute; Bertin (Coexpair Dynamics), Maarten Bach (KVE), Mael Farinas (Coriolis) and Marcus Kremers (Airborne), and was moderated by F&eacute;lix Dom&iacute;nguez (FIDAMC)&nbsp;&mdash; all companies&nbsp;focused on providing solutions for high-rate, automated and consistent manufacture.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<blockquote>\n<p>&ldquo;Definition of process standards is needed for more agile certification, including transition from approving specific parts to approving processes for more rapid adoption.&rdquo;</p>\n</blockquote>\n</div>\n\n<p>They agreed advances in automation, digitalization and in situ&nbsp;consolidation are transforming TPC&nbsp;parts production, but also stressed the need&nbsp;for&nbsp;more robust, modular and efficient equipment capable of matching the speeds of thermoset processes. Collaboration between equipment developers, OEMs and certification authorities is needed, as well as definition of process standards to enable&nbsp;more agile certification, including&nbsp;transition from approving specific parts to approving processes for&nbsp;more rapid adoption of the manufacturing methods.</p>\n\n<h3><strong>Round table 5&nbsp;&ndash;&nbsp;</strong><a href=\"https://fidamc.es/en/desafios-y-oportunidades-de-la-innovacion-en-materiales-termoplasticos/\"><strong>Innovation in materials</strong></a></h3>\n\n<p>Nathalie Schmitz (Hexcel), Mark Bouwman (Toray)&nbsp;and Johannes Treiber (Syensqo) represented material suppliers and cited standardization&nbsp;as a key area, noting&nbsp;the industry will benefit from economies of scale as TPC use increases.&nbsp;They highlighted the potential for recyclability, improved durability and reduction of overall production costs, noting the role of technology centers as agents of knowledge transfer between research and industry. They also advocated&nbsp;greater harmonization of certifications and processes in Europe in order to accelerate industrial adoption.</p>\n\n<h3>Round table 6 &ndash;&nbsp;<strong><a href=\"https://fidamc.es/en/ecosistema-global-de-investigacion-colaboracion-y-alineacion-para-el-futuro-de-los-termoplasticos/\" target=\"_blank\">Global research ecosystem</a></strong></h3>\n\n<p>The final session&nbsp;featured&nbsp;David Leach (Composite Material Solutions), Rens Pierik (TPRC)&nbsp;and Isabel Mart&iacute;n (FIDAMC), who agreed that collaborative development centers can provide benefits of sharing production scale equipment, reducing risk and enabling&nbsp;a wider range of organizations in the supply chain to participate. They also discussed the need to align European technology agendas and promote closer cooperation between centers of excellence to share infrastructure, data and methodologies. The next decade will be decisive for consolidating an international yet coordinated TPC ecosystem</p>\n\n<h2>TPC parts are reality, progress via community</h2>\n\n<p>In his concluding comments, FIDAMC CEO Dur&aacute;n said that&nbsp;TPC parts are&nbsp;no longer a promise, &ldquo;they are a reality in motion,&rdquo;&nbsp;emphasizing they&nbsp;are lighter, more efficient and more sustainable. The&nbsp;hub&nbsp;in Cadiz, he noted, will&nbsp;move TPC&nbsp;development from TRL 3 to 6, and&nbsp;will not duplicate efforts but rather complement existing capabilities in Europe and around the world.&nbsp;</p>\n\n<p>&ldquo;Progress is not measured by the speed of technology, but by the strength of the community behind it,&rdquo; he concluded, reiterating this&nbsp;is the best way to address the exponential change that can be achieved for TPC and future aviation.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fidamc-hosts-aerospace-thermoplastics-international-summit-in-madrid"
      }
    ],
    "link": "https://www.compositesworld.com/news/fidamc-hosts-aerospace-thermoplastics-international-summit-in-madrid"
  },
  {
    "published": "Tue, 25 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      25,
      15,
      0,
      0,
      1,
      329,
      0
    ],
    "title": "HRC supports Range Aviation’s LEU100 eVTOL in advancing future low-altitude logistics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "HRC supports Range Aviation’s LEU100 eVTOL in advancing future low-altitude logistics"
    },
    "summary": "HRC completed a composite design and manufacturing project with Range Aviation, supplying materials, engineering, manufacturing support and comprehensive compliance checks.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "HRC completed a composite design and manufacturing project with Range Aviation, supplying materials, engineering, manufacturing support and comprehensive compliance checks."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-HRC-LEU100-eVTOL.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Flight testing the LEU100.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-HRC-LEU100-eVTOL.jpg;maxWidth=720\" /> </a></div>\n\n<p>Low-logistics&nbsp;LEU100 eVTOL aircraft has begun flight testing. Source | HRC</p>\n</div>\n\n<p>Low-altitude logistics is rapidly emerging as a key driver of next-gen transportation systems,&nbsp;supported by ongoing policy developments and accelerated advancements in composite materials, aviation engineering&nbsp;and autonomous flight technologies. Within this evolving&nbsp;landscape, composites companies like&nbsp;<a href=\"https://www.compositesworld.com/suppliers/hrc\" target=\"_blank\">HRC</a>&nbsp;(Jiangshu, China) are supporting the development of eVTOL aircraft applications like the&nbsp;LEU100. Developed by&nbsp;<a href=\"https://www.rangeaviation.com/\" target=\"_blank\">Range Aviation</a> (Hefei, China), the logistics&nbsp;aircraft&rsquo;s preparation for real-world deployment has been guided&nbsp;by HRC&rsquo;s&nbsp;structural design, composites engineering and manufacturing support.</p>\n\n<p>With a maximum takeoff weight of 140 kilograms, a range of 200 kilometers, cruising speed of 120 kilometers/hour&nbsp;and a 55-kilogram&nbsp;payload capacity, the LEU100 is engineered for high-demand missions including logistics transport, medical rescue, emergency response&nbsp;and remote sensing. Its performance profile positions it as a medium-sized logistics eVTOL platform&nbsp;advancing toward commercialization.</p>\n\n<p>HRC contributed across the entire composite airframe development chain &mdash; from conceptual structural layouts and material development to engineering simulation, precision composite molding, final assembly support&nbsp;and compliance verification. The fuselage uses a carbon fiber composite foam sandwich structure, delivering significant weight reduction while ensuring stiffness and in-service durability. Quick-assembly interfaces at the wing fuselage and vertical tail fuselage connections further enhance transportability and final assembly efficiency. Additional components &mdash; including the nose cone, cabin doors&nbsp;and battery access covers &mdash; were engineered for optimized accessibility and streamlined maintenance.</p>\n\n<p>As part of its engineering role, HRC conducted comprehensive manufacturing compliance checks, ensuring all composite structures and processes met stringent airworthiness and customer requirements. The aircraft&rsquo;s type certificate (TC) application was accepted by the Civil Aviation Administration of China (CAAC) in August 2024, with the first development aircraft completing system tests, ground tests, protected and unprotected flight tests, and full-process transition flights.</p>\n\n<p>The LEU100 was displayed at the 8<sup>th</sup> China International Import Expo (CIIE) in early November 2025, showcased at the HRC booth. Its engineering quality, structural innovations and potential to accelerate the low-altitude logistics ecosystem attracted strong interest from industry stakeholders and visitors.</p>\n\n<p>As the low-altitude economy accelerates globally, HRC has established itself as a partner capable of integrating R&amp;D, design and&nbsp;engineering, composite manufacturing&nbsp;and final assembly within one unified platform. The company continues to collaborate with OEMs including Xpeng, Aeroht, Aerofugia, Aeroone, Yitong&nbsp;UAV, Xi&rsquo;an Aircraft Co., Air White Whale&nbsp;and Range Aviation, contributing to multiple next-gen aircraft programs.</p>\n\n<p>Looking ahead, HRC will continue advancing its composite engineering capabilities to support the commercialization of innovative low-altitude platforms.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hrc-supports-range-aviations-leu100-evtol-in-advancing-future-low-altitude-logistics"
      }
    ],
    "link": "https://www.compositesworld.com/news/hrc-supports-range-aviations-leu100-evtol-in-advancing-future-low-altitude-logistics"
  },
  {
    "published": "Mon, 24 Nov 2025 14:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      19,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "Airborne enters project with Lockheed Martin on next-gen composites automation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airborne enters project with Lockheed Martin on next-gen composites automation"
    },
    "summary": "Building on Airborne KBL and APP systems, partners will develop an automated&nbsp;laminating and kitting system to package complicated material types and shapes with more rapid aero production in mind.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Building on Airborne KBL and APP systems, partners will develop an automated&nbsp;laminating and kitting system to package complicated material types and shapes with more rapid aero production in mind."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/lmairborne.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airborne and Lockheed personnel posing at an event.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/lmairborne.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Airborne</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/airborne\" target=\"_blank\">Airborne</a> (The Hague, Netherlands) has been awarded a contract by&nbsp;<a href=\"https://www.lockheedmartin.com/en-us/index.html\" target=\"_blank\">Lockheed Martin</a>&nbsp;(Bethesda, Md., U.S.)&nbsp;under an Industrial Participation&nbsp;Program (IPP) on the development of enhanced composites automation systems. Under the project, titled &ldquo;Enhancing the digital thread for composites manufacturing,&rdquo; Lockheed Martin will share technical knowledge with Airborne to develop an automated laminating and kitting system to package complicated material types and shapes.</p>\n\n<p>The project, building on Airborne&rsquo;s advanced kit by light (KBL) and automated ply placement (APP) technologies, will advance smart material handling and intelligent automation in an aim to raise the benchmark for rapid aerospace production. It will also bring a new partner into the continued collaboration between Lockheed Martin and the Dutch industry.</p>\n\n<p>The project plans to enhance Airborne&rsquo;s already robust automation systems, focusing on higher production output, enhanced inspection systems, broader material compatibility&nbsp;and improved software integration. These developments will support the specific requirements of Lockheed Martin&rsquo;s business units.</p>\n\n<p>For more than 30 years, Airborne has played a leading role in the Dutch composites industry, initially as a manufacturer of composite parts and now as a developer of advanced automation systems for aerospace, defense, automotive and renewable energy markets.</p>\n\n<p>&ldquo;The Lockheed Martin‑Airborne collaboration will integrate smart material kit creation with advanced data‑driven automation for a flexible production system that enables the next-generation of aerospace fabrication,&rdquo; says&nbsp;Tara Thomasson, Lockheed Martin Technical Fellow.</p>\n\n<p>It further reinforces the importance of international collaboration and a strong IPP partnership. &ldquo;This project will be another successful win/win opportunity, giving Airborne the enhanced capabilities for their new kitting and laminating systems and Lockheed Martin will be able to procure these enhanced systems for our production lines,&rdquo; adds&nbsp;Joe Krapf, Lockheed Martin Industrial Participation country manager.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airborne-enters-project-with-lockheed-martin-on-next-gen-composites-automation"
      }
    ],
    "link": "https://www.compositesworld.com/news/airborne-enters-project-with-lockheed-martin-on-next-gen-composites-automation"
  },
  {
    "published": "Mon, 24 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      18,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "Gurit inaugurates Advanced Composites R&D Center in China",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Gurit inaugurates Advanced Composites R&D Center in China"
    },
    "summary": "To be fully operational by end of 2025, the center will drive the development of novel composite technologies including PET, complementing Gurit&rsquo;s existing global hubs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "To be fully operational by end of 2025, the center will drive the development of novel composite technologies including PET, complementing Gurit&rsquo;s existing global hubs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-gurit-compositesrdcenter-china-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-gurit-compositesrdcenter-china-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Gurit</p>\n</div>\n\n<p>On Nov. 17, <a href=\"https://www.compositesworld.com/suppliers/gurit-uk\" target=\"_blank\">Gurit</a>&nbsp;(Zurich, Switzerland)&nbsp;officially inaugurated its Advanced Composites Research &amp; Development Center in the Tianjin Economic-Technological Development Area (TEDA). The unveiling ceremony marks a significant milestone in Gurit&rsquo;s global strategy, strengthening its &ldquo;R&amp;D-to-production&rdquo; capabilities and reaffirming its long-term commitment to the Chinese market.</p>\n\n<p>Set to be fully operational by the end of 2025, the R&amp;D center will drive the development of next-generation, high-performance composite technologies. It complements Gurit&rsquo;s existing R&amp;D and composite testing hubs in the U.K., India&nbsp;and New Zealand, creating a more integrated global innovation network.</p>\n\n<p>The Tianjin center will focus primarily on the research, development, analysis&nbsp;and testing of PET materials. Its close proximity to Gurit&rsquo;s Tianjin PET manufacturing facility will streamline new product introduction, shorten development cycles&nbsp;and enable faster responses to innovation needs in the wind energy sector and beyond.</p>\n\n<p>During the inauguration, Gurit and TEDA representatives discussed opportunities to jointly build advanced industrial ecosystems and address key technological challenges, supporting the region&rsquo;s transition toward high-end, intelligent manufacturing.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gurit-inaugurates-advanced-composites-rd-center-in-china"
      }
    ],
    "link": "https://www.compositesworld.com/news/gurit-inaugurates-advanced-composites-rd-center-in-china"
  },
  {
    "published": "Mon, 24 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      18,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "ÉireComposites, ATG Europe brings composites expertise to LISA project",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ÉireComposites, ATG Europe brings composites expertise to LISA project"
    },
    "summary": "ESA-led project is developing a constellation of three satellites&nbsp;to detect gravitational waves and provide&nbsp;insight into the origins of the universe.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ESA-led project is developing a constellation of three satellites&nbsp;to detect gravitational waves and provide&nbsp;insight into the origins of the universe."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-eirecomposites-atg-lisa-satellite.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-eirecomposites-atg-lisa-satellite.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | &Eacute;ireComposites</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/eirecomposites-teo-irish-composites\" target=\"_blank\">&Eacute;ireComposites Teo</a> (Galway, Ireland) and <a href=\"https://www.atg-europe.com\" target=\"_blank\">ATG Europe Ltd.</a> (Noordwijk, Netherlands) have announced a key role in&nbsp;Laser Interferometer Space Antenna (LISA), a mission led by the&nbsp;European Space Agency (ESA) in collaboration with NASA&nbsp;to develop the largest observatory ever built.</p>\n\n<p>LISA&nbsp;consists of three satellites in a triangular formation, each 2.5 million kilometers apart.&nbsp;Each satellite will emit a laser toward&nbsp;the other two and measure tiny changes in the distance between satellites via the detection of gravitational waves &mdash;&nbsp;formed by extreme cosmic events such as the merger of black holes that&nbsp;create ripples in the fabric of space-time.</p>\n\n<p>Despite the enormous distance between the satellites (six times the distance from the Earth to the Moon), the sophisticated optical instruments on board can pick up changes smaller than the size of a helium atom and hence detect gravitational waves. The results from the mission will shed light on what happens when black holes collide and provide insight into the origins of the universe&nbsp;immediately after the Big Bang.</p>\n\n<p>ATG will design the central tube (the chassis of the satellite) based on its patented lightweight, high-stiffness, grid-stiffened structural composite architecture, while &Eacute;ireComposites&nbsp;will manufacture and assemble the structure. This work will encompass everything from the manufacture of test components and structural assemblies to autoclave curing, bonding&nbsp;and precision machining. Detailed inspections will be carried out to make sure each part meets strict aerospace standards, using nondestructive testing and dimensional checks throughout the build. By combining advanced computational modeling, hands-on manufacturing&nbsp;and meticulous quality control, the partners will deliver reliable, high-performance composite structures that are central to the success of the LISA project.</p>\n\n<p>&ldquo;Nearly everything we know about the universe comes from telescopes,&rdquo; says Tomas Flanagan. &ldquo;LISA provides a completely different approach by focusing on gravitational waves instead of light. It&rsquo;s hard to believe that we&rsquo;ll be making structural carbon fiber&nbsp;components for the largest machine that humanity has ever built and that we will be seeking evidence to support Einstein&rsquo;s general theory of relativity.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/eirecomposites-atg-europe-brings-composites-expertise-to-lisa-project"
      }
    ],
    "link": "https://www.compositesworld.com/news/eirecomposites-atg-europe-brings-composites-expertise-to-lisa-project"
  }
]