[
  {
    "title": "Europe’s Metop-SGA1 Orbiting Weather Satellite Launched",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Europe’s Metop-SGA1 Orbiting Weather Satellite Launched"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/europes-metop-sga1-orbiting-weather-satellite-launched/"
      }
    ],
    "link": "https://acmanet.org/europes-metop-sga1-orbiting-weather-satellite-launched/",
    "comments": "https://acmanet.org/europes-metop-sga1-orbiting-weather-satellite-launched/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Fri, 22 Aug 2025 06:31:46 +0000",
    "published_parsed": [
      2025,
      8,
      22,
      6,
      31,
      46,
      4,
      234,
      0
    ],
    "tags": [
      {
        "term": "Aerospace",
        "scheme": null,
        "label": null
      },
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19581",
    "guidislink": false,
    "summary": "<p>Arianespace launched EUMETSAT&#8217;s Metop-SGA1 (Metop – Second Generation, 1), the first of a series of six polar-orbiting weather satellites, into orbit. EUMETSAT is the European operational satellite agency for monitoring [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/europes-metop-sga1-orbiting-weather-satellite-launched/\">Europe’s Metop-SGA1 Orbiting Weather Satellite Launched</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Arianespace launched EUMETSAT&#8217;s Metop-SGA1 (Metop – Second Generation, 1), the first of a series of six polar-orbiting weather satellites, into orbit. EUMETSAT is the European operational satellite agency for monitoring [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/europes-metop-sga1-orbiting-weather-satellite-launched/\">Europe’s Metop-SGA1 Orbiting Weather Satellite Launched</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Arianespace launched EUMETSAT&#8217;s Metop-SGA1 (Metop – Second Generation, 1), the first of a series of six polar-orbiting weather satellites, into orbit. EUMETSAT is the European operational satellite agency for monitoring weather, climate, and the environment from space. Beyond Gravity is delivering radio occultation instruments, providing important data for weather forecasts and climate monitoring to all six Airbus-built satellites. The Metop-SGA1 launched on the Ariane 6 rocket, featuring payload fairing from Beyond Gravity made of carbon fiber composite materials.</p>\n\n\n\n<p>The satellite structures are six-meters high, weigh around one ton, and are built of carbon fiber, aluminum, and titanium. Beyond Gravity provided thermal insulation for the weather satellite, protecting it from extreme temperature fluctuations of plus/minus two hundred degrees Celsius in space, and stabilizing the interior of the satellite at a constant room temperature to ensure safe functioning of the instruments on board.</p>\n\n\n\n<p>“This new European weather satellite, together with its five counterparts, will significantly enhance weather forecasting accuracy and climate change monitoring. A key element of this mission is our radio occultation instrument. Our so-called radio occultation instrument provides important weather data, for example about humidity and temperature, and underlines our capabilities as an important data provider,” said Oliver Grassmann, Executive Vice President Satellites at Beyond Gravity.</p>\n\n\n\n<p>Phil Evans, Director-General of EUMETSAT, added “Extreme weather has cost Europe hundreds of billions of euros and tens of thousands of lives over the past 40 years—storms like Boris, Daniel and Hans, record heatwaves and fierce wildfires are just the latest reminders. The launch of Metop-SGA1 is a major step forward in giving national weather services in our member states sharper tools to save lives, protect property, and build resilience against the climate crisis. These positive impacts will be felt even beyond that and over the Atlantic, as Metop-SGA1 is Europe&#8217;s first contribution to the Joint Polar System with NOAA. This milestone reflects years of teamwork across EUMETSAT, ESA, the EU, CNES, DLR, Airbus, Thales Alenia Space, and many others. This is the beginning of an exciting new chapter as we work to ensure the satellite settles into orbit and starts delivering the vital data it was built to provide.”</p>\n<p>The post <a href=\"https://acmanet.org/europes-metop-sga1-orbiting-weather-satellite-launched/\">Europe’s Metop-SGA1 Orbiting Weather Satellite Launched</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/europes-metop-sga1-orbiting-weather-satellite-launched/feed/",
    "slash_comments": "0"
  },
  {
    "title": "ACMA’s LCA+EPD Generator: A Smart Investment in Selling the Environmental Benefits of Composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ACMA’s LCA+EPD Generator: A Smart Investment in Selling the Environmental Benefits of Composites"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/acmas-lcaepd-generator-a-smart-investment-in-selling-the-environmental-benefits-of-composites/"
      }
    ],
    "link": "https://acmanet.org/acmas-lcaepd-generator-a-smart-investment-in-selling-the-environmental-benefits-of-composites/",
    "comments": "https://acmanet.org/acmas-lcaepd-generator-a-smart-investment-in-selling-the-environmental-benefits-of-composites/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 21:16:16 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      21,
      16,
      16,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Sustainability",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19576",
    "guidislink": false,
    "summary": "<p>The 2025 version of ACMA’s LCA+EPD Generator is now up and running, and it’s already reshaping how composite manufacturers approach sustainability documentation. Designed to prepare cradle-to-gate environmental product declarations (EPDs) [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/acmas-lcaepd-generator-a-smart-investment-in-selling-the-environmental-benefits-of-composites/\">ACMA’s LCA+EPD Generator: A Smart Investment in Selling the Environmental Benefits of Composites</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>The 2025 version of ACMA’s LCA+EPD Generator is now up and running, and it’s already reshaping how composite manufacturers approach sustainability documentation. Designed to prepare cradle-to-gate environmental product declarations (EPDs) [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/acmas-lcaepd-generator-a-smart-investment-in-selling-the-environmental-benefits-of-composites/\">ACMA’s LCA+EPD Generator: A Smart Investment in Selling the Environmental Benefits of Composites</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>The 2025 version of ACMA’s LCA+EPD Generator is now up and running, and it’s already reshaping how composite manufacturers approach sustainability documentation. Designed to prepare cradle-to-gate environmental product declarations (EPDs) for FRP composite construction products, the Generator delivers more reliable results, at a fraction of the cost – $10,000 for ACMA members and $15,000 for non-members (pricing subject to change) – and in a fraction of the time compared to traditional methods.</p>\n\n\n\n<p>Beyond construction products, the Generator is expanding to support a wide range of applications. Cradle-to-grave lifecycle assessments, EPDs for non-construction products and those governed by existing product category rules (PCRs) – such as utility poles – can all be generated through this tool. This broad usefulness is exactly why ACMA’s Composites Growth Initiative (CGI) Fund invested in its development: it provides value across the industry and opens the door to new markets and sustainability-driven procurement programs.</p>\n\n\n\n<p>A key strength of the Generator is the extensive pre-verified life cycle inventory (LCI) – a robust database of climate and environmental impacts for raw materials commonly used in FRP composites. Developed in partnership with Trinity Consultants, this dataset allows manufacturers to produce consistent, accurate LCA calculations even when gaps in primary data exist. Without it, consultants must independently locate and verify data – a process that can be both costly and time-consuming, with questionable alignment to actual composite inputs.</p>\n\n\n\n<p>To further streamline the process, the Generator features digitized data entry forms that guide manufacturers through the submission of raw material, transportation and process data. This structure improves the reliability of submitted information while reducing both preparation costs and turnaround time.</p>\n\n\n\n<p>ACMA’s strategic collaboration with SmartEPD (a digital EPD program operator) and Trinity Consultants (a leader in life cycle analysis) ensures the Generator meets the highest technical standards while remaining practical for everyday use. Their expertise in FRP product modeling and sustainability assessment has made this tool an unmatched resource for composite manufacturers.</p>\n\n\n\n<p>Many firms advertise low-cost, rapid-turnaround LCA and EPD services, but fast doesn’t always mean accurate. Without proper data sources or deep knowledge of composite materials, resulting declarations can lack the rigor needed by decision-makers seeking reliable, comparative insights. This not only undermines market credibility but also limits a manufacturer’s ability to identify environmental “hot spots” and pursue meaningful performance improvements.</p>\n\n\n\n<p>As momentum for sustainability accelerates, more clients – including state DOTs, commercial developers and global OEMs – are demanding detailed environmental reporting. From infrastructure and automotive to buildings and housing, product selection is increasingly influenced by lifecycle impact assessments. Participation in these markets will require FRP manufacturers to present credible, independently verified EPDs, and that’s exactly what ACMA’s Generator enables.</p>\n\n\n\n<p><strong>Steps to Generate Your EPD Using the Generator</strong></p>\n\n\n\n<ol class=\"wp-block-list\" start=\"1\">\n<li><strong>Fill out the interest form</strong><br />Start by completing the form at <em>https://acmanet.org/lca-epd</em>. Once submitted, ACMA’s Sustainability Project Manager, Hannah Henry, will reach out to discuss the process and requirements specific to your manufacturing facility and product.</li>\n\n\n\n<li><strong>Participate in a kick-off call with our team of consultants</strong><br />In this call, we’ll define the scope of your project, walk you through the SmartEPD web platform, and based on the complexity of your product and data, you’ll receive a quote for your EPD.</li>\n\n\n\n<li><strong>Accept the quote</strong><br />After reviewing the proposal, you’ll receive a contract and non-disclosure agreement (NDA) to sign with ACMA and the consulting team.</li>\n\n\n\n<li><strong>Create a project and draft EPD</strong><br />Upon submitting your payment, you’ll create a project and begin working through the EPD template within the SmartEPD platform.</li>\n\n\n\n<li><strong>Collect and submit your product and facility data</strong><br />This includes production and utility data, bills of materials and other operational inputs. While the data collection phase may seem extensive, it’s critical to generating an accurate and reliable LCA. You’ll also have the opportunity to consult directly with Trinity Consultants to receive technical guidance and ensure transparency throughout the process.</li>\n\n\n\n<li><strong>Submit the draft EPD for verification</strong><br />Your data will be processed through a pre-verified LCA calculator and integrated into the draft EPD, which is then submitted to SmartEPD for review. Our consultants will work alongside you throughout the verification stage to provide support and ensure quality.</li>\n\n\n\n<li><strong>Publish your EPD</strong><br />Once verified, your EPD can be published and made publicly available on the SmartEPD platform, helping demonstrate your environmental performance to customers and regulators.</li>\n</ol>\n\n\n\n<p>Fully leveraging the Generator’s capabilities will help composite producers not only meet emerging expectations but demonstrate the long-term reliability, cost-effectiveness and sustainability advantages of their products.</p>\n\n\n\n<p>Composites manufacturers interested in using the Generator can get started by filling out the interest form at <em>https://acmanet.org/lca-epd.</em> John Schweitzer is Vice President of EH&amp;S and Sustainability at ACMA. Email comments to <em>jschweitzer@acmanet.org</em>.</p>\n<p>The post <a href=\"https://acmanet.org/acmas-lcaepd-generator-a-smart-investment-in-selling-the-environmental-benefits-of-composites/\">ACMA’s LCA+EPD Generator: A Smart Investment in Selling the Environmental Benefits of Composites</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/acmas-lcaepd-generator-a-smart-investment-in-selling-the-environmental-benefits-of-composites/feed/",
    "slash_comments": "0"
  },
  {
    "title": "Congress Makes Manufacturing Tax Provisions Permanent",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Congress Makes Manufacturing Tax Provisions Permanent"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/congress-makes-manufacturing-tax-provisions-permanent/"
      }
    ],
    "link": "https://acmanet.org/congress-makes-manufacturing-tax-provisions-permanent/",
    "comments": "https://acmanet.org/congress-makes-manufacturing-tax-provisions-permanent/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 21:14:08 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      21,
      14,
      8,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "Advocacy",
        "scheme": null,
        "label": null
      },
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Policy",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19574",
    "guidislink": false,
    "summary": "<p>Less than a month after ACMA’s record-setting Composites 2025 Fly-In, Washington provided manufacturers with an extra reason to celebrate on the Fourth of July: much needed tax improvements that potentially [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/congress-makes-manufacturing-tax-provisions-permanent/\">Congress Makes Manufacturing Tax Provisions Permanent</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Less than a month after ACMA’s record-setting Composites 2025 Fly-In, Washington provided manufacturers with an extra reason to celebrate on the Fourth of July: much needed tax improvements that potentially [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/congress-makes-manufacturing-tax-provisions-permanent/\">Congress Makes Manufacturing Tax Provisions Permanent</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Less than a month after ACMA’s record-setting Composites 2025 Fly-In, Washington provided manufacturers with an extra reason to celebrate on the Fourth of July: much needed tax improvements that potentially help every ACMA member company.</p>\n\n\n\n<p>Despite skepticism that a divided House Republican Caucus could come together, the House passed the Senate’s budget reconciliation package, known as the “One Big Beautiful Bill,” on July 3, following a dramatic series of overnight votes in the Senate, which passed the bill on July 1.</p>\n\n\n\n<p>In the week following the ACMA Fly-In, Senate Republicans unveiled their version of the “One Big Beautiful Bill.”&nbsp; Matching a key request from ACMA during our Fly-In, the Senate made full expensing of research and development and bonus depreciation for capital investments permanent. While the House included both provisions in its bill, the provisions would expire in five years. ACMA and other manufacturers have lobbied hard for these provisions to be made permanent to avoid a repeat from the 2017 tax bill, which included a five-year limit that Congress waited two years to renew.</p>\n\n\n\n<p>These provisions are essential to incentivize manufacturing innovation. R&amp;D expenses lower the cost for manufacturers to develop new products and improve production methods, such as shifting resin systems or changing molding for composites manufacturers. If these innovations require new equipment or plant improvements, bonus depreciation allows the full expensing of those purchases in the year the purchase occurs.</p>\n\n\n\n<p>Our industry faces several challenges in the coming years, from regulatory pressure on styrene, supply chain uncertainty due to tariffs and workforce retention issues. These tax provisions make it easier for manufacturers to invest in their processes and facilities, offering a way to confront these challenges and remain competitive.</p>\n\n\n\n<p>ACMA’s government relations staff have been working with Congress and other manufacturing trade associations for more than two years to pass these needed tax updates. Thanks to these efforts and the hard work of the over 100 ACMA members and staff meeting with House and Senate offices in June, these provisions are now a permanent part of the tax code.</p>\n\n\n\n<p>ACMA’s President and Chief Executive Officer Cindy Squires praised the final version of the bill: “The American Composites Manufacturers Association congratulates the House and Senate for passing permanent tax relief for U.S. manufacturers. The certainty provided by H.R. 1 will allow composites manufacturers to more aggressively fund research and development, knowing that these costs will be able to be expensed in the year they occur. Similarly, the permanent 100% bonus depreciation provision will create an ability for manufacturers of all sizes, small to large, to make necessary investments to expand and modernize and to scale up innovation.</p>\n\n\n\n<p>ACMA will work with our members in the coming months to provide further information on how to best utilize these new tax provisions.” Dan Neumann is vice president of government relations at ACMA. Email comments to <em>dneumann@acmanet.org</em>.</p>\n<p>The post <a href=\"https://acmanet.org/congress-makes-manufacturing-tax-provisions-permanent/\">Congress Makes Manufacturing Tax Provisions Permanent</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/congress-makes-manufacturing-tax-provisions-permanent/feed/",
    "slash_comments": "0"
  },
  {
    "title": "Charting a Course for Family Business Success",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Charting a Course for Family Business Success"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/charting-a-course-for-family-business-success/"
      }
    ],
    "link": "https://acmanet.org/charting-a-course-for-family-business-success/",
    "comments": "https://acmanet.org/charting-a-course-for-family-business-success/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 21:11:17 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      21,
      11,
      17,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19571",
    "guidislink": false,
    "summary": "<p>Family businesses are a vital segment of the U.S. economy, generating $7.7 trillion in gross domestic product, according to a report by Family Enterprise USA. While Wal-Mart Inc. is the [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/charting-a-course-for-family-business-success/\">Charting a Course for Family Business Success</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Family businesses are a vital segment of the U.S. economy, generating $7.7 trillion in gross domestic product, according to a report by Family Enterprise USA. While Wal-Mart Inc. is the [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/charting-a-course-for-family-business-success/\">Charting a Course for Family Business Success</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Family businesses are a vital segment of the U.S. economy, generating $7.7 trillion in gross domestic product, according to a report by Family Enterprise USA. While Wal-Mart Inc. is the largest family-owned business, reaching $648 billion in revenues in 2024, the company is among 32.4 million family businesses in the U.S. One of those is Bestbath, a manufacturer of FRP bathing products based in Caldwell, Idaho.</p>\n\n\n\n<p>Megan Multanen serves as co-CEO of Bestbath, a second-generation, family-owned business, alongside her brother, Jay. They have guided the company founded by their father into a $50 million-plus enterprise.</p>\n\n\n\n<p>“One of the things that I appreciate about having a family-owned business is the focus I get to have on the future,” says Multanen, immediate past chair of ACMA. “We aren’t beholden to an anonymous group of demanding stockholders. We are tasked with making good decisions that ensure our children, our employees’ children and our customers’ children can rely on Bestbath in the future.”</p>\n\n\n\n<p><strong>Family Business Traits</strong></p>\n\n\n\n<p>Last year, ACMA launched the Family Business Network (FBN) to foster collaboration and growth among family-owned businesses in the composites manufacturing sector.</p>\n\n\n\n<p>“Any business guru will tell you that having a network of people who can listen, understand and give you advice is critical to success. But many closely held, family-run businesses don’t have a network of people that truly understand the quirks, challenges and joys of owning and running a family business,” says Multanen, whose company sponsors FBN. “The Family Business Network is a place where you can hear good ideas, process tricky issues and meet professionals who can guide families – and non-family members who manage and lead the business – through their unique planning and financial issues.”</p>\n\n\n\n<p>In May, FBN hosted the first in a series of webinars led by Dennis Jaffe, a consultant with BanyanGlobal Family Business Advisors. A panel of experts shared strategies for navigating generational transitions, ownership structures and governance challenges.</p>\n\n\n\n<p>Before diving into those strategies, Jaffe discussed two ways in which family businesses differ from other companies. The first is that people who own family businesses are more than just business partners.</p>\n\n\n\n<p>“They have a personal relationship, which means they also have a personal agenda that goes beyond just seeing how much money they can make,” he says. “There are all kinds of considerations about working together – about what’s important – and these come up frequently.”</p>\n\n\n\n<p>Second, family-owned businesses typically want to pass the company on to the next generation.</p>\n\n\n\n<p>“While a lot of businesses are interested in immediate returns – what they made this quarter – the family business is looking ahead a generation or two and trying to create a legacy for their children and grandchildren,” says Jaffe.</p>\n\n\n\n<p><strong>Potential Pitfalls</strong></p>\n\n\n\n<p>There are a few statistics on family business succession that are widely cited by organizations: Less than one-third of all family-owned businesses successfully transition to the second generation, only 12% make it to the third generation and just 3% remain in business beyond that. If the data holds true, some of the unique challenges that family businesses face contribute to rocky transitions.</p>\n\n\n\n<p>Jaffe shared four of them:</p>\n\n\n\n<p><strong>Challenge # 1: Balancing family and business roles</strong></p>\n\n\n\n<p>“Family businesses are strange entities that contain both a family, where people are emotionally connected and care for each other, and a business, where people are accountable and have to achieve results,” says Jaffe. “It’s very hard to shift from the family reality to the business reality.”</p>\n\n\n\n<p><strong>Challenge # 2: Transitioning from one family to a group of families</strong></p>\n\n\n\n<p>“Over two or three generations, the business is run by a group of families – something like a tribe. The second generation live together, but starting with the third generation they don’t,” says Jaffe. “They must learn how to work together. The challenge is to build on the positive things they share and overcome the inevitable differences that come up.”</p>\n\n\n\n<p><strong>Challenge # 3: Moving from one wealth creator to shared governance</strong></p>\n\n\n\n<p>“Family businesses are typically started by one entrepreneur who builds the business and makes decisions on their own,” says Jaffe. “The challenge for every family business is that the second and third generation can’t be like the first. There is no one like the wealth creator. Subsequent generations have to create a governance structure and decide how the business will be organized, who is in charge, what are the shared goals and so on.”</p>\n\n\n\n<p><strong>Challenge # 4: Expanding from a family business to a family enterprise</strong></p>\n\n\n\n<p>“By the third generation, family businesses usually move beyond a single business to a portfolio of interests,” says Jaffe. “They may have other investments, real estate and a family foundation. The family has to figure out not only how they are going to preserve the business, but what they are going to do with their wealth and resources.”</p>\n\n\n\n<p><strong>Wealth Management</strong></p>\n\n\n\n<p>The webinar panelists offered several recommendations to help family businesses address challenges and thrive. One of the top priorities is estate planning and wealth management.</p>\n\n\n\n<p>“Having an estate plan, implementing it and confirming that the assets have the proper beneficiary designations is really critical,” says John Loew, a tax director at Sikich LLP. “Far more important is the impact on the family, so you need to share that estate plan.”</p>\n\n\n\n<p>Jen Rasmussen, also a tax director at Sikich, encourages business owners to discuss their estate plan with everyone in the family, even if they don’t share all the details.</p>\n\n\n\n<p>“We want people to disclose so that everyone has realistic expectations, even if it’s just to say, ‘We created a family trust, here is where the business is and you will be taken care of,’” says Rasmussen.</p>\n\n\n\n<p>Setting up a family trust is key to managing estate taxes, sheltering assets from creditors and passing on wealth to future generations.</p>\n\n\n\n<p>“A lot of our clients with long-term, multigenerational trusts have a family mission statement pertinent to the trust document,” says Loew. “It’s a message from you to current and future beneficiaries of your trust that expresses your wishes for use of the trust assets. A trust document can’t be too nebulous, but a family mission statement can provide guidance to the trustee.”</p>\n\n\n\n<p><strong>Family Forums</strong></p>\n\n\n\n<p>As businesses grow from generation to generation, decisions on roles of employment, ownership, inheritance and wealth distribution get complicated. People strive to be fair, but that’s an ambiguous concept. Matthew Petersen, a partner in the law firm Holland &amp; Knight LLP, makes the distinction between a fair process and a fair outcome.</p>\n\n\n\n<p>“A fair outcome is probably not achievable. In a large system, no matter what happens, there are always going to be people who are not fully satisfied with how the dice roll came out for them. But if there’s a fair process, people are much more accepting,” he says. “At a minimum, it’s a process that includes open and proactive communication to the family at large.”</p>\n\n\n\n<p>Petersen and the other webinar panelists are proponents of family forums.</p>\n\n\n\n<p>“I’m a true believer in holding regular meetings to convene the family members who are touched by the business,” he says. “They create an opportunity to communicate information about what’s happening in the business and a forum for people to be heard.”</p>\n\n\n\n<p>Rob Sligh, a senior consultant with The Family Business Consulting Group, reminds family members to get together and have fun, too. In addition, make sure the business doesn’t lose its identity with each new generation.</p>\n\n\n\n<p>“Share the founding story. How challenges were met can be inspirational and establish a solid foundation for other things like developing a family vision, values and expectations for business performance,” says Sligh. “These provide a north star for company leadership to follow.”</p>\n\n\n\n<p><strong>Exit Strategies</strong></p>\n\n\n\n<p>All business owners eventually step away from the business, whether they pass it to the next generation or sell the company. Planning is key.</p>\n\n\n\n<p>“A well-planned exit takes five to six years,” says Rob Vero with Novastone Capital Advisors, which has an operator-led search fund program for succession. “Once you decide to exit the business, there are a wide range of possibilities.”</p>\n\n\n\n<p>Vero recommends that owners go through the process of preparing their business for sale even if they don’t intend to sell it.</p>\n\n\n\n<p>“Get your finances in order, then look at the organizational chart. Is it scalable?” he says. “Then, are you managing taxes and succession efficiently? If you ask those questions and get your company ready for sale, it will be better run and more disciplined. And that preparation becomes invaluable for the next generation to step in.”</p>\n\n\n\n<p>As new generations enter the family business, there isn’t a one-size-fits-all solution. Collaborating with consultants and advisors, and networking with organizations like ACMA’s Family Business Network, can help businesses work through challenges and implement appropriate strategies.</p>\n\n\n\n<p>“There are lots of ways you have to pay attention as you cross generations, and the challenges of the second and third generation are hugely different that the challenges of the first generation,” says Jaffe. “The fruits of success are that you get to continue playing. It’s like a video game, where you move on to level two and level three.” Susan Keen Flynn is managing editor of <em>Composites Manufacturing</em> magazine. Email comments to <em>sflynn@keenconcepts.net</em>.</p>\n<p>The post <a href=\"https://acmanet.org/charting-a-course-for-family-business-success/\">Charting a Course for Family Business Success</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/charting-a-course-for-family-business-success/feed/",
    "slash_comments": "0"
  },
  {
    "title": "New ACMA Event! Composites Evolution 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "New ACMA Event! Composites Evolution 2025"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/new-acma-event-composites-evolution-2025/"
      }
    ],
    "link": "https://acmanet.org/new-acma-event-composites-evolution-2025/",
    "comments": "https://acmanet.org/new-acma-event-composites-evolution-2025/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 21:06:16 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      21,
      6,
      16,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19568",
    "guidislink": false,
    "summary": "<p>Join leading manufacturers, suppliers and technical experts Oct. 22 – 23, 2025, at Composites Evolution in Knoxville, Tenn., a new event focused on open molding and filament winding, where you [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/new-acma-event-composites-evolution-2025/\">New ACMA Event! Composites Evolution 2025</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Join leading manufacturers, suppliers and technical experts Oct. 22 – 23, 2025, at Composites Evolution in Knoxville, Tenn., a new event focused on open molding and filament winding, where you [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/new-acma-event-composites-evolution-2025/\">New ACMA Event! Composites Evolution 2025</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Join leading manufacturers, suppliers and technical experts Oct. 22 – 23, 2025, at Composites Evolution in Knoxville, Tenn., a new event focused on open molding and filament winding, where you will explore practical, profitable solutions to the EPA’s new styrene regulations. This focused, forward-looking conference will show you how to turn compliance into competitive advantage – boosting efficiency, improving processes and unlocking new market opportunities. Visit <em>acma.today/CE25</em> to register and learn more about this exciting new event!</p>\n\n\n\n<p><strong>ACMA Members Make an Impact in D.C.</strong></p>\n\n\n\n<p>ACMA recently hosted the Composites 2025 Fly-In in Washington, D.C., bringing members together to advocate for the expanded use of composites in federal policy and programs. Participants met with members of Congress and key agency leaders to promote sustainability, gain insights into upcoming legislation and build connections that support long-term business growth. Events like this highlight the value of ACMA membership in shaping industry priorities and opening new opportunities. Learn more about our initiatives and get involved by visiting <em>smartpolicymaterials.com</em>.</p>\n\n\n\n<p>CAPTION: &nbsp;[Photo Name – Capital Steps Fly-In]</p>\n\n\n\n<p>ACMA members and staff visited Capital Hill during the Composites 2025 Fly-In</p>\n\n\n\n<p><strong>License the ACMA Digital Edition of the Basic Composites Manual</strong></p>\n\n\n\n<p>ACMA’s Basic Composites Manual has long been the foundational resource for composites education. Now, with its fully updated&nbsp;Digital Edition, you can deliver high-quality, modernized training directly on your own learning management system (LMS).</p>\n\n\n\n<p>By licensing the ACMA Digital Edition for your LMS, you gain the flexibility to:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Customize delivery for your workforce or students</li>\n\n\n\n<li>Ensure consistent, industry-vetted training company-wide or campus-wide</li>\n\n\n\n<li>Support instructor-led or self-paced learning models</li>\n\n\n\n<li>Enhance onboarding, upskilling and academic curricula with minimal development cost</li>\n</ul>\n\n\n\n<p>Contact us today at&nbsp;<em>cct@acmanet.org</em>&nbsp;to learn more about pricing and implementation.</p>\n<p>The post <a href=\"https://acmanet.org/new-acma-event-composites-evolution-2025/\">New ACMA Event! Composites Evolution 2025</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/new-acma-event-composites-evolution-2025/feed/",
    "slash_comments": "0"
  },
  {
    "title": "Old Technology, New Enhancements",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Old Technology, New Enhancements"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/old-technology-new-enhancements/"
      }
    ],
    "link": "https://acmanet.org/old-technology-new-enhancements/",
    "comments": "https://acmanet.org/old-technology-new-enhancements/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 21:03:09 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      21,
      3,
      9,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19565",
    "guidislink": false,
    "summary": "<p>The process of manufacturing composites by winding fiber filaments over a rotating mandrel dates back to the 1940s, and after decades of upgrades and improvement the technique is still in [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/old-technology-new-enhancements/\">Old Technology, New Enhancements</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>The process of manufacturing composites by winding fiber filaments over a rotating mandrel dates back to the 1940s, and after decades of upgrades and improvement the technique is still in [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/old-technology-new-enhancements/\">Old Technology, New Enhancements</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>The process of manufacturing composites by winding fiber filaments over a rotating mandrel dates back to the 1940s, and after decades of upgrades and improvement the technique is still in wide use today. From golf club shafts and boat paddles to pressure vessels and aerospace structures, filament winding remains a preferred manufacturing method for hollow, cylindrical or oval-shaped composite products.</p>\n\n\n\n<p>The material formulations in filament wound products like tanks and pipes make them strong and lightweight. “In a hand lay-up process, the resin reinforcement is about 65% resin and 35% reinforcement. But in filament winding it flips, so you wind up having a much higher degree of reinforcement versus resin,” says Kevin Lambrych, manager of Alta Performance Materials’ Corrosion Science Center (CSC) in Ohio and manager of corrosion and fire-retardant resins PD and TS. “That allows you to make a lighter, stronger laminate. You can lay up a lot of reinforcement in a short period of time for a very strong tank or pipe wall.”</p>\n\n\n\n<p><strong>Preventing Corrosive Breaches</strong></p>\n\n\n\n<p>At the CSC, Alta partners with fabricators, engineering firms and end users to ensure the products they need, like scrubbers, tanks and pipes, can withstand corrosive materials, such as acids, bases and other aggressive chemicals. “We also help companies optimize their fabrication techniques. With filament winding, that means achieving good, effective cures so they can lay up thicker windings and improve their production efficiency,” says Lambrych.</p>\n\n\n\n<p>Creating a corrosion-resistant tank begins with the hand lay-up of a corrosion barrier on a mandrel. The barrier, which provides most of the corrosion protection, consists of surfacing veils (100 to 200 mils thick) with a backing of chopped strand glass and resin. The first 10 to 20 mils are 90% resin, while the balance is chopped strand glass with 65% resin. The discontinuous chopped strand glass prevents chemical attack from moving easily from fiber to fiber.</p>\n\n\n\n<p>For each application, Alta recommends the veil type (C-glass, synthetic polyester or carbon), number of veils, type of glass and thickness of the chopped strand glass mat.</p>\n\n\n\n<p>“We try to recommend both the materials with the best performance and best ease of processing for the fabricator,” Lambrych says.</p>\n\n\n\n<p>The next step is the filament winding of the structure, which should be made with the same resin as the corrosion barrier in case there’s a breach. Alta produces Derakane<img alt=\"™\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2122.png\" style=\"height: 1em;\" /> and Derakane<img alt=\"™\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2122.png\" style=\"height: 1em;\" /> Signia<img alt=\"™\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2122.png\" style=\"height: 1em;\" /> epoxy vinyl ester systems, which are designed with high resistance to oxidizing acids, solvents and caustics.</p>\n\n\n\n<p>For customers working with new chemical environments, Alta will test coupons of various material combinations in reactor kettles to determine the loss of strength, flex modulus and hardness that occur over time. The goal of testing is to identify the best material combination for the application’s environment.</p>\n\n\n\n<p>One reason for the continued popularity of filament winding is flexibility of construction; filament wound storage tanks can be made on a worksite. “If you can get the mandrel to the location, and you ship the reinforcement and the resin on trucks, you can then essentially set up a fabrication shop right there,” says Lambrych. “Tanks up to 60 feet have been made onsite.”</p>\n\n\n\n<p>One example is the El Boleo Project in Baja California, Mexico, which used onsite fabrication to make 40-foot diameter corrosion-resistant tanks used in the extraction of copper, cobalt, zinc and manganese from ore. Other tanks are manufactured offsite and shipped to the location, like the corrosion-resistant filament wound tanks being used in a project that is shortening the time it takes to extract lithium from the water in geothermal power plants.</p>\n\n\n\n<p>“As we come up with new technologies like these, filament winding is going to continue to be a pretty important piece of the composites manufacturing industry,” says Lambrych.</p>\n\n\n\n<p><strong>Stronger Replacement Poles</strong></p>\n\n\n\n<p>As aging wood utility poles continue to fail during hurricanes, windstorms, fires and other natural disasters, some power and telecommunications companies are hardening their infrastructure by strategically replacing wood poles with stronger and more resilient FRP composite poles.</p>\n\n\n\n<p>Composites manufacturers can use pultrusion or filament winding to build FRP poles. While both methods deliver strong, lightweight, resilient structures, each has its advantages. Because pultrusion is a continuous process – making poles of constant cross section with uniform strength – this manufacturing method is good for large-scale, economical production of standard profile poles.</p>\n\n\n\n<p>Resilient Structures, which was founded in 1995, uses the filament winding process, which enables production of modular, tapered poles with continuous axial and circumferential reinforcement where necessary.</p>\n\n\n\n<p>“A utility pole is structurally efficient when it is designed as a tapered column,” says Scott Holmes, Resilient Structures’ chief technical officer. “Although the top of a pole can be loaded with equipment and wires and gets buffeted by the wind, the highest stresses are going to be near the bottom of the pole.” Tapered poles offer better load distribution and aerodynamic efficiency.</p>\n\n\n\n<p>Manufacturers of filament wound poles look for ways to improve the efficiency of their fabrication processes. “If you’re building a very large structure layer by layer it’s really critical that you get a lot of material down quickly. You’ve got to minimize the time that you spend winding as much as possible,” Holmes says.</p>\n\n\n\n<p>Increased optimization and control of the winding process has helped. “We can program the machine to put fibers at a particular angle and to optimize the number of layers or circuits to cover the entire part,” he says. “But even with computer control, and all the latest software improvements, you still need an operator there because you’re dealing with a live material, taking fiberglass and impregnating it with resin. The operators know what they’re looking at and can make adjustments as needed to ensure a consistent process.”</p>\n\n\n\n<p>Resilient Structures uses a proprietary polyurethane resin for its poles. The formulation is environmentally friendly – without the use of solvents – and has excellent structural properties and built-in UV resistance.</p>\n\n\n\n<p>Holmes says changes are on the horizon for manufacturing of filament wound poles. Today most companies use structural testing to validate how they perform. But Holmes says more companies are beginning to use finite element analysis (FEA) of winding patterns to optimize the laminates.</p>\n\n\n\n<p>“FEA enables a stress analysis on a complex composite structure, because even a tapered pole is not a simple structure to analyze. Using these programs, you can say, ‘I want a winding pattern to look like this, and analyze it to come up with a more optimized laminate design,’” he adds. In the future, such analyses will likely use a digital twin of a pole and the associated manufacturing process to reduce structural testing and further optimize the pole.</p>\n\n\n\n<p><a><strong>A Hybrid Model</strong></a></p>\n\n\n\n<p>Filament winding is a fast, cost-effective way to manufacture many products, but it is limited in the reinforcement capabilities, materials and the shapes it can produce. <a>Addcomposites, based in Finland, has developed a hybrid automated fiber placement/filament winding system that could overcome some of those restrictions.</a></p>\n\n\n\n<p>In 2019, a year after its founding, the company introduced its compact AFP-XS system, which is designed to convert existing robotic arms into automated fiber placement (AFP) systems. “As we evolved and understood industrial robotics a bit more, we realized that the AFP system platform we built can be used to do filament winding as well,” says Pravin Luthada, company co-founder and CEO.</p>\n\n\n\n<p>The AFP-XS system features interchangeable compaction mechanisms that can support AFP’s localized pressure application or filament winding’s continuous tension control. Dual-mode also supports the thermal management modules&nbsp;to enable in-situ consolidation of thermoplastics or controlled thermoset winding.&nbsp;Changeover from one process to another is fast; the system can be programmed to stop at any point to make the switch.</p>\n\n\n\n<p>Luthada says there are several benefits to this hybrid system. Up to now, filament winding has primarily been done with thermoset resins, in part because traditional filament winders are not built to handle in-situ consolidation for thermoplastics. The head on the AFP-XS, however, can be fitted with a heat source that would allow that curing. Having the ability to build composite components with recyclable thermoplastics is an environmental advantage in today’s market.</p>\n\n\n\n<p>Combining AFP capabilities with filament winding also enables better placement of reinforcements at critical places within a structure. “With filament winding, you have to follow a geodesic path, but with AFP you have no such limitation. You can follow any path on the surface as long as it’s allowed by the fiber, and can place reinforcing patches where you need them,” says Luthada. That reduces the use of materials in areas that don’t need reinforcement, ultimately cutting the weight of the composite part.</p>\n\n\n\n<p>The hybrid system makes it possible to produce more complex shapes in a single manufacturing process as well. Filament winding can be used only for convex shapes, while AFP can handle both convex and concave surfaces.</p>\n\n\n\n<p>One application for this hybrid process is missile structures and carriers for them. “These are slightly complex windings because there are dips, and there are certain sections where extra fibers are needed so that you can attach a handle or some sort of holding mechanism,” says Luthada. “You could make them with this system, and they would be extremely light.”</p>\n\n\n\n<p>The AFP-XS system was deployed by a European defense manufacturer for the construction of a rectangular pipe. In another demonstration project, a manufacturer produced a next-generation hydrogen tank with a 41% weight reduction. The tank included a 15-layer filament wound CFRP shell, localized AFP reinforcement and an integrated thermoplastic liner.</p>\n\n\n\n<p>With technological advances like these, decades-old filament winding production is likely to be around for many more years.</p>\n\n\n\n<p>Mary Lou Jay is a freelance writer based in Timonium, Md. Email comments to <em>mljay@comcast.net</em>.</p>\n<p>The post <a href=\"https://acmanet.org/old-technology-new-enhancements/\">Old Technology, New Enhancements</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/old-technology-new-enhancements/feed/",
    "slash_comments": "0"
  },
  {
    "title": "Digital Twins Reveal Hidden Information",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Digital Twins Reveal Hidden Information"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/digital-twins-reveal-hidden-information/"
      }
    ],
    "link": "https://acmanet.org/digital-twins-reveal-hidden-information/",
    "comments": "https://acmanet.org/digital-twins-reveal-hidden-information/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 20:58:41 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      20,
      58,
      41,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19561",
    "guidislink": false,
    "summary": "<p>It can be difficult to determine what happens inside a composite product during the manufacturing process – where anomalies may have occurred or how closely the final product matches the [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/digital-twins-reveal-hidden-information/\">Digital Twins Reveal Hidden Information</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>It can be difficult to determine what happens inside a composite product during the manufacturing process – where anomalies may have occurred or how closely the final product matches the [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/digital-twins-reveal-hidden-information/\">Digital Twins Reveal Hidden Information</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>It can be difficult to determine what happens inside a composite product during the manufacturing process – where anomalies may have occurred or how closely the final product matches the original design. Digital twin technology can provide those interior views.</p>\n\n\n\n<p>A digital twin is a virtual, data-based representation of the properties and behaviors of a physical system or process throughout its operational life. Using a digital twin, also known as a virtual twin, a manufacturer can optimize the performance of a composite product, reduce production errors and maintain a record of any changes made to the product.</p>\n\n\n\n<p><strong>Tracing Causes of Failure</strong></p>\n\n\n\n<p>Aligned Vision has been creating digital twins for aerospace customers for several years. The first step in that direction was the addition of cameras to its laser projection system, which resulted in an inspection system that captured, during manufacturing, calibrated images of the plies in layers of the composite component. These images, analyzed by machine vision and early machine learning models, enabled a manufacturer to determine if the fiber orientation in the actual composite component matched the orientation in the original CAD design. That real-time information allowed manufacturers to resolve some quality problems during production, reducing the number of parts that were not built to spec.</p>\n\n\n\n<p>Now AI has made analyzing those images even more powerful and easier to do. “We can take these small, highly magnified, calibrated images and run them through deep learning classifiers to look for edges of the plies, fiber orientation and foreign objects and debris (FODs),” says Scott Blake, president of Aligned Vision.</p>\n\n\n\n<p>The data from those images, along with other attributes like the part’s dimension and shape, are incorporated into an as-built digital twin to the originally designed component. Multiple component images are stitched together to create a digital twin of an entire part, such as a wind turbine blade or a helicopter rotor. By relying on this information rather than on a theoretical or design model, manufacturers gain a more accurate representation of what’s going on inside the part.</p>\n\n\n\n<p>If the composite part fails while in use, the manufacturer can refer to its digital twin to try to determine the cause. A digital twin can also serve as a record of repair work that’s been done when a composite part is damaged, providing valuable information for technicians if the part later requires more work.</p>\n\n\n\n<p>Digital twins could reduce part overdesign as well. By analyzing data from multiple digital twins of a particular component, a manufacturer could determine how much variation typically occurs in the manufacturing process. That could enable them to reduce the design allowables for the part while still meeting the design requirements.</p>\n\n\n\n<p>“If you know how precisely you’re building what you’ve designed, you can more tightly optimize that design. This will lower the weight of the part and the energy used to produce it,” says Blake. “This is what industry 4.0 is all about, having this real-world data that can be compared with the nominal design data so you can make smart decisions.”</p>\n\n\n\n<p><strong>Increased Manufacturing Reliability</strong></p>\n\n\n\n<p>The complex manufacturing processes used to produce many composite parts today often require operators to closely monitor running equipment. Such close surveillance might not be necessary if a digital twin can trigger an alarm when there is a problem.</p>\n\n\n\n<p>“The digital twin could help by putting the operator’s attention on a part when it’s needed, rather than having operators sit there all the time,” says Kris Villez, senior R&amp;D staff at Oak Ridge National Laboratory (ORNL).</p>\n\n\n\n<p>Some of Villez’s work at ORNL involves the use of statistical models to determine how quickly and accurately a digital twin system that uses a camera-based anomaly detection system can find errors during the additive manufacturing of a part. Using cameras to record data, researchers printed two 80-layer hexagonal patterns, with the first pattern printed correctly so it could serve as the normal image. In the second pattern, researchers varied the extruder speed in different trials, intentionally producing anomalies in the printed hexagon. Using machine learning to analyze and compare the normal statistical model with digital twins created at slower running speeds, Villez’s team detected large faults – anomalies representing a 30% reduction in speed – every time.</p>\n\n\n\n<p>“Our results show that images are easily identified as anomalous for extruder speeds at or below 85% of the nominal speed, meaning that an anomalous reduction of the material deposition rate can be detected within seconds of its onset,” Villez says.</p>\n\n\n\n<p>An alarm system tied to the digital twin could reduce manufacturers’ labor costs and/or allow them to assign operators to more important tasks, such as analyzing long-term reliability or data sets from multiple prints.</p>\n\n\n\n<p>In another project, Villez and his team explored how similar the digital twin must be to the original normal image to trigger an alarm. The question becomes how much deviation a manufacturer can tolerate. There’s a tradeoff between having too many false alarms, when the operator is constantly being warned that something is wrong when it’s not, and missing any true anomaly or true fault. If the system generates too many false alarms, operators would be more likely to switch it off.</p>\n\n\n\n<p>The researchers demonstrated that under ideal conditions it is possible to automatically set the right threshold for triggering alarms using statistical process control and principal component analysis (PCA) to analyze the data of the normal image versus its digital twin.</p>\n\n\n\n<p>“One of the drivers of my research is to put the AI and statistical tools into the hands of people who are not necessarily experts,” Villez says. “If the threshold can be set automatically, then we don’t need a model expert or an AI expert to do this work.”</p>\n\n\n\n<p><strong>Exploring Production Options</strong></p>\n\n\n\n<p>Digital twin technology could assist the composites industry in meeting the large demand for parts for electric vertical takeoff and landing (eVTOL) vehicles and more. Autoclaving, the current method of producing those parts, is too slow; digital twins could speed the adoption of alternative production methods.</p>\n\n\n\n<p>Boeing is developing a stamp forming production process to produce airframe structural parts in collaboration with Purdue University’s Composites Manufacturing &amp; Simulation Center (CMSC) and Joby Aviation.&nbsp;In stamp forming, composite materials change shape in different directions as they are heated, shaped and cooled. To study these effects, CMSC developed a digital twin of a generic shape with a complex geometry of double curvature using FORM3D, which replicates a composite stamping process and analyzes the virtual product. Joby and the CMSC are working to&nbsp;validate the virtual twin to optimize this manufacturing method.</p>\n\n\n\n<p>“We modeled all of the physics-based processes involved, the heat flow of the material, how it shrinks and all of the physics around how it changes shape and why,” says R. Byron Pipes, CMSC executive director. Determining how all these elements interact using empirical methods would take an enormous amount of time to conduct the required studies, but in a virtual twin everything can be integrated into one model, which makes it possible to understand and control the process.</p>\n\n\n\n<p>With the virtual twin, researchers observed an unexpected change in form in the shape. The small radius of curvature decreased upon cooling, while the large radius of curvature increased. This unexpected behavior guided the redesign, which was only possible with the virtual twin.</p>\n\n\n\n<p>“The virtual twin allows you to look at all of the design possibilities and evaluate them against each other,” says Pipes. Instead of running expensive and time-consuming real-world experiments changing one variable at a time, researchers could use the virtual twin to determine the guide design.</p>\n\n\n\n<p>In another project, CMSC and Boeing used digital twin technology to develop a method of using composite prepreg molding to produce complex geometry components previously made by machining aluminum or titanium. When the discontinuous fiber prepreg platelet material was heated, it flowed into the geometries of the mold, but the fiber orientation changed during this process and impacted the properties of the material. With the digital twin that CMSC developed, researchers were able to simulate the flow of the platelet and predict the final fiber orientation.</p>\n\n\n\n<p>“This met one of the important challenges of prepreg molded composites in aircraft structure, namely the ability of Boeing engineers to predict how part shape and strength were related,” says Pipes.</p>\n\n\n\n<p><strong>The Future of Digital Twins</strong></p>\n\n\n\n<p>Digital twin technology would be advantageous for composites manufacturers in industries like aerospace, but Blake sees several hurdles to overcome. He says that realization of digital twins’ benefits will likely be slowed by lack of cooperation between design, quality and manufacturing departments, and a lack of understanding of the technology’s benefits in C-suites.</p>\n\n\n\n<p>While digital twin technology is too expensive for most companies to use today – it requires specialized computer expertise – Pipes envisions a time when manufacturers could access it via software providers that use AI. Manufacturers could run massive amounts of data through this software to build data that supports AI systems.</p>\n\n\n\n<p>“The ultimate goal for a virtual twin in manufacturing is that it’s so good and runs so fast that it can tell the machine that&#8217;s doing the manufacturing what to do and how to adjust to any changes it sees in the process in real time,” Pipes says.</p>\n\n\n\n<p>Mary Lou Jay is a freelance writer based in Timonium, Md. Email comments to <em>mljay@comcast.net.</em><em></em></p>\n<p>The post <a href=\"https://acmanet.org/digital-twins-reveal-hidden-information/\">Digital Twins Reveal Hidden Information</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/digital-twins-reveal-hidden-information/feed/",
    "slash_comments": "0"
  },
  {
    "title": "Making a Push for Prefab FRP Panels",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Making a Push for Prefab FRP Panels"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/making-a-push-for-prefab-frp-panels/"
      }
    ],
    "link": "https://acmanet.org/making-a-push-for-prefab-frp-panels/",
    "comments": "https://acmanet.org/making-a-push-for-prefab-frp-panels/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 20:56:03 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      20,
      56,
      3,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "Architecture",
        "scheme": null,
        "label": null
      },
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19558",
    "guidislink": false,
    "summary": "<p>As the U.S. construction sector continues to face a pervasive labor shortage that many expect to intensify, Building Composites in Moraine, Ohio, has introduced a prefabricated FRP building enclosure panel [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/making-a-push-for-prefab-frp-panels/\">Making a Push for Prefab FRP Panels</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>As the U.S. construction sector continues to face a pervasive labor shortage that many expect to intensify, Building Composites in Moraine, Ohio, has introduced a prefabricated FRP building enclosure panel [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/making-a-push-for-prefab-frp-panels/\">Making a Push for Prefab FRP Panels</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>As the U.S. construction sector continues to face a pervasive labor shortage that many expect to intensify, Building Composites in Moraine, Ohio, has introduced a prefabricated FRP building enclosure panel system that speeds up construction and reduces on-site labor.</p>\n\n\n\n<p><a></a><a>Hyperwall<img alt=\"™\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2122.png\" style=\"height: 1em;\" /></a> FRP panels arrive on site painted, with pre-installed windows as well as built-in thermal and moisture barriers. Once attached to a steel or concrete frame, the panels create a complete exterior building skin. At one-third of the weight of precast concrete panels, the FRP panels are easier to handle and can be bolted rather than welded to the building frame or slab, which cuts installation time in half, says Andy Loff, CEO of Building Composites.</p>\n\n\n\n<p>The prefabricated panels reduce the need for on-site labor by moving production off the job site and into a factory. “There’s just such a shortage of people that want to work on construction sites where you have to go to work when it&#8217;s 8 degrees and windy outside and stand out there and try to be productive all day,” says Loff. “You have weather delays on construction sites. You have to climb up to the 15<sup>th</sup> floor to get to work. There’s lots of reasons why construction labor on site is inefficient compared to factory labor.”</p>\n\n\n\n<p>The all-in-one panels also reduce on-site labor by eliminating the need to coordinate successive waves of tradespeople. “You don&#8217;t have five or six of the trades coming in to put in the moisture barrier, the fire barrier, the vapor barrier and everything else because it&#8217;s all built into that one panel,” he says. “It also significantly reduces risk because the less people that are climbing up a building or being inside it, the less risk it is for the general contractor.”</p>\n\n\n\n<p>Loff and a large general contracting company in Falls Church, Va., began developing Hyperwall FRP panels in 2020. Four years of collaborative research and development culminated in a 40 x 80-foot, two-story demonstration building made from eight innovative enclosure solutions.</p>\n\n\n\n<p>“The monolithic FRP panel was the clear-cut winner out of the different technologies we tested to meet the goals of reducing on-site labor and speeding up construction,” Loff says. Building Composites was founded last year to commercialize the technology.</p>\n\n\n\n<p>The FRP panels are fabricated using sandwich construction with three to five layers of quadriaxial knit fiberglass fabric by SAERTEX and a polyisocyanurate foam core. Fiberglass is also placed in the Z direction, creating a repeating pattern of I-beams that increases structural performance.</p>\n\n\n\n<p>Manufacturing inputs are pre-assembled into kitting profiles that technicians hand-lay into steel or FRP molds and vacuum infuse with vinyl ester resin. Next, the panels go through a robotic fluoropolymer paint line, followed by hand installation of windows, balconies and other features. Panel thickness is determined by structural and thermal performance requirements and architectural interest. Panel size varies by application, but is generally capped at 41 x 10 feet for ease of shipping.</p>\n\n\n\n<p>Loff says that it’s important to limit the number of SKUs in each Hyperwall application. “It is a lot more expensive for us to build a building if you have 500 panels on it that are 500 different shapes instead of 500 that are all the same. Inevitably, it’s somewhere in the middle,” he says. “We help architects understand those cost tradeoffs and assist them in trying to get more creative with the same shape. For example, the same panel can be flipped over and create a slightly different look.”<br /><br /></p>\n\n\n\n<p>One of the first Hyperwall projects is HITT Contracting’s new headquarters. Building Composites is currently fabricating 351 panels for the 270,000-square-foot, six-story building, which will be installed in the winter of 2026. A 500,000-square-foot mixed-used residential and shopping complex is also in the works. Both projects are in Falls Church, VA.</p>\n\n\n\n<p>The construction industry has been slow to adopt composites. According to Building Composites, structural composites account for less than two percent of material value in building construction today. However, the ongoing labor shortage is driving the industry toward new technologies. “I think FRP has a very bright future in buildings and architecture because of this push to prefabrication and reducing on site labor,” says Loff. “The lightweight nature, impermeability to air and water and the corrosion resistant aspects [of composites] really lend themselves well to the construction industry.”</p>\n\n\n\n<p>Melissa O’Leary is a freelance writer in Cleveland. Email comments to <em>melissa@good4you.org</em>.</p>\n<p>The post <a href=\"https://acmanet.org/making-a-push-for-prefab-frp-panels/\">Making a Push for Prefab FRP Panels</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/making-a-push-for-prefab-frp-panels/feed/",
    "slash_comments": "0"
  },
  {
    "title": "ACMA: Driving Innovative Platforms for Composites Industry Engagement",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ACMA: Driving Innovative Platforms for Composites Industry Engagement"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/acma-driving-innovative-platforms-for-composites-industry-engagement/"
      }
    ],
    "link": "https://acmanet.org/acma-driving-innovative-platforms-for-composites-industry-engagement/",
    "comments": "https://acmanet.org/acma-driving-innovative-platforms-for-composites-industry-engagement/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 20:53:12 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      20,
      53,
      12,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19555",
    "guidislink": false,
    "summary": "<p>As I begin my service as ACMA Board Chair, receiving the baton from my friend and colleague Megan Multanen, I naturally reflect on the privilege and responsibility to continue a [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/acma-driving-innovative-platforms-for-composites-industry-engagement/\">ACMA: Driving Innovative Platforms for Composites Industry Engagement</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>As I begin my service as ACMA Board Chair, receiving the baton from my friend and colleague Megan Multanen, I naturally reflect on the privilege and responsibility to continue a [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/acma-driving-innovative-platforms-for-composites-industry-engagement/\">ACMA: Driving Innovative Platforms for Composites Industry Engagement</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>As I begin my service as ACMA Board Chair, receiving the baton from my friend and colleague Megan Multanen, I naturally reflect on the privilege and responsibility to continue a long tradition of ACMA to engage and inspire our members. I have been actively engaged in ACMA, or its predecessor the Composites Fabricators Association, since 1997. Countless executive leaders, colleagues and ACMA staff have inspired and supported me and my peers through those years. In fact, Megan’s father Gary Multanen was an early inspiration to me and our industry, modeling the management courage to proactively and transparently engage our neighbors and communities. Other ACMA leaders, whether in a family business or a multi-national corporation, have modeled purposeful engagement with their workforce through the Certified Composites Technician Program &nbsp;or through youth development like Scouting or STEM.</p>\n\n\n\n<p>The recent celebration of the ten-year anniversary of IACMI and the sustained growth of our CAMX partnership with SAMPE speaks to the power of engagement across our composites industry organizations. As we approach CAMX, I welcome and encourage all our members and industry colleagues to take full advantage of this exciting commercial and technology transfer platform to connect, collaborate and grow.</p>\n\n\n\n<p>ACMA demonstrates its very special value through the creative ways it continues to build and sustain new and vital platforms for engagement of members of all sizes and positions in the value chain. Programs such as the Composites Growth Initiative, ACMA Fly-In, Family Business Network, &nbsp;the LCA + EPD Generator and Emerging Leaders Program offer open and welcoming platforms for all members and prospective members, and most importantly open markets for all those that engage. And ACMA board members participate in and support advocacy groups like Women in the Composites Industry and others.&nbsp;</p>\n\n\n\n<p>ACMA recently launched a new program and event centered called Composites Evolution. The intersection of AI, digital twin technology, additive manufacturing, machine-driven processes, robotics and other Industry 4.0 breakthroughs will continue to present both opportunities and challenges for our industry, depending largely on how we engage them. Constraints with labor, technical talent, material or regulation will be a shared experience for all manufacturers to rise above to sustain growth. In recent remarks to our industry, Marcio Sandri of Owens Corning offered a compelling vision of four pillars critical to the growth of composites: Scalable Innovation, Standardization, Strong and Stable Supply Chains, and Sustainability and Circularity. These pillars demand engagement and shared lifting. As a member-driven organization, the ACMA is well positioned to lead in shaping the evolution of our industry, as the marketplace for innovative solutions and capabilities.</p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p>Mike Gromacki</p>\n<p>The post <a href=\"https://acmanet.org/acma-driving-innovative-platforms-for-composites-industry-engagement/\">ACMA: Driving Innovative Platforms for Composites Industry Engagement</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/acma-driving-innovative-platforms-for-composites-industry-engagement/feed/",
    "slash_comments": "0"
  },
  {
    "title": "A View Toward Composites Evolution",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "A View Toward Composites Evolution"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://acmanet.org/a-view-toward-composites-evolution/"
      }
    ],
    "link": "https://acmanet.org/a-view-toward-composites-evolution/",
    "comments": "https://acmanet.org/a-view-toward-composites-evolution/#respond",
    "authors": [
      {
        "name": "srummani"
      }
    ],
    "author": "srummani",
    "author_detail": {
      "name": "srummani"
    },
    "published": "Wed, 20 Aug 2025 20:49:58 +0000",
    "published_parsed": [
      2025,
      8,
      20,
      20,
      49,
      58,
      2,
      232,
      0
    ],
    "tags": [
      {
        "term": "CM Magazine",
        "scheme": null,
        "label": null
      },
      {
        "term": "Summer 2025 Issue",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://acmanet.org/?p=19552",
    "guidislink": false,
    "summary": "<p>Michael Gromacki, CEO of McClarin Composites, jokes that his involvement with ACMA began with a dumpster fire. “In 1997, I gave my first presentation with ACMA – then called the [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/a-view-toward-composites-evolution/\">A View Toward Composites Evolution</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Michael Gromacki, CEO of McClarin Composites, jokes that his involvement with ACMA began with a dumpster fire. “In 1997, I gave my first presentation with ACMA – then called the [&#8230;]</p>\n<p>The post <a href=\"https://acmanet.org/a-view-toward-composites-evolution/\">A View Toward Composites Evolution</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Michael Gromacki, CEO of McClarin Composites, jokes that his involvement with ACMA began with a dumpster fire.</p>\n\n\n\n<p>“In 1997, I gave my first presentation with ACMA – then called the Composites Fabricators Association – on the safe handling of scrap resin,” says Gromacki, who began a two-year term as chair of ACMA’s Board of Directors in July. “Employees at industry companies were polymerizing and discarding scrap resin in dumpsters, which can later start a fire. It was a high-risk practice without common guidelines, resulting in several shop fires.”</p>\n\n\n\n<p>At the time, Gromacki was a young engineer working in the resins division of TOTAL, known in North America as Cook Composites and Polymers (CCP). He anticipated a low turnout for his presentation, which was scheduled for the late afternoon on the last day of the conference. But the room was packed.</p>\n\n\n\n<p>“That showed me that the industry really cared about safety, preventing loss and doing things properly,” recalls Gromacki. “The experience was great, and it began a lifelong engagement with ACMA.”</p>\n\n\n\n<p><strong>An Early Interest in Advanced Materials</strong></p>\n\n\n\n<p>Gromacki grew up in Racine, Wis., on the shores of Lake Michigan approximately 30 miles south of Milwaukee. He attended the University of Wisconsin – Madison, where he majored in chemical engineering and competed in football and rowing.</p>\n\n\n\n<p>As a boy, Gromacki was drawn to science. Technological advancements of the 1980s sparked his interest in material science.</p>\n\n\n\n<p>“You had the development of the space shuttle and superconductive materials, prosthetics and the artificial heart,” says Gromacki. “They were all made possible through advanced materials, including composites and ceramics.”</p>\n\n\n\n<p>In high school, he participated in Junior Achievement<sup><img alt=\"™\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2122.png\" style=\"height: 1em;\" /></sup> programs, where an entrepreneurial engineer and local business owner who volunteered with the organization influenced his decision to enter the field. Another key person who inspired Gromacki was his second cousin, Alan Kulwicki, a driver on the NASCAR circuit with a degree in mechanical engineering and eventual NASCAR Rookie of the Year, Cup Champion and Hall of Fame inductee.</p>\n\n\n\n<p>After graduating from college, Gromacki worked in engineering consulting firms for approximately five years, most notably URS Corp., now part of AECOM. “I was exposed to a whole universe of opportunities,” he says. “As an engineer in a large firm you could work in various industries – pharmaceuticals, paper, refining, specialty chemicals and others.”</p>\n\n\n\n<p>In 1997, Gromacki joined a consulting firm client, TOTAL at CCP, marking the start of his career in the composites industry.</p>\n\n\n\n<p><strong>A Career in Composites</strong></p>\n\n\n\n<p>Gromacki held several positions within TOTAL, including manufacturing director and vice president of engineering and loss control in the resins division. He joined Dixie Chemical Co. as vice president of operations in 2009, then served as president for three years. Following a two-year stint as director of global wind and composites systems at Olin Corp., he was appointed CEO of McClarin Composites in 2022.</p>\n\n\n\n<p>Throughout his career, Gromacki has gained a reputation as an insightful leader with a strong technical background. Jennifer Agnew Scott, a sales executive with Olin, praises his ability to assess situations and take actions that drive positive outcomes – even in the most trying times. Gromacki served as her business leader at Olin from 2020 to 2022.</p>\n\n\n\n<p>“During extreme weather events and the COVID pandemic that led to uncertainty and supply chain disruptions globally, Mike instituted approaches that aligned with the company’s mission – zero disruptions,” says Agnew Scott. “I felt empowered and accountable, and, most importantly, I felt free to bring my authentic self in every interaction with Mike, even when we disagreed.”</p>\n\n\n\n<p>Agnew Scott also believes that Gromacki’s experience with several companies and in a variety of roles has given him “a unique perspective on every aspect of the industry, from technology, policy and talent acquisition to employee empowerment, engagement and C-suite expectations.”</p>\n\n\n\n<p><strong>A Focus on Automation</strong></p>\n\n\n\n<p>Gromacki brought a quarter century of experience in the composites industry to McClarin Composites, a 72-year-old company with more than 300 employees in three locations: Oklahoma City, Hanover, Pa., and Wapato, Wash.</p>\n\n\n\n<p>“I was attracted to McClarin because it had great locations, a legacy in plastic thermoforming and composites, and a lot of potential to implement machine-driven processes,” he says. “That’s a solid platform to drive innovation.”</p>\n\n\n\n<p>Gromacki believes automated solutions can help the composites industry address one of its biggest concerns. “Traditional open mold operations are labor intensive, and one of the main challenges that manufacturing faces right now is labor availability,” he says. “We have to change the paradigm.”</p>\n\n\n\n<p>McClarin is implementing automated solutions from GrayMatter Robotics to handle labor intensive and arduous tasks, such as sanding, polishing, buffing and grinding. GrayMatter’s robotic cells rapidly scan parts, then use autonomous planning software to build a model that ensures accurate placement of the part and correct use of the tool (grinder, sander, etc.). The system also monitors the cell operation throughout the process to make sure it’s functioning properly.</p>\n\n\n\n<p>Under Gromacki’s leadership, McClarin has executed a joint agreement with ExxonMobil to grow high-speed RTM molding applications for Proxxima<sup><img alt=\"™\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2122.png\" style=\"height: 1em;\" /></sup> polyolefin thermoset resins as an alternative to prepreg and sheet molding compound. He anticipates the new RTM line will be operational in 4Q 2025.</p>\n\n\n\n<p><strong>A Servant Leader</strong></p>\n\n\n\n<p>Gromacki was drawn to ACMA after his positive experience as a conference speaker.</p>\n\n\n\n<p>“I was hooked on the notion that ACMA was supportive of new people, and you get the most value if you get involved and keep abreast of the different businesses and technologies,” he says.</p>\n\n\n\n<p>For many years, Gromacki served on and chaired the association’s Loss Control Committee, part of the Resins Managers Council. The committee focused on process safety for production of unsaturated resins, particularly dicyclopentadiene-based resins. Gromacki and his peers advocated for safe and efficient production of resins with lower styrene content that were compliant with hazardous air pollutant (HAP) limits under then new Maximum Achievable Control Technology (MACT) standards.</p>\n\n\n\n<p>“It was a great example of how companies – even competitors – can work together in a pre-competitive environment to help the industry,” he says.</p>\n\n\n\n<p>Gromacki has served on ACMA’s Board of Directors while working for three companies: Dixie Chemical, Olin and McClarin Composites. Through the years, he chaired several committees, including the Technical, Membership, Finance and Executive Committees.</p>\n\n\n\n<p>“Mike understands how the board works and what ACMA’s issues and opportunities are,” says Leon Garoufalis, president and CEO of Composites One and former vice chair of ACMA’s Board of Directors. “He brings a servant leader mentality to this position, which is required for the type of collaboration necessary to move ACMA and the industry forward.”</p>\n\n\n\n<p>One of the critical topics facing the industry as Gromacki begins his tenure as ACMA chair is sustainability. Member companies are increasingly hearing from customers asking about the environmental impact of their products.</p>\n\n\n\n<p>“There is a lot of sensitivity about the carbon footprint of parts, the equipment in use and end-of-life for equipment in the segments we target at McClarin, such as mass transit and heavy trucking,” says Gromacki. “These topics weren’t a priority 25 years ago, but they’ve become urgent. And large companies are requiring that you clear their supplier thresholds.”</p>\n\n\n\n<p>ACMA has responded by developing the LCA + EPD Generator to prepare reliable, cost-effective environmental product declarations for their products and materials.</p>\n\n\n\n<p>Other priorities for ACMA under Gromacki’s leadership include keeping members abreast of trade policies and tariffs and their effect on the industry, as well as ramping up workforce development efforts. “When you face challenges that you are trying to navigate, your association is your closest ally,” says Gromacki. “We strive as a board to work on issues that have the most impact for ACMA members.”</p>\n<p>The post <a href=\"https://acmanet.org/a-view-toward-composites-evolution/\">A View Toward Composites Evolution</a> appeared first on <a href=\"https://acmanet.org\">American Composites Manufacturers Association</a>.</p>"
      }
    ],
    "wfw_commentrss": "https://acmanet.org/a-view-toward-composites-evolution/feed/",
    "slash_comments": "0"
  }
]