[
  {
    "published": "Fri, 20 Jun 2025 00:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      20,
      4,
      0,
      0,
      4,
      171,
      0
    ],
    "title": "Lockheed Martin tech fellow Carl Rousseau earns ASTM award",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Lockheed Martin tech fellow Carl Rousseau earns ASTM award"
    },
    "summary": "ASTM International&nbsp;honors Carl Quinn Rousseau with ASTM International&rsquo;s Wayne W. Stinchcomb Memorial Award for advancements in composites technology.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ASTM International&nbsp;honors Carl Quinn Rousseau with ASTM International&rsquo;s Wayne W. Stinchcomb Memorial Award for advancements in composites technology."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-carlrousseu-astm.png;maxWidth=385\" /></div>\n\n<p>Carl Rousseau. Source | ASTM International</p>\n</div>\n\n<p>Carl Quinn Rousseau, senior tech fellow at Lockheed Martin Aeronautics Co. (Fort Worth, Texas, U.S.), has received the Wayne W. Stinchcomb Memorial Award from&nbsp;<a href=\"https://www.astm.org/\" target=\"_blank\">ASTM International</a>&rsquo;s&nbsp;(West Conshohocken, Pa., U.S.) composite materials committee (D30).</p>\n\n<p>The award commemorates the technical and humanitarian contributions of Wayne W. Stinchcomb and recognizes Rousseau&rsquo;s significant contributions to the advancements of composites technology and his Memorial Lecture delivered in 2024.</p>\n\n<p>An ASTM International member since 1987, Rousseau has also been honored with the Outgoing Chairman Award (2011), the Award of Appreciation (2002, 2015), the Distinguished Service Award (2012) and the Award of Merit (2017).</p>\n\n<p>Rousseau&rsquo;s career focus is composite structural analysis methods, testing and design allowables development. He attained his current position at Lockheed Martin Aeronautics in 2025 but has been with the company since 2001, prior to which he worked with GE Aircraft Engines and Bell Helicopter.</p>\n\n<p>Rousseau earned his doctoral degree in engineering mechanics from Clemson University in 1994.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/lockheed-martin-tech-fellow-carl-rousseau-earns-astm-award"
      }
    ],
    "link": "https://www.compositesworld.com/news/lockheed-martin-tech-fellow-carl-rousseau-earns-astm-award"
  },
  {
    "published": "Thu, 19 Jun 2025 15:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      19,
      19,
      0,
      0,
      3,
      170,
      0
    ],
    "title": "ZAL, CRIAQ partner on advanced digital solutions and future propulsion for sustainable aviation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ZAL, CRIAQ partner on advanced digital solutions and future propulsion for sustainable aviation"
    },
    "summary": "German and Canadian research centers will implement joint projects in advanced technologies to foster innovation, promote international exchange of expertise and support talent mobility.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "German and Canadian research centers will implement joint projects in advanced technologies to foster innovation, promote international exchange of expertise and support talent mobility."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CEOs for ZAL and CRIAQ sign partnership agreement\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-zal-criaq.jpg;maxWidth=720\" /> </div>\n\n<p>Source | ZAL</p>\n</div>\n\n<p>The <a href=\"https://www.zal.aero\" target=\"_blank\">ZAL Center of Applied Aeronautical Research</a> (Hamburg, Germany) and <a href=\"https://www.criaq.aero/en/\" target=\"_blank\">Consortium for Research and Innovation in Aerospace in Qu&eacute;bec</a> (CRIAQ, Canada)&nbsp;have formed a partnership to implement joint research projects in advanced technologies and to support international talent mobility.&nbsp;</p>\n\n<p><em>CW</em> readers will recognize ZAL as the current home for the completed <a href=\"https://www.compositesworld.com/news/mffd-longitudinal-seams-welded-worlds-largest-cfrtp-fuselage-successfully-completed\" target=\"_blank\">Multifunctional Fuselage Demonstrator (MFFD)</a>, a thermoplastic composite fuselage produced within the&nbsp;EU-funded Clean Sky 2/<a href=\"https://www.clean-aviation.eu/news-events/bringing-the-next-generation-multifunctional-fuselage-demonstrator-mffd-to-life\" target=\"_blank\">Clean Aviation</a>&rsquo;s&nbsp;Large Passenger Aircraft&nbsp;(LPA)&nbsp;Innovative Aircraft Demonstrator Platform (IADP). Meanwhile, CRIAQ has been involved with developing thermoplastic composite aerostructures for decades&nbsp;&mdash;&nbsp;including a helicopter tail boom&nbsp;&mdash;&nbsp;and is now seeking partners for the <a href=\"https://www.criaq.aero/en/projects/\" target=\"_blank\">HAUTE project</a> (High-rate manufacturing of Aerostructures Using Thermoplastic composites and adaptive Equipment).&nbsp;&nbsp;</p>\n\n<p>Under the&nbsp;new partnership agreement, ZAL and CRIAQ will collaborate on key enabling technologies, especially&nbsp;in the areas of advanced digital solutions such as AI&nbsp;and future-oriented propulsion systems aimed at improving the sustainability of aviation. The focus lies on fostering innovation and promoting the international exchange of expertise and&nbsp;builds on existing agreements and previous collaborations, including successful projects such as&nbsp;&ldquo;Lightweight Bionic Aircraft Interior&rdquo; in the field of 3D printing and &ldquo;New Acoustic Insulation Meta-Material Technology for Aerospace&rdquo; in the field of acoustics.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/zal-criaq-partner-on-advanced-digital-solutions-and-future-propulsion-for-sustainable-aviation"
      }
    ],
    "link": "https://www.compositesworld.com/news/zal-criaq-partner-on-advanced-digital-solutions-and-future-propulsion-for-sustainable-aviation"
  },
  {
    "published": "Thu, 19 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      19,
      16,
      0,
      0,
      3,
      170,
      0
    ],
    "title": "What you might have missed at Paris Air Show 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "What you might have missed at Paris Air Show 2025"
    },
    "summary": "A surge in defense spending, partnerships in hydrogen propulsion and new combat aircraft agreements, many backed by composites industry leaders, culminated the&nbsp;55th Paris Air Show.\n\n&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A surge in defense spending, partnerships in hydrogen propulsion and new combat aircraft agreements, many backed by composites industry leaders, culminated the&nbsp;55th Paris Air Show.\n\n&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-aerobaticgroupformation-GettyImages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerobatic group formation leaving trail at blue sky.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-aerobaticgroupformation-GettyImages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.siae.fr/en/\" target=\"_blank\">The Paris Air Show</a>,&nbsp;organized by SIAE, a subsidiary of the French Aerospace Industries Association (GIFAS),&nbsp;is an international aerospace trade show held every couple of years in France, providing a platform for&nbsp;aircraft displays, product demonstrations&nbsp;and networking opportunities. The event was held June 16-22, 2025, and did not disappoint with its 2,500 exhibitors representing 48 countries, and up to 150 aircraft and 210 flying displays.</p>\n\n<p>According to reports made by several acclaimed sources,&nbsp;Airbus dazzled the this year&rsquo;s show with $21 billion in aircraft orders &mdash; highlighted by deals from AviLease, Riyadh Air, Starlux, LOT, JSX&nbsp;and SkyWest &mdash; while Boeing pulled back significantly in the aftermath of the Air India 787 crash, canceling executive attendance and declining to announce new commercial sales. Despite the somber tone set by the disaster and geopolitical tensions, the event still showcased a surge in defense spending, hydrogen propulsion breakthroughs&nbsp;and new combat aircraft partnerships.</p>\n\n<p><em>CW</em> presents key announcements and highlights shared at the Paris Air Show that pertain to composites-related developments below.</p>\n\n<hr />\n<div class=\"article_sidebar\">\n<h3>Fiber Dynamics, Fill GmbH and NIAR to advance U.S. aerospace manufacturing</h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/fiber-dynamics\" target=\"_blank\">Fiber Dynamics</a> (Wichita, Kan., U.S.), an aerospace composites company, and Austrian engineering company&nbsp;<a href=\"https://www.compositesworld.com/suppliers/fill-gesellschaft-mbh\" target=\"_blank\">Fill</a>&nbsp;(Gurten) have announced a strategic partnership to expand advanced composites manufacturing capabilities in the U.S.</p>\n\n<p>The collaboration, supported by Wichita State University&rsquo;s <a href=\"https://www.compositesworld.com/suppliers/national-institute-for-aviation-research\" target=\"_blank\">National Institute for Aviation Research</a> (NIAR), represents a step in reshoring manufacturing and strengthening the U.S. aerospace supply chain. It will enable automated manufacturing of composite parts, from fiber to fully inspected finished parts, for both commercial aerospace and defense applications, as well as other high-performance industries.&nbsp;</p>\n\n<p><em><a href=\"https://www.compositesworld.com/news/fiber-dynamics-fill-gmbh-partner-to-expand-us-aerocomposites\" target=\"_blank\">Read the complete announcement here</a>.</em></p>\n</div>\n\n<hr />\n<h3><strong>Ascendance, Airbus form alliance to progress hybrid-electric propulsion</strong></h3>\n\n<p>On June 12, <a href=\"https://www.ascendance-ft.com/\" target=\"_blank\">Ascendance Flight Technologies</a>&nbsp;(Toulouse, France) announced a&nbsp;strategic partnership to jointly explore hybrid-electric technologies with Airbus (Toulouse). Ascendance will brings its expertise in designing modular, certifiable hybrid-electric systems, while Airbus contributes its industrial scale and global experience. This combination of strengths will target the development of&nbsp;hybrid-electric systems that reduce aviation emissions and meet the industry&rsquo;s rigorous certification standards.</p>\n\n<p>Materials consideration is not disclosed at this time. Regardless, both aerospace companies support composites-intensive aircraft platforms &mdash; Ascendance with its <a href=\"https://aviationweek.com/aerospace/advanced-air-mobility/ascendance-progresses-work-first-full-scale-demonstrator#:~:text=In%20addition%20to%20powering%20the,undisclosed%20supplier's%20facility%20in%20France.\" target=\"_blank\">Atea hybrid eVTOL</a>&nbsp;(as well as a&nbsp;<a href=\"https://www.compositesworld.com/news/solvay-ascendance-flight-technologies-and-airborne-join-forces\" target=\"_blank\">2023 collaboration</a> with Solvay and Airborne), and Airbus&rsquo;&nbsp;A220, A350 and A380 models in particular.</p>\n\n<hr />\n<h3><strong>Airbus, MTU Aero Engines to advance&nbsp;hydrogen fuel cell technology</strong></h3>\n\n<p>A memorandum of understanding (MOU) with <a href=\"https://www.mtu.de/\" target=\"_blank\">MTU Aero Engines</a> (Munich, Germany) will progress&nbsp;hydrogen fuel cell propulsion to decarbonize aviation.</p>\n\n<p>The partnership follows Airbus&rsquo; decision to focus its research effort on a fully electric, hydrogen-powered aircraft with a fuel cell engine, a field in which MTU has developed recognized expertise through its Flying Fuel Cell concept. The development also follows Airbus pushing out its&nbsp;<a href=\"https://www.compositesworld.com/news/airbus-pushes-zeroe-aircraft-project-timeline-to-2040s\" target=\"_blank\">ZEROe aircraft project timeline</a>, though the company at the time stated that it was still&nbsp;&ldquo;committed to ...&nbsp;bringing a commercially viable, fully electric hydrogen-powered aircraft to market.&rdquo;</p>\n\n<p>The agreement with MTU sets out a three-step roadmap for the development of a hydrogen-powered fuel cell engine suitable for the commercial aviation market. The first step is to mature the technological building blocks essential for the engine through joint research projects, such as Clean Aviation. The second step will involve aligning the two partners&rsquo;&nbsp;R&amp;T roadmaps on hydrogen technologies. The result of these joint explorations then would allow the companies&nbsp;to consider a third step toward&nbsp;the development of a fuel-cell engine for a hydrogen powered aircraft.</p>\n\n<div class=\"article_sidebar\">\n<h3>Hexcel, NIAR to form Hexcel&nbsp;<strong>Application Center in Kansas</strong></h3>\n\n<p>On June 16, <a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel Corp.</a> (Stamford, Conn., U.S.) and the <a href=\"https://www.compositesworld.com/suppliers/national-institute-for-aviation-research\" target=\"_blank\">National Institute for Aviation Research</a> (NIAR) at Wichita State University (WSU, Kan., U.S.), signed a memorandum of understanding (MOU) as an initial step to establish the Hexcel Application Center at NIAR ATLAS in Kansas. This effort aims to broaden the development and application of composite materials in the aerospace and defense industries.</p>\n\n<p>Once established, the Hexcel Application Center will leverage Hexcel&rsquo;s expertise in composite materials and NIAR&rsquo;s extensive research capabilities to accelerate innovation and enhance the U.S. composite industry&rsquo;s competitiveness. The Hexcel Application Center aims to focus on several key areas, including automated layup and fiber placement, liquid composite molding and infusion, high-temperature carbon-based materials, advanced material processing to support high-rate manufacturing&nbsp;and improved performance of carbon fiber composites.</p>\n\n<p>The Hexcel Application Center will be housed within NIAR&rsquo;s&nbsp;Advanced Technologies Lab for Aerospace Systems in Wichita, and will include a donation of more than $10 million in state-of-the-art equipment, including an AFP&nbsp;machine and an autoclave, to support collaborative R&amp;D. These efforts will also benefit from the National Center for Advanced Materials Performance (NCAMP) database.</p>\n\n<hr />\n<h3><strong>Embraer&nbsp;recognizes Hexcel as preferred supplier</strong></h3>\n\n<p>Hexcel celebrates&nbsp;50 years of supply to <a href=\"https://embraer.com/\" target=\"_blank\">Embraer</a>&nbsp;(S&atilde;o Jos&eacute; dos Campos, Brazil)&nbsp;marked by the signing of a preferred supplier agreement for composite raw materials.&nbsp;&ldquo;Our relationship has been built on trust, innovation&nbsp;and shared vision,&rdquo; says&nbsp;Tom Gentile, chairman, president and CEO of Hexcel. &ldquo;Hexcel&rsquo;s materials have been integral to the performance and efficiency of Embraer&rsquo;s&nbsp;aircraft, and we look forward to continuing this journey together.&rdquo;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-hexcel-embraer.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hexcel and Embraer at Paris Air Show.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-hexcel-embraer.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Hexcel, Embraer</p>\n</div>\n\n<p>Hexcel has been a longstanding provider of a range of advanced composite materials to Embraer, including prepregs, engineered core and advanced structures. These materials are used in various Embraer aircraft platforms, such as the C-390 military transport, the <em>E-Jet E2</em> family of narrowbody regional aircraft&nbsp;and the <em>Phenom 300</em> business jet.</p>\n\n<p>Hexcel&rsquo;s history with Embraer is also marked by numerous achievements, including the recent recognition as Supplier of the Year in the Standards and&nbsp;Materials Category.&nbsp;<strong> </strong></p>\n\n<hr />\n<h3>Hexcel highlights TPC aircraft door demonstrator, part of HELUES multi-partnership project</h3>\n\n<p>Hexcel also spotlighted a carbon fiber-reinforced&nbsp;polyetherketoneketone (PEKK) thermoplastic component developed as part of the&nbsp;HELUES project. This was supported by the company&rsquo;s strategic alliance with Arkema (Cologne, Germany) in 2018 to develop&nbsp;thermoplastic composite solutions for the aerospace sector.</p>\n\n<p>The HELUES project, funded by the Bavarian State Ministry of Economic Affairs and supported by the German Aerospace Centre&nbsp;(DLR), brought together Airbus Helicopters Deutschland GmbH, Neue Materialien Bayreuth GmbH, Siebenwurst GmbH &amp; Co. KG, Incoe&nbsp;International Europe, in addition to Arkema&nbsp;and Hexcel. In this project, partners developed&nbsp;a novel manufacturing&nbsp;process using high-temperature thermoplastic composites.</p>\n\n<p>The final HELUES demonstrator is a complex structural component for an overwing emergency exit door.&nbsp;At its core is&nbsp;a one-step forming and injection overmolding technology that uses&nbsp;HexPly&nbsp;unidirectional (UD) carbon fiber-reinforced Kepstan&nbsp;PEKK tapes in conjunction with Kepstan&nbsp;PEKK injection molding compounds. This integrated approach enabled&nbsp;the rapid creation of a fully formed, structurally complex component, including reinforcing ribs and functional elements, in less than 2&nbsp;minutes.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-hexcel-helues-project.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aircraft door demonstrator.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-hexcel-helues-project.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Hexcel</p>\n</div>\n\n<p>&ldquo;By eliminating autoclaves and enabling functional integration in a single step, thermoplastics are opening the door to truly scalable aircraft production,&rdquo; says&nbsp;Thierry Merlot, Hexcel&nbsp;president aerospace Europe, Asia Pacific, Middle East, Africa and&nbsp;Industrial.</p>\n\n<p>The HELUES demonstrator directly replaces a traditionally assembled door structure with a single, integrated part, reducing component count and assembly steps by up to 90%. Early stage testing confirmed optimal material bonding between molded ribs and thermoformed laminates, even under complex process parameters, further supporting the part&rsquo;s viability in demanding aerospace environments.</p>\n\n<hr />\n<h3>Hexcel to support key defense programs with Kongsberg partnership</h3>\n\n<p><a href=\"https://www.kongsberg.com/\" target=\"_blank\">Kongsberg Defence &amp; Aerospace AS</a> (Norway) and Hexcel have signed a long-term&nbsp;partnership agreement for the supply of HexWeb&nbsp;engineered honeycombs and HexPly&nbsp;prepregs for Kongsbergy&rsquo;s&nbsp;strategic production programs over a 5-year period.</p>\n\n<p>&ldquo;The agreement provides a solid base for Kongberg&rsquo;s&nbsp;[defense] production program for several years to come,&rdquo;&nbsp;says Terje Br&aring;then, EVP aerostructures and&nbsp;MRO at Kongsberg.</p>\n\n<hr />\n<h3>What did Hexcel have on display at Paris Air Show?</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-hexcel-gkn-wingbox-rib.jpg\" target=\"_blank\"><img alt=\"Wingbox rib.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-hexcel-gkn-wingbox-rib.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Hexcel</p>\n</div>\n\n<p>&ldquo;At Hexcel, we are committed to supporting the aerospace industry&rsquo;s transition toward faster and automated manufacturing processes,&rdquo; says Merlot. The company supported this statement through the showcase of real-world components featuring its&nbsp;HexPly M51 rapid-curing prepreg:</p>\n\n<ul>\n\t<li><strong>GKN Aerospace wingbox rib.&nbsp;</strong>Developed as part of the ASCEND project, this thermoset&nbsp;press molded rib exemplified&nbsp;the scalability of HexPly M51 for large-volume aerospace components. Its rapid-cure capabilities and automation readiness support GKN Aerospace&rsquo;s strategy for next-generation aircraft production.</li>\n\t<li><strong>Duqueine&nbsp;fuselage frame.&nbsp;</strong>Created within the CORAC program, this fuselage frame has demonstrated processing time reductions of more than&nbsp;50% using HexPly M51 carbon fiber UD materials.&nbsp;</li>\n</ul>\n\n<p>HexPly M51 is designed specifically for hot-in/hot-out press curing of primary structure composite parts. It delivers shorter cure cycles and reduces the need for multiple sets of tooling, ancillary material consumption and manual labor, according to Hexcel. Importantly, HexPly M51 is ideal for aerospace OEMs targeting high-rate production programs with flexible curing possibilities, fully compatible with ATL, AFP&nbsp;and pick-and-place technologies.</p>\n</div>\n\n<h3>&nbsp;</h3>\n\n<h3>GKN Aerospace supports Airbus-led ICEFlight program</h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gkn-aerospace\" target=\"_blank\">GKN Aerospace</a> (Redditch, U.K.) has joined the collaborative&nbsp;Innovative Cryogenic Electric Flight (ICEFlight)&nbsp;project. The initiative is led by Airbus, through its Tech Hub in the Netherlands and together with its innovation arm Airbus UpNext under the Dutch public-private program&nbsp;Luchtvaart in Transitie&nbsp;(LiT).</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-airbus-upnext-cryogenics.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-airbus-upnext-cryogenics.png;maxWidth=385\" /></a></div>\n\n<p>Airbus UpNext engineer is working on cryogenic technologies. Source | Airbus</p>\n</div>\n\n<p>ICEFlight will focus on accelerating the maturation of critical cryogenic technologies<strong>. </strong>Alongside GKN Aerospace, Airbus is also partnering with Cryoworld B.V., Stirling Cryogenics B.V., Futura Composites B.V., the Royal NLR, Delft University of Technology and the University of Twente. The consortium will collectively explore the use of<strong> </strong>liquid hydrogen as a fuel source as well as a cold source for the electrical system cooling. This approach aims to enhance the performance of next-generation aircraft powertrains through the integration of advanced electrical technologies, superconductivity and hyperconductivity.</p>\n\n<p>GKN Aerospace will apply knowledge from past projects to mature these technologies. The collaboration will concentrate on the development and rigorous testing of specialized cryogenic cooling and electrical distribution systems.&nbsp;At the end of the project, the research framework and supply chain will be positioned to provide two critical innovations, namely a cryogenic cooling system<strong> </strong>and cryogenic electrical network<strong>.</strong></p>\n\n<p>In addition to the technological innovations to be explored, ICEFlight aims to establish<strong> </strong>testing facilities in the Netherlands, led by the Royal NLR, to ensure the reliability and validate the performance of the cryogenic systems for aviation, with opportunities to spin off to other sectors.</p>\n\n<hr />\n<h3>GKN, Archer expand collaboration for manufacture of key eVTOL airframe components in the U.K.</h3>\n\n<p>GKN Aerospace is collaborating with <a href=\"https://archer.com/\" target=\"_blank\">Archer Aviation Inc.</a>&nbsp;(Santa Clara, Calif., U.S.), manufacturing and supplying&nbsp;key airframe components for the eVTOL company&rsquo;s <em>Midnight</em> aircraft in the U.K. The partnership supports Archer&rsquo;s production ramp phase.</p>\n\n<p>GKN will use and build on its extensive experience in lightweight aerostructures, wing technologies&nbsp;and electrical systems to support the manufacture and supply of <em>Midnight</em>&rsquo;s wing. This work expands the existing collaboration between Archer and GKN Aerospace, through which it has supplied Midnight&rsquo;s low voltage electrical wiring interconnection systems (EWIS) since 2023. These components are critical to the aircraft&rsquo;s performance, safety&nbsp;and manufacturability as Archer prepares for commercial launch.</p>\n\n<p>The collaboration will leverage GKN Aerospace&rsquo;s advanced manufacturing technologies to ensure the wing structure meets the stringent performance and certification requirements. Work has been underway at GKN Aerospace UK&rsquo;s Global Technology Centre in Bristol and across its European sites for over a year.</p>\n\n<hr />\n<h3><strong>GKN Aerospace leads &pound;12M ASPIRE program</strong></h3>\n\n<p>GKN Aerospace has launched ASPIRE, a new &pound;12 million&nbsp;U.K. R&amp;D program&nbsp;to develop and demonstrate next-gen&nbsp;composite wing and flap structures. The 3-year program&nbsp;officially started in May 2025 and will run until April 2028.</p>\n\n<p>ASPIRE will deliver three full-scale composite wingtip variants for structural testing to ultimate load, providing an&nbsp;opportunity to validate novel technologies&nbsp;in highly relevant test conditions. Each wingtip variant will represent a different structural philosophy and technology set. Variant one is a bonded assembly with multiple parts, aligned with GKN Aerospace&rsquo;s design approach. Variant two is a quasi-isotropic co-infused RTM&nbsp;structure featuring automated deposition, forming, digital twin integration and Pentaxia&rsquo;s self-heated tooling (JouleTool). Variant three, introduces non-standard fiber angles, low-energy dry fiber forming&nbsp;and SmaRTM processing.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-gkn-wing-technology-gtc.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Wing technology at GTC.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-gkn-wing-technology-gtc.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | GKN Aerospace</p>\n</div>\n\n<p>Key innovations under evaluation include <a href=\"https://www.compositesworld.com/suppliers/icomat\" target=\"_blank\">iCOMAT</a>&rsquo;s&nbsp;(Bristol, U.K.) Rapid Tow Sheared (RTS) lightweight structure and <a href=\"https://carbonthreesixty.com/\" target=\"_blank\">Carbon </a><a href=\"https://carbonthreesixty.com/\" target=\"_blank\">ThreeSixty</a>&rsquo;s&nbsp;(Chippenham, U.K.) stitched deltoid noodles, made from recycled carbon fibers aligned through the <a href=\"https://www.lineat.co.uk/\" target=\"_blank\">Lineat</a>&nbsp;(Bristol)&nbsp;aligned formable fiber technology (AFFT) process. These developments are supported by analytical and numerical methods developed by the University of Bath.</p>\n\n<p>Alongside the wingtip demonstrators, ASPIRE will also develop an optimized composite flap. The flap demonstration will feature a prepreg manufacturing approach with RTS skins (iCOMAT), tailored fiber&nbsp;placed brackets (Carbon ThreeSixty), low-energy, out-of-autoclave curing molds and press cured ribs.</p>\n\n<p>A key program&nbsp;milestone will be achieving TRL 6 for the press curing of composite ribs. This builds on GKN Aerospace&rsquo;s experience producing the A350 flap in Munich and will support future improvements for the next-gen&nbsp;single-aisle aircraft.</p>\n\n<div class=\"article_sidebar\">\n<h3><strong>Archer announces third Launch Edition&nbsp;partner, striking deal to deploy <em>Midnight </em>in Indonesia</strong></h3>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-archer-evtol-min.png\" target=\"_blank\"><img alt=\"Midnight eVTOL on runway.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-archer-evtol-min.png;maxWidth=385\" /></a></div>\n\n<p>Source | Archer Aviation Inc.</p>\n</div>\n\n<p>Archer Aviation has signed an agreement with PT.&nbsp;IKN&nbsp;(Indonesia) covering plans to deploy an initial fleet of 50&nbsp;<em>Midnight</em> aircraft in Indonesia, making it the third country in which Archer is planning to deploy the eVTOL under its &ldquo;Launch Edition&rdquo; program.</p>\n\n<p>As with Archer&rsquo;s other Launch Edition partners, the goal of this program is to establish a pragmatic and repeatable commercialization playbook to deploy <em>Midnight</em> in early adopter markets in advance of type certification in the U.S. In addition to Indonesia, Archer has already announced planned Launch Edition program deployments <a href=\"https://www.compositesworld.com/news/archer-to-establish-international-presence-in-uae\" target=\"_blank\">in the UAE</a> and Ethiopia.</p>\n\n<p>The scope of Archer&rsquo;s planned Launch Edition program with PT. IKN includes the deployment of an initial fleet of Midnight Launch Edition aircraft to Indonesia with a supporting team of Archer pilots, technicians and engineers. Archer also plans to provide backend operational software&nbsp;and front-end booking applications to help power operations during the program.&nbsp;In addition to air taxi services, the parties intend to explore a range of complementary use cases such as logistics and environmental surveillance, including in support of the development of Indonesia&rsquo;s new capital city, Ibu Kota Nusantara (IKN).</p>\n\n<hr />\n<h3>Archer announced five-country eVTOL alliance&nbsp;</h3>\n\n<p>Archer also joined leaders from the FAA and U.S. DOT to announce the formation of a five-country alliance to streamline the certification and deployment of eVTOL aircraft globally. This alliance includes the U.S., U.K. Australia, Canada and New Zealand.</p>\n\n<p>The goal of this effort is to streamline the certification and validation process for eVTOL aircraft, like <em>Midnight</em>, globally. Archer believes that this&nbsp;alliance has the potential to create a seamless pathway to bring <em>Midnight</em> to the skies of these other countries once the company obtains type certification in the U.S from the FAA.</p>\n</div>\n\n<h3><strong>France and Spain renew commitment to Airbus A400M program</strong></h3>\n\n<p>Airbus and OCCAR (Bonn, Germany) have reached an agreement with the A400M launch nations to secure production for the program&nbsp;for the foreseeable future<em>,</em> improve the cost of operations and jointly develop new capabilities. Through the agreement, France and Spain stated their intention to advance four and three A400M aircraft respectively in their delivery schedule.</p>\n\n<p>As key enablers, Airbus has committed to work on operational cost improvements through maintenance optimization and efficiency measures, and make A400M future developments faster and more cost-effective. Through the agreement, both Airbus and OCCAR will review the industrial status of the program&nbsp;on a yearly basis, giving the A400M production setup stability to pursue the evolution of the platform and open export opportunities.</p>\n\n<p>Among these new capabilities, Airbus is already looking into developments like standoff jamming, payload increase to 40 tonnes,<em> </em>mothership for remote carriers and firefighting &mdash;&nbsp;developments that will further widen the A400M applications and are key to the present and future global requirements for both current and future operators.</p>\n\n<p>The A400M, a&nbsp;four-engine turboprop military transport aircraft, is comprised of more than 30% composites. This includes its wing spars, vertical and horizontal tailplane and the upper cargo door &mdash; at the time of <a href=\"https://www.compositesworld.com/articles/inside-manufacturing-a400m-cargo-door-out-of-the-autoclave\" target=\"_blank\"><em>CW</em>&rsquo;s report on it in 2010</a>,&nbsp;the&nbsp;largest structural composite aircraft component produced to date using&nbsp;vacuum-assisted resin infusion.</p>\n\n<hr />\n<div class=\"article_sidebar\">\n<h3>WHI Global announces Enfield expansion and new contract with Sikorsky to support the <em>Black Hawk</em></h3>\n\n<p>Connecticut Governor Ned Lamont and business-driven nonprofit <a href=\"https://www.advancect.org\" target=\"_blank\">AdvanceCT</a>&nbsp;(New Haven) have announced that aerospace component manufacturer, <a href=\"https://www.compositesworld.com/suppliers/whi-global\" target=\"_blank\">WHI Global&nbsp;LLC</a> (Fairfield, N.J., U.S.), will open a new production facility in Enfield, Connecticut. Concurrently, WHI subsidiary <a href=\"https://www.compositesworld.com/suppliers/aerobond-composites\" target=\"_blank\">Aerobond Composites&nbsp;LLC</a> (Springfield, Mass., U.S.) announced that it has signed contracts with Sikorsky, a Lockheed Martin company, to produce various components for the <a href=\"https://www.compositesworld.com/search?q=UH-60%20Black%20Hawk\" target=\"_blank\">UH-60 <em>Black Hawk&nbsp;</em>helicopter</a>. WHI is backed by private investment fund RVE Partners.</p>\n\n<p>WHI is a vertically integrated manufacturer of complex composite parts and assemblies for the aerospace and defense markets. With a growing business, WHI made the decision to open a new facility in Connecticut to be closer to some of its larger customers.</p>\n\n<p>WHI&rsquo;s new facility is being designed with expansion in mind. Currently under construction, the site will feature cleanrooms and expanded capacity to support additional production lines in the future. It will support composites manufacturing capabilities including layup, bonding, rubber vulcanization and compression molding for aerospace and defense customers. WHI plans to hire more than&nbsp;40 employees in Connecticut and invest $12 million in the new facility.</p>\n\n<p>The company has been working closely with AdvanceCT to help navigate the many benefits offered to manufacturers opening new facilities in the state of Connecticut. WHI is planning a formal ribbon cutting for later in 2025.</p>\n</div>\n\n<h3>Horizon Aircraft partners with MT-Propeller for Hybrid eVTOL composite propellers</h3>\n\n<p align=\"left\"><a href=\"https://www.horizonaircraft.com/\" target=\"_blank\">New Horizon Aircraft Ltd.</a>&nbsp;(Toronto, Canada), doing business as Horizon Aircraft, announces a strategic partnership with <a href=\"https://www.mt-propeller.com/\" target=\"_blank\">MT-Propeller</a>&nbsp;(Atting, Germany), to supply propellers for Horizon&rsquo;s eVTOL aircraft hybrid turbine engine.</p>\n\n<p align=\"left\">MT-Propeller is known for&nbsp;manufacturing natural composite propellers for single- and twin-engine aircraft, airships, wind tunnels and other applications. The collaboration will leverage this composite propeller blade expertise to deliver maximum speed, efficiency&nbsp;and significant noise reduction for Horizon&rsquo;s <em>Cavorite X7 </em>aircraft in development. The hybrid-electric aircraft is designed for both vertical takeoff and conventional runway operations.</p>\n\n<div class=\"article_sidebar\">\n<h3>VoltAero reveals evolved configuration of <em>Cassio 330</em></h3>\n\n<p><a href=\"https://www.voltaero.aero/\" target=\"_blank\">VoltAero</a>&nbsp;(Saint-Agnant, France) has unveiled the&nbsp;production configuration of its <em>Cassio 330</em> electric-hybrid aircraft for regional transportation.&nbsp;Multiple factors led to this evolution, resulting in decreased complexity for the <em>Cassio 330</em>&rsquo;s airworthiness certification and aligning its overall design in compliance with the EASA&rsquo;s latest CS.23 certification specifications for normal category airplanes.</p>\n\n<p>&ldquo;As we take another step toward the Cassio 330&rsquo;s production, our strategy remains unchanged: using safe and efficient electric-hybrid propulsion and power technologies that are realistically available today, applying them to a conventional takeoff/landing aircraft for sustainable regional transportation using existing airport infrastructure,&rdquo; explains&nbsp;Jean Botti, VoltAero&rsquo;s CEO and CTO.</p>\n\n<p>At the heart of VoltAero&rsquo;s evolution for the <em>Cassio 330 </em>production version is the use of a series-hybrid architecture, versus the original parallel-hybrid configuration. During taxi, takeoff and initial flight phases, the aircraft will operate&nbsp;on all-electric propulsion for eco-efficient and quiet operations. The thermal engine recharges the batteries during cruise flight as a range extender.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-voltaero-cassio330-configuration.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Cassio 330 in rendered flight.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-voltaero-cassio330-configuration.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | VoltAero</p>\n</div>\n\n<p>Another visible difference for the Cassio 330&rsquo;s production configuration is VoltAero&rsquo;s adoption of a T-tail instead of the original design&rsquo;s twin booms that supported a high-set horizontal tail. This change eliminates the potential of damage to the twin booms in the event of a propeller blade failure. The new configuration also has a fully redundant architecture for operational safety and other innovations.</p>\n\n<p>VoltAero will produce the <em>Cassio 330</em> at its&nbsp;purpose-built 2,400-square-meter industrial facility&nbsp;at Saint Agnant. <a href=\"https://www.compositesworld.com/news/voltaero-opens-facility-in-france-for-cassio-aircraft\" target=\"_blank\">Inaugurated last November</a>, this location serves as the primary hub for production and delivery of Cassio family aircraft &mdash;&nbsp;supported by VoltAero&rsquo;s on-site design, engineering, flight test and administrative departments. It is sized for the assembly of 150 Cassio airplanes annually at full rate, to be backed by additional production sites created in other key geographical markets.</p>\n\n<p><em>In the same week, VoltAero&nbsp;signed an&nbsp;agreement for 15 </em>Cassio 330<em> electric-hybrid aircraft and an option for another 15, to be acquired by HM Aerospace Sdn Bhd&nbsp;(Kuala Lumpur) for pilot training at Malaysia&rsquo;s flight academy after EASA certification and validation by the Civil Aviation Authorities of Malaysia. The agreement, formalized at the Paris Air Show,&nbsp;brings a new dimension to VoltAero&rsquo;s orderbook for its Cassio electric-hybrid airplanes by expanding their use &mdash;&nbsp;together with Halim Mazmin Group &mdash;&nbsp;to the training role for professional pilots, and expanding it over the Asia-Pacific region, where pilots are in great demand.</em></p>\n</div>\n\n<h3>FACC, Kineco forge strategic partnership</h3>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-facc-kineco-paris-signoff.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-facc-kineco-paris-signoff.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | FACC AG, Kineco</p>\n</div>\n\n<p><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.facc.com&amp;esheet=52783801&amp;newsitemid=20220718005475&amp;lan=en-US&amp;anchor=FACC&amp;index=2&amp;md5=5bfa230c491305979c57e1234ec1a3f0\" rel=\"nofollow\" target=\"_blank\">FACC AG</a>&nbsp;(Ried im Innkreis, Austria) and <a href=\"https://www.linkedin.com/company/kinecoaero/\" target=\"_blank\">Kineco Aerospace &amp; Defence</a>&nbsp;(Goa, India), a part of the Kineco Group, signed a multiyear supply chain agreement, marking the start of a strategic collaboration in the sourcing of composite components for commercial aircraft work packages.</p>\n\n<p>This agreement initiates a critical 10-month phase of technical alignment, customer qualification and operational co-operation between FACC and Kineco. Upon successful execution, it is expected to evolve into a long-term relationship delivering value to both partners and their global customers.</p>\n\n<p>The partnership is a strong validation of Kineco&rsquo;s capabilities in advanced composites and further reinforces FACC&rsquo;s&nbsp;global supply chain ecosystem.</p>\n\n<div class=\"article_sidebar\">\n<h3>U.S. operations begin for Aura Aero training aircraft</h3>\n\n<p>French aircraft manufacturer&nbsp;<a href=\"https://aura-aero.com/en/\" target=\"_blank\">Aura Aero Inc.</a>&nbsp;(Cugnaux), having announced it was building its U.S. presence <a href=\"https://www.compositesworld.com/news/aura-aero-builds-presence-in-us-with-florida-facility\" target=\"_blank\">in October 2024</a>, has officially opening its 10,000-square-foot facility in Daytona Beach, Florida,&nbsp;enabling local assembly, delivery and support of its <em>Integral</em>&nbsp;two-seat training aircraft. In 2023, <a href=\"https://aura-aero.com/en/medias/press-release/aura-aero-exhibits-at-aero-friedrichshafen/#:~:text=Like%20all%20the%20aircraft%20in%20the%20AURA,ensures%20lightness%2C%20resistance%20and%20easy%20operational%20implementation.\" target=\"_blank\">the company notes</a> that the aircraft was &ldquo;designed anticipating its environmental impact during flight as well as its end-of-life recyclability, being manufactured with a wood-carbon composite that ensures lightness, resistance and easy operational implementation.&rdquo;</p>\n\n<p>Initial activity at the Florida site will focus on the <em>Integral&nbsp;R</em>, certified in Europe and now on an FAA fast-track for U.S. approval. The facility will also host two prototypes of the all-electric <em>Integral&nbsp;E</em>, due to begin flight testing ahead of expected service entry in early 2027.</p>\n\n<p>At the 2025 Paris Air Show, the company also launched its Enbata&nbsp;drone program, designed for both civil and defense use and&nbsp;targeted to fly by the end of 2026.&nbsp;Enbata&nbsp;shares digital systems and modular design principles with the ERA aircraft, and leverages the company&rsquo;s existing certified manufacturing platform.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/what-you-might-have-missed-at-paris-air-show-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/what-you-might-have-missed-at-paris-air-show-2025"
  },
  {
    "published": "Thu, 19 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      19,
      15,
      0,
      0,
      3,
      170,
      0
    ],
    "title": "Coriolis Composites heightens U.S. presence to empower AFP",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Coriolis Composites heightens U.S. presence to empower AFP"
    },
    "summary": "With innovation, expertise&nbsp;and a deep commitment to its partners&rsquo; success, France-based Coriolis Composites is actively strengthening its strategic footprint across North American composites manufacturing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "With innovation, expertise&nbsp;and a deep commitment to its partners&rsquo; success, France-based Coriolis Composites is actively strengthening its strategic footprint across North American composites manufacturing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-coriolis-afp-range-min.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-coriolis-afp-range-min.png;maxWidth=720\" /> </a></div>\n\n<p>AFP equipment offerings. Source (All Images) | Coriolis Composites</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/coriolis-composites-sas\" target=\"_blank\">Coriolis Composites</a>&nbsp;(Qu&eacute;ven, France)&nbsp;continues to strengthen its strategic footprint in the U.S., leveraging innovation&nbsp;and a strong commitment to advancing composite manufacturing technologies.</p>\n\n<p>At the core of this strategy is the promotion of the company&rsquo;s next-generation automated fiber placement (AFP) machine, the <a href=\"https://www.compositesworld.com/products/coriolis-highlights-c12-afp-system-for-multi-material-rd-applications\" target=\"_blank\">C1.2</a> (launched in 2022), specifically engineered to drape complex concave parts with high&nbsp;precision and efficiency. Complementing this, Coriolis is expanding its product range with the large dockable heads on the <a href=\"https://www.compositesworld.com/products/coriolis-composites-introduces-the-c3-dockable-afp-head\" target=\"_blank\">C3</a> (launched this year) and C5 (launched in 2020). Coriolis says it offers&nbsp;a complete AFP product lineup, capable of handling both small, complex parts and large aerostructures &mdash; including&nbsp;wing components&mdash;&nbsp;via both robotic and gantry systems.</p>\n\n<p>Beyond machine innovation, Coriolis Composites is introducing CATFIBER, a tool to optimize AFP during the design phase. Embedded in the Catia V5 and 3DX platforms, this tool can simulate a variety of AFP machines (independent of the machine vendor). It empowers engineering teams to push the boundaries of composites design (until FEA) while addressing AFP constraints &mdash; such as gaps and sectorization &mdash; early in the design process</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-coriolis-accessibility-range.png\" target=\"_blank\"><img alt=\"Coriolis AFP accessibility range.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-coriolis-accessibility-range.png;maxWidth=385\" /></a></div>\n\n<p>Coriolis AFP accessibility range.</p>\n</div>\n\n<p>While the AFP machine and its design tool embedded in Catia&nbsp;remain at the core of Coriolis&rsquo;&nbsp;offering, the company also provides a comprehensive range of solutions, including filament winding technologies, automatic ply inspection systems, digital twin solutions&nbsp;and data analysis.</p>\n\n<p>In terms of infrastructure, Coriolis has established a dedicated Technical Support center in Wichita, Kansa, ensuring responsive local service to its U.S. customers. The company features one of its AFP machines at the National Institute for Aviation Research (NIAR). To date, a little less than 10 AFP machines have been installed in the U.S.</p>\n\n<p>Coriolis also actively participates in all major industry events, including SAMPE, CAMX&nbsp;and more. Those interested can contact Coriolis at&nbsp;<a href=\"mailto:sales.support@coriolis-composites.com\" target=\"_blank\">sales.support@coriolis-composites.com</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/coriolis-composites-heightens-us-presence-to-empower-afp"
      }
    ],
    "link": "https://www.compositesworld.com/news/coriolis-composites-heightens-us-presence-to-empower-afp"
  },
  {
    "published": "Thu, 19 Jun 2025 07:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      19,
      11,
      0,
      0,
      3,
      170,
      0
    ],
    "title": "Hufschmied to host Aerospace Day 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hufschmied to host Aerospace Day 2025"
    },
    "summary": "Materials, processes&nbsp;and current challenges in the aviation industry supply chain will be addressed via high-profile speakers and an accompanying exhibition on July 11 in Bobingen, Germany.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Materials, processes&nbsp;and current challenges in the aviation industry supply chain will be addressed via high-profile speakers and an accompanying exhibition on July 11 in Bobingen, Germany."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-hufschmeid-aerospaceday.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-hufschmeid-aerospaceday.jpg;maxWidth=720\" /> </a></div>\n\n<p>Augsburg is a hub for both the aviation industry and composite materials technology. Source |&nbsp;Hufschmied Zerspanungssysteme GmbH</p>\n</div>\n\n<p>In cooperation with the <a href=\"https://www.compositesworld.com/suppliers/dlr---german-aerospace-center\" target=\"_blank\">German Aerospace Center</a> (DLR), the MAI Carbon cluster of Composites United e. V. (CU) and bavAIRia e. V (the association of Bavarian aerospace companies),&nbsp;<a href=\"https://www.compositesworld.com/suppliers/hufschmied-zerspanungssysteme\" target=\"_blank\">Hufschmied Zerspanungssysteme&nbsp;GmbH</a> (Bobingen, Germany)&nbsp;invites industry&nbsp;to Aerospace Day 2025. The&nbsp;in-person event is taking place July 10&nbsp;from 9:30 a.m. to 6:00 p.m. in Bobingen, Germany at Hufschmied&rsquo;s technology center.&nbsp;</p>\n\n<p>Under the motto &ldquo;Bringing together what belongs together,&rdquo; high-profile keynote speakers and other experts from industry and research will highlight the challenges currently facing OEMs and Tier 1 suppliers and how small- and medium-sized companies in particular can optimally leverage their innovative strength and expertise. Exhibitors and practical live demonstrations will illustrate how production technology is responding to industry trends.</p>\n\n<p>Aerospace Day topics covered include material combinations &mdash; such as metals and carbon fiber-reinforced polymers (CFRP)&nbsp;&mdash; and the interaction between additive and machining processes. Live demonstrations will focus on efficient and stress-free aluminum machining using the example of an aerospace structural component, as well as the delamination-free machining of a CFRP component in a one-shot process that minimizes machining costs. Further demonstrations on 3D printing and machining of high-performance engineering plastics with tools from Hufschmied will focus on the cost-efficient and process-reliable production of drone components.</p>\n\n<p>The following keynote speakers have confirmed their participation in the event:</p>\n\n<ul>\n\t<li>Norbert Peer, managing director, Premium Aerotec (Airbus)</li>\n\t<li>Andreas Ockel, chief operating officer, FACC AG</li>\n\t<li>Dr.-Ing. Andreas Erber, managing director, Mubea Aviation GmbH.&nbsp;</li>\n</ul>\n\n<p>Andreas Gundel, managing director of bavAIRia e. V., will open with a keynote speech, and Prof. Dr.-Ing. Michael Kupke, professor of fiber composite rechnology at the University of Augsburg and deputy director of the Institute of Structures and Design at DLR, will moderate a panel discussion.</p>\n\n<p>Aerospace Day comes with an accompanying exhibition. Numerous companies are participating, ranging from machine tools and materials to clamping, measuring and CAM systems. These are partners with whom Hufschmied collaborates in the optimization of manufacturing processes. The following companies will be represented with information stands and some will also be involved in demonstrations: CMS, Grob-Werk, Hexagon, HRC | ACTC, KraussMaffei, Lehmann&amp;Voss, MHT, Mitsubishi Chemical, Open Mind&nbsp;Technologies, Rego Fix, G. A. R&ouml;ders, Schw&auml;bische Werkzeugmaschinen, SoniCut, VisCheck, Weschu, Carl Zeiss IQS Deutschland, ZeroClamp&nbsp;and Zimmer &amp; Kreim.</p>\n\n<p>In addition, there will be an opportunity for attendees to prove themselves as future pilots in a&nbsp;flight simulator from H3 Grob Aircraft,&nbsp;and to take a close look at a drone from Team HORYZN and a test rocket from WARR Rocketry.</p>\n\n<p>Registration for Aerospace Day 2025 is <a href=\"https://workshop.hufschmied.net/luftfahrttage-bobingen-2025/\" target=\"_blank\">now open here</a>.</p>\n\n<p>The following day, July 11,&nbsp;Hufschmied will hold an open house from 10:00 a.m. to 4:00 p.m. To register, <a href=\"https://workshop.hufschmied.net/tag-der-offenen-tuer-2025/\" target=\"_blank\">contact here</a>.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hufschmied-to-host-aerospace-day-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/hufschmied-to-host-aerospace-day-2025"
  },
  {
    "published": "Wed, 18 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      18,
      17,
      0,
      0,
      2,
      169,
      0
    ],
    "title": "Bcomp natural fiber composites to be used in future BMW Group production cars",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Bcomp natural fiber composites to be used in future BMW Group production cars"
    },
    "summary": "Bcomp partners with BMW Group to integrate high-performance natural fiber materials into series production models, reducing CO2 emissions for exterior and interior car parts.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Bcomp partners with BMW Group to integrate high-performance natural fiber materials into series production models, reducing CO2 emissions for exterior and interior car parts."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Bcomp-BMW-exterior-parts-1-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Exterior natural fiber automotive part.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Bcomp-BMW-exterior-parts-1-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | BMW AG</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a>&rsquo;s&nbsp;(Fribourg, Switzerland) high-performance natural fiber materials will be used extensively in <a href=\"https://www.bmwgroup.com/en.html\" target=\"_blank\">BMW Group</a>&nbsp;(Munich, Germany)&nbsp;series production for both exterior and interior components of future production cars. The flax-based materials mark a significant step in replacing parts traditionally made with carbon fiber over the past decades, Bcomp reports.</p>\n\n<p>This development represents a major milestone in the partnership between Bcomp and BMW Group, which have collaborated for several years to research and develop CO<sub>2</sub>-reduced materials, demonstrate their performance in race environments&nbsp;and now bring them to series production readiness. For example, replacing carbon fiber composites with Bcomp&rsquo;s natural fiber composites in the roof of the next-generation BMW M3 results in a CO<sub>2</sub>e reduction of around 40% in production, along with additional end-of-life benefits.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Bcomp-BMW-exterior-parts-2-min.jpg\" target=\"_blank\"><img alt=\"Natural fiber engine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Bcomp-BMW-exterior-parts-2-min.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>The roll-out of Bcomp&rsquo;s materials into series production signifies a race-to- road success. The partnership began with motorsport prototyping and has since provided notable performance and sustainability improvements across multiple racing platforms, including Formula E, DTM&nbsp;and GT4.</p>\n\n<p>In 2019, Bcomp and BMW Motorsport used CO<sub>2</sub>-reduced materials in Formula E via ampliTex and powerRibs&nbsp;flax materials to build a high-performance cooling shaft for the BMW iFE.20 race car. The 2022 BMW M4 GT4 further bridged the gap to road applications, featuring more natural fiber parts than any GT race car to date, both partners contend &mdash; inside and out.</p>\n\n<p>Bcomp and BMW Group have also developed a bespoke natural fiber color and weave pattern that meets the stringent demands of roof structures in total vehicle homologation. The public has already seen this material in the award-winning BMW M Visionary Materials Seat project.</p>\n\n<p>Bcomp&rsquo;s natural fiber composites are designed to integrate seamlessly into multiple existing manufacturing processes at scale. The vehicle roof will be made using RTM, ensuring fast and consistent production. Other interior and exterior parts will be produced using a prepreg process. This approach supports vertical integration and improved control over performance, quality&nbsp;and sustainability.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/bcomp-natural-fiber-composites-to-be-used-in-future-bmw-group-production-cars"
      }
    ],
    "link": "https://www.compositesworld.com/news/bcomp-natural-fiber-composites-to-be-used-in-future-bmw-group-production-cars"
  },
  {
    "published": "Wed, 18 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      18,
      15,
      0,
      0,
      2,
      169,
      0
    ],
    "title": "Terra Agri, Midwest Composites cut agriculture CO2 emissions with biocomposite drone canopy",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Terra Agri, Midwest Composites cut agriculture CO2 emissions with biocomposite drone canopy"
    },
    "summary": "Canopy covers use empty fruit bunch (EFB), woven jute and nonwoven kenaf to enhance durability and reduce environmental impact of drones engineered for&nbsp;enterprise agriculture in Indonesia and Malaysia.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Canopy covers use empty fruit bunch (EFB), woven jute and nonwoven kenaf to enhance durability and reduce environmental impact of drones engineered for&nbsp;enterprise agriculture in Indonesia and Malaysia."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-terraagri-midwestcomposites-terradrone.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-terraagri-midwestcomposites-terradrone.jpg;maxWidth=720\" /> </a></div>\n\n<p>The TerraDrone. Source (All Images) | Terra Agri</p>\n</div>\n\n<p><a href=\"https://terra-droneagri.com/\" target=\"_blank\">Terra Agri</a>&nbsp;(Jakarta, Indonesia), an&nbsp;agricultural service brand, has partnered with advanced composite and biocomposite provider <a href=\"https://midwestcomposites.com.my/\" target=\"_blank\">Midwest Composites LLC</a> (Wapakoneta, Ohio, U.S.) to introduce high-performance biocomposite drone canopy covers for Terra Agri&rsquo;s&nbsp;E16 and G30 models. These eco-friendly drone components are designed for industrial agriculture and help reduce CO<sub>₂</sub> emissions, and reflects Terra&rsquo;s commitment to encouraging agriculture drone development in Indonesia and Malaysia, its primary markets.</p>\n\n<p>Specifically developed for harsh agricultural environments, the biocomposite covers use renewable natural fibers including empty fruit bunch (EFB) palm pulp, woven jute and nonwoven kenaf. These eco-conscious materials outperform traditional plastics by offering improved flexibility, UV resistance&nbsp;and structural strength.</p>\n\n<p>The E16 drone&rsquo;s frame, crafted from EFB palm pulp biocomposites, weighs just 207 grams with a thickness of 1.5 millimeters,&nbsp;and delivers a flexural strength of 55.6 MPa. The&nbsp;lightweight, plant-based composite protects vital electronics such as the GPS and flight controller. Compared to standard plastic materials, it offers a CO<sub>₂</sub> emissions reduction of up to 73.2%.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-terradrone-g30-biocomposite-covers.png\" target=\"_blank\"><img alt=\"G30 drone with biocomposite canopy covers.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-terradrone-g30-biocomposite-covers.png;maxWidth=385\" /></a></div>\n\n<p>G30 drone with biocomposite canopy covers.</p>\n</div>\n\n<p>The woven jute biocomposite front cover (45% biocontent, 219.4 grams, 1.54 millimeters&nbsp;thick) and a nonwoven kenaf biocomposite&nbsp;rear cover, offer enhanced protection for high-voltage systems like the battery and power distribution board of&nbsp;the G30 drone. These eco-friendly drone parts are designed for long operational life, even under direct heat and moisture exposure, common in tropical agricultural zones.</p>\n\n<p>Unlike conventional drone canopy cover, which can crack and warp under intense sunlight, these biocomposite materials maintain flexibility and integrity. Their resistance to water ingress and bolt hole stress helps prevent in-field failure, reducing downtime and maintenance for plantation operators who rely on precision drone systems.</p>\n\n<p>&ldquo;This collaboration with Midwest Composites delivers industrial-grade drone components that are not only tougher but also significantly more sustainable,&rdquo; emphasizes&nbsp;Wilson Ong, country manager, Terra Drone Agri.&nbsp; &ldquo;The agricultural sector is under growing pressure to improve sustainability without sacrificing performance. By integrating biocomposites like EFB, jute and kenaf into drone technology, we&rsquo;re proving that eco-friendly materials can outperform conventional ones in both durability and functionality.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/terra-agri-midwest-composites-cut-agriculture-co2-emissions-with-biocomposite-drone-canopy"
      }
    ],
    "link": "https://www.compositesworld.com/news/terra-agri-midwest-composites-cut-agriculture-co2-emissions-with-biocomposite-drone-canopy"
  },
  {
    "published": "Wed, 18 Jun 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      18,
      14,
      0,
      0,
      2,
      169,
      0
    ],
    "title": "Lemki Robotics 3D printed off-road robot is made from composites, recycled materials",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Lemki Robotics 3D printed off-road robot is made from composites, recycled materials"
    },
    "summary": "The off-road robot is suited for military logistics, search and rescue, precision agriculture, infrastructure inspection and more.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The off-road robot is suited for military logistics, search and rescue, precision agriculture, infrastructure inspection and more."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </div>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-lemkirobotix.jpg;maxWidth=385\" /></div>\n\n<p>Source | Lemki Robotix</p>\n</div>\n\n<p>Following the recent launch of the <a href=\"https://iscale3d.com/project/3d-camper/\" target=\"_blank\">Discover 3D camper</a>, Ukrainian company Lemki Robotix (Uzhhorod), together with German firm iSCALE 3D (Grenzach-Wyhlen) and engineering partner Zeykan Robotics (&Scaron;těp&aacute;nov, Czech Republic), recently&nbsp;unveiled a production model&nbsp;of a fully 3D printed off-road logistics robot.&nbsp;</p>\n\n<p>The&nbsp;autonomous robot is designed for off-road conditions and built entirely using recycled materials. The sealed body is printed from glass fiber-reinforced recycled polypropylene, airless, puncture-proof,&nbsp;recycled polyurethane wheels&nbsp;and rims made of carbon fiber-reinforced nylon.</p>\n\n<p>A key innovation lies in the hollow, buoyant wheels, which not&nbsp;only improve terrain handling but also act as paddle wheels, enabling water crossing without compromising mobility.</p>\n\n<p>The robot is equipped with 360&deg; cameras, LiDAR&nbsp;and Starlink satellite connectivity for real-time remote control.&nbsp;Operation can be performed manually&nbsp;or autonomously using an onboard neural network, which interprets sensor data for intelligent navigation, even in GPS-denied zones.</p>\n\n<p>Due to its modular construction and rugged capabilities, the robot is suited for military logistics, search and rescue, precision agriculture, infrastructure inspection and remote delivery and hazardous zones.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/3d-printed-off-road-logistics-robot-made-from-recycled-materials-2"
      }
    ],
    "link": "https://www.compositesworld.com/news/3d-printed-off-road-logistics-robot-made-from-recycled-materials-2"
  },
  {
    "published": "Tue, 17 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      17,
      16,
      0,
      0,
      1,
      168,
      0
    ],
    "title": "Cygnet, Viritech recover H2 tank continuous carbon fibers in Ford FCVGen2.0 project",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Cygnet, Viritech recover H2 tank continuous carbon fibers in Ford FCVGen2.0 project"
    },
    "summary": "Partner technologies&nbsp;have demonstrated the&nbsp;viability of recycled continuous fibers and the potential for automotive tanks to be recycled at meaningful rates.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Partner technologies&nbsp;have demonstrated the&nbsp;viability of recycled continuous fibers and the potential for automotive tanks to be recycled at meaningful rates."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Cygnet-Fibre-Recovery-System.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Unwinding of continuous carbon fiber.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Cygnet-Fibre-Recovery-System.jpg;maxWidth=720\" /> </a></div>\n\n<p>Cygnet Texkimp's Fibre Recovery System unwinds continuous carbon fiber&nbsp;from a demonstrator tank. Source (All Images) | Cygnet Texkimp</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/cygnet-texkimp\" target=\"_blank\">Cygnet Texkimp</a>&nbsp;(Northwich, U.K.) and hydrogen powertrain solutions developer <a href=\"https://www.viritech.co.uk/\" target=\"_blank\">Viritech</a>&nbsp;(Nuneaton, Warwickshire, U.K.) have partnered to recover high-value, continuous carbon fibers from hydrogen pressure vessels as part of a strategy to improve circularity in the manufacture of filament-wound parts.</p>\n\n<p>The two companies have worked together within the FCVGen2.0 consortium which is led by Ford Motor Co. and partly funded by the Advanced Propulsion Centre UK (APC). The consortium <a href=\"https://www.compositesworld.com/news/cygnet-texkimp-joins-uk-project-for-hydrogen-powered-ford-e-transit-development\" target=\"_blank\">was brought together in 2023</a>&nbsp;to design, build and trial a small fleet of hydrogen fuel-cell powered Ford <em>E-Transits</em> that maximize value for fleets with high daily energy demands and zero-emissions ambitions. One of its objectives is to develop and evaluate a viable recycling route for end-of-life (EOL) fuel tank components that maintains the properties of, and develops uses for, recycled fiber, in order to accelerate the industrialization of recycling technologies in automotive.</p>\n\n<p>The partnership between Cygnet Texkimp and Viritech harnessed Cygnet Texkimp&rsquo;s Fibre Recovery System, which addresses one of the project&rsquo;s key aims: To develop a workable strategy and technical capability to reclaim maximum value from carbon fiber&nbsp;hydrogen tanks at the end of their usable life and reuse them in new applications. The system, which complements Cygnet Texkimp&rsquo;s filament winding capability, has been developed to recover continuous, high-quality carbon fibers from filament-wound parts and present them in convenient, bobbin-wound formats for reuse in the manufacture of composites.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Viritech-tank.jpg\" target=\"_blank\"><img alt=\"Viritech tank on a Cygnet Texkimp winding machine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Viritech-tank.jpg;maxWidth=385\" /></a></div>\n\n<p>Viritech tank on a Cygnet Texkimp winding machine.</p>\n</div>\n\n<p>As part of the project, Viritech is creating composite pressure vessels &mdash; using a&nbsp;novel nano-infused,&nbsp;resin-based material system&nbsp;&mdash;&nbsp; that achieve optimum efficiency in manufacture and operation, while also being readily recyclable. Cygnet&rsquo;s&nbsp;technology successfully processed Viritech&rsquo;s graphene nanomaterial and&nbsp;recovered the tank&rsquo;s carbon fibers at its&nbsp;Innovation Centre using DEECOM (<a href=\"https://www.compositesworld.com/articles/pressurized-steam-based-composites-recycling-for-full-fiber-reclamation\" target=\"_blank\">read about the recycling process</a>). The reclaimed fibers were then mechanically unwound and rewound onto bobbins, ready to be reused in conventional applications.</p>\n\n<p>Unlike many other recycling processes, rCF is typically processed in short lengths and thus is limited in its application. Cygnet&rsquo;s technology, however, recovers and unwinds continuous fibers to enable their use as an alternative to virgin fibers, i.e., more high-value applications, like&nbsp;filament winding, pultrusion, weaving, unidirectional&nbsp;prepreg and towpreg.</p>\n\n<p>&ldquo;Our partnership with Viritech demonstrates the potential for hydrogen tanks to be recycled at a meaningful rate,&rdquo; says Dr. Yan Liu, senior R&amp;D specialist at Cygnet Texkimp, who led the project. &ldquo;Our Fibre Recovery System has an essential role to play in enabling design for recycling and design for disassembly strategies that inform the manufacture of future hydrogen pressure vessel technology.&nbsp;The system closes the loop between our DEECOM fiber&nbsp;recycling solution and our extensive filament winding capability and provides end-to-end processing and recycling capability for composite fibers.&rdquo;</p>\n\n<p>The two companies are also working together to further develop the filament winding technology as part of a strategy to develop highly efficient and sustainable manufacturing and recycling solutions for hydrogen pressure vessels. This partnership is based around Cygnet Texkimp&rsquo;s fully automated, five-axis filament winding cell and Viritech&rsquo;s graphene nanomaterial system.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cygnet-viritech-recover-h2-tank-continuous-carbon-fibers-in-ford-fcvgen20-project"
      }
    ],
    "link": "https://www.compositesworld.com/news/cygnet-viritech-recover-h2-tank-continuous-carbon-fibers-in-ford-fcvgen20-project"
  },
  {
    "published": "Tue, 17 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      17,
      15,
      0,
      0,
      1,
      168,
      0
    ],
    "title": "CRP Technology obtains ISO 14001:2015 certification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CRP Technology obtains ISO 14001:2015 certification"
    },
    "summary": "3D printing company strengthens its industrial model by combining environmental sustainability, technological innovation&nbsp;and strict process control.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "3D printing company strengthens its industrial model by combining environmental sustainability, technological innovation&nbsp;and strict process control."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-crp-gear-windformxt-2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"3D printed gear.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-crp-gear-windformxt-2.jpg;maxWidth=720\" /> </a></div>\n\n<p>A gear formed with&nbsp;Windform XT 2.0 IMG. Source | CRP Technology</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/crp-technology\" target=\"_blank\">CRP Technology</a> (Modena, Italy), a company known for its Windform range of fiber-reinforced materials for selective laser sintering (SLS) 3D printing, has obtained&nbsp;ISO 14001:2015 certification, confirming the company&rsquo;s responsible and sustainable environmental management.&nbsp;</p>\n\n<p>Issued by the DNV, this certification applies to the production of plastic components using SLS&nbsp;and the production of powders intended for SLS and other similar additive manufacturing processes. The certified activities fall under IAF code 15 (rubber and plastic products) and were assessed according to the requirements of Technical Regulation RT-09.</p>\n\n<p>This new milestone adds to the EN 9100 certification already achieved by CRP Technology for its quality management system applied to the aerospace and defense sectors, further confirming the industrial model adopted by CRP Technology &mdash; one that combines technological innovation, rigorous process control, operational transparency&nbsp;and environmental responsibility.&nbsp;</p>\n\n<p>CRP Technology's commitment to sustainability also takes shape through concrete circular economy projects, such as the recovery of Windform XT 2.0 powders (Windform XT 2.0 is a carbon fiber-reinforced nylon). Once no longer suitable for SLS 3D printing, the powders are reprocessed and converted into Windform XT 2.0 IMG, which can be used in injection molding or FDM/FFF 3D printing processes in pellet form.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/crp-technology-obtains-iso-140012015-certification"
      }
    ],
    "link": "https://www.compositesworld.com/news/crp-technology-obtains-iso-140012015-certification"
  }
]