[
  {
    "title": "Carbon Fiber",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Carbon Fiber"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/carbon-fiber/"
      }
    ],
    "link": "https://sampe.org/carbon-fiber/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Wed, 12 Dec 2018 18:09:42 +0000",
    "published_parsed": [
      2018,
      12,
      12,
      18,
      9,
      42,
      2,
      346,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://avada.theme-fusion.com_demos/lifestyle/?p=48",
    "guidislink": false,
    "summary": "<p>Carbon fibers go all the way back to Thomas Edison’s invention of the first incandescent light bulb in 1879 with the help of Lewis Latimer’s invention of “carbonized cotton threads and bamboo slivers to make the filaments for the bulbs.”  Carbon fibers for use in structural materials started to be developed near the end</p>\n<p>The post <a href=\"https://sampe.org/carbon-fiber/\">Carbon Fiber</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Carbon fibers go all the way back to Thomas Edison’s invention of the first incandescent light bulb in 1879 with the help of Lewis Latimer’s invention of “carbonized cotton threads and bamboo slivers to make the filaments for the bulbs.”  Carbon fibers for use in structural materials started to be developed near the end</p>\n<p>The post <a href=\"https://sampe.org/carbon-fiber/\">Carbon Fiber</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-1 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-0 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-1\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">C</span>arbon fibers go all the way back to Thomas Edison’s invention of the first incandescent light bulb in 1879 with the help of Lewis Latimer’s invention of “carbonized cotton threads and bamboo slivers to make the filaments for the bulbs.”  Carbon fibers for use in structural materials started to be developed near the end of World War I.  Union Carbide began investigating a replacement for tungsten wire in vacuum tubes by carbonizing rayon.  In 1958, they developed a carbonized rayon cloth and submitted it to the U.S. Air Force as a replacement for fiberglass in rocket nozzle exit cones and re-entry heat shields.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>The modern era of carbon fibers began in 1956, when Union Carbide’s Dr. Roger Bacon demonstrated the first high-performance carbon fibers in 1958.  In fibrous forms, carbon and graphite are the strongest and stiffest materials for their weight that have ever been produced with a tensile strength of 20 Gigapascals (GPa) and Young’s modulus of 700 GPa.  In 1959, Union Carbide scientists Curry Ford and Charles Mitchell patented a process for making fibers and cloths by heat-treating rayon to high temperatures, up to 3,000 °C.  They had produced the strongest commercial carbon fibers to date, which led to the entry of carbon fibers into the “advanced composites” industry in 1963.  The first truly high modulus commercial carbon fibers were invented in 1964, when Bacon and Wesley Schalamon made fibers from rayon using a new “hot-stretching” process.  They stretched the carbon yarn at high temperatures (more than 2800° C), orienting the graphite layers to lie nearly parallel with the fiber axis. The process resulted in a ten-fold increase in Young’s modulus—a major step on the way to duplicating the properties of Bacon’s graphite whiskers.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>While researchers in the United States were reveling in rayon, scientists overseas were busy creating their own carbon fiber industries based on polyacrylonitrile, or PAN.  In 1961, Japanese researchers demonstrated high strength and high modulus fibers from PAN precursors.  Akio Shindo of the Government Industrial Research Institute in Osaka, Japan, made fibers in the lab with a modulus of more than 140 GPa, about three times that of rayon-based fibers at the time.  Shindo’s process was quickly taken up by other Japanese researchers, leading to pilot-scale production in 1964.  In that same year, William Watt of the Royal Aircraft Establishment in England invented a still higher-modulus fiber from PAN.  The British fibers were rapidly put into commercial production through licenses to <a href=\"https://en.wikipedia.org/wiki/Rolls-Royce_Limited\" rel=\"noopener undefined noreferrer\" target=\"_blank\">Rolls-Royce</a>, Morganite; and <a href=\"https://en.wikipedia.org/wiki/Courtaulds\" rel=\"noopener undefined noreferrer\" target=\"_blank\">Courtaulds</a>.  The Japanese eventually took the lead in manufacturing PAN-based carbon fibers, effectively beating the British at their own game.  Japan’s Toray Industries developed a precursor that was far superior to anything seen before, and in 1970 they signed a joint technology agreement with Union Carbide, bringing the United States back to the forefront in carbon fiber manufacturing.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>PAN and rayon are both non-graphitizing materials, so carbon fibers from these precursors will never be truly graphitic, even after heat treatment to high temperatures.  To make the next generation of carbon fibers, scientists needed a new starting material.  Union Carbide’s Leonard Singer studied the underlying mechanism of carbonization, which involved heating various petroleum and coal-based materials.  Heating organic substances like these inevitably leads to the formation of a pitch, a tar-like mixture of hundreds of branched compounds with different molecular weights.  In 1970 Singer and his assistant, Allen Cherry, designed a “taffy-pulling” machine that applied stress to the viscous mesophase to align the molecules, and then heated the material to convert it to a highly oriented carbon fiber. The process worked, and subsequent analyses verified that they had made highly-oriented graphitizable carbon fibers.  The physical properties of these graphitized mesophase pitch fibers were astounding. Not only did they have an ultrahigh elastic modulus, approaching 1,000 GPa, but these were also the first carbon fibers with ultrahigh thermal conductivity (3-4X of copper).  This made them especially useful for any application where stiffness and heat removal were important, such as aircraft brakes and electronic circuits.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Nearly all commercial carbon fibers produced today are based on rayon, PAN or pitch.  Approximately 92% of the carbon fiber produced today is PAN based.  It offers the combination of worldwide availability, structural properties, and demonstrated composite performance.  Pitch-based fibers are unique in their ability to achieve ultrahigh Young’s modulus and thermal conductivity and, therefore, have found an assured place in critical military and space applications. But their high cost has kept production to a minimum; only a few companies are currently producing them.</p>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/carbon-fiber/\">Carbon Fiber</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "Composite Affordability Initiative",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composite Affordability Initiative"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/composite-affordability-initiative/"
      }
    ],
    "link": "https://sampe.org/composite-affordability-initiative/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Mon, 12 Nov 2018 18:08:57 +0000",
    "published_parsed": [
      2018,
      11,
      12,
      18,
      8,
      57,
      0,
      316,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Food",
        "scheme": null,
        "label": null
      },
      {
        "term": "Outdoors",
        "scheme": null,
        "label": null
      },
      {
        "term": "Pregnancy",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://avada.theme-fusion.com_demos/lifestyle/?p=45",
    "guidislink": false,
    "summary": "<p>The Composites Affordability Initiative (CAI) was a bold and innovative approach to create revolutionary advancements for the design and manufacture of composites.  Historical data had clearly indicated composite structures had reached a plateau for fighter/attack aircraft applications.  Additional applications, for which composite structures were well suited, were avoided due to a perception of higher</p>\n<p>The post <a href=\"https://sampe.org/composite-affordability-initiative/\">Composite Affordability Initiative</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>The Composites Affordability Initiative (CAI) was a bold and innovative approach to create revolutionary advancements for the design and manufacture of composites.  Historical data had clearly indicated composite structures had reached a plateau for fighter/attack aircraft applications.  Additional applications, for which composite structures were well suited, were avoided due to a perception of higher</p>\n<p>The post <a href=\"https://sampe.org/composite-affordability-initiative/\">Composite Affordability Initiative</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-2 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-1 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-2\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">T</span>he Composites Affordability Initiative (CAI) was a bold and innovative approach to create revolutionary advancements for the design and manufacture of composites.  Historical data had clearly indicated composite structures had reached a plateau for fighter/attack aircraft applications.  Additional applications, for which composite structures were well suited, were avoided due to a perception of higher cost and risk than DoD weapon system programs were willing to accept.  At $150M including industry cost share, CAI was the DoD’s largest composites R&amp;D program ever launched.  CAI’s legacy was to enable large integrated and bonded primary aircraft structures.   The CAI team consisting of the Air Force Research Laboratory, the Office of Naval Research, Bell Helicopter Textron, The Boeing Company, Lockheed Martin and Northrop Grumman has placed in the hands of the DoD supplier base a suite of tools and technologies that enable for the first time, the confident application and certification of bonded structures for primary load bearing applications.</p>\n<div class=\"txtNew\" id=\"comp-jqsgy8h5\">\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Advanced structural analysis tools which can more accurately predict the onset of failure as well as failure progression have been developed and transitioned to commercial vendors.  The adhesively bonded pi-joint design for structures has been shown to be very robust for manufacturing defects, tolerant of damage and provides a dual load-path approach increasing the confidence of satisfactory performance.  Process controls have been implemented to improve the reliability of surface preparation, surface evaluation, adhesive mixing and dispensing as well as assembly.  These tools and technologies combined with a new inspection technique that can not only identify kissing bonds but provide a quantitative measure of the strength of the bond at a specific site provide unprecedented capabilities needed for certification.  These tools and technologies along with a sound certification plan of analysis supported by test provided DoD and FAA certification authorities with enough confidence that they believe that there are currently no technical barriers to certify bonded structures.  Full-scale testing of integrated and bonded structures were performed to validate their capability for limit loads, ultimate loads, as well as two lifetimes of fatigue/w damage.</p>\n</div>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/composite-affordability-initiative/\">Composite Affordability Initiative</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "Burt Rutan",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Burt Rutan"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/burt-rutan/"
      }
    ],
    "link": "https://sampe.org/burt-rutan/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Fri, 12 Oct 2018 18:08:13 +0000",
    "published_parsed": [
      2018,
      10,
      12,
      18,
      8,
      13,
      4,
      285,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Family",
        "scheme": null,
        "label": null
      },
      {
        "term": "Fitness",
        "scheme": null,
        "label": null
      },
      {
        "term": "Health",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://avada.theme-fusion.com_demos/lifestyle/?p=42",
    "guidislink": false,
    "summary": "<p>After serving with the U.S. Air Force as a flight test project engineer at Edwards Air Force Base, Burt Rutan became the director of the Bede Test Center for Bede Aircraft in Newton, KS.  With the experience and a strong interest in aircraft design and manufacturing, he formed the Rutan Aircraft Factory in Mojave,</p>\n<p>The post <a href=\"https://sampe.org/burt-rutan/\">Burt Rutan</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>After serving with the U.S. Air Force as a flight test project engineer at Edwards Air Force Base, Burt Rutan became the director of the Bede Test Center for Bede Aircraft in Newton, KS.  With the experience and a strong interest in aircraft design and manufacturing, he formed the Rutan Aircraft Factory in Mojave,</p>\n<p>The post <a href=\"https://sampe.org/burt-rutan/\">Burt Rutan</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-3 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-2 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-3\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">A</span>fter serving with the U.S. Air Force as a flight test project engineer at Edwards Air Force Base, Burt Rutan became the director of the Bede Test Center for Bede Aircraft in Newton, KS.  With the experience and a strong interest in aircraft design and manufacturing, he formed the Rutan Aircraft Factory in Mojave, CA in 1974 to develop light, homebuilt aircraft.  This company developed the VariViggen, VariEze, NASA AD-, Quickie, Defiant, Long-EZ, Grizzly, scaled NGT trainer, Solitare, Catbird, and the all-composite Voyager (which flew around the world on a single tank of fuel.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>In April 1982, he founded Scaled Composites to develop research aircraft.  Scaled has become the world’s most productive aerospace prototype development company.  Aircraft they produced include a single-seat, twin-jet, the subscale T-46A demonstrator for Fairchild Republic, a two-seat, single-engine recreational aircraft (Microlight proof of concept) for Group Lotus, Ltd., an eleven seat, twin turboprop high performance business aircraft (85% scale Starship 1 prototype) for Beech Aircraft, a large agricultural aircraft (full scale Predator proof of concept) for DARPA, a reconnaissance aircraft (full scale CM-44 UAV prototype) for DARPA, a tandem wing, three surface technology demonstration (62% Advanced Technology Tactical Transport) for DARPA, and the short run production of an all composite reconnaissance UAV (Model 324 Scarab) for Teledyne Ryan.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Scaled was responsible for structural design, tooling, and manufacture of the Orbital Sciences Corp. Pegasus rocket wing, fillets, and fins.  Scaled developed the Earthwinds gondola for a global, non-stop balloon record attempt, the McDonnell-Douglas DC-X Single Stage Rocket Technology 1/3 scale proof of concept vehicle.  They also developed the design and fabricated the structure for two Bell Eagle Eye tilt-rotor UAV demonstrators, the VisionAire Business Jet demonstrator, and three NASA X-38 Crew Return Vehicle structures.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Rutan has been President/CEO of Scaled since its inception in 1982.  Scaled was sold to Beech Aircraft in 1985, which was subsequently acquired by Wyman-Gordon Co. in 1989.  Rutan led a group of provate investors to require Scaled in 2000.  In 2007, Northrop Grumman acquired Scaled after years of being a major shareholder of the company.  Rutan retired in 2011.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Rutan was recognized by SAMPE with the presentation of its Lubin Award in 1995.  The Lubin Award is given for significant contributions in the field of material and process engineering.</p>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/burt-rutan/\">Burt Rutan</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "Susan Ruth",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Susan Ruth"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/susan-ruth/"
      }
    ],
    "link": "https://sampe.org/susan-ruth/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Wed, 12 Sep 2018 18:07:26 +0000",
    "published_parsed": [
      2018,
      9,
      12,
      18,
      7,
      26,
      2,
      255,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Food",
        "scheme": null,
        "label": null
      },
      {
        "term": "Health",
        "scheme": null,
        "label": null
      },
      {
        "term": "Travel",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://avada.theme-fusion.com_demos/lifestyle/?p=39",
    "guidislink": false,
    "summary": "<p>Susan Ruth is a talented engineer and supervisor who brought these same skills to SAMPE.  After SAMPE expanded internationally, Susan was our first female international president.  (Peggy Moore was the first woman to serve as SAMPE’s president.)  Her unique global vision was critical as she implemented a program of growth and consolidation for all</p>\n<p>The post <a href=\"https://sampe.org/susan-ruth/\">Susan Ruth</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Susan Ruth is a talented engineer and supervisor who brought these same skills to SAMPE.  After SAMPE expanded internationally, Susan was our first female international president.  (Peggy Moore was the first woman to serve as SAMPE’s president.)  Her unique global vision was critical as she implemented a program of growth and consolidation for all</p>\n<p>The post <a href=\"https://sampe.org/susan-ruth/\">Susan Ruth</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-4 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-3 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-4\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">S</span>usan Ruth is a talented engineer and supervisor who brought these same skills to SAMPE.  After SAMPE expanded internationally, Susan was our first female international president.  (Peggy Moore was the first woman to serve as SAMPE’s president.)  Her unique global vision was critical as she implemented a program of growth and consolidation for all the international sectors of SAMPE.  Susan also understood and promoted the student-related activities of SAMPE realizing that new, young members were a key to SAMPE’s long-term growth and strength.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Susan was especially interested in providing a strong voice and feeling of belonging to SAMPE’s non-North American members.  For many years, she hosted annual parties at her home, with special attention to international members on the day following the SAMPE exposition and conference in Anaheim or Long Beach.  Members from all over the world marveled at the models of space ships, naval ships and paraphernalia of Star Wars and Star Trek that Susan and her husband made and collected.  It was always a fun evening of good food and interesting conversation.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Susan saw the advantages of SAMPE becoming more directly involved in the space programs (was it the Star Trek effect?) and she led SAMPE to much tighter interactions with this important sector.  Susan was a section leader at her company and used this position to invite several college students to work for the Aerospace Corporation as interns.  She taught them how to think long-term and strategically as well as how to perform complex and difficult engineering systems analyses.  She strengthened the student organizations in SAMPE and always was a kind advocate for student events.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>In that international spirit, Susan worked to reconcile the breach that had occurred between SAMPE and the people in India who had formed I-SAMPE.  Susan became good friends with the leadership of I-SAMPE and made several attempts to draw them into the SAMPE organization.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Just before Susan’s presidency, there was a major downturn in the aerospace industry and it caused SAMPE to lose money.  However, Susan quickly reacted and was able to pull SAMPE to a breakeven financial position.</p>\n<p class=\"font_8\">Susan was a pioneer for women in SAMPE and also was an example for everyone on how to think strategically and globally. A compassionate and perceptive as a leader, we thank her for her service.</p>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/susan-ruth/\">Susan Ruth</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "Advanced Composites Advance U.S. Air Force Aviation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Advanced Composites Advance U.S. Air Force Aviation"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/advanced-composites-advance-u-s-air-force-aviation/"
      }
    ],
    "link": "https://sampe.org/advanced-composites-advance-u-s-air-force-aviation/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Sun, 12 Aug 2018 18:10:26 +0000",
    "published_parsed": [
      2018,
      8,
      12,
      18,
      10,
      26,
      6,
      224,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Fitness",
        "scheme": null,
        "label": null
      },
      {
        "term": "Food",
        "scheme": null,
        "label": null
      },
      {
        "term": "Yoga",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://avada.theme-fusion.com_demos/lifestyle/?p=51",
    "guidislink": false,
    "summary": "<p>Advances in structural materials have been largely responsible for the major performance improvements in current Air Force (AF) systems and will be enabling to any significant performance gains in current and future systems. Air superiority can only be achieved by maximizing performance. Maximizing performance requires advanced materials such as advanced composites. Staying ahead of the</p>\n<p>The post <a href=\"https://sampe.org/advanced-composites-advance-u-s-air-force-aviation/\">Advanced Composites Advance U.S. Air Force Aviation</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Advances in structural materials have been largely responsible for the major performance improvements in current Air Force (AF) systems and will be enabling to any significant performance gains in current and future systems. Air superiority can only be achieved by maximizing performance. Maximizing performance requires advanced materials such as advanced composites. Staying ahead of the</p>\n<p>The post <a href=\"https://sampe.org/advanced-composites-advance-u-s-air-force-aviation/\">Advanced Composites Advance U.S. Air Force Aviation</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-5 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-4 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-5\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">A</span>dvances in structural materials have been largely responsible for the major performance improvements in current Air Force (AF) systems and will be enabling to any significant performance gains in current and future systems. Air superiority can only be achieved by maximizing performance. Maximizing performance requires advanced materials such as advanced composites. Staying ahead of the threat environment leads to a need for major improvements in key performance metrics such as maneuverability and survivability, which, in turn, has led designers to turn to major increases in advanced composite usage. These materials allow unique combinations of designs, shapes, and weight savings that other materials cannot provide. The lightweight fighter – the F-16 &#8211; had limited usage (limited to the empennage) of advanced composites, about 3% of the structural weight, fairly modest by today’s numbers. The next generation of aircraft &#8211; the B-2 and the F-22 &#8211; saw major increases in composite usage from about 3% to 25-30% of the structural weight (Air University Report), The B-2’s use of advanced composites represented the first major usage increase in advanced composites by an AF system. Major gains in a key performance driver &#8211; survivability – have been achieved due to the combination of improved designs and advanced materials. New materials such as advanced composites have allowed missions to be performed with minimum detection and loss of aircraft and personnel. Similarly, the increase in performance from the F-16 to the F-22 was enabled by the increased use of advanced composites. Higher speeds resulted in the first wide scale use of a higher temperature matrix material – bismaleimides (BMIs). Major improvements in automation resulted in the use of tape placement in the horizontal stabilizer pivot shafts and resin transfer molding in numerous other parts. The desire to improve the damage tolerance of doors led to the first use of thermoplastic composites on a production AF aircraft. The F-22 was truly an advanced technology fighter.</p>\n<p>​The AF has been very successful at developing and applying advanced materials in an extremely complex environment of new materials, materials systems, manufacturing processes, and operational requirements. Although enhanced performance continues to be a high priority, improvements must be affordable. However, affordability should be assessed in terms of the life cycle cost of the system. Revolutionary materials and processes, which in some cases are more expensive than those currently in use, may have a favorable overall impact on a system&#8217;s life cycle cost (and may also provide performance advantages).</p>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/advanced-composites-advance-u-s-air-force-aviation/\">Advanced Composites Advance U.S. Air Force Aviation</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "Boeing’s 787",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Boeing’s 787"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/boeings-787/"
      }
    ],
    "link": "https://sampe.org/boeings-787/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Thu, 12 Jul 2018 18:06:37 +0000",
    "published_parsed": [
      2018,
      7,
      12,
      18,
      6,
      37,
      3,
      193,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Food",
        "scheme": null,
        "label": null
      },
      {
        "term": "Outdoors",
        "scheme": null,
        "label": null
      },
      {
        "term": "Wellbeing",
        "scheme": null,
        "label": null
      },
      {
        "term": "Yoga",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://avada.theme-fusion.com_demos/lifestyle/?p=36",
    "guidislink": false,
    "summary": "<p>The journey for carbon fiber composites on commercial airplanes for Boeing has spanned decades.  It started in 1984 when Boeing replaced the primary structure on a Boeing 737 Classic horizontal tail with the first carbon/epoxy primary structural piece as a study.  From there, incremental insertion continued with the use of composites on the 777</p>\n<p>The post <a href=\"https://sampe.org/boeings-787/\">Boeing&#8217;s 787</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>The journey for carbon fiber composites on commercial airplanes for Boeing has spanned decades.  It started in 1984 when Boeing replaced the primary structure on a Boeing 737 Classic horizontal tail with the first carbon/epoxy primary structural piece as a study.  From there, incremental insertion continued with the use of composites on the 777</p>\n<p>The post <a href=\"https://sampe.org/boeings-787/\">Boeing&#8217;s 787</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-6 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-5 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-6\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">T</span>he journey for carbon fiber composites on commercial airplanes for Boeing has spanned decades.  It started in 1984 when Boeing replaced the primary structure on a Boeing 737 Classic horizontal tail with the first carbon/epoxy primary structural piece as a study.  From there, incremental insertion continued with the use of composites on the 777 empennage and floor sections.  Then there was one final leap to use it on the 787 for primary structure throughout the airframe on the fuselage, wings, doors and many other components.  Today, composite usage on the 787 equals about 50% of the aircraft by weight.</p>\n<div class=\"wp2\" id=\"comp-jqsgm56b\" title=\"\">\n<div class=\"wp2link\" id=\"comp-jqsgm56blink\">\n<div class=\"wp2img\" id=\"comp-jqsgm56bimg\"></div>\n</div>\n</div>\n<div class=\"txtNew\" id=\"comp-jqsgowtn\">\n<p class=\"font_8\">Use of CFRP on the 787 plays a significant role in the advantages the airplane has over other commercial models in the same class. The fabrication process of the singular composite barrel sections instead of multiple aluminum sheets leads to a significant weight decrease from reducing the fasteners used by 40,000 &#8211; 50,000. Carbon fiber composites also have a higher strength-to-weight ratio than metallic materials used in aircraft manufacturing and help make the airplane lighter overall by nearly 20%. In addition to lowering the airplane weight, moving to a composite primary structure promises to reduce both the scheduled and non-routine maintenance burden on the airlines.</p>\n<p class=\"font_8\">The aircraft market continues to produce challenges for the materials engineering community for continuing the adoption of composites on future airplanes. As market and manufacturing challenges arise, new materials and process innovations for composites provide solutions for greater adoption of composites in the industry. It is an exciting time for the aerospace and composites industries as we move forward to tackle these new challenges.</p>\n</div>\n<div class=\"wp2\" id=\"comp-jqsgm569\" title=\"\">\n<div class=\"wp2link\" id=\"comp-jqsgm569link\">\n<div class=\"wp2\" id=\"comp-jqsgm569\" title=\"\">\n<div class=\"wp2link\" id=\"comp-jqsgm569link\">\n<div class=\"wp2img\" id=\"comp-jqsgm569img\"></div>\n</div>\n</div>\n<div class=\"wp2\" id=\"comp-jqsgm56b1\" title=\"\">\n<div class=\"wp2link\" id=\"comp-jqsgm56b1link\">\n<div class=\"wp2img\" id=\"comp-jqsgm56b1img\"></div>\n</div>\n</div>\n</div>\n</div>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/boeings-787/\">Boeing&#8217;s 787</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "Composites Applications for Space",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composites Applications for Space"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/composites-applications-for-space/"
      }
    ],
    "link": "https://sampe.org/composites-applications-for-space/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Tue, 12 Jun 2018 18:05:43 +0000",
    "published_parsed": [
      2018,
      6,
      12,
      18,
      5,
      43,
      1,
      163,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Family",
        "scheme": null,
        "label": null
      },
      {
        "term": "Health",
        "scheme": null,
        "label": null
      },
      {
        "term": "Travel",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://avada.theme-fusion.com_demos/lifestyle/?p=33",
    "guidislink": false,
    "summary": "<p>Composites have been used in space applications for decades, and their use continues to grow.  Composite applications can be found on human spaceflight vehicles, satellites and payloads, and the launch vehicles that are used to get these to space.  Composites are enabling for spacecraft where lightweight and environmental stability are critical to mission success. </p>\n<p>The post <a href=\"https://sampe.org/composites-applications-for-space/\">Composites Applications for Space</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Composites have been used in space applications for decades, and their use continues to grow.  Composite applications can be found on human spaceflight vehicles, satellites and payloads, and the launch vehicles that are used to get these to space.  Composites are enabling for spacecraft where lightweight and environmental stability are critical to mission success. </p>\n<p>The post <a href=\"https://sampe.org/composites-applications-for-space/\">Composites Applications for Space</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-7 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-6 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-7\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">C</span>omposites have been used in space applications for decades, and their use continues to grow.  Composite applications can be found on human spaceflight vehicles, satellites and payloads, and the launch vehicles that are used to get these to space.  Composites are enabling for spacecraft where lightweight and environmental stability are critical to mission success.  They are also used extensively in launch vehicles for a growing number of applications.  Solid rocket motors and pressure vessels for fuel and gas storage are typically reinforced with composites.  Composites also are the standard for ablative and other high temperature components in rocket motor nozzles and reentry heat shields dating back to the Apollo era.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>High modulus carbon fiber reinforced laminates are the standard for many composite spacecraft applications. In human-rated crew capsules, composite panels are used to support the thermal protection system (TPS) required for vehicle reentry. The temperature capability and low thermal expansion provides additional benefit by reducing the amount of TPS material needed, which lowers the mass of the vehicle. Carbon fiber laminates are used extensively on satellites and payload support structures. Typical bus structures are built from aluminum honeycomb sandwich panels with either carbon fiber or aluminum facesheets.  Optical benches and other structures that must maintain dimensional stability for accuracy are always built from high modulus, high thermal conductivity carbon fiber laminates with low moisture absorption resins, usually cyanate ester.  These materials help maintain extreme dimensional stability over temperature extremes and in the vacuum of space.  RF reflectors and solar array substrates also utilize high modulus carbon fiber laminates for their stiffness and dimensional stability.  Other common composite applications include struts and booms for deployable instruments.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Launch vehicles use composite structures for their deployable payload fairings as well as for sections of the core booster such as interstages. The need for larger composite structures has pushed the development of high quality Out-of-Autoclave composite systems to fabricate these components with fewer joints thereby increasing the benefits of using composite structures. Unlined composite cryo-tanks have also been successfully developed.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Filament wound composite structures are also used extensively for space applications. Solid rocket motors, often used as upper stages for spacecraft, are nearly always filament wound from high strength carbon fiber.  Pressurized tanks used for liquid hydrazine fuel and various gasses are typically very thin wall metallic liners overwrapped with carbon fiber in epoxy resin.</p>\n<p class=\"font_8\"><span class=\"wixGuard\">​</span>Special high temperature composites are utilized for the hottest components in rocket nozzles including throats and exit cones.  Similar composite materials are also used for reentry vehicle heat shields.  They fall into two general categories, ablatives and ceramic matrix composites.  Ceramic matrix composites are carbon or ceramic fiber reinforced with carbon or ceramic matrixes.  Carbon-carbon is the most common of these materials. The Space Shuttle used carbon-carbon panels on the nose and the wing leading edge to protect it from temperatures exceeding 2,300°F seen during reentry. Ablative composites are usually either silica or carbon fiber reinforced phenolic which absorb heat by changing state. An ablative heat shield was used on the Apollo capsule, and a similar heat shield is being used on the Orion capsule, which will return to humans to the moon and beyond.</p>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/composites-applications-for-space/\">Composites Applications for Space</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "Dr. Charles Browning, FSAMPE",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Dr. Charles Browning, FSAMPE"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/dr-charles-browning-fsampe/"
      }
    ],
    "link": "https://sampe.org/dr-charles-browning-fsampe/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Sat, 12 May 2018 18:04:28 +0000",
    "published_parsed": [
      2018,
      5,
      12,
      18,
      4,
      28,
      5,
      132,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Food",
        "scheme": null,
        "label": null
      },
      {
        "term": "Outdoors",
        "scheme": null,
        "label": null
      },
      {
        "term": "Pregnancy",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://avada.theme-fusion.com_demos/lifestyle/?p=30",
    "guidislink": false,
    "summary": "<p>Charlie Browning has had a profound influence on the development of advanced composite materials for aerospace applications.In 1966, he became member of the U. S. Air Force Materials Laboratory team that invented advanced composites.He performed groundbreaking research on the study of humidity effects on graphite/epoxy composites, showing the detrimental impact on material properties and,</p>\n<p>The post <a href=\"https://sampe.org/dr-charles-browning-fsampe/\">Dr. Charles Browning, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Charlie Browning has had a profound influence on the development of advanced composite materials for aerospace applications.In 1966, he became member of the U. S. Air Force Materials Laboratory team that invented advanced composites.He performed groundbreaking research on the study of humidity effects on graphite/epoxy composites, showing the detrimental impact on material properties and,</p>\n<p>The post <a href=\"https://sampe.org/dr-charles-browning-fsampe/\">Dr. Charles Browning, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-8 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-7 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-8\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">C</span>harlie Browning has had a profound influence on the development of advanced composite materials for aerospace applications.In 1966, he became member of the U. S. Air Force Materials Laboratory team that invented advanced composites.He performed groundbreaking research on the study of humidity effects on graphite/epoxy composites, showing the detrimental impact on material properties and, thus, a detrimental impact on design allowables for aircraft.Broadening beyond in house research later in his career, he served as a technical advisor to numerous Air Force System Program offices including the F-16, B-1, B-2, and F-22 to help them overcome issues in implementing composites on those aircraft.His advice helped the aerospace industry understand the strengths and limitations of composites for these applications, and helped them understand how to fabricate composite parts.</p>\n<div class=\"txtNew\" id=\"comp-jtkovzvh\">\n<p class=\"font_8\">In 1983, Charlie took on management roles in the Air Force, advancing from Technical Area Manager to ultimately the Director of the Air Force Research Laboratory (AFRL) Materials and Manufacturing Directorate.Through his management career, Charlie shaped the composites investment strategy that enabled the Air Force to realize the benefits of advanced composites on the F-16, B-1, B-2, F-22, and F-35.His investments in composite processing took composites from a poorly understood art to a physics based</p>\n</div>\n<div class=\"txtNew\" id=\"comp-jtkozqy1\">\n<p class=\"font_8\">understanding of the impact of heat and mass transport.F-22 requirements mandated a highly toughened resin to meet impact damage requirements, so his investments in both thermoplastics and toughened epoxies have led to the materials in use today by the Air Force.Needs for lightweight turbine engine components led to his investments in fluorinated polyimides that are now in service on the Air Force’s F119 and F135 engines.Finally realizing that aircraft designers were becoming reluctant to use composites in a broad manner due the high costs shown by the F-22, he developed a joint program with the Navy called the Composites Affordability Initiative.This ground breaking work on bonded structures are scheduled to fly on high priority national security assets.In addition, through the confidence the aerospace industry gained on the use of composites for Air Force aircraft, they were able to apply composite to civil aircraft, from the general aviation community through commercial airliners like the Boeing 787.His leadership earned him the SAMPE Fellow award in 1996.</p>\n<p class=\"font_8\">Currently, Charlie serves as the Torley Chair in Composite Materials and the Chair of the Chemical and Materials Engineering Department at the University of Dayton.In 2017, Charlie was awarded SAMPE’s Lubin Award for significant contributions in the field of material and process engineering.</p>\n</div>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/dr-charles-browning-fsampe/\">Dr. Charles Browning, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "Les Cohen, FSAMPE",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Les Cohen, FSAMPE"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/les-cohen-fsampe/"
      }
    ],
    "link": "https://sampe.org/les-cohen-fsampe/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Sat, 21 Apr 2018 16:35:15 +0000",
    "published_parsed": [
      2018,
      4,
      21,
      16,
      35,
      15,
      5,
      111,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Food",
        "scheme": null,
        "label": null
      },
      {
        "term": "Outdoors",
        "scheme": null,
        "label": null
      },
      {
        "term": "Pregnancy",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://sampeglobal.wpengine.com/?p=817",
    "guidislink": false,
    "summary": "<p>Les is world renowned for his work in advanced composite materials.  In his 50+ year career and counting, he has had major impact on how the aerospace industrial base manufactures composites.  He joined McDonnell Douglas in the late 1960s.  While at McDonnell, he held positions of increasing responsibility in Technology Operations and Business Development.</p>\n<p>The post <a href=\"https://sampe.org/les-cohen-fsampe/\">Les Cohen, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>Les is world renowned for his work in advanced composite materials.  In his 50+ year career and counting, he has had major impact on how the aerospace industrial base manufactures composites.  He joined McDonnell Douglas in the late 1960s.  While at McDonnell, he held positions of increasing responsibility in Technology Operations and Business Development.</p>\n<p>The post <a href=\"https://sampe.org/les-cohen-fsampe/\">Les Cohen, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-9 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-8 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-9\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">L</span>es is world renowned for his work in advanced composite materials.  In his 50+ year career and counting, he has had major impact on how the aerospace industrial base manufactures composites.  He joined McDonnell Douglas in the late 1960s.  While at McDonnell, he held positions of increasing responsibility in Technology Operations and Business Development. As a senior director, he oversaw their business development in the Russian Federation.  Les has worked on applying composites to a wide range of aerospace structures including ICBMs and re-entry vehicles, the OH-58 helicopter, the Reagan-era Strategic Defense Initiative.</p>\n<div class=\"txtNew\" id=\"comp-jtkp6mgf\">\n<p class=\"font_8\">Following his McDonnell Douglas career, he launched a new career as partner and owner of a public corporation named Culver City Composites, famous for their work in fabricating polyimide prepregs.  Les took Culver City Composites public and ultimately sold the company to Cytec Engineering Materials.</p>\n<p class=\"font_8\"><img alt=\"Les Cohen\" class=\"alignleft wp-image-818 size-full\" height=\"255\" src=\"http://sampeglobal.wpengine.com/wp-content/uploads/2019/05/les-cohen.jpg\" width=\"256\" />Next, Les joined HITCO Carbon Composites and revitalized their work around automation of composite primary and secondary structure.  Under his leadership, HITCO launched a major capital improvement program that enabled the company to become a leading Tier II fully automated supplier to</p>\n</div>\n<div class=\"txtNew\" id=\"comp-jtkp6mgo\">\n<p class=\"font_8\">The Boeing Company for manufacture of 787 composite work packages and to Lockheed Martin for the manufacture of automated fiber placed (AFP) wing skins and nacelles skins for the F-35.  In his role as Senior Vice President for Strategic Technology, he has led HITCO in capturing several government R&amp;D efforts to advance the state of the art in composite manufacturing including hot drape forming, noodle fabrication, automated tape layup, and automated fiber placement manufacturing techniques with out-of-the-autoclave materials.  His latest passion is to leverage the Digital Thread concept for composite to eliminate analog methods in managing and facilitating the production of digitally fabricated complex primary and secondary structure in composites.</p>\n<p class=\"font_8\">Throughout his career, Les has been a strong champion of SAMPE.  He has been the general chairman of many North American SAMPE conferences.  In addition, he serves on the SAMPE Europe Scientific Committee.  Les is most proud of his involvement of the launch of the SAMPE Foundation whose focus is K-12 STEM education in advanced materials.  Les is a SAMPE Fellow and a recipient of SAMPE’s Lubin award for significant contributions in the field of material and process engineering.</p>\n</div>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/les-cohen-fsampe/\">Les Cohen, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  },
  {
    "title": "John Delmonte, FSAMPE",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "John Delmonte, FSAMPE"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://sampe.org/john-delmonte-fsampe/"
      }
    ],
    "link": "https://sampe.org/john-delmonte-fsampe/",
    "authors": [
      {
        "name": "SAMPE Global Team"
      }
    ],
    "author": "SAMPE Global Team",
    "author_detail": {
      "name": "SAMPE Global Team"
    },
    "published": "Wed, 21 Mar 2018 16:46:31 +0000",
    "published_parsed": [
      2018,
      3,
      21,
      16,
      46,
      31,
      2,
      80,
      0
    ],
    "tags": [
      {
        "term": "SAMPE @ 75",
        "scheme": null,
        "label": null
      },
      {
        "term": "Food",
        "scheme": null,
        "label": null
      },
      {
        "term": "Outdoors",
        "scheme": null,
        "label": null
      },
      {
        "term": "Pregnancy",
        "scheme": null,
        "label": null
      }
    ],
    "id": "http://sampeglobal.wpengine.com/?p=820",
    "guidislink": false,
    "summary": "<p>John Delmonte, both as an individual and through the two companies that he founded, was one of the leading pioneers in composites and adhesives.  His book, Technology of Adhesives, was the “bible” on adhesives for many engineers during the 1950s, encouraging their application in aircraft.  In all, Delmonte wrote nine technical books relating to materials</p>\n<p>The post <a href=\"https://sampe.org/john-delmonte-fsampe/\">John Delmonte, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "<p>John Delmonte, both as an individual and through the two companies that he founded, was one of the leading pioneers in composites and adhesives.  His book, Technology of Adhesives, was the “bible” on adhesives for many engineers during the 1950s, encouraging their application in aircraft.  In all, Delmonte wrote nine technical books relating to materials</p>\n<p>The post <a href=\"https://sampe.org/john-delmonte-fsampe/\">John Delmonte, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-10 hundred-percent-fullwidth non-hundred-percent-height-scrolling\"><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-9 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last fusion-column-no-min-height\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\"><div class=\"fusion-text fusion-text-10\"><p><span class=\"fusion-dropcap dropcap dropcap-boxed\">J</span>ohn Delmonte, both as an individual and through the two companies that he founded, was one of the leading pioneers in composites and adhesives.  His book, Technology of Adhesives, was the “bible” on adhesives for many engineers during the 1950s, encouraging their application in aircraft.  In all, Delmonte wrote nine technical books relating to materials and processes each of which provided vital information in applying these materials to aircraft and space systems.</p>\n<div class=\"txtNew\" id=\"comp-jtkpe6dv\">\n<p class=\"font_8\">Delmonte was the holder of over 20 patents in these areas.  His Technology of Carbon and Graphite Fiber Composites was published in 1981, containing important information on carbon fibers and their use in composites, including aircraft and space applications.  Other books he wrote were:  Plastics in Engineering, Metal Filled Plastics, Metal/Polymer Composites, Plastics Molding, and Origins of Materials and Processes.</p>\n<p><img alt=\"\" class=\"alignleft wp-image-822 size-medium\" height=\"300\" src=\"https://sampeglobal.wpengine.com/wp-content/uploads/2019/05/the-technology-of-adhesives-200x300.jpg\" width=\"200\" /></p>\n<p class=\"font_8\">He was the founder of Furane Plastics, a Los Angeles based company that developed epoxy and polyurethane adhesives, sealants, potting compounds, and other thermosetting m</p>\n<p class=\"font_8\">aterials widely used in aircraft and space systems’ electronic hardware and various structural members.  Recognizing the need for expertise in testing of compos</p>\n<p class=\"font_8\">ites, adhesives, and other materials, Delmonte founded Delsen Testing Laboratories in Glendale, CA in 1957.  Today, many years after its founding, Delsen continues to serve the aircraft and space industries conduc</p>\n<p class=\"font_8\">ting mechanical, electrical, and flammability tests of composites and other materials.</p>\n</div>\n<div class=\"txtNew\" id=\"comp-jtkpe6e4\">\n<p class=\"font_8\">Early in his career, Delmonte was a pioneer in plastics education, starting as an instructor at Illinois Institute of Technology.  During that time, he wrote his first book, Plastics in Engineering.  Shortly after, he was appointed the director of the newly established Plastics Industries Technical Institute in Los Angeles.  During World War II, the institute educated many people who went on to become contributors to the aircraft and space industries.</p>\n<p class=\"font_8\">Always willing to contribute to our industry, Delmonte held key elective offices and was active in many professional organizations, including the SAMPE, Society of Plastics Engineers, the Society of the Plastics Industry, the American Chemical Society, ASTM, the California Institute of Technology Associates, and Plastics Pioneers.  He earned many honors from these organizations, including being one of the first people to be elected as a SAMPE Fellow.  In 1982, he funded a special award administered by SAMPE to encourage outstanding contributions in materials and process technologies, the Delmonte Award for Excellence.</p>\n</div>\n</div><div class=\"fusion-clearfix\"></div></div></div></div></div>\n<p>The post <a href=\"https://sampe.org/john-delmonte-fsampe/\">John Delmonte, FSAMPE</a> appeared first on <a href=\"https://sampe.org\">SAMPE Global</a>.</p>"
      }
    ]
  }
]