[
  {
    "published": "Wed, 5 Nov 2025 00:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      5,
      5,
      0,
      0,
      2,
      309,
      0
    ],
    "title": "International Composites Summit releases 2025 event program, launches Careers Connect feature",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "International Composites Summit releases 2025 event program, launches Careers Connect feature"
    },
    "summary": "Now in its fifth year, the free-to-attend&nbsp;ICS Conference Forum taking place Dec. 2-3 in the U.K. offers a comprehensive lineup of industry keynotes, panels, discussions and a new industry talent platform.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Now in its fifth year, the free-to-attend&nbsp;ICS Conference Forum taking place Dec. 2-3 in the U.K. offers a comprehensive lineup of industry keynotes, panels, discussions and a new industry talent platform."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ics-summit-min.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ics-summit-min.png;maxWidth=720\" /> </a></div>\n\n<p>Source | ICS</p>\n</div>\n\n<p>The <a href=\"https://internationalcompositessummit.com/\" target=\"_blank\">International Composites Summit (ICS)</a>,&nbsp;the U.K.&rsquo;s free-to-attend event dedicated to the global composites industry is taking place Dec. 2-3, 2025, in Wembley, London.&nbsp;Now in its fifth year, ICS 2025 brings together more than 250 industry leaders, investors&nbsp;and innovators for 2&nbsp;impactful days of business, collaboration&nbsp;and innovation at The Drum at Wembley. ICS has released its 2025 program, which includes the debut launch of Careers Connect.</p>\n\n<p>Careers Connect is designed to connect students, graduates&nbsp;and early career professionals with companies in the composites and advanced engineering sectors, addressing one of the industry&rsquo;s biggest challenges &mdash;&nbsp;finding, attracting&nbsp;and retaining skilled talent. Careers Connect provides a practical way for companies and candidates to meet face-to-face, share opportunities and start building long-term relationships that strengthen this future talent pipeline.&nbsp;</p>\n\n<p>At ICS 2025, this feature will include:</p>\n\n<ul>\n\t<li>A <em>live Jobs Board</em>, enabling companies to showcase vacancies and opportunities directly to attendees.</li>\n\t<li><em>CV upload stations,</em> where candidates can share their details and opt-in to be contacted by employers.</li>\n\t<li>A <em>30-minute Q&amp;A</em> titled &ldquo;Connecting Talent with Opportunity,&rdquo; exploring ideas for building the workforce of the future.</li>\n</ul>\n\n<p>&ldquo;This is a critical moment for our industry,&rdquo; says&nbsp;Gemma Hardy, managing director at The Fluency Business Group. &ldquo;The demand for skilled composites professionals continues to grow, and ICS is committed to helping companies and candidates connect. Careers Connect will not only support recruitment now but also help build a sustainable talent pipeline for the future.&rdquo;</p>\n\n<p>The launch of Careers Connect at ICS 2025 marks the first step in a broader initiative. In 2026, Careers Connect will expand into a fully developed Careers Zone, with pre-scheduled interviews, employer presentations&nbsp;and a national candidate outreach program&nbsp;designed to attract talent from across the U.K.</p>\n\n<p>ICS invites candidates to&nbsp;visit the Careers Connect area, upload their CVs, view live job postings and join the panel session to gain insights into the industry; and companies to&nbsp;showcase their vacancies, register to receive candidate CVs and take part in the discussion about building a stronger workforce.</p>\n\n<h3>ICS 2025 program highlights, keynotes</h3>\n\n<p>This year&rsquo;s event features a strong line-up of global industry leaders, including Chris Skinner, vice president of strategic marketing and R&amp;D at Owens Corning; Ginger Gardiner, senior technical editor at <em>CompositesWorld</em>; and Mjed Hashem, lead materials engineer at NEOM, the future in design and construction.</p>\n\n<p>ICS also welcomes Marcy Offner, president of Women in the Composites Industry (WiC), to the U.K. for the first time. Offner will lead the Women in Composites Panel on the second day, exploring diversity and leadership across the sector.</p>\n\n<p>&ldquo;ICS 2025 is all about connecting the global composites ecosystem,&rdquo; says&nbsp;Katie Homes, ICS events manager. &ldquo;From Owens Corning and NEOM to Williams Racing and JLR, our speakers represent the full spectrum of innovation driving the industry forward.&rdquo;</p>\n\n<p>Across 2 days, the ICS Conference Forum will cover key themes including sustainability, automation, future flight&nbsp;and recycling, alongside The Pitching Zone for startups and innovators. It will explore the trends shaping the future of composites, from advanced materials and sustainability to automation, design intelligence&nbsp;and construction at giga-scale. In addition to the keynote sessions mentioned above, the program includes&nbsp;panels and presentations from organizations such as Williams Racing, JLR&nbsp;and GKN.</p>\n\n<p>ICS 2025 is free to attend for visitors and designed for commercial impact for exhibitors and sponsors. <a href=\"https://www.internationalcompositessummit.com\" target=\"_blank\">Register or learn more here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/international-composites-summit-releases-2025-event-program-launches-careers-connect-feature"
      }
    ],
    "link": "https://www.compositesworld.com/news/international-composites-summit-releases-2025-event-program-launches-careers-connect-feature"
  },
  {
    "published": "Tue, 4 Nov 2025 00:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      4,
      5,
      0,
      0,
      1,
      308,
      0
    ],
    "title": "AZL Joint Partner Project to build holistic approach for TPC-driven pressure vessel design",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AZL Joint Partner Project to build holistic approach for TPC-driven pressure vessel design"
    },
    "summary": "Design, manufacturing processes&nbsp;and material configurations will be sought through three work packages over a 9-month period through the combined efforts of participating engineers and decision-makers.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Design, manufacturing processes&nbsp;and material configurations will be sought through three work packages over a 9-month period through the combined efforts of participating engineers and decision-makers."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-azl-tpcpressurevessel-project.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Abstract JPP logo for TPC pressure vessel design.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-azl-tpcpressurevessel-project.png;maxWidth=720\" /> </a></div>\n\n<p>Source | AZL Aachen GmbH</p>\n</div>\n\n<p>Building on its longstanding partnerships with leading companies across the composites value chain, <a href=\"https://www.compositesworld.com/suppliers/azl-aachen-gmbh\" target=\"_blank\">AZL Aachen GmbH</a> (Germany) has launched its new Joint Partner Project (JPP) &ldquo;Thermoplastic Pressure Vessels &ndash; Benchmarking of Design-for-Manufacturing Strategies to Optimize Material Efficiency and Cost.&rdquo;&nbsp;Among the first participants, Toyota Motor Europe&nbsp;(TME, Brussel, Belgium) underscores the strategic importance of a comparative evaluation of design and manufacturing concepts for thermoplastic composite (TPC) pressure vessels.&nbsp;</p>\n\n<p>TPC offer automation, energy-efficiency, recyclability&nbsp;and reprocessability advantages for high-pressure vessel applications. However, when thermoset-derived design principles are applied unchanged, AZL believes the processing and performance capabilities of thermoplastics remain largely untapped. AZL&rsquo;s project therefore takes a holistic approach &mdash; TPC-driven vessel designs, manufacturing processes&nbsp;and material configurations to maximize both economic and technical performance.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Make sure to also check out...</h3>\n\n<p><a href=\"https://www.compositesworld.com/articles/composites-end-markets-pressure-vessels-2025\">Composites end markets: Pressure vessels (2025)</a></p>\n\n<p><a href=\"https://www.compositesworld.com/news/market-report-composites-and-carbon-fiber-in-hydrogen-storage\">Market report: Composites and carbon fiber in hydrogen storage</a></p>\n</div>\n</div>\n\n<p>Dr. Martin Kerschbaum, manager ME22 at TME, highlights the motivation behind Toyota&rsquo;s participation: &ldquo;The usage of thermoplastic resins for manufacturing of high-pressure hydrogen storage vessels is of high interest for Toyota. This is due to potential advantages in terms of design, processing, performance&nbsp;and circularity. It is essential to compare and evaluate the diverse options of design and manufacturing strategies for high-pressure vessels based on TPC materials. Gaining additional insights into the key influencing factors on material efficiency, production scalability and realistic cost-structure scenarios is a crucial part of this process. AZL&rsquo;s structured approach &mdash; a combination of know-how in applications, composite materials and production systems with expertise across the entire value chain &mdash; provides Toyota with valuable input for the further development of innovative storage systems.&rdquo;</p>\n\n<p>The 9-month project brings together international industry partners to explore new TPC vessel concepts. It is structured into three work packages:</p>\n\n<ul>\n\t<li><strong>WP1: Market &amp; Technology Landscape</strong> &mdash;&nbsp;Mapping state-of-the-art technologies, certification protocols&nbsp;and relevant IP.</li>\n\t<li><strong>WP2: Conceptual Design &amp; Manufacturing Strategies</strong> &mdash;&nbsp;Developing vessel architectures optimized for thermoplastics, evaluating design variants&nbsp;and defining production system concepts.</li>\n\t<li><strong>WP3: Performance, Cost &amp; Production Benchmarking</strong> &mdash; Quantifying material usage, recyclability, cycle times, cost per unit&nbsp;and carbon impact to guide industrial decision-making.</li>\n</ul>\n\n<p>By actively involving engineers and decision-makers from participating companies, AZL&rsquo;s JPPs combine technical depth with strategic relevance. Participants not only gain access to engineering results and benchmarking data, but also develop in-house expertise &mdash; enabling them to communicate more effectively with customers, suppliers&nbsp;and investors in the hydrogen and compressed natural gas (CNG) markets.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Steeped in innovative thinking</h3>\n\n<p>Previous AZL JPPs and R&amp;D programs have addressed hydrogen and CNG vessel design, filament and towpreg winding, and thermoplastic processing technologies. Within RWTH Aachen University&rsquo;s ecosystem, AZL combines design, simulation, production and testing infrastructure &mdash; covering the full range of technologies for component development, prototyping and developing production systems.</p>\n\n<p>This expertise is further amplified through the AZL Partnership Workgroup &ldquo;Composite Pipes &amp; Vessels,&rdquo;&nbsp;a dedicated platform for continuous collaboration, knowledge exchange&nbsp;and networking across the global composites industry. This new project on TPC pressure vessels builds on this&nbsp;foundation, offering participants both short-term insights and long-term strategic connections.</p>\n</div>\n</div>\n\n<p>&ldquo;AZL&rsquo;s JPPs create trusted spaces for knowledge exchange,&rdquo; adds Philipp Fr&ouml;hlig, head of industrial services at AZL Aachen GmbH. &ldquo;Our goal is to enable every participant to make well-founded technical and business decisions for their own product roadmap. Companies, independent of newcomers or established players benefit from collective benchmarking, faster learning by first-hand information and a shared understanding of what drives efficiency and competitiveness in TPC&nbsp;pressure vessel technologies.&rdquo;</p>\n\n<p>The next report meeting on&nbsp;Nov. 5, 2025, will provide an update on concept benchmarking and early design results for &ldquo;Thermoplastic Pressure Vessels &ndash; Benchmarking of Design-for-Manufacturing Strategies to Optimize Material Efficiency and Cost.&rdquo; Companies&nbsp;interested in hydrogen and CNG storage technologies are invited to join the consortium, gain access to the project findings&nbsp;and collaborate directly. In addition to this JPP, AZL offers individual R&amp;D support, benchmarking studies,and strategic guidance for companies developing lightweight composite pressure vessels and related components.</p>\n\n<p><em>Interested parties should reach out to Philipp Fr&ouml;hlig, head of industrial services (email:&nbsp;<a href=\"https://philipp.froehlig@azl-aachen-gmbh.de/\" target=\"_blank\">philipp.froehlig@azl-aachen-gmbh.de</a>; phone:&nbsp;+49 241 475 735 14)</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/azl-joint-partner-project-to-build-holistic-approach-for-tpc-driven-pressure-vessel-design"
      }
    ],
    "link": "https://www.compositesworld.com/news/azl-joint-partner-project-to-build-holistic-approach-for-tpc-driven-pressure-vessel-design"
  },
  {
    "published": "Mon, 3 Nov 2025 14:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      3,
      19,
      0,
      0,
      0,
      307,
      0
    ],
    "title": "FibreCoat, Lofith Composites form partnership to test ultra-resilient TPC materials in space",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FibreCoat, Lofith Composites form partnership to test ultra-resilient TPC materials in space"
    },
    "summary": "TPC satellite panels made from&nbsp;FibreCoat&rsquo;s energy-saving coated fibers and Lofith&rsquo;s low-water impregnation process&nbsp;will spend around 12 months in space starting in 2026 to test their performance.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "TPC satellite panels made from&nbsp;FibreCoat&rsquo;s energy-saving coated fibers and Lofith&rsquo;s low-water impregnation process&nbsp;will spend around 12 months in space starting in 2026 to test their performance."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-fibrecoat-lofith-team-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"The FibreCoat and Lofith Composite teams.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-fibrecoat-lofith-team-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>The FibreCoat and Lofith Composites teams. Source | FibreCoat GmbH</p>\n</div>\n\n<p>Coated fiber technology developer&nbsp;<a href=\"https://www.fibrecoat.de/\" target=\"_blank\">FibreCoat&nbsp;GmbH</a>&nbsp;(Aachen, Germany) and Spanish advanced materials company <a href=\"https://www.lofithcomposites.com/en/\" target=\"_blank\">Lofith Composites</a> (Valencia) have announced a&nbsp;strategic partnership to develop next-gen&nbsp;thermoplastic composites&nbsp;(TPC) for space. The first orbital demonstration of the joint material is planned for 2026, when a satellite will carry test panels into orbit for 12 months.</p>\n\n<p>The partnership joins FibreCoat&rsquo;s expertise in aluminum fiber&nbsp;coatings with Lofith&rsquo;s thermoplastic tape and composites manufacturing capabilities. Together, the companies will integrate FibreCoat&rsquo;s coated fibers into Lofith&rsquo;s recyclable, high-performance composites to produce lightweight structural materials designed to meet the extreme demands of space.</p>\n\n<p>During the orbital demonstration, detectors attached to the test panels will track dangerous ionizing radiation with and without shielding, temperature changes&nbsp;and other environmental effects. These results will be key to seeing if the materials are &ldquo;space-ready&rdquo;&nbsp;and meet&nbsp;the need of space companies for resilient, lightweight, cost-efficient materials. The test is expected to take place between the Q1 and Q2&nbsp;2026.</p>\n\n<p>Lofith Composites, launched in 2024, has developed an&nbsp;impregnation process that delivers up to 50%&nbsp;weight reduction and 30%&nbsp;higher strength compared to aluminum, as well as full recyclability. The process also consumes less water than conventional methods.</p>\n\n<p>FibreCoat &mdash; which recently secured &euro;500,000 in funding after winning the Industry category in the DLR INNOspace Masters&rsquo; DLR Challenge, as well as being named the overall winner of INNOspace in Pioneering Technology&nbsp;&mdash; has developed&nbsp;novel way to coat metals and plastics onto fibers, thus combining the properties of the fibers and the coating material, during the fiber&nbsp;spinning process. Its products are reported to offer strength and conductivity at a fraction of the weight and cost of competitor products; its latest Bismuth-based coating brings added functionality.&nbsp;</p>\n\n<p>&ldquo;Our goal has always been to deliver the next generation of TPC: recyclable, strong&nbsp;and able to remain robust even in harsh environments,&rdquo; says&nbsp;Amador Garc&iacute;a Sancho, CEO of Lofith Composites. &ldquo;Partnering with FibreCoat enables us to combine our expertise and qualify a material that can be used for satellite panels and a wide range of other applications.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fibrecoat-lofith-composites-form-partnership-to-test-ultra-resilient-tpc-materials-in-space"
      }
    ],
    "link": "https://www.compositesworld.com/news/fibrecoat-lofith-composites-form-partnership-to-test-ultra-resilient-tpc-materials-in-space"
  },
  {
    "published": "Mon, 3 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      3,
      17,
      0,
      0,
      0,
      307,
      0
    ],
    "title": "Huber Advanced Materials increases prices for all product lines",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Huber Advanced Materials increases prices for all product lines"
    },
    "summary": "Price increase for&nbsp;additives, suppressants, thermal management solutions, specialty aluminum oxides and other products effective&nbsp;Jan. 1, 2026, seeks to mitigate U.S. tariff-related impact.\n\n&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Price increase for&nbsp;additives, suppressants, thermal management solutions, specialty aluminum oxides and other products effective&nbsp;Jan. 1, 2026, seeks to mitigate U.S. tariff-related impact.\n\n&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-finance-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Abstract finance image.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-finance-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>The <a href=\"https://www.huberadvancedmaterials.com/\" target=\"_blank\">Huber Advanced Materials</a> (HAM, Atlanta, Ga., U.S.) business unit of Huber Engineered Materials (HEM), a business that is part of the J.M. Huber Corp. portfolio of businesses, has announced a global price increase dependent on product or as contracts allow, effective Jan. 1, 2026. HAM manufactures high-quality and purity,&nbsp;halogen-free fire retardant additives for composite resin systems, in addition to&nbsp;smoke suppressants, thermal management solutions, specialty aluminum oxides, and organic matting agents and carriers.</p>\n\n<p>According to the company, these price increases are necessary to partially offset the impact of recently implemented U.S.&nbsp;tariffs on imported aluminum hydroxide (ATH) feedstock and additional inflationary pressures from raw materials, regulatory compliance, labor and (ocean) freight cost.</p>\n\n<p>In North America, these tariffs have not only raised the cost of imported feedstock and finished products but have also contributed to higher domestic costs across the supply chain. These factors make price adjustments necessary.</p>\n\n<p>HAM remains committed to actively managing these challenges and minimizing&nbsp;the impacts on our customers wherever possible.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/huber-advanced-materials-increases-prices-for-all-product-lines"
      }
    ],
    "link": "https://www.compositesworld.com/news/huber-advanced-materials-increases-prices-for-all-product-lines"
  },
  {
    "published": "Mon, 3 Nov 2025 11:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      3,
      16,
      0,
      0,
      0,
      307,
      0
    ],
    "title": "X-59 supersonic aircraft makes first successful flight",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "X-59 supersonic aircraft makes first successful flight"
    },
    "summary": "Initial flying qualities and air data performance were verified during the X-59&rsquo;s flight, which will be expanded over the coming months by&nbsp;Lockheed Martin&rsquo;s Skunk Works and NASA.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Initial flying qualities and air data performance were verified during the X-59&rsquo;s flight, which will be expanded over the coming months by&nbsp;Lockheed Martin&rsquo;s Skunk Works and NASA."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-Lockheed-X59-flight.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"X-59 in flight.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-Lockheed-X59-flight.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Lockheed Martin Skunk Works</p>\n</div>\n\n<p>On Oct. 28,&nbsp;<a href=\"https://www.lockheedmartin.com/en-us/who-we-are/business-areas/aeronautics/skunkworks.html\" target=\"_blank\">Lockheed Martin Skunk Works</a>&nbsp;(Palmdale, Calif., U.S.), in partnership with <a href=\"https://www.nasa.gov/\" target=\"_blank\">NASA</a> (Washington, D.C., U.S.), successfully completed the first flight of the&nbsp;composites-intensive X-59 supersonic aircraft.&nbsp;</p>\n\n<p>The X-59 took off from Skunk Works&rsquo;&nbsp;facility at U.S. Air Force Plant 42 in&nbsp;Palmdale, before landing near NASA&rsquo;s Armstrong Flight Research Center in&nbsp;Edwards, California. The X-59 performed exactly as planned, verifying initial flying qualities and air data performance on the way to a safe landing at its new home.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<ul>\n\t<li><a href=\"https://www.compositesworld.com/articles/digital-design-multi-material-structures-enable-a-quieter-supersonic-nasa-x-plane\" target=\"_blank\">Digital design, multi-material structures enable a quieter supersonic NASA X-plane</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/cutting-100-pounds-certification-time-for-the-x-59-nose-cone\">Cutting 100 pounds, certification time for the X-59 nose cone</a></li>\n\t<li><a href=\"https://www.compositesworld.com/news/collier-aerospace-hyperx-optimizes-x-59-composite-nose-cone-\">Collier Aerospace HyperX&nbsp;optimizes X-59 composite nose cone</a></li>\n</ul>\n</div>\n</div>\n\n<p>The X-59 is designed to demonstrate the ability to fly at supersonic speeds while reducing the sonic boom to a gentle thump. In doing so, the X-59 aims to overcome one of the primary barriers to supersonic commercial flight, which is currently restricted over land due to noise concerns. The aircraft&rsquo;s successful&nbsp;development and flight testing will inform the establishment of new data-driven acceptable noise thresholds related to supersonic commercial flight over land, paving the way for a new generation of supersonic aircraft that can efficiently and sustainably transport passengers and cargo twice as fast as aircraft today.&nbsp;</p>\n\n<p>Skunk Works will continue to lead the aircraft&rsquo;s initial flight test campaign, working closely with NASA to expand the X-59&rsquo;s flight envelope over the coming months. Part of this test journey will include the X-59&rsquo;s first supersonic flights, where the aircraft will achieve the optimal speed and altitude for a quiet boom. This will enable NASA to operate the X-59 to measure its sound signature and conduct community acceptance testing.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/x-59-supersonic-aircraft-makes-first-successful-flight"
      }
    ],
    "link": "https://www.compositesworld.com/news/x-59-supersonic-aircraft-makes-first-successful-flight"
  },
  {
    "published": "Mon, 3 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      3,
      15,
      0,
      0,
      0,
      307,
      0
    ],
    "title": "PHOEBUS project makes progress on CFRP liquid oxygen, hydrogen upper stage tanks",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "PHOEBUS project makes progress on CFRP liquid oxygen, hydrogen upper stage tanks"
    },
    "summary": "The ESA project has proven that linerless CFRP tanks for Ariane 6 rocket can handle the extreme temperatures of liquid H2 and O2, and are moving on to&nbsp;testing campaign for 2-meter and 3.5-meter tanks in 2026.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The ESA project has proven that linerless CFRP tanks for Ariane 6 rocket can handle the extreme temperatures of liquid H2 and O2, and are moving on to&nbsp;testing campaign for 2-meter and 3.5-meter tanks in 2026."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-phoebus-team.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"PHOEBUS team and CFRP tanks.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-phoebus-team.jpg;maxWidth=720\" /> </a></div>\n\n<p>The&nbsp;PHOEBUS team in front of their 2-meter-diameter liquid hydrogen tank (left) and full-scale liquid oxygen tank (right) at MT Aerospace in Augsburg, Germany. Source (All Images) | MT Aerospace</p>\n</div>\n\n<p>Progress is being made with PHOEBUS, a European Space Agency (ESA, Paris, France) project developed together with&nbsp;<a href=\"https://www.ariane.group/en/\" target=\"_blank\">ArianeGroup</a>&nbsp;(Paris) and&nbsp;<a href=\"https://www.mt-aerospace.de/index-en.html\" target=\"_blank\">MT Aerospace</a>&nbsp;(Augsburg, Germany). The carbon fiber-reinforced polymer (CFRP) tanks being developed in lieu of metallic tanks &mdash; one tank developed for liquid hydrogen, and one developed for liquid oxygen&nbsp;&mdash; will offer&nbsp;potential future application on the&nbsp;<em>Ariane 6</em>&nbsp;rocket&rsquo;s upper stage and spin-off industrial applications.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-PHOEBUS-upperstage-in-orbit.jpg\" target=\"_blank\"><img alt=\"Rendition of the PHOEBUS upper stage in orbit.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-PHOEBUS-upperstage-in-orbit.jpg;maxWidth=385\" /></a></div>\n\n<p>Rendering of the PHOEBUS&nbsp;upper station for <em>Ariane 6</em> concept in orbit.&nbsp;The black upper stage is shown firing the Vinci engine to push a satellite into orbit.</p>\n</div>\n\n<p>PHOEBUS aims to assess the feasibility and benefits of replacing metal tanks.&nbsp;While this lightweight material offers the possibility of saving several tonnes of mass, such an approach has never been implemented before and presents significant technical challenges.</p>\n\n<p>The central core of the ESA&rsquo;s <em>Ariane 6</em> rocket runs on liquid oxygen and liquid hydrogen, which are two very different molecules, so PHOEBUS project partners need&nbsp;to develop and produce two types of tanks able to withstand these extremes.</p>\n\n<h3>Liquid hydrogen tank milestones</h3>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-phoebus-lh2-tank-final-stages.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-phoebus-lh2-tank-final-stages.jpg;maxWidth=385\" /></a></div>\n\n<p>PHOEBUS&nbsp;hydrogen tank during production at MT Aerospace in Augsburg in October 2025.&nbsp;This tank will hold almost 2,600 liters and is 2 meters diameter.</p>\n</div>\n\n<p>Hydrogen is the smallest molecule in the universe, and when used as fuel on the <em>Ariane 6</em> rocket it has to be cooled to -253&deg;C, just 20&deg; above absolute zero. Generally, carbon fiber&nbsp;composites, and thus carbon fiber tanks,&nbsp;do not like it that cold &mdash; when filled with cool propellants under pressure, small cracks can form.</p>\n\n<p>With these extreme conditions, the PHOEBUS project team has already overcome many technical hurdles &mdash;&nbsp;not only on development and tank concepts but also on measurement &mdash; as there are no off-the-shelf devices that accurately measure minuscule leak rates at cryogenic temperatures as low as -253&deg;C.&nbsp;This has led to the successful development of small 60-liter demonstration &ldquo;bottle&rdquo; tanks, which have shown that <a href=\"https://www.esa.int/Enabling_Support/Space_Transportation/Future_space_transportation/Tests_prove_carbon-fibre_fuel_tank_for_Phoebus_upper_stage\" target=\"_blank\">CFRP is capable of holding hydrogen in liquid form</a> without leaking, even without a protective liner.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Additional project details...</h3>\n\n<ul>\n\t<li>Smaller-scale &ldquo;bottle&rdquo; tank models have proven this technology is possible.</li>\n\t<li>ArianeSpace&rsquo;s new test facility in Trauen, Gemany, passed a preliminary design review in June and is being prepared for testing with liquid hydrogen starting in&nbsp;April 2026.</li>\n\t<li>Tanks are made using automatic fiber&nbsp;placement (AFP). Future upgrades may include using automation and AI&nbsp;to further improve quality control.</li>\n</ul>\n</div>\n</div>\n\n<p>Now, the team is&nbsp;working on a larger version with an updated design that will hold almost 2,600 liters. This 2-meter-diameter hydrogen tank will be tested by filling it with liquid hydrogen in 2026.</p>\n\n<p>Manufacture&nbsp;of the inner tank pressure vessel began in September 2025 at MT Aerospace&rsquo;s Augsburg facility and is expected to be finished in December. A test campaign is planned for April 2026, of which&nbsp;ArianeGroup will be responsible.</p>\n\n<p>Multiple tests will be run to try and learn as much as possible about how the tank behaves as it would on the launch pad and during liftoff to understand how and where the first cracks could appear. Sensors on and in the tank will provide pressure, temperature and strain data to monitor during testing and evaluated in-depth between each test.</p>\n\n<h3>Liquid oxygen tank milestones</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-PHOEBUS-fullscale-linerless-LO2-tank.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-PHOEBUS-fullscale-linerless-LO2-tank.jpg;maxWidth=385\" /></a></div>\n\n<p>Full-scale, linerless&nbsp;CFRP liquid&nbsp;oxygen tank finished production at MT Aerospace in Augsburg.&nbsp;</p>\n</div>\n\n<p>In comparison, liquid oxygen is cooled and stored to -180&deg;C, a highly reactive and possibly corrosive propellant. Similar&nbsp;to its work with liquid hydrogen, PHOEBUS has proven the use of CFRP tanks via small demonstration &ldquo;bottle&rdquo; tanks without a protective liner. In addition, following a 2019&nbsp;<a href=\"https://www.esa.int/Enabling_Support/Space_Transportation/Future_space_transportation/Tough_tests_no_problem_for_carbon-fibre_cryo_fuel_tanks\" target=\"_blank\">demonstration of holding liquid oxygen in a 2-meter&nbsp;tank</a>, further tests were successful and did not end up in any unplanned disassembly of the tank, as could be feared if the material reacted with oxygen.</p>\n\n<p>An improved tank design has now been expanded to a full-scale 3.5-meter tank concept, which is in the last phases of production: the manufacturing tools are being removed and quality control inspections performed at MT Aerospace in Augsburg. The experience from the PHOEBUS project has enabled a very smooth production of this first full-scale tank element, which will be finished in a few months.</p>\n\n<p><em>PHOEBUS is part of the ESA&rsquo;s Future Launchers Preparatory Programme (FLPP).</em></p>\n\n<div class=\"article_sidebar\">\n<div></div>\n\n<p style=\"text-align: center;\">PHOEBUS demonstrates the production of its 2-meter-scale liquid hydrogen tank pressure vessel on an AFP machine.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/phoebus-project-makes-progress-on-cfrp-liquid-oxygen-hydrogen-upper-stage-tanks"
      }
    ],
    "link": "https://www.compositesworld.com/news/phoebus-project-makes-progress-on-cfrp-liquid-oxygen-hydrogen-upper-stage-tanks"
  },
  {
    "published": "Fri, 31 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      31,
      17,
      0,
      0,
      4,
      304,
      0
    ],
    "title": "Advanced materials exhibition returns to Tokyo in November 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Advanced materials exhibition returns to Tokyo in November 2025"
    },
    "summary": "Highly-Functional Material Week 2025, covering everything from composites, ceramics and metals, presents more than 1,000 exhibitors across eight specialized, concurrent&nbsp;shows.&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Highly-Functional Material Week 2025, covering everything from composites, ceramics and metals, presents more than 1,000 exhibitors across eight specialized, concurrent&nbsp;shows.&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-hfmwtokyo25-min.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"HFMW exhibit collage.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-hfmwtokyo25-min.png;maxWidth=720\" /> </a></div>\n\n<p>Source | HFMW</p>\n</div>\n\n<p><a href=\"https://www.material-expo.jp/tokyo/en-gb.html?utm_source=media&amp;utm_medium=referral&amp;utm_campaign=pressrelease\" target=\"_blank\">Highly-Functional Material Week</a> (HFMW) Tokyo 2025 is opening its doors at Makuhari Messe in Japan from Nov. 12-14, 2025. The advanced materials exhibition will feature&nbsp;a comprehensive display of functional materials&mdash;&nbsp;including&nbsp;functional films, plastics, cellulose, carbon fiber composites, metals and ceramics&nbsp;&mdash; that&nbsp;highlight significant progress across industries like electronics, mobility, clean energy, aerospace, medical devices and sustainability.</p>\n\n<p>More than a 1,000 exhibitors will present their latest technologies across eight specialized shows: Filtech Japan, Plastics Japan, Metal Japan, Ceramic Japan,&nbsp;Adhesion &amp; Bonding Expo, Paint &amp; Coating Japan, Sustainable Material Expo&nbsp;and Green Process Japan. This year&rsquo;s Tokyo edition will also feature major concurrent shows accessible to participants, creating a platform for cross-industry collaboration and knowledge exchange.</p>\n\n<p>Another concurrent event is the inaugural Recycle Tech Japan, an exhibition dedicated to recycling innovation and ecosystem development. As industries intensify efforts toward carbon neutrality, this platform will showcase practical solutions and foster partnerships among material suppliers, manufacturers, logistics providers, retailers, waste management companies and municipalities.</p>\n\n<p>&ldquo;Highly-Functional Material Week has always been about connecting people with ideas and technologies that push industries forward,&rdquo; says&nbsp;Katsutoshi Tsuchiya, HFMW&nbsp;show director, RX Japan Ltd. &ldquo;This year&rsquo;s Tokyo edition will be a true meeting ground for professionals who want to see not only what&rsquo;s possible for the materials sector today, but also what&rsquo;s shaping its future. We&rsquo;re excited to welcome participants from around the world to experience it firsthand.&rdquo;</p>\n\n<p>With its comprehensive coverage of both foundational materials and applied technologies, HFMW&nbsp;Tokyo 2025 is expected to draw significant international attention. Visitors can anticipate countless opportunities to network with innovators on-site and discover new solutions that could redefine their business.</p>\n\n<p><a href=\"https://www.material-expo.jp/tokyo/en-gb/register.html?cat=visitor&amp;?utm_source=media&amp;utm_medium=referral&amp;utm_campaign=pressrelease\" target=\"_blank\">Registration for visitors is now open</a>. For more information, visit the official website <a href=\"https://www.material-expo.jp/tokyo/en-gb.html?utm_source=media&amp;utm_medium=referral&amp;utm_campaign=pressrelease\" target=\"_blank\">here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/advanced-materials-exhibition-returns-to-tokyo-in-november-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/advanced-materials-exhibition-returns-to-tokyo-in-november-2025"
  },
  {
    "published": "Fri, 31 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      31,
      17,
      0,
      0,
      4,
      304,
      0
    ],
    "title": "CUBIC project meeting reports progress on novel biomaterials for circular composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CUBIC project meeting reports progress on novel biomaterials for circular composites"
    },
    "summary": "In early October, the CUBIC consortium held meetings to discuss current progress and upcoming strategies, toured DITF&rsquo;s research facilities and joined a training session on bio-based carbon fiber development from lignin.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "In early October, the CUBIC consortium held meetings to discuss current progress and upcoming strategies, toured DITF&rsquo;s research facilities and joined a training session on bio-based carbon fiber development from lignin."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CUBIC project to improve circularity of composites via biomaterials\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update.jpg;maxWidth=720\" /> </div>\n\n<p>Source (All Images) | CUBIC project</p>\n</div>\n\n<p>The CUBIC consortium gathered for its 5<sup>th</sup> project meeting from&nbsp;Oct. 7-8, 2025. Hosted by the German Institutes of Textile and Fiber Research (<a href=\"https://www.ditf.de/en/\" target=\"_blank\">DITF</a>, Denkendorf, Germany), the meeting reviewed progress and upcoming strategies. Participants also toured DITF&rsquo;s stabilization and carbonization lines for carbon fiber and joined in a training session on DITF&rsquo;s development of bio-based carbon fibers from lignin. As a partner in CUBIC, DITF is working to develop towpregs to be used in the production of Type 4 pressure vessels.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-goals.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CUBIC project objectives for circular bio-based composites\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-goals.jpg;maxWidth=720\" /> </a></div>\n\n<div>&nbsp;</div>\n\n<div>&nbsp;</div>\n</div>\n\n<p>CUBIC consortia members reported that new promising formulations based on bio-based monomers have been identified, including bioPA, bioepoxy and bio-based carbon fiber, which show great potential for pilot scale production. Validation at intermediate scale confirmed the reproducibility of lab results while Certified Renewable Carbon Content (C-bio) analyses also confirmed consistency across scales.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-bioproducts.jpg\" target=\"_blank\"><img alt=\"biobased B2B intermediate products for composites\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-bioproducts.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>In parallel, other monomers have been successfully scaled up, and representative pilot batches were delivered to partners <a href=\"https://mosesproductos.com/en/home/\" target=\"_blank\">Moses Productos</a> (Zaragoza, Spain) and <a href=\"https://www.centexbel.be/en\" target=\"_blank\">Centexbel</a> (Brussels, Belgium).</p>\n\n<p>Work is also ongoing to review the Virtual Control Strategy within CUBIC&rsquo;s Sustainability and Digitalization twinning activities from colleagues at <a href=\"https://idener.ai/\" target=\"_blank\">idener.ai</a> (Seville, Spain).</p>\n\n<p>Meanwhile, <a href=\"https://cidetec.es/\" target=\"_blank\">CIDETEC</a> (Donostia/San Sebasti&aacute;n, Spain) has carried out mechanical tests on composites made from carbon fiber and a bio-based epoxy resin (BioEPO) supplied by <a href=\"https://specificpolymers.com/\" target=\"_blank\">Specific Polymers</a>&nbsp;(Castries, France), produced through an in-house process.</p>\n\n<p>Together with <a href=\"https://www.carbotainer.es/\" target=\"_blank\">Carbotainer</a> (Zaragoza, Spain) and CIDETEC, DITF held a hybrid technical workshop with presentations on:</p>\n\n<ul>\n\t<li>Lignin-based carbon fiber production</li>\n\t<li>Pultrusion and vitrimer thermoforming</li>\n\t<li>Type 4 hydrogen pressure vessels.</li>\n</ul>\n\n<div></div>\n\n<h2>&nbsp;</h2>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Collaboration with other projects</h3>\n\n<p>CUBIC actively pursues synergies with other Horizon Europe projects, including: <a href=\"https://biophenomproject.eu/\" target=\"_blank\">BIOPHENOM</a>, <a href=\"https://www.salient-project.eu/\" target=\"_blank\">SALIENT</a>, <a href=\"https://vibesproject.eu/\" target=\"_blank\">VIBES</a>, <a href=\"https://estellaproject.eu/\" target=\"_blank\">ESTELLA</a>, <a href=\"https://www.bio-uptake-project.eu/\" target=\"_blank\">BIOUPTAKE</a>, <a href=\"https://redysign.eu/\" target=\"_blank\">redysign</a>, <a href=\"https://www.bioradar.org/\" target=\"_blank\">BIORADAR</a>, <a href=\"https://multimag-project.eu/\" target=\"_blank\">MultiMag</a>, and <a href=\"https://plastice.eu/\" target=\"_blank\">PLASTICE</a>.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-collaboration.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> </a><source media=\"(min - width: 1000px)\" /><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-collaboration.jpg\" target=\"_blank\"> </a><source media=\"(min - width: 401px) and (max-width: 1000px)\" /><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-collaboration.jpg\" target=\"_blank\"> </a><source media=\"(max-width: 400px)\" /><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-collaboration.jpg\" target=\"_blank\"> <!--[if IE 9]></video><![endif]--> <img alt=\"CUBIC collaborates with other Horizon Europe projects\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-cubic-update-collaboration.jpg;maxWidth=720\" /></a></div>\n</div>\n</div>\n</div>\n\n<h3>Training events&nbsp;</h3>\n\n<p>On Oct. 29, CUBIC held another training as part of the <a href=\"https://vital-project.eu/\" target=\"_blank\">VITAL Learning Factory</a>. Partner idener.ai showcased&nbsp;how AI and data-driven approaches can create new opportunities in manufacturing, while polymer experts covered bio-based thermoplastics processing and recycling.</p>\n\n<p>Alongside the online training, an in-person afternoon session provided participants with practical experience regarding thermoplastic process conditions, reprocess recycled bioplastics and how to evaluate the performance of the recycled products.</p>\n\n<p>For more information about CUBIC, read:</p>\n\n<ul>\n\t<li><a href=\"https://mailchi.mp/e1d9654ee955/cubics-4th-newsletter\" target=\"_blank\">Fourth CUBIC project newsletter</a></li>\n\t<li><a href=\"%09https:/www.compositesworld.com/news/cubic-project-updates-reinforce-focus-on-bio-based-composites-development\" target=\"_blank\">CUBIC project updates reinforce focus on bio-based composites development</a></li>\n\t<li><a href=\"https://www.compositesworld.com/news/cubic-project-to-develop-100-recyclable-composite-hydrogen-containers-care-seats\" target=\"_blank\">CUBIC project to develop 100% recyclable composite hydrogen container, car seat</a>.</li>\n</ul>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cubic-project-meeting-reports-progress-on-novel-biomaterials-for-circular-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/cubic-project-meeting-reports-progress-on-novel-biomaterials-for-circular-composites"
  },
  {
    "published": "Fri, 31 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      31,
      16,
      0,
      0,
      4,
      304,
      0
    ],
    "title": "Voidsyexpands composites NDT&E into international markets, grows business capabilities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Voidsyexpands composites NDT&E into international markets, grows business capabilities"
    },
    "summary": "In efforts to transform into a stable, internationally recognized company for quality assurance and predictive maintenance, voidsy is&nbsp;looking for distribution and partnership opportunities outside the DACH region.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "In efforts to transform into a stable, internationally recognized company for quality assurance and predictive maintenance, voidsy is&nbsp;looking for distribution and partnership opportunities outside the DACH region."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-voidsy-new-office.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Relocated voidsy building.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-voidsy-new-office.jpg;maxWidth=720\" /> </a></div>\n\n<p>The company recently relocated to a larger facility in Wels. Source (All Images)&nbsp;| voidsy gmbh</p>\n</div>\n\n<p><a href=\"https://www.voidsy.com/en/\" target=\"_blank\">Voidsy gmbh</a>&nbsp;(Wels, Austria), a high-potential deep-tech company specializing in nondestructive testing and evaluation (NDT&amp;E), is transitioning beyond the startup phase with its expansion into international markets including France and the U.S. The company aims to transform the way industries, including composites, inspect and evaluate components &mdash;&nbsp;achieving up to 80% faster and more cost-effective results compared to traditional methods via its photothermal tomography technology (<a href=\"https://www.compositesworld.com/articles/photothermal-tomography-for-locating-quantifying-defects-in-composites-\" target=\"_blank\">read more here</a>).</p>\n\n<p>Unlike traditional composite ultrasonic inspection that is slow and requires contact with samples, and infrared testing techniques&rsquo; surface-level data, voidsy&rsquo;s&nbsp;photothermal tomography system is capable of quickly&nbsp;generating accurate 3D visualizations of internal structures.&nbsp;Based on a diffusive process of thermal propagation, it enables precise, noncontact&nbsp;and nondestructive materials imaging by&nbsp;thermally exciting a specimen and detecting its time-dependent temperature response with high-resolution infrared sensors.</p>\n\n<p>&ldquo;As the demand for efficient and reliable inspection solutions grows, voidsy&rsquo;s photothermal tomography stands out as a next-generation tool for advanced industries,&rdquo; emphasizes&nbsp;CTO of voidsy gmbh Dr. G&uuml;nther Mayr. &ldquo;Our system allows engineers to analyze components in a fraction of the time and cost, with no compromise on accuracy or detail.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-voidsy-Rox2.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-voidsy-Rox2.png;maxWidth=385\" /></a></div>\n\n<p>The voidsy 3D V-ROX is a compact and intelligent photothermal tomography system that enables 3D imaging of hidden material and structural defects.</p>\n</div>\n\n<p>Building on this technological foundation, voidsy is actively expanding into new markets. The company is already actively selling all over Europe and searching for distribution and partnership opportunities outside the DACH region, where its NDT&amp;E solutions are ideally suited for aerospace, automotive&nbsp;and energy sectors. This strategic move underscores voidsy&rsquo;s commitment to global collaboration and its mission to bring innovation to European industry.</p>\n\n<p>In parallel with its international expansion, voidsy is growing at home. The company has recently welcomed four new team members, strengthening its operational, engineering&nbsp;and business development capabilities. To support this growth, voidsy has also relocated to a larger, state-of-the-art facility in Wels, Austria, equipped for immediate testing of customer samples and continuous innovation.</p>\n\n<p>&ldquo;This milestone marks our transformation into a stable, internationally recognized company,&rdquo; says Dr. Holger Plasser, co-founder and CEO of voidsy. &ldquo;We are ready to lead the next wave of innovation in NDT&amp;E.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/voidsy-expands-composites-ndte-into-international-markets-grows-business-capabilities"
      }
    ],
    "link": "https://www.compositesworld.com/news/voidsy-expands-composites-ndte-into-international-markets-grows-business-capabilities"
  },
  {
    "published": "Fri, 31 Oct 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      10,
      31,
      15,
      30,
      0,
      4,
      304,
      0
    ],
    "title": "Cygnet Texkimp industrializes McLaren ART, licenses solution for multiple markets",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Cygnet Texkimp industrializes McLaren ART, licenses solution for multiple markets"
    },
    "summary": "High-rate fiber deposition technology, originally developed for high-volume supercar manufacturing, offers&nbsp;potential to address specialized, complex and high-rate composite part requirements in other industries.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "High-rate fiber deposition technology, originally developed for high-volume supercar manufacturing, offers&nbsp;potential to address specialized, complex and high-rate composite part requirements in other industries."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-McLaren-ART.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ART machine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-McLaren-ART.jpg;maxWidth=720\" /> </a></div>\n\n<p>McLaren introduced automated rapid tape (ART) production at its Composites Technology Centre in Sheffield, U.K., in 2025. Source (All Images) | Cygnet Texkimp</p>\n</div>\n\n<p>Composites technology specialist <a href=\"https://www.compositesworld.com/suppliers/cygnet-texkimp\" target=\"_blank\">Cygnet Texkimp</a>&nbsp;(Northwich, U.K.), the designer and machine builder for global supercar manufacturer <a href=\"https://cars.mclaren.com/en\" target=\"_blank\">McLaren Automotive</a>&rsquo;s&nbsp;(Woking, Surrey, U.K.)&nbsp;automated rapid tape (ART) technology concept, is now licensing the high-rate fiber deposition solution for multiple markets.</p>\n\n<p>As part of a development program&nbsp;spearheaded by McLaren&rsquo;s in-house innovation team,&nbsp;ART was designed to overcome the challenge of producing high-quality, complex,&nbsp;composites-intensive parts at viable rate and forms, including&nbsp;highly loaded and complex aerodynamic components, for McLaren&rsquo;s&nbsp;supercar portfolio&nbsp;(<a href=\"https://www.compositesworld.com/news/mclaren-develops-aerospace-inspired-art-method-for-volume-composite-super-car-engineering\" target=\"_blank\">learn more about the process here</a>). Now, Cygnet&nbsp;Texkimp and McLaren have formed an exclusive licensing agreement that enables&nbsp;Cygnet to market the solution to other industries including aerospace, space, defense,&nbsp;wind energy and industrial as part of a long-term strategy to enable high-rate, sustainable manufacture of composites.</p>\n\n<p>McLaren commissioned Cygnet Texkimp to develop its technology into a full production-scale machine after the two companies took part in the ASCEND program (read &ldquo;<a href=\"https://www.compositesworld.com/articles/ascend-program-completion-transforming-the-uks-high-rate-composite-manufacturing-capability\">ASCEND program completion: Transforming the U.K.'s high-rate composites manufacturing capability</a>&rdquo;).&nbsp;A prototype high-rate deposition machine has been installed at the McLaren Composites Technology Centre (MCTC) in Sheffield. The&nbsp;technology is already integrated into McLaren&rsquo;s manufacturing processes and is producing structural components for current supercar programs, including the McLaren W1 <em>Ultimate Supercar</em>.</p>\n\n<p>A second industrial-specification ART machine, currently being built at Cygnet Texkimp&rsquo;s Innovation Centre in Cheshire, will be installed at the MCTC in November 2025, delivering increased manufacturing capacity.</p>\n\n<p>&ldquo;ART combines McLaren&rsquo;s extensive knowledge and experience of highly specialized carbon fiber&nbsp;engineering with our fiber&nbsp;handling and processing expertise and understanding of mechanics and controls,&rdquo; says Luke Vardy, Cygnet Texkimp CEO.&nbsp;&ldquo;The technology unlocks enormous potential for large-scale global markets to access the benefits of a highly specialized carbon fiber and composites manufacturing solution first developed for aerospace and high-performance automotive-grade composites. It is relevant to many industries for the manufacture of composite structures that are optimized for high performance.&rdquo;</p>\n\n<p>ART manufactures high-performance carbon fiber&nbsp;composite parts at rate and with minimal scrap. Lengths of dry composite tape are laid down in rapid and accurate formation, at a speed of up to 2.5 meters/second, in a way that significantly reduces the potential for waste generated by off-cuts that cannot be reused. Up to 95% of the dry tape feedstock used to layer a component goes into the final part.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-Cygnet-McLaren-ART-machine.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"McLaren Automotive andCygnet Texkimp ART machine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-Cygnet-McLaren-ART-machine.jpg;maxWidth=720\" /> </a></div>\n\n<p>McLaren Automotive and&nbsp;Cygnet Texkimp ART machine.</p>\n</div>\n\n<p>The solution creates new possibilities for innovation in automotive and aerospace engineering and design through its fiber placement capabilities. This element of the technology enables manufacturers to accurately tailor the load-bearing and stiffness characteristics of the finished part through the strategic positioning of the fibers. Specific adjustment of fiber&nbsp;orientation within the composite material allows for anisotropic stiffness: rigidity can be enhanced in specific directions while flexibility can be maintained elsewhere.&nbsp;</p>\n\n<p>The process has also been highly automated and digitized to offer extensive handling and real-time monitoring capability. In this way, end users are able to&nbsp;determine that every part has been manufactured to identical specifications, which in turn leads to significant time saving benefits linked to speed of manufacture and reduced test frequency.</p>\n\n<p>A full-scale demonstration machine will be built at Cygnet Texkimp&rsquo;s Innovation Centre where it will be available for customer trials in early 2026. Within the Centre, organizations will also benefit from Cygnet Texkimp&rsquo;s tape manufacturing capability which includes advanced machines to manufacture dry carbon fiber&nbsp;tapes alongside high-performance thermoset, thermoplastic and ceramic prepreg materials.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cygnet-texkimp-industrializes-mclaren-art-licenses-solution-for-multiple-markets"
      }
    ],
    "link": "https://www.compositesworld.com/news/cygnet-texkimp-industrializes-mclaren-art-licenses-solution-for-multiple-markets"
  }
]