[
  {
    "published": "Wed, 16 Jul 2025 13:54:54 -0400",
    "published_parsed": [
      2025,
      7,
      16,
      17,
      54,
      54,
      2,
      197,
      0
    ],
    "title": "University research studies potential of bladeless wind turbines",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "University research studies potential of bladeless wind turbines"
    },
    "summary": "Insights from a new study from the University of Glasgow demonstrates how smaller-scale wind power generation, with designs achieved via&nbsp;computer modeling techniques, can scale up utility-grade systems.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Insights from a new study from the University of Glasgow demonstrates how smaller-scale wind power generation, with designs achieved via&nbsp;computer modeling techniques, can scale up utility-grade systems."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-aerialview-citygrid-GettyImages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerial view of a city grid by a river.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-aerialview-citygrid-GettyImages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>Engineers from the&nbsp;<a href=\"https://www.gla.ac.uk/\" target=\"_blank\">University of Glasgow</a> (Scotland) have performed a new study on&nbsp;the use of sophisticated computer simulations for&nbsp;bladeless wind turbines (BWTs) to identify how future generations of the technology could be built for maximum efficiency.&nbsp;According to researchers, findings could help BWTs, which are still at an early stage of R&amp;D, from small-scale field experiments to practical forms of power generation for national electricity grids. This work, titled &ldquo;<a href=\"https://www.sciencedirect.com/science/article/pii/S096014812501211X?via%3Dihub\">Performance analysis and geometric optimisation of bladeless wind turbines using wake oscillator model</a>,&rdquo; has been&nbsp;published in&nbsp;<em>Renewable Energy</em>.</p>\n\n<p>According to <em><a href=\"https://acmanet.org/bladeless-wind-turbines-offer-potential-for-efficient-renewable-energy-production/?utm_campaign=11454023-Industry%20Digest%202025&amp;utm_medium=email&amp;_hsenc=p2ANqtz--C0SskB4gEgmh1IaX4VX9upjyPzilfUslNm5AlXwv1kddjiPICfcdHb1q4J4nIQnkgITbE_Mndpnnm___yxdF1neyG_Q&amp;_hsmi=371201924&amp;utm_content=371201924&amp;utm_source=hs_email\" target=\"_blank\">Composites Manufacturing</a>,</em>&nbsp;BWTs&nbsp;&ldquo;consist of a cylinder built of resin-reinforced carbon fiber or glass fiber that is anchored to the ground by a rod&rdquo; and&nbsp;sways in the wind, like lampposts in inclement weather.&nbsp;As the wind blows against them, BWTs create vortices &mdash;&nbsp;alternating swirls of air that rock the entire structure back and forth.&nbsp;When the frequency of the rocking matches the structure&rsquo;s natural tendency to vibrate, the motion is amplified significantly, and the increased motion is converted into electricity. This process is called&nbsp;vortex-induced vibration.</p>\n\n<p>In its paper, the team shows how they used computer modeling techniques to simulate the performance of thousands of variations of BWT design. The results cast new light on the interplay between mast dimensions, power output&nbsp;and structural safety in winds between 20 and 70 miles per hour.</p>\n\n<p>Key findings include an&nbsp;optimal design for BWTs which creates a &ldquo;sweet spot&rdquo; that balances power generation with structural strength. The design, a 65-centimeter-diameter, 80-centimeter-tall mast, could safely deliver a maximum of 460 watts of power, significantly outpacing the performance of even the best-performing, real-world prototypes built to date, which have delivered a maximum of 100 watts.</p>\n\n<p>The team&rsquo;s&nbsp;model also demonstrated the limits of other designs, which could potentially generate more power, but wouldn&rsquo;t hold up to real-world conditions. In the paper, the University of Glasgow team&nbsp;illustrates&nbsp;how different designs of BWTs could, in theory, generate up to 600 watts, but at the cost of structural integrity.</p>\n\n<p>Ultimately, the team believes their methodology could provide the foundation for scaling up BWTs to utility-grade systems generating 1 kilowatt and beyond, making them much more practical for use by renewable energy providers.</p>\n\n<p>&ldquo;What this study shows for the first time is that, counter intuitively, the structure with the highest efficiency for extracting energy is&nbsp;not in fact the structure which gives the highest power output,&rdquo; explains the University of Glasgow&rsquo;s James Watt School of Engineering Dr. Wrik Mallik, one of the paper&rsquo;s authors. &ldquo;Instead, we have identified the ideal midpoint between the design variables to maximize the ability of BWTs to generate power while maintaining their structural strength. In the future, BWTs could play an invaluable role in generating wind power in urban environments, where conventional wind turbines are less useful. BWTs are quieter than wind turbines, take up less space, pose less of a threat to wildlife&nbsp;and have fewer moving parts, so they should require less regular maintenance.&rdquo;</p>\n\n<p>James Watt School of Engineering&rsquo;s professor Sondipon Adhikari,&nbsp;also one of the paper&rsquo;s authors, says they hope this research will help spur industry to develop new BWT design prototypes. &ldquo;Removing some of the guesswork involved in refining prototypes could help bring BWTs closer to becoming a more useful part of the world&rsquo;s toolbox for achieving net-zero through renewables,&rdquo; says&nbsp;Adhikari. &ldquo;We plan to continue refining our understanding of BWT design and how the technology can be scaled up to provide power across a wide range of applications. We&rsquo;re also keen to explore how metamaterials &mdash;&nbsp;specially designed materials which have been finely tuned to imbue them with properties not found in nature &mdash;&nbsp;could boost BWTs&rsquo; effectiveness in the years to come.&rdquo;</p>\n\n<p>James Watt School of Engineering master&rsquo;s student Janis Breen also contributed to the paper.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/university-research-studies-potential-of-bladeless-wind-turbines"
      }
    ],
    "link": "https://www.compositesworld.com/news/university-research-studies-potential-of-bladeless-wind-turbines"
  },
  {
    "published": "Wed, 16 Jul 2025 12:57:28 -0400",
    "published_parsed": [
      2025,
      7,
      16,
      16,
      57,
      28,
      2,
      197,
      0
    ],
    "title": "Coltata Aerospace enhances Evans Composites' repair operations",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Coltata Aerospace enhances Evans Composites' repair operations"
    },
    "summary": "Under Coltata&rsquo;s platform, Evans has displayed significant improvement in operational&nbsp;performance, scalability&nbsp;and customer experience for aerospace and defense.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Under Coltata&rsquo;s platform, Evans has displayed significant improvement in operational&nbsp;performance, scalability&nbsp;and customer experience for aerospace and defense."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-evanscomposites-infusion.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Vacuum infusion.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-evanscomposites-infusion.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Evans Composites</p>\n</div>\n\n<p><a href=\"https://www.coltalaaerospace.com/\" target=\"_blank\">Coltala Aerospace</a>&nbsp;(Fort Worth, Texas, U.S.)&nbsp;a mission-driven aerospace and defense platform, has announced key operational and strategic enhancements at <a href=\"https://www.evanscomposites.com/\" target=\"_blank\">Evans Composites</a>, an FAA, EASA and ISO-certified Part 145 repair station, better positioning the company in&nbsp;composites repair and overhaul of aircraft flight controls and structures.</p>\n\n<p>Evans Composites has seen transformative growth, with a 55% increase in revenue in June 2025 compared to the same time in 2024. Moreover, the company&rsquo;s workforce has doubled in size.&nbsp;Powered by Coltala Aerospace&rsquo;s precision integration strategy, this momentum has brought alignment and strength to Evans, driving gains in operational performance, scalability&nbsp;and customer experience.</p>\n\n<p>&ldquo;Evans Composites has a long legacy of excellence in composite repair, and under the Coltala Aerospace platform, we&rsquo;ve been able to further maximize its capabilities,&rdquo; says Rick Armstrong,&nbsp;CEO of Coltala Aerospace. &ldquo;We are now stronger, faster&nbsp;and more strategically aligned to serve our partners in aerospace and defense.&rdquo; Since joining the Coltala Aerospace platform, Evans Composites has experienced:</p>\n\n<p><strong>More than 30% reduction in turn times.</strong>&nbsp;Streamlined workflows and standardized procedures have improved operational efficiency, enabling faster delivery without compromising quality.&nbsp;</p>\n\n<p><strong>Strategic cross-division alignment</strong>.&nbsp;Integration under Coltala&rsquo;s unified vision has enhanced cross-functional collaboration and sharpened strategic focus across business units. Each division specializes on its core strengths and collaborates seamlessly on everything else.</p>\n\n<p><strong>Data-driven decision-making</strong>.&nbsp;Implementation of robust reporting tools now empowers teams to make smarter, faster&nbsp;and more informed decisions at all levels.</p>\n\n<p><strong>Enhanced customer experience. </strong>New communication protocols and service tracking methods ensure more consistent, proactive&nbsp;and transparent customer engagement.&nbsp;</p>\n\n<p><strong>Scalable infrastructure investment</strong>.&nbsp;Modernized systems and tools support long-term growth, compliance&nbsp;and operational excellence across the organization, including the&nbsp;addition of new tablets on the shop floor and redesigned&nbsp;employee work spaces.</p>\n\n<p>&ldquo;The implementation of our run chart and the progress reflected in our customer scorecards support our upward trajectory,&rdquo; says Nick McDonald, VP &ndash;&nbsp;general manager of Evans Composites. &ldquo;As we continue looking ahead and strategically planning future Kaizen events, the future is bright, not only for our team and our organization, but most importantly, for our customers.&rdquo;</p>\n\n<p>According to Ralph Manning, co-founder of Coltata Holdings, Evans Composites represents the&nbsp;&nbsp;kind of high-integrity business Coltala seeks to elevate, &ldquo;one with deep industry roots and the capacity for transformation.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/coltata-aerospace-enhances-evans-composites-repair-operations"
      }
    ],
    "link": "https://www.compositesworld.com/news/coltata-aerospace-enhances-evans-composites-repair-operations"
  },
  {
    "published": "Wed, 16 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      16,
      16,
      0,
      0,
      2,
      197,
      0
    ],
    "title": "Dyneema launches woven composite fabric with UHMWPE fiber",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Dyneema launches woven composite fabric with UHMWPE fiber"
    },
    "summary": "Dual-layer structure of Dyneema&nbsp;core with a fully woven Dyneema&nbsp;face fabric resists abrasion and wear, offering durability&nbsp;under significant load conditions and after prolonged use.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Dual-layer structure of Dyneema&nbsp;core with a fully woven Dyneema&nbsp;face fabric resists abrasion and wear, offering durability&nbsp;under significant load conditions and after prolonged use."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-products-avient-dyneema.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Dyneema woven composite and backpack example.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-products-avient-dyneema.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Dyneema</p>\n</div>\n\n<p><a href=\"https://www.dyneema.com/\" target=\"_blank\">Dyneema</a> (Greenville, N.C., U.S.), owned by composites solution provider <a href=\"https://www.compositesworld.com/suppliers/avient-corporation-composites\" target=\"_blank\">Avient Corp.</a> (Avon Lake, Ohio, U.S.), has increased the layers in its Dyneema woven composite, combining the strength of a Dyneema&nbsp;composite core with a 100% Dyneema&nbsp;abrasion-resistant woven face fabric. The fabric can offer up to&nbsp;10 times more abrasion resistance, five&nbsp;times better tear resistance&nbsp;and 34% weight savings compared to the existing Dyneema&nbsp;high-performance composite portfolio.</p>\n\n<p>Fifteen times stronger than steel yet light enough to float on water, Dyneema is an&nbsp;ultra-high molecular weight polyethylene (UHMWPE) fiber, which is trusted in applications where performance is paramount and reliability is critical. The woven composite&nbsp;feature a dual-layer composite structure that combines the strength, abrasion resistance&nbsp;and durability of a fully woven Dyneema&nbsp;face fabric, with the dimensional stability, structural integrity&nbsp;and waterproof properties of Dyneema&nbsp;composite technology. The result is a fabric that is highly durable under significant load conditions and after prolonged use.</p>\n\n<p>Dyneema&nbsp;R&amp;D specialists spent 2&nbsp;years extensively testing the new fabric with longtime collaborator&nbsp;Hyperlite Mountain Gear, an outdoor gear manufacturer. With the help of Hyperlite&rsquo;s extensive network of elite athletes and mountaineers, the company tested prototype backpacks during months-long expeditions on some of the most extreme hiking trails from the Alaskan wilderness to the summit of the Rockies and beyond. Backpacks from Hyperlite are the first products on the market to feature this technology and are available to consumers and outdoor enthusiasts worldwide starting July 15, 2025.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dyneema-launches-woven-composite-fabric-with-uhmwpe-fiber"
      }
    ],
    "link": "https://www.compositesworld.com/news/dyneema-launches-woven-composite-fabric-with-uhmwpe-fiber"
  },
  {
    "published": "Wed, 16 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      16,
      15,
      0,
      0,
      2,
      197,
      0
    ],
    "title": "Nlcomp begins construction of rFactory in Italy",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Nlcomp begins construction of rFactory in Italy"
    },
    "summary": "The 200-square-meter facility represents nlcomp&rsquo;s transition from startup to established business, accelerating expansion of its sustainable composite products from marine to also wind and other high-performance applications.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The 200-square-meter facility represents nlcomp&rsquo;s transition from startup to established business, accelerating expansion of its sustainable composite products from marine to also wind and other high-performance applications."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-nlcomp-rfactory-breaking-ground.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Groundbreaking ceremony in Italy.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-nlcomp-rfactory-breaking-ground.jpg;maxWidth=720\" /> </a></div>\n\n<p>Groundbreaking ceremony in Italy. Source | nlcomp</p>\n</div>\n\n<p>On July 10,&nbsp;<a href=\"https://northernlightcomposites.com/\" target=\"_blank\">Northern Light Composites</a>&nbsp;(nlcomp, Monfalcone), an Italian startup specializing in&nbsp;sustainable, recyclable composite materials, officially started work on the construction of rFactory, the company&rsquo;s first industrial plant.</p>\n\n<p>The new production site, built entirely with sustainable materials (including wood and nlcomp&rsquo;s composites), marks a strategic step in the growth of the startup, which was <a href=\"https://www.compositesworld.com/news/nlcomp-spins-off-eco-yachts-brand-for-sustainable-composite-boat-development\" target=\"_blank\">originally born in the marine sector</a>, and is now ready to expand into wind energy and high-performance advanced materials.</p>\n\n<p>RFactory will cover an area of approximately 500 square meters. It will host a production line for sustainable composite components up to 20 meters in length, as well as offices, design spaces and a meeting room for working with partners and industrial stakeholders.</p>\n\n<p>The first product to be manufactured in the new facility will be <em>Offshore 34</em>, a racing sailboat designed by Gianluca Guelfi and Fabio D&rsquo;Angeli, built with nlcomp&rsquo;s sustainable resins and marketed under the Northern Light brand.</p>\n\n<p>&ldquo;The groundbreaking ceremony is a moment I would call historic for our company,&rdquo; says&nbsp;Fabio Bignolini, CEO of nlcomp.&nbsp;&ldquo;We will finally have the ability to produce entirely in-house, completing our transition from startup to established business. The plot purchased from the Monfalcone Industrial Consortium has the size and location that already allow us, together with our partners and shareholders &mdash; especially the Samer Group &mdash; to plan future development in sectors linked to boating and wind energy.&rdquo;</p>\n\n<p>Nlcomp has raised approximately &euro;1.2 million from leading investors and has participated in CDP Venture Capital and Zest&rsquo;s&nbsp;Zero Acceleration Program.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/nlcomp-begins-construction-of-rfactory-in-italy"
      }
    ],
    "link": "https://www.compositesworld.com/news/nlcomp-begins-construction-of-rfactory-in-italy"
  },
  {
    "published": "Wed, 16 Jul 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      16,
      14,
      0,
      0,
      2,
      197,
      0
    ],
    "title": "ASTM Composite Materials Committee is developing flexure testing standard",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ASTM Composite Materials Committee is developing flexure testing standard"
    },
    "summary": "Practice will help establish stronger composite testing for safer, lighter structures.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Practice will help establish stronger composite testing for safer, lighter structures."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">&nbsp;</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-astm-admet-composites-testing.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composites testing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-astm-admet-composites-testing.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | ADMET&nbsp;Inc.</p>\n</div>\n\n<p><a href=\"https://www.astm.org/\" target=\"_blank\">ASTM International</a> (W. Conshohocken, Pa., U.S.) is developing a proposed standard that organizations can use to design, analyze and certify composite structures in the aerospace, automotive, marine and civil engineering fields. The proposed standard (<a href=\"https://www.astm.org/membership-participation/technical-committees/workitems/workitem-wk93387\" target=\"_blank\">WK93387</a>) is being developed by the structural test methods subcommittee&nbsp;(D30.05),&nbsp;ASTM&nbsp;D30.</p>\n\n<p>According to ASTM member Adam J. Sawicki, the proposed standard practice contains procedures to modify the D7264/D7264M polymer matrix composite laminate flexure test method to permit testing of specimens containing open and filled holes.</p>\n\n<p>Sawicki adds that the practical applications of WK93387 (in combination with&nbsp;<a href=\"https://www.astm.org/membership-participation/technical-committees/workitems/workitem-wk93388\" target=\"_blank\">WK93388</a>) center on the generation of open-hole and filled-hole flexure data can be used in the design and analysis of composite structures.</p>\n\n<p>&ldquo;These tests are performed to complement D5766/D5766M for open-hole tension, D6484/D6484M for open-hole compression&nbsp;and D6742/D6742M for filled-hole tension and compression,&rdquo; says Sawicki. &ldquo;Notched laminate flexure tests typically exhibit higher surface strains at failure than those obtained under in-plane open-hole and filled-hole testing. This higher strain capability helps to design weight-efficient structures.&rdquo;</p>\n\n<p>This effort directly relates to the&nbsp;United Nations Sustainable Development Goal&nbsp;#13 on&nbsp;Climate Action.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/astm-composite-materials-committee-is-developing-flexure-testing-standard"
      }
    ],
    "link": "https://www.compositesworld.com/news/astm-composite-materials-committee-is-developing-flexure-testing-standard"
  },
  {
    "published": "Tue, 15 Jul 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      15,
      14,
      0,
      0,
      1,
      196,
      0
    ],
    "title": "Toray Advanced Composites to supply composites for constellation solar arrays",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Toray Advanced Composites to supply composites for constellation solar arrays"
    },
    "summary": "Per a long-term agreement, space-qualified&nbsp;carbon fiber/epoxy materials will be delivered to Airborne for high-volume production of&nbsp;solar array substrates and yoke panels.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Per a long-term agreement, space-qualified&nbsp;carbon fiber/epoxy materials will be delivered to Airborne for high-volume production of&nbsp;solar array substrates and yoke panels."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-toray-airborne-solar-arrays-partnership.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Toray and Airborne personnel.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-toray-airborne-solar-arrays-partnership.jpg;maxWidth=720\" /> </a></div>\n\n<p>Left to right:&nbsp;Claire Baker, development lead, space and comms,&nbsp;Toray Advanced Composites;&nbsp;David Bernard, managing director Europe, Toray Advanced Composites;&nbsp;Marcus Kremers, CTO, Airborne; and&nbsp;Paul Smith, European sales director, Toray Advanced Composites.&nbsp;Source | Toray Advanced Composites</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/toray-advanced-composites-uk\" target=\"_blank\">Toray Advanced Composites</a> (Langley Mill, U.K.) has signed a long-term supply agreement (LTA) with&nbsp;<a href=\"https://www.compositesworld.com/suppliers/airborne\" target=\"_blank\">Airborne Aerospace B.V.</a> (The Hague, Netherlands)&nbsp;to provide advanced composite materials for the production of solar array substrates for mega-constellation satellites.</p>\n\n<p>Toray has more than&nbsp;four decades of space heritage and in-flight, mission-critical reliability. The company&rsquo;s space-qualified, epoxy-based, carbon fiber-reinforced materials will be manufactured and supplied from its European Centre of Excellence for thermoset systems in Langley Mill, and used by Airborne in the manufacture of solar array substrates and yoke panels.&nbsp;</p>\n\n<p>Produced to tight tolerances on fiber&nbsp;areal weight, resin content and slit width, the high-performance materials from Toray will be supplied in 6-inch-wide unidirectional prepreg tape format. High-volume production will be achieved using Airborne&rsquo;s robotic automated tape laying (ATL) technology, specifically developed for space applications.</p>\n\n<p>&ldquo;Our lightweight composites offer the ideal combination of high stiffness, optimal toughness&nbsp;and low outgassing &mdash; which, when combined with their proven in-flight reliability, makes them perfectly suited for demanding space environments and for automated, scalable manufacturing,&rdquo; says Claire Baker, development lead, space and comms, Toray Advanced Composites. &ldquo;As the space sector moves toward high-rate production, automation is key. Airborne demonstrates how advanced carbon fiber composites and smart manufacturing enable the performance, scalability&nbsp;and affordability needed to expand global access to space.&rdquo;</p>\n\n<p>This LTA is the result of many years of close collaboration between Toray and Airborne on the development and manufacturing of spacecraft structures.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/toray-advanced-composites-to-supply-composites-for-constellation-solar-arrays"
      }
    ],
    "link": "https://www.compositesworld.com/news/toray-advanced-composites-to-supply-composites-for-constellation-solar-arrays"
  },
  {
    "published": "Mon, 14 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      14,
      17,
      0,
      0,
      0,
      195,
      0
    ],
    "title": "KVE, Pinette PEI to supply TPC induction welding equipment",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "KVE, Pinette PEI to supply TPC induction welding equipment"
    },
    "summary": "Integrated solution for TPC&nbsp;stamp forming and part assembly via&nbsp;induction welding opens capabilities for&nbsp;increased part sizes, reduced weight and production cost, optimized cycle times.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Integrated solution for TPC&nbsp;stamp forming and part assembly via&nbsp;induction welding opens capabilities for&nbsp;increased part sizes, reduced weight and production cost, optimized cycle times."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-KVE-welded-torsion-box.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Induction welded torsion box demonstrator.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-KVE-welded-torsion-box.jpg;maxWidth=720\" /> </a></div>\n\n<p>Induction welded torsion box demonstrator. Source | KVE Composites</p>\n</div>\n\n<p>In June 2025 at the Paris Air Show,&nbsp;<a href=\"https://www.compositesworld.com/suppliers/kve-composites-group\" target=\"_blank\">KVE Composites Group</a>&nbsp;(The Hague, Netherlands) and&nbsp;<a href=\"https://www.compositesworld.com/suppliers/pinette-emidecau-industries\" target=\"_blank\">Pinette Emidecau Industries</a>&nbsp;(Chalon Sur Saone, France) signed an&nbsp;agreement to work together in supplying&nbsp;induction welding equipment for the assembly of thermoplastic composites (TPCs). Through this nonexclusive partnership, welding technology will be added to Pinette PEI&rsquo;s thermoplastics&nbsp;manufacturing equipment portfolio.</p>\n\n<p>The collaboration emerges from a shared vision&nbsp;to advance high-rate, sustainable manufacturing of structural TPC aerospace components. Through the partnership, KVE and Pinette PEI will&nbsp;offer an integrated solution for TPC&nbsp;stamp forming and part assembly via&nbsp;induction welding, opening new opportunities to increase part sizes, reduce weight, improve cycle times, optimize recyclability and cut productions costs.</p>\n\n<p>Pinette PEI provides TPC production equipment, such as the one it <a href=\"https://www.compositesworld.com/articles/video-installing-the-worlds-largest-thermoplastic-composites-press-at-airbus-bremen\" target=\"_blank\">installed at Airbus Bremen</a>. &ldquo;Joining forces with KVE is an obvious move&nbsp;that brings numerous opportunities to our customers,&rdquo; says Erick Rousseau, Pinette PEI CEO. &ldquo;Thanks to this partnership, our customers will have a complete integrated solution for material preparation, stamping, welding and NDT [nondestructive testing]&nbsp;control, with a high degree of integration, automation and supervision.&rdquo;</p>\n\n<p>Pinette PEI will be responsible for system-level design and manufacturing of the cell. KVE&nbsp;continues to provide the welding-specific hardware, software and parts. Furthermore, KVEs expertise is offered to support customers in welding process development.</p>\n\n<p>In order to promote the technology, a welding setup will be installed at Pinette&rsquo;s TIFAANI production line to perform R&amp;D programs and test the capability of different TPC processing technologies.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/kve-pinette-pei-to-supply-tpc-induction-welding-equipment"
      }
    ],
    "link": "https://www.compositesworld.com/news/kve-pinette-pei-to-supply-tpc-induction-welding-equipment"
  },
  {
    "published": "Mon, 14 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      14,
      16,
      0,
      0,
      0,
      195,
      0
    ],
    "title": "Bell is awarded Phase 2 funding for DARPA X-Plane",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Bell is awarded Phase 2 funding for DARPA X-Plane"
    },
    "summary": "Bell has been given the opportunity to build an X-Plane demonstrator based on a stop/fold tiltrotor.&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Bell has been given the opportunity to build an X-Plane demonstrator based on a stop/fold tiltrotor.&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-darpa-bell-xplane-rendering-min.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Artist’s concept of the Bell X-Plane.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-darpa-bell-xplane-rendering-min.png;maxWidth=720\" /> </a></div>\n\n<p>Artist&rsquo;s concept of the Bell X-Plane. Source | Bell Textron Inc.</p>\n</div>\n\n<p><a href=\"https://www.textron.com/\" rel=\"nofollow\" target=\"_blank\">Bell Textron Inc.</a>&nbsp;(Fort Worth, Texas, U.S.),&nbsp;a Textron Inc. company, has been down-selected for Phase 2 of the Defense Advanced Research Projects Agency&rsquo;s (DARPA) Speed and Runway Independent Technologies (SPRINT) X-Plane program with the objective to complete design, construction, ground testing and certification of an X-plane demonstrator.</p>\n\n<p><a href=\"https://aviationweek.com/defense/aircraft-propulsion/darpa-picks-bell-over-aurora-build-sprint-x-plane?elq2=d580e52e1f9d486bb843420c7a75d1e5&amp;sp_eh=fce30e695618fa517cd4f22d2eb07cf55c5b0071c5cf288a8732e1e9aca46f5b&amp;elq2=d580e52e1f9d486bb843420c7a75d1e5&amp;sp_eh=fce30e695618fa517cd4f22d2eb07cf55c5b0071c5cf288a8732e1e9aca46f5b&amp;utm_campaign=55523&amp;utm_emailname=AW_News_AerospaceDigest_NL_07102025&amp;utm_medium=email&amp;utm_rid=CPEN1000034614990\" target=\"_blank\"><em>Aviation Week</em> </a>reports that&nbsp;DARPA selected Bell over &ldquo;a rival bid from&nbsp;Boeing-owned Aurora Flight Sciences to enter Phase 2 of the SPRINT&nbsp;program, which calls for building the X-plane.&rdquo; Aurora, however, <a href=\"https://www.compositesworld.com/news/aurora-reveals-sprint-fan-in-wing-design-progress\" target=\"_blank\">still plans to pursue its technology</a>; testing performed during Phase 1 validated the feasibility of the fan-in-wing technology.&nbsp;</p>\n\n<p>&ldquo;Bell is is excited to demonstrate a new aircraft with the first-ever stop/fold technology,&rdquo; says&nbsp;Jason Hurst, senior vice president, engineering, Bell. &ldquo;This is an achievement we&rsquo;ve been working toward&nbsp;for over 10 years.&rdquo;</p>\n\n<p>Aviation Week notes that this stop/fold technology &ldquo;overcomes the roughly 300-knot&nbsp;speed limitation of aircraft such as the U.S. Army&rsquo;s MV-75 and the Bell&nbsp;Boeing&nbsp;V-22 <em>Osprey</em>.&rdquo;</p>\n\n<p>The goal of the program is to provide these aircraft with the ability to cruise at speeds from 400-450 knots at relevant altitudes and hover in austere environments from unprepared surfaces. In Phase 1A and 1B, Bell completed conceptual and preliminary design efforts for the SPRINT X-plane. Phase 2 includes detailed design and build culminating in flight test during Phase 3.</p>\n\n<p>In preparation for X-plane development, Bell has completed significant risk reduction activities including demonstrating folding rotor, integrated propulsion&nbsp;and flight control technologies at&nbsp;Holloman Air Force Base&nbsp;as well as&nbsp;wind tunnel testing&nbsp;at the National Institute for Aviation Research (NIAR) at Wichita State University.</p>\n\n<p>Bell has a history of breaking barriers and high-speed vertical lift technology development, with VTOL configurations like the X-14, X-22, XV-3 and XV-15 for NASA, the U.S. Army and U.S. Air Force, and continues to build on the legacy of the Bell X-1.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/bell-is-awarded-phase-2-funding-for-darpa-x-plane-"
      }
    ],
    "link": "https://www.compositesworld.com/news/bell-is-awarded-phase-2-funding-for-darpa-x-plane-"
  },
  {
    "published": "Mon, 14 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      14,
      15,
      0,
      0,
      0,
      195,
      0
    ],
    "title": "XTI Aerospace completes FAA TriFan 600 structures review",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "XTI Aerospace completes FAA TriFan 600 structures review"
    },
    "summary": "The TriFan 600, an &ldquo;xVTOL&rdquo; platform that is fully composite, heads toward FAA type certification.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The TriFan 600, an &ldquo;xVTOL&rdquo; platform that is fully composite, heads toward FAA type certification."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-xti-trifan600.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"TriFan 600 infographic.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-xti-trifan600.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | XTI Aerospace Inc.</p>\n</div>\n\n<p><a href=\"https://xtiaerospace.com/\" target=\"_blank\">XTI Aerospace Inc.</a> (Englewood, Colo., U.S.) has announced the successful completion of a structures technical familiarization (Tech Fam) meeting with the Federal Aviation Administration (FAA), another completed step forward in the company&rsquo;s path to certification of the TriFan 600.</p>\n\n<p>The TriFan 600 is XTI&rsquo;s vertical takeoff and landing (VTOL) business aircraft that takes off and lands like a helicopter, flies at speeds of up to 311 miles per hour&nbsp;and has a range of up to 985 miles, creating a new category that XTI terms the &ldquo;xVTOL.&rdquo; The hybrid-electric platform&rsquo;s entire structure,&nbsp;including the fuselage and wings, is made of carbon fiber composite materials, <a href=\"https://evtol.news/xti-aircraft-trifan-600\" target=\"_blank\">according to eVTOL.news</a>.</p>\n\n<p>Engineering experts from XTI and the FAA reviewed the TriFan 600 aircraft&rsquo;s structural design philosophy, analysis methodologies, load conditions&nbsp;and compliance approach. XTI is committed to a collaborative and transparent certification program and plans to conduct additional Tech Fam meetings with the FAA across additional disciplines in the coming months.</p>\n\n<p>&ldquo;Completion of this collaborative Tech Fam meeting progresses the TriFan 600 towards type certification [the FAA approval of the design of the aircraft and all component parts],&rdquo; says&nbsp;David Ambrose, XTI&rsquo;s VP&nbsp;of engineering. &ldquo;We continue to de-risk critical aspects of our structural design with FAA input.&rdquo;</p>\n\n<p><a href=\"https://www.airframer.com/news_story.html?report=34636\" target=\"_blank\">Airframer.com</a> notes that, alongside its certification push, XTI is also exploring propulsion innovation through a memorandum of understanding (MOU) with MagLev Aero. Under the MOU, the companies will assess integrating MagLev&rsquo;s HyperDrive tip-driven ducted fan technology into XTI&rsquo;s future hybrid-electric aircraft and UAV designs. MagLev CEO Ian Randall says that magnetic levitation &ldquo;has not been used in operational aircraft propulsion before&rdquo; and could help &ldquo;push the boundaries of what&rsquo;s possible.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/xti-aerospace-completes-faa-trifan-600-structures-propulsion-system-reviews"
      }
    ],
    "link": "https://www.compositesworld.com/news/xti-aerospace-completes-faa-trifan-600-structures-propulsion-system-reviews"
  },
  {
    "published": "Mon, 14 Jul 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      14,
      14,
      0,
      0,
      0,
      195,
      0
    ],
    "title": "Composite Braiding awarded for TPC twin track cantilever support",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composite Braiding awarded for TPC twin track cantilever support"
    },
    "summary": "Railway infrastructure cuts weight by 84%, carbon emissions by 80% and installation time by 50%&nbsp;while&nbsp;automated process offers &ge;90% lower&nbsp;labor costs, waste and energy use versus traditional composites manufacturing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Railway infrastructure cuts weight by 84%, carbon emissions by 80% and installation time by 50%&nbsp;while&nbsp;automated process offers &ge;90% lower&nbsp;labor costs, waste and energy use versus traditional composites manufacturing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-tpc-twin-track-cantilever.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"thermoplastic composite twin track cantilever by Composite Braiding\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-tpc-twin-track-cantilever.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | Composite Braiding</p>\n</div>\n\n<p><a href=\"https://compositebraiding.com/\" target=\"_blank\">Composite Braiding</a> (Derby, U.K.) has been selected by <a href=\"https://www.railforum.uk/2025/07/seven-rail-forum-members-recognised-as-regional-winners-in-the-erci-innovation-awards-2025/\" target=\"_blank\">Rail Forum</a> as regional winners of the 2025 European Railway Clusters Initiative (ERCI) Innovation Awards for its sustainable thermoplastic composite Twin Track Cantilever that supports overhead line equipment for electrified railways.</p>\n\n<p>Weighing just 277 kilograms, the structure reduces weight by 84% and carbon footprint by 80% versus steel supports. It is not only fully recyclable but can reportedly be installed in 15 minutes, reducing installation time by 50% as well as the need for lifting equipment, heavy goods transportation and service roads. Its lightweight also significantly reduces the amount of concrete needed for the structure&rsquo;s foundations.</p>\n\n<p>&ldquo;This award recognizes our innovative work as part of the <a href=\"https://cp.catapult.org.uk/opportunity/clean-futures-accelerator-2/\" target=\"_blank\">Catapult Clean Futures Accelerator</a>,&rdquo; says Composites Braiding general manager, Steve Barbour. &ldquo;Described by industry experts as &lsquo;game-changing,&rsquo;&nbsp;this is the kind of innovation that can transform infrastructure delivery.&rdquo; The Clean Futures Accelerator is a program within Catapult Connected Places, part of The Innovate UK Catapult Network.</p>\n\n<p>Reporter Lisa Baker explained in a <em><a href=\"https://businessinthenews.co.uk/2025/02/11/composite-braiding-to-showcase-low-carbon-rail-technology-at-clean-futures-demonstration-day/#:~:text=With%20the%20use%20of%20steel,Manufacturing%20Organisation%20headquarters%20in%20Dudley.\" target=\"_blank\">Business in the News</a></em> article that steel cantilevers across the U.K.&rsquo;s rail network number in the tens of thousands. Composite Braiding&rsquo;s technology has the potential to considerably reduce the carbon footprint of the sector &mdash; a critical step for the U.K. to reach its target of net-zero railways by 2050.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-tpc-twin-track-cantilever-braid.jpg\" target=\"_blank\"><img alt=\"braiding machine at Composite Braiding in UK\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-tpc-twin-track-cantilever-braid.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>&ldquo;With our manufacturing capabilities, we combine fibers like carbon, glass and basalt with thermoplastics to create advanced composites quickly and at scale,&rdquo; says Composite Braiding&rsquo;s technical director, Alastair Barnett. &ldquo;This&nbsp;fully automated process can reduce labor costs by 90%, industrial waste by 97% and uses 95% less energy that traditional composites manufacturing. We believe that our new lightweight cantilever design is the next step in sustainable rail infrastructure and, once scaled, can truly help to move the needle toward&nbsp;a low-carbon, cost-effective rail network for the future.&rdquo;</p>\n\n<p>As reported by <a href=\"https://www.derbyshiretimes.co.uk/business/composite-braiding-marks-major-new-milestone-for-decarbonising-uk-rail-5022123\" target=\"_blank\">Ryan Witton in the <em>Derbyshire Times</em></a>, Composite Braiding&rsquo;s lead development engineer, Guy Lawrence, explained the innovative design:</p>\n\n<p class=\"m-l-2\">&ldquo;We had one simple aim &mdash; to show that composite rail infrastructure is not just a viable alternative to steel, but brings substantial mechanical, economic and environmental benefits. Our main driver was mass reduction, which ultimately leads to lower installed costs per unit, improved worker safety and significantly reduced installation time.</p>\n\n<p class=\"m-l-2\">&ldquo;Our unique ability to easily adapt product designs means each unit can be tailored mechanically and aesthetically for its given application, while our in-house production methodology enables low-cost, high-volume production of high-performance composites that is repeatable, predictable and easily scalable. By using thermoplastic composites, we can manufacture rail infrastructure that is truly sustainable: low waste, low energy usage, recyclable and repairable.&rdquo;</p>\n\n<p>Composites Braiding notes that large structural components are ubiquitous in&nbsp;the rail industry, both in infrastructure and rolling stock. That&rsquo;s where its braiding equipment generates value, able to produce large recyclable components from carbon, glass and/or basalt fiber, combined with sustainable thermoplastics. It can produce tubes and beams of almost any shape that significantly reduce weight and CO<sub>2</sub> emissions.</p>\n\n<p>The company thanks Connected Places Catapult, BCIMO and Coventry University for their support through the Clean Futures Accelerator and its in-house Composite Braiding team for succeeding in this&nbsp;achievement.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/composite-braiding-awarded-for-tpc-twin-track-cantilever-support"
      }
    ],
    "link": "https://www.compositesworld.com/news/composite-braiding-awarded-for-tpc-twin-track-cantilever-support"
  }
]