[
  {
    "published": "Fri, 29 Aug 2025 06:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      29,
      10,
      0,
      0,
      4,
      241,
      0
    ],
    "title": "People in composites: August 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "People in composites: August 2025"
    },
    "summary": "The following job announcements and promotions have been shared by Arris Composites, Dieffenbacher,&nbsp;Mets&auml; Spring, The Gill Corp., Vestas,&nbsp;Teijin Aramid and HydroGraph.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The following job announcements and promotions have been shared by Arris Composites, Dieffenbacher,&nbsp;Mets&auml; Spring, The Gill Corp., Vestas,&nbsp;Teijin Aramid and HydroGraph."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<h3>Dieffenbacher announces new additions to management board, future CTO</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-peoplenews-dieffenbacher-stephenzipf.jpg\" target=\"_blank\"><img alt=\"Stefan Zipf headshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-peoplenews-dieffenbacher-stephenzipf.jpg;maxWidth=385\" /></a></div>\n\n<p>Stefan Zipf, head of Dieffenbacher&rsquo;s Wood Business Unit, and soon-to-be CTO.</p>\n</div>\n\n<p>On Aug.&nbsp;1, German machine and plant manufacturer <a href=\"https://www.compositesworld.com/suppliers/dieffenbacher-north-america\" target=\"_blank\">Dieffenbacher</a>&nbsp;(Eppingen, Germany)&nbsp;appointed Stefan Zipf, head of the Wood Business Unit, to the company&rsquo;s management board. On March 1, 2026, Zipf will also transition into the role of chief technical officer (CTO) while remaining his current position in the Wood Business Unit.</p>\n\n<p>Lothar Fischer, who has&nbsp;served as CTO since March 2018, will continue at Dieffenbacher on a project and advisory basis starting March 1. &ldquo;Lothar has achieved a lot in his tenure as CTO. He has strengthened our supply chains and further expanded our global production network,&rdquo; says Dieffenbacher CEO Christian Dieffenbacher. &ldquo;We thank him for his commitment and tireless efforts over the past 8&nbsp;years and look forward to our continued collaboration.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Lothar Fischer headshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-peoplenews-dieffenbacher-lotharfischer.jpg;maxWidth=385\" /></div>\n\n<p>Lothar Fischer.</p>\n</div>\n\n<p>Zipf has worked at Dieffenbacher for 28 years. During this time, he has&nbsp;held positions ranging from dual mechanical engineering student to head of the Wood Business Unit, steadily taking on more responsibility. &ldquo;Adding Stefan to the management board furthers the planned, smooth generational change in our company&rsquo;s leadership,&rdquo; says Dieffenbacher. &ldquo;On behalf of the entire Dieffenbacher team, I wish him every success in his new role and look forward to the momentum he&rsquo;ll bring to the further development of our company.&rdquo;</p>\n\n<div class=\"article_sidebar\">\n<h3><strong>Mets&auml; Spring recruits director of business development to strengthen Kuura team</strong></h3>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Anna-Kaisa Huttunen headshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-peoplenews-metsaspring-anna-kaisa-huttunen.jpg;maxWidth=385\" /></div>\n\n<p>Anna-Kaisa Huttunen,&nbsp;Mets&auml; Group&nbsp;director of business development.</p>\n</div>\n\n<p>Master of Art and Design Anna-Kaisa Huttunen has been appointed to the position of director of business development at&nbsp;<a href=\"https://www.metsagroup.com/\" target=\"_blank\">Mets&auml; Group</a>&nbsp;(Helsinki, Finland).&nbsp;Her duties include leading the work to form business and market entry plans for Mets&auml; Group&rsquo;s Kuura textile fiber <a href=\"https://www.compositesworld.com/news/metsa-group-begins-pre-engineering-stage-of-kuura-wood-based-fiber-mill\" target=\"_blank\">opportunity</a>.</p>\n\n<p>Huttunen has extensive experience in the textile industry. She graduated as a fashion designer in the 1990s from the University of Art and Design, now Aalto University. Her career began with victories in design competitions and working in Paris in the service of the French company Lacoste.</p>\n\n<p>Over the years, she has worked not only in France, but also in Austria, the Middle East and China with fashion, workwear, technical textiles and wearable technology. She has led design teams and worked in teaching positions.</p>\n\n<p>In 2007, Huttunen returned to Finland and has since worked in the development and management of international business, first in the textile rental business, and later in 2022 at a company specializing in textile fiber recycling.</p>\n\n<p>&ldquo;The entire global value chain of textile production, from fiber&nbsp;to clothing and back to fiber&nbsp;through recycling, has become familiar to me during my career,&rdquo; says Huttunen.&nbsp;She has been following the development of the Kuura textile fiber&nbsp;for a long time and sees significant potential in it. &ldquo;Kuura is a very promising innovation in the global market. Its strengths include product quality, production energy efficiency&nbsp;and strong environmental values. The fashion and textile industry has given me a lot, and it is motivating to get to commercialize a solution that genuinely benefits the industry.&rdquo;</p>\n\n<p>Kuura&rsquo;s current phase, expected to conclude after summer 2026, includes four projects: pre-engineering of the potential commercial-scale plant, further development of the Kuura production process, collaborating with clients for market entry&nbsp;and the financial planning. &ldquo;Anna-Kaisa&rsquo;s role is specifically aimed at helping with the third project, collaborating with clients on the potential market entry,&rdquo; says Niklas von Weymarn, CEO of Mets&auml; Spring.</p>\n</div>\n\n<h3>Arris Composites&nbsp;appoints Dolby Laboratories to board of directors&nbsp;</h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/arris---arris-composites\" target=\"_blank\">Arris Composites</a> (Berkeley, Calif., U.S.)&nbsp;has appointed Kevin Yeaman, president and CEO of Dolby Laboratories (San Francisco, Calif., U.S.), to its board of directors. Yeaman brings deep expertise in introducing and scaling innovative technologies, pioneering licensing models&nbsp;and growing a globally recognized brand.</p>\n\n<p>Under Yeaman&rsquo;s leadership, Dolby&rsquo;s technology has become essential to billions of consumer electronics devices, including TVs, mobile devices, cars and PCs.&nbsp;His experience directly parallels Arris&rsquo;&nbsp;strategy to scale its technology and composite material innovation across mass-market industries through licensing and strategic partnerships.</p>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Kevin Yeaman headshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-peoplenews-arris-kevinyeaman.jpg;maxWidth=720\" /> </div>\n\n<p>Kevin Yeaman.</p>\n</div>\n\n<p>&ldquo;Dolby&rsquo;s journey &mdash; from manufacturing hardware to becoming a dominant force in technology licensing built on powerful IP &mdash; is a blueprint for the path we envision at Arris,&rdquo; says Riley Reese, CEO of Arris Composites. &ldquo;Kevin&rsquo;s experience navigating a licensing business and building a world-class brand will be invaluable as we empower the world&rsquo;s leading companies to realize the full potential of our composite technology.&rdquo;</p>\n\n<p>Founded in 2017, the Arris&nbsp;team created Additive Molding via the development of patented software, materials&nbsp;and high-volume production methods to create advanced composite parts that are lighter, stronger&nbsp;and more sustainable. The company&rsquo;s strategy involves enabling creators with the Arris&nbsp;technology, mirroring Dolby&rsquo;s successful model of providing tools to content creators to drive ecosystem-wide adoption.</p>\n\n<div class=\"article_sidebar\">\n<h3>The Gill Corp. promotes CCO</h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/the-gill-corporation\" target=\"_blank\">The Gill Corp.</a> (El Monte, Calif., U.S.), a high-performance composite materials company for the aerospace industry, announces the promotion of Chris Larsen to the newly created position of chief commercial officer (CCO).</p>\n\n<p>Larsen joined The Gill Corp.&nbsp;in 2010 as director of sales, and most recently served as corporate vice president&nbsp;sales and marketing. Reporting to Stephen Gill, CEO and chairman, Larsen will lead global sales, marketing, contracts, program management and customer services, while having active involvement in strategic initiatives and acquisitions.</p>\n</div>\n\n<h3><strong>Vestas appointment succeeds current chief technology and operations officer&nbsp;</strong></h3>\n\n<p><a href=\"https://www.vestas.com/en\" target=\"_blank\">Vestas Wind Systems A/S</a> (Aarhus, Denmark) is announces that Felix Henseler will succeed Anders Nielsen as chief technology and operations officer (CTOO) on Sept. 1,&nbsp;2025. Nielsen is retiring&nbsp;from day-to-day management by the end of 2025 after 6&nbsp;years as CTOO, where he has played a leading role in the turnaround of Vestas&rsquo; Power Solutions segment as well as the continued industrialization and standardization of Vestas&rsquo; technology and manufacturing.</p>\n\n<p>Henseler most recently served as CEO&nbsp;of ZF Wind Power and will join Vestas immediately. As CTOO, he will have full focus on ramping up both onshore and offshore manufacturing and strengthening Vestas&rsquo; offering within wind energy solutions and industry maturity. To ensure a smooth transition, Nielsen will continue as an advisor to Felix Henseler and Vestas until end of 2025.</p>\n\n<p>&ldquo;The energy industry is impacted by the geopolitical shifts we&rsquo;re seeing across the globe, and our ability to become even more efficient, competitive and scalable will be decisive to ensure affordable, secure and sustainable energy across the globe,&rdquo; says Henseler.&nbsp;&ldquo;With a long career within engineering and manufacturing, efficiency, competitiveness and scalability will be my focus. I&rsquo;m honored to become part of Vestas and meet my many new colleagues who are driving these efforts and ensuring&nbsp;we deliver on our customer promises.&rdquo;</p>\n\n<p>According to Nielsen, &ldquo;The last 6&nbsp;years have been some of the most eventful and valuable of my career where we have faced many challenges and I&rsquo;m proud of what we have achieved together during that period. I want to thank my many Vestas colleagues, including everyone in executive management, for the support and valuable discussions through ups and downs. I look forward to working with Felix and the rest of the technology and operations management team to ensure a smooth transition.&rdquo;</p>\n\n<p>Vestas&rsquo; Technology and Manufacturing organizations were merged into Vestas Technology and Operations in Q3 2024 with a clear objective to increase industrialization within wind energy and strengthen Vestas&rsquo; end-to-end approach to delivery of wind energy solutions. Vestas seeks to continue this strategic evolution with the appointment of Henseler. He will be part of Vestas executive management and report directly to Henrik Andersen.</p>\n\n<div class=\"article_sidebar\">\n<h3>Teijin Aramid announces CEO leadership transition</h3>\n\n<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-peoplenews-TeijinAramid-PeterterHorst.jpg;maxWidth=720\" /> </div>\n\n<p>Taiichi Machida (left) and Peter ter Horst (right).</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/teijin-aramid-bv\" target=\"_blank\">Teijin Aramid</a>&nbsp;(Arnhem, Netherlands) announces that Peter ter Horst will step down as CEO&nbsp;at the end of 2025 after 19 years of dedicated service. Effective Oct.&nbsp;1, 2025, Taiichi Machida will take over as CEO.</p>\n\n<p>Ter Horst has played a pivotal role in guiding Teijin Aramid through both prosperous and challenging times. Over the past 5.5 years as CEO, he led the company through the COVID-19 pandemic, a major fire at the Delfzijl site&nbsp;and the current organizational transformation aimed at strengthening the company&rsquo;s future resilience. His leadership has been marked by a deep commitment to the company&rsquo;s people, values&nbsp;and long-term vision.</p>\n\n<p>Te Horst will remain with Teijin Aramid until December 2025 to support a smooth transition.</p>\n</div>\n\n<h3><strong>HydroGraph&nbsp;adds growth strategist and defense industry expert to board of directors</strong></h3>\n\n<p><a href=\"https://hydrograph.com/\" rel=\"nofollow\" target=\"_blank\" title=\"HydroGraph Clean Power Inc.\">HydroGraph Clean Power Inc.</a>&nbsp;(Vancouver, BC, Canada) announces&nbsp;the appointment of technology executive, military veteran and leadership coach Cordell Bennigson to its board of directors.</p>\n\n<p>Bennigson is currently CEO of R2 Wireless U.S., leading the expansion of spectrum sensing and electromagnetic dominance solutions for defense and critical infrastructure needs. He is also a leadership instructor, executive coach and operating advisor with Echelon Front, which trains and advises Fortune 100 and global company teams to grow, adapt and perform at their best. A former U.S. Marine Corps officer and CEO of multiple private equity-backed companies, Bennigson holds an MBA from Harvard Business School.</p>\n\n<p>&ldquo;Cordell brings strong business development experience in the technology sector along with the expertise of an advisor who has led multiple companies through growth and transformation,&rdquo; HydroGraph&rsquo;s Kjirstin Breure, who was named board chair in June 2025, says. &ldquo;His military background has trained him to take an action-oriented approach and provides HydroGraph with critical insights into that sector as we continue to open new opportunities in multiple end markets. We are excited to have him on the board.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/people-news-august-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/people-news-august-2025"
  },
  {
    "published": "Thu, 28 Aug 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      28,
      18,
      0,
      0,
      3,
      240,
      0
    ],
    "title": "Uavos composite curing ovens are awarded conformity certification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Uavos composite curing ovens are awarded conformity certification"
    },
    "summary": "New line of products have passed&nbsp;Technical Testing Institute TS&Uacute; Pie&scaron;ťany&rsquo;s rigorous evaluation process.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New line of products have passed&nbsp;Technical Testing Institute TS&Uacute; Pie&scaron;ťany&rsquo;s rigorous evaluation process."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-uavos-ovens-conformity.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composite curing oven.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-uavos-ovens-conformity.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Uavos Inc.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/uavos-inc\" target=\"_blank\">Uavos&nbsp;Inc.</a> (Mountain View, Calif., U.S.) has successfully completed a comprehensive conformity assessment of its composite curing oven, conducted by the Technical Testing Institute TS&Uacute; Pie&scaron;ťany in Slovakia. Following the evaluation, the oven has been awarded a Conformity Certificate confirming its compliance with stringent international safety and quality standards.</p>\n\n<p>The certification process included a series of rigorous tests, all of which were successfully passed and documented in official test reports:</p>\n\n<ul>\n\t<li>Electromagnetic compatibility tests ensured&nbsp;compliance with EMC regulations for interference-free operation.</li>\n\t<li>Basic safety and essential performance tests validated&nbsp;operational reliability and safety functions.</li>\n\t<li>Safety of machinery assessment confirmed&nbsp;compliance with EU directives for industrial machinery.</li>\n</ul>\n\n<p>&ldquo;The successful completion of these evaluations is strong validation of our engineering excellence and our commitment to safety and quality,&rdquo; notes Aliaksei Stratsilatau, founder and CEO of Uavos. &ldquo;For our customers, it means access to proven, reliable products that ensure precision, energy efficiency and compliance with industry standards.&rdquo;</p>\n\n<p>Uavos develops and manufactures security and commercial solutions based on advanced unmanned systems with an international investor base. Its&nbsp;technology, products and tailored services include multi-role UAVs, proprietary autopilots, advanced communication systems, UAV components and experiential training. Uavos&nbsp;is involved in stratospheric R&amp;D projects, having developed the HiDRON meteo missions stratospheric glider and the HAPS ApusDuo autonomous aircraft.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/uavos-composite-curing-ovens-are-awarded-conformity-certification"
      }
    ],
    "link": "https://www.compositesworld.com/news/uavos-composite-curing-ovens-are-awarded-conformity-certification"
  },
  {
    "published": "Thu, 28 Aug 2025 13:30:00 -0400",
    "published_parsed": [
      2025,
      8,
      28,
      17,
      30,
      0,
      3,
      240,
      0
    ],
    "title": "Submit technical paper, ITAR presentation abstracts for SAMPE 2026",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Submit technical paper, ITAR presentation abstracts for SAMPE 2026"
    },
    "summary": "SAMPE is now accepting formal written research papers and ITAR submissions&nbsp;for its 2026 conference and exhibition in Seattle, with abstracts due by Sept. 22, 2025.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "SAMPE is now accepting formal written research papers and ITAR submissions&nbsp;for its 2026 conference and exhibition in Seattle, with abstracts due by Sept. 22, 2025."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-man-writing-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Blurred man writing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-man-writing-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/sampe\" target=\"_blank\">SAMPE</a> (Diamond Bar, Calif., U.S.) is now accepting technical paper and ITAR abstract submissions for the SAMPE 2026&nbsp;Conference and Exhibition taking place&nbsp;in Seattle, Washington from April 27-30, 2026. To be considered, abstract submissions are due no later than&nbsp;Sept. 22, 2025.</p>\n\n<p>Technical papers are formal written research papers reviewed by industry peers and published in the conference proceedings. They are the crucial basis by which SAMPE selects presentations for the annual SAMPE technical conference program. Each technical paper undergoes a thorough review by a team of subject matter experts and volunteers. SAMPE&nbsp;also accepts ITAR presentations; a technical paper is not required for these.</p>\n\n<div>\n<blockquote>\n<p><a href=\"https://www.sampeamerica.org/technical-papers-submit\" target=\"_blank\">Submit abstracts here</a>.</p>\n</blockquote>\n</div>\n\n<p><strong>What is SAMPE looking for?</strong>&nbsp;Technical papers featuring original tests, analysis&nbsp;and results that push the boundaries of materials and process engineering. A complete list of potential paper track focuses can be <a href=\"https://www.sampeamerica.org/technical-papers-submit\" target=\"_blank\">viewed here</a>.</p>\n\n<p><strong>Why should I submit? </strong>Those who submit will gain valuable feedback from expert reviewers and&nbsp;build their professional reputation and network. Should your abstract be selected, you will also have the opportunity to present your research to industry leaders worldwide, further contributing to advancing materials science and engineering.</p>\n\n<p>Selected technical paper and ITAR presentations will be announced Oct. 25, 2025.&nbsp;</p>\n\n<div class=\"article_sidebar\">\n<h3>Abstract guidelines</h3>\n\n<p>Abstracts should concisely report the aims and outcomes of your research so that readers know exactly what your paper is about. Your abstract should be fully understandable on it&rsquo;s own to someone who hasn&rsquo;t read your full paper or related sources.</p>\n\n<ul>\n\t<li>You will select one track that best aligns with your abstract topic.</li>\n\t<li>You must have a short, specific abstract title that indicates the nature of your technical paper (containing no abbreviations).</li>\n\t<li>You will need to provide a 100-200 word abstract. Be as specific as possible as to what you will discuss in your paper &mdash;&nbsp;technologies or strategies covered, case studies cited, etc. This will be used by the conference committee to evaluate your submission.</li>\n\t<li>Your abstract should include all of the following:\n\t<ul>\n\t\t<li>Your research problems and objectives</li>\n\t\t<li>Your methods</li>\n\t\t<li>Your key results or arguments</li>\n\t\t<li>Your conclusion.</li>\n\t</ul>\n\t</li>\n</ul>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/submit-technical-paper-itar-presentation-abstracts-for-sampe-2026-"
      }
    ],
    "link": "https://www.compositesworld.com/news/submit-technical-paper-itar-presentation-abstracts-for-sampe-2026-"
  },
  {
    "published": "Thu, 28 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      28,
      17,
      0,
      0,
      3,
      240,
      0
    ],
    "title": "IACC NODE, Lamáquina enable functional 3D printed composite boat",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "IACC NODE, Lamáquina enable functional 3D printed composite boat"
    },
    "summary": "Asket, the student team&rsquo;s first project, is a custom, one-piece vessel featuring a 3D printed hull, real-time sensor function and adaptive robotic control.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Asket, the student team&rsquo;s first project, is a custom, one-piece vessel featuring a 3D printed hull, real-time sensor function and adaptive robotic control."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-node-asket.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"3D printed Asket.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-node-asket.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | IACC NODE</p>\n</div>\n\n<p><a href=\"https://iaac.net/\" target=\"_blank\">NODE</a>, a multidisciplinary student team from the Institute for Advanced Architecture of Catalonia (IAAC, Barcelona, Spain), has announced the successful completion of autonomous surface vessel (ASV) Asket, the group&rsquo;s first project&nbsp;that is participating in the Njord 2025 Autonomous Ship Championship. The one-piece additive manufactured composite vessel was enabled by large-scale 3D printing center&nbsp;<a href=\"https://lamaquina.io/\" target=\"_blank\">Lam&aacute;quina</a>&nbsp;(Barcelona, Spain).</p>\n\n<p>This student-led design project was engineered by&nbsp;Lam&aacute;quina to create a full functional, innovative vessel.&nbsp;Constructed from fiberglass-reinforced PETG, Asket was&nbsp;printed with a <a href=\"https://www.compositesworld.com/suppliers/cead-bv\" target=\"_blank\">CEAD</a>&nbsp;(Delft, Netherlands)&nbsp;E25 pellet&nbsp;extruder mounted on a <a href=\"https://www.kuka.com/en-us\" target=\"_blank\">KUKA</a>&nbsp;(Augsburg, Germany) robotic arm at&nbsp;Lam&aacute;quina&rsquo;s Barcelona facility.&nbsp;Measuring 141 centimeters&nbsp;in length, 67 centimeters in width&nbsp;and 28 centimeters in height, the boat&nbsp;was completed in under 10 hours,&nbsp;achieving complete watertightness without any postprocessing or assembly.</p>\n\n<p>To enhance buoyancy and impact resistance, Asket&rsquo;s base&nbsp;incorporates a custom solid infill pattern. Stability and performance are further optimized through variable wall thickness &mdash;&nbsp;7.5 millimeters at the bottom for a low center of gravity, tapering to 5.5 millimeters at the top to reduce weight. This gradient improves both balance and material efficiency.</p>\n\n<div style=\"text-align: center;\"></div>\n\n<p>Advanced active layer time management was employed throughout printing. Robotic speed and extrusion flow were dynamically adjusted in real time to maintain consistent thermal conditions, ensuring strong interlayer adhesion while preventing warping or deformation.</p>\n\n<p>This production exemplifies the potential of large-scale, functional 3D printing for marine applications.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/iacc-node-lamaquina-enable-functional-3d-printed-composite-boat-"
      }
    ],
    "link": "https://www.compositesworld.com/news/iacc-node-lamaquina-enable-functional-3d-printed-composite-boat-"
  },
  {
    "published": "Thu, 28 Aug 2025 12:45:00 -0400",
    "published_parsed": [
      2025,
      8,
      28,
      16,
      45,
      0,
      3,
      240,
      0
    ],
    "title": "Janicki Industries launches expansion with 162,000-square-foot facility in Washington",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Janicki Industries launches expansion with 162,000-square-foot facility in Washington"
    },
    "summary": "The new Hamilton facility, equipped with advanced tools like a large autoclave, and AFP machine&nbsp;and expanded clean rooms, boosts Janicki&rsquo;s ability to deliver complex aerospace composites at greater scale.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The new Hamilton facility, equipped with advanced tools like a large autoclave, and AFP machine&nbsp;and expanded clean rooms, boosts Janicki&rsquo;s ability to deliver complex aerospace composites at greater scale."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Janicki-Building12-construction-min.JPG\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Building 12 construction aerial view.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Janicki-Building12-construction-min.JPG;maxWidth=720\" /> </a></div>\n\n<p>Source | Janicki Industries</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/janicki-industries\" target=\"_blank\">Janicki Industries</a> (Sedro-Woolley, Wash., U.S.)&nbsp;is constructing a 162,000-square-foot manufacturing facility and a 20,000-square-foot storage expansion at its Hamilton, Washington, campus. The facility, called Building 12, will add 350 jobs and substantially expand the company&rsquo;s advanced manufacturing capabilities in support of several aerospace programs.</p>\n\n<p>This project marks the company&rsquo;s latest in a series of expansions to meet growing demand. Since 2020, Janicki has increased its headcount by 105% and expanded its operational footprint to more than 1 million square feet in Washington state.</p>\n\n<p>Building 12 will be equipped with state-of-the-art manufacturing equipment, including what the company says is the &ldquo;largest autoclave north of Everett,&rdquo; an oversized oven, an automated fiber placement (AFP) machine, paint and grit booths, a large nondestructive inspection robot and Janicki&rsquo;s&nbsp;largest proprietary five-axis CNC machine to date.&nbsp;The building will also expand cleanroom space by another 25,000 square feet to meet increasing demand for advanced composite production.</p>\n\n<p>&ldquo;This new facility and advanced equipment enable us to tackle more complex projects, expand our production capacity and further develop the skilled workforce essential to our success,&rdquo; says&nbsp;John Janicki, president of Janicki. &ldquo;We remain dedicated to providing our employees with the best tools and resources to deliver top-quality products and service. These investments are central to achieving our long-term growth objectives.&rdquo;</p>\n\n<p>Sustainability features are integrated into the facility. More than 45,000 square feet will be constructed with mass timber, reducing the building&rsquo;s overall carbon footprint, and a 500-kilowatt solar panel array.</p>\n\n<p>Construction is underway, and the facility is expected to be fully operational by March 2026. Hiring has begun for positions ranging from entry-level engineering and manufacturing roles to senior leadership opportunities. Janicki anticipates continued growth as new programs come online and customer needs evolve.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/janicki-industries-launches-expansion-with-162000-square-foot-facility-in-washington"
      }
    ],
    "link": "https://www.compositesworld.com/news/janicki-industries-launches-expansion-with-162000-square-foot-facility-in-washington"
  },
  {
    "published": "Tue, 26 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      26,
      15,
      0,
      0,
      1,
      238,
      0
    ],
    "title": "Daher ODDICEA 2 project gains support to boost decarbonization of TPC production activities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Daher ODDICEA 2 project gains support to boost decarbonization of TPC production activities"
    },
    "summary": "Renewed financial support from France&rsquo;s Pays de la Loire region will build on technological Industry 4.0 advances made in the project&rsquo;s first phase for Daher&rsquo;s Nantes facility, which has already delivered tangible results.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Renewed financial support from France&rsquo;s Pays de la Loire region will build on technological Industry 4.0 advances made in the project&rsquo;s first phase for Daher&rsquo;s Nantes facility, which has already delivered tangible results."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Daher-ODDICEA2project-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Daher facility using robots.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Daher-ODDICEA2project-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Daher</p>\n</div>\n\n<p>In April 2025, the Pays de la Loire region of France reaffirmed its support for the second phase of the ODDICEA project, which aims at making <a href=\"https://www.daher.com/en/\" target=\"_blank\">Daher</a>&rsquo;s Nantes (France) facility&nbsp;a benchmark for Industry 4.0.&nbsp;</p>\n\n<p>ODDICEA 2 seeks to build on the technological advances achieved so far in the ODDICEA project, as well as expand&nbsp;digital benefits that enhance the site&rsquo;s economic performance and accelerate the decarbonization of its thermoplastic composite (TPC) production activities. Toward this goal, the Pays de la Loire region is granting &euro;500,000 in financial aid, representing one-third of the project&rsquo;s total budget.</p>\n\n<p>The project&rsquo;s first phase (ODDICEA 1, conducted from 2018-2023) enabled Daher to take a major leap forward in Industry 4.0. Co-funded at 40% by the Pays de la Loire region, ODDICEA enabled the company to move from a robotic plant to a connected factory, delivering tangible results: a 10% increase in productivity at connected workstations; energy savings of approximately &euro;10,000 per month; and a 10% reduction in CO<sub>₂</sub> emissions.&nbsp;These results received recognition, notably with the &ldquo;Digital Revolution&rdquo; award at the 2023 Future Enterprise Heroes Ceremony.</p>\n\n<p>The project also strengthened Daher&rsquo;s integration into the local ecosystem through collaboration with organizations such as IRT Jules Verne, an industrial and collaborative research center for manufacturing; and Astree Software, a key partner in the implementation of manufacturing execution systems (MES).</p>\n\n<p>With continued backing, ODDICEA 2 builds on the achievements of the program&rsquo;s first phase, further improving the Daher Nantes site&rsquo;s performance while reducing its carbon footprint. This new phase continues the work of ODDICEA 1, with the internally developed connectivity standard serving as the foundation.</p>\n\n<p>ODDICEA 2 is structured around four main pillars. The first focuses on optimizing energy consumption through a real-time monitoring solution, along with efforts to eliminate carbon-based energy sources from the plant&rsquo;s energy mix. The goal of the remaining three pillars is to enhance the use of industrial data and integrate advanced technologies to increase the site&rsquo;s competitiveness. ODDICEA 2 also will benefit other Daher sites, with methods and tools that can be rolled out group-wide.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/daher-oddicea-2-project-gains-support-to-boost-decarbonization-of-tpc-production-activities"
      }
    ],
    "link": "https://www.compositesworld.com/news/daher-oddicea-2-project-gains-support-to-boost-decarbonization-of-tpc-production-activities"
  },
  {
    "published": "Tue, 26 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      26,
      14,
      0,
      0,
      1,
      238,
      0
    ],
    "title": "Joby demonstrates piloted eVTOL flight in FAA-controlled airspace",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Joby demonstrates piloted eVTOL flight in FAA-controlled airspace"
    },
    "summary": "The flight between two public California airports, and the aircraft&rsquo;s ability to integrate with other airliners, is built on years of eVTOL testing and 40,000+ miles flown across the Joby fleet.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The flight between two public California airports, and the aircraft&rsquo;s ability to integrate with other airliners, is built on years of eVTOL testing and 40,000+ miles flown across the Joby fleet."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-joby-aircraft-airport-flight.jpeg\" target=\"_blank\"><img alt=\"Joby aircraft flight.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-joby-aircraft-airport-flight.jpeg;maxWidth=385\" /></a></div>\n\n<p>Source | Joby Aviation</p>\n</div>\n\n<p><a href=\"https://www.jobyaviation.com/\" target=\"_blank\">Joby Aviation</a>&rsquo;s&nbsp;(Santa Cruz, Calif., U.S.) electric vertical takeoff and landing (eVTOL) aircraft has&nbsp;successfully operated with other aircraft in FAA-controlled airspace through completion of its first flight between two U.S. airports, Marina (OAR) and Monterey (MRY), California. The achievement builds on Joby&rsquo;s momentum toward&nbsp;commercial market readiness, acting as a&nbsp;critical measure of the company&rsquo;s product maturity, as well as demonstrating&nbsp;the type of real-world service Joby intends to offer to the public.&nbsp;</p>\n\n<p>Joby&rsquo;s flight time from OAR to MRY was approximately 12 minutes over 10 nautical miles, including 5 minutes in a hold pattern at MRY for air traffic spacing. The piloted flight included vertical takeoff, transition to wingborne flight, integration into the controlled airspace around MRY&nbsp;and vertical landing. The milestone marks the first time a piloted Joby eVTOL&nbsp;air taxi has flown from one public airport to another. The flight also successfully demonstrated the team&rsquo;s ability to conduct mobile flight tests and deliver full ground support operations away from home base in Marina.</p>\n\n<p>&ldquo;For years, our flight testing has validated our aircraft&rsquo;s capabilities, and we&rsquo;ve done this across a wide range of environmental conditions,&rdquo; notes Didier Papadopoulos, president of aircraft OEM at Joby. &ldquo;As part of the natural progression of our flight test program, it was time to venture further.&rdquo;</p>\n\n<p>These critical flight tests also provided developmental data related to the human factors of operating the aircraft at a controlled airport and in the enroute national airspace. In particular, Joby&rsquo;s ability to integrate into controlled airspace was demonstrated when its aircraft successfully sequenced with other aircraft at Monterey Airport, including a holding pattern to accommodate another arriving airliner. This is also an important step in the company&rsquo;s certification efforts, as the FAA requires aircraft to demonstrate they can operate in shared airspace by flying between multiple airports.</p>\n\n<p>Video of the flight demonstration can be viewed below.</p>\n\n<div></div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/joby-demonstrates-piloted-evtol-flight-in-faa-controlled-airspace"
      }
    ],
    "link": "https://www.compositesworld.com/news/joby-demonstrates-piloted-evtol-flight-in-faa-controlled-airspace"
  },
  {
    "published": "Tue, 26 Aug 2025 09:30:00 -0400",
    "published_parsed": [
      2025,
      8,
      26,
      13,
      30,
      0,
      1,
      238,
      0
    ],
    "title": "EHang deepens Hefei partnership for VT35 long-range eVTOL",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "EHang deepens Hefei partnership for VT35 long-range eVTOL"
    },
    "summary": "Joint investment in VT35 product hub across Hefei, China, will cover everything from R&amp;D to operations, building up the aircraft&rsquo;s certifications and range of applications.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Joint investment in VT35 product hub across Hefei, China, will cover everything from R&amp;D to operations, building up the aircraft&rsquo;s certifications and range of applications."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-ehang-vt30.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-ehang-vt30.jpg;maxWidth=720\" /> </a></div>\n\n<p>VT30 prototype. Source | <a href=\"https://www.youtube.com/watch?v=I7mMS6Ir7qs&amp;ab_channel=EHang\" target=\"_blank\">EHang YouTube</a></p>\n</div>\n\n<p><a href=\"https://www.ehang.com/index/\" target=\"_blank\">EHang Holdings Ltd.</a>&nbsp;(Guangzhou, China) has&nbsp;signed an investment cooperation agreement with the Hefei government, in which EHang will establish its product hub for the VT35 electric vertical takeoff and landing (eVTOL) series.&nbsp;</p>\n\n<p>The VT35 series is EHang&rsquo;s new generation of long‑range, lift‑and‑cruise, pilotless eVTOL&nbsp;products. It likely incorporates composite materials, as the <a href=\"https://evtol.news/ehang-vt30#:~:text=The%20EHang%20VT%2D30%20an,fly%20people%20between%20two%20cities.\" target=\"_blank\">VT30 prototype</a>&rsquo;s superstructure was carbon fiber composite. EHang and the Hefei government&nbsp;plan to jointly invest in and establish a comprehensive base for VT35 series products in Hefei, covering R&amp;D, testing, manufacturing, airworthiness certification, supply chain management, sales, operations&nbsp;and talent development.</p>\n\n<p>This partnership represents a significant upgrade in EHang&rsquo;s strategic layout at its East China regional headquarters in Hefei and accelerates industrialization of the VT35 series. The total investment in this partnership is estimated to be approximately RMB 1 billion (approx. $139.8 million). In addition, the Hefei government plans to provide EHang with comprehensive support valued at approximately RMB 500 million (approx. $70 million), including orders for eVTOL aircraft, investments&nbsp;or other forms of cooperation across the industry chain.</p>\n\n<p>The VT35 is designed for medium- to long-distance air mobility, including intercity, cross-sea&nbsp;and cross-mountain transport. It introduces major upgrades from the VT30 such as advanced autonomous flight control and propulsion systems.&nbsp;</p>\n\n<p>EHang&rsquo;s&nbsp;type certificate (TC) application for the VT35 was officially accepted by the Civil Aviation Administration of China (CAA&rdquo;) in February 2025 and is currently under airworthiness review process. EHang&rsquo;s goals are to achieve TC,&nbsp;production certificate (PC)&nbsp;and standard airworthiness certification (AC). Further, the company will assist its joint venture, Hefei Heyi Aviation Co.&nbsp;Ltd., in applying for air operator certification (OC) for the VT35. These efforts will enable a wide range of operations &mdash; including urban and intercity passenger transport, logistics&nbsp;and emergency rescue in Hefei and the broader East China region.</p>\n\n<p>In recent years, EHang has worked closely with Hefei, achieving growth together and making significant contributions to the city&rsquo;s low-altitude economy.&nbsp;Gaoyun Fei, secretary of the CPC Hefei Municipal Committee, has expressed&nbsp;hope that EHang will continue to grow in Hefei;&nbsp;strengthen cooperation with universities, research institutions and leading companies; and help bring more advanced technologies to the city. He also encouraged EHang to attract more high-quality projects, expand into areas such as logistics, fire protection&nbsp;and tourism, and work together to improve the low-altitude economy&rsquo;s industrial ecosystem.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ehang-deepens-hefei-partnership-for-vt35-long-range-evtol"
      }
    ],
    "link": "https://www.compositesworld.com/news/ehang-deepens-hefei-partnership-for-vt35-long-range-evtol"
  },
  {
    "published": "Mon, 25 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      25,
      15,
      0,
      0,
      0,
      237,
      0
    ],
    "title": "Spirit enters definitive agreement with CTRM for Malaysia facility, businesses",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Spirit enters definitive agreement with CTRM for Malaysia facility, businesses"
    },
    "summary": "Acquisition transaction&nbsp;entered into previously announced merger agreement&nbsp;will make Composites Technology Research Malaysia (CTRM) an important asset to Boeing and&nbsp;Airbus programs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Acquisition transaction&nbsp;entered into previously announced merger agreement&nbsp;will make Composites Technology Research Malaysia (CTRM) an important asset to Boeing and&nbsp;Airbus programs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0225-cw-news-aircraft-GettyImages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0225-cw-news-aircraft-GettyImages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>In early August, <a href=\"https://www.compositesworld.com/suppliers/spirit-aerosystems\" target=\"_blank\">Spirit AeroSystems</a>&nbsp;(Wichita, Kan., U.S.) announced&nbsp;a purchase agreement to sell its facility and businesses in Subang, Malaysia, to <a href=\"https://ctrm.com.my/\" target=\"_blank\">Composites Technology Research Malaysia Sdn Bhd</a> (CTRM, Malaysia) for $95,200,000, subject to customary adjustments. This transaction was entered into following the previously announced merger agreement with Boeing and subsequent definitive agreement with Airbus. The transaction is expected to close in Q4 2025, subject to regulatory approvals and closing conditions being met.&nbsp;</p>\n\n<p>Spirit AeroSystems&rsquo; business in Subang&nbsp;is a world-class&nbsp;engineering and manufacturing business, which occupies 45 acres with 400,000 square-feet manufacturing footprint in Subang&rsquo;s Malaysian International Aerospace Centre and employs more than&nbsp;1,000 employees. The operation offers aerostructures assembly,&nbsp;services capabilities&nbsp;and an integrated supply chain with access to advantaged, in-region material sourcing, skilled labor and scalability.&nbsp;</p>\n\n<p>As a result of this transaction, CTRM will become an important supplier to Airbus for its A220, A320&nbsp;and A350 programs, and to Boeing on the 737 and 787 programs.&nbsp;</p>\n\n<p>&ldquo;Our agreement with CTRM for the acquisition of this manufacturing facility ensures&nbsp;a strong future for this business as well as the regional stakeholders in Malaysia,&rdquo; says&nbsp;Irene Esteves, Spirit AeroSystems executive vice president and chief financial officer. &ldquo;This also marks a milestone in the ongoing acquisition <a href=\"https://www.compositesworld.com/news/spirit-aerosystems-shareholders-approve-acquisition-by-boeing\" target=\"_blank\">of Spirit by Boeing</a>.&rdquo;&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spirit-enters-definitive-agreement-with-ctrm-for-malaysia-facility-businesses"
      }
    ],
    "link": "https://www.compositesworld.com/news/spirit-enters-definitive-agreement-with-ctrm-for-malaysia-facility-businesses"
  },
  {
    "published": "Mon, 25 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      25,
      14,
      0,
      0,
      0,
      237,
      0
    ],
    "title": "UniSQ, iLAuNCH Trailblazer program drive digital twin innovation for composite repairs",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "UniSQ, iLAuNCH Trailblazer program drive digital twin innovation for composite repairs"
    },
    "summary": "Working with Boeing Australia, Memko and Dassault Syst&egrave;mes, the University of Southern Queensland (UniSQ) has developed a digital twin via the 3DEXPERIENCE platform, digitizing processes that could lead&nbsp;toward more efficient and effective maintenance, repair&nbsp;and operations of future fleets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Working with Boeing Australia, Memko and Dassault Syst&egrave;mes, the University of Southern Queensland (UniSQ) has developed a digital twin via the 3DEXPERIENCE platform, digitizing processes that could lead&nbsp;toward more efficient and effective maintenance, repair&nbsp;and operations of future fleets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"UniSQ's Center for Future Materials.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-unisq-cfm-ilaunch.jpg;maxWidth=720\" /> </div>\n\n<p>The Centre for Future Materials (CFM) is UniSQ's&nbsp;research center in advanced composite materials and manufacturing. Source | Dassault&nbsp;Syst&egrave;mes</p>\n</div>\n\n<p>Back in November 2023, Australia&rsquo;s&nbsp;iLAuNCH Trailblazer program &mdash;&nbsp;which aims to address critical skill gaps and accelerate the development of Australia&rsquo;s space sector&nbsp;&mdash; announced its backing of a&nbsp;University of Southern Queensland (UniSQ) project, targeting faster and more efficient&nbsp;aircraft and spacecraft composite repairs. Supported by Boeing Australia and&nbsp;engineering services company&nbsp;<a href=\"https://memko.com.au/\" target=\"_blank\">Memko</a> (Melbourne), the university&rsquo;s&nbsp;Centre for Future Materials (CFM) has since innovated a digital twin using&nbsp;<a href=\"https://www.compositesworld.com/suppliers/dassault-sys\" target=\"_blank\">Dassault Syst&egrave;mes</a>&rsquo; (V&eacute;lizy-Villacoublay, France) 3DEXPERIENCE platform to&nbsp;digitize&nbsp;the composite repair process.</p>\n\n<p>&ldquo;MEMKO brings to UniSQ access to the Dassault Syst&egrave;mes virtual twin software and their engineering expertise with these tools, which enables the virtual replication of a product along its whole life cycle &mdash;&nbsp;from digital design through to manufacturing requirements or in this case, structural repair,&rdquo; says&nbsp;iLAuNCH Trailblazer executive director Darin Lovett.&nbsp;</p>\n\n<p>Dr. Tristan Shelley from the UniSQ CFM has been heading the research, with the ultimate goal of increasing the digitalization of manufacturing processes for composite materials. In addition, to complete the project, the&nbsp;UniSQ installed scholarships for three Ph.D. opportunities to work alongside engineers and scientists at Boeing Aerostructures Australia and Memko in Melbourne, Brisbane and Toowoomba in an effort to develop workforce development and upskilling programs.</p>\n\n<p>Almost two years later, the&nbsp;iLAuNCH Trailblazer project&nbsp;has seen much success, which&nbsp;Dassault Syst&egrave;mes&nbsp;has detailed in this customer story <a href=\"https://www.3ds.com/insights/customer-stories/university-southern-queensland-composite-material-repair\" target=\"_blank\">here</a>. Using the 3DEXPERIENCE platform&rsquo;s digital twin capabilities, Shelley and his team have been doing everything from damage detection and capturing real-time visual data from filament winding to&nbsp;predict and optimize the best wind path, to&nbsp;programming scarfing tool paths, all in the name of&nbsp;eliminating&nbsp;both engineering and laborious processes and creating greater precision in the composite repair process.</p>\n\n<p>&ldquo;We are refining the NDT [nondestructive testing] process to help engineers identify the repairs area faster and more precisely,&rdquo; Shelley says in the article. &ldquo;We use reverse engineering capabilities within the&nbsp;3DEXPERIENCE platform to read the processed NDT data. This enables the creation of topology (the properties that remain unchanged under continuous deformations) which in turn can be overlaid with actual CAD data. This allows us to analyze and improve the visibility of internal layers to identify the size and extent of the damage.&rdquo;</p>\n\n<p><a href=\"https://www.3ds.com/insights/customer-stories/university-southern-queensland-composite-material-repair\" target=\"_blank\">Read the original article</a> for more details about the project&rsquo;s process, successes and next steps.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/unisq-ilaunch-trailblazer-program-drive-digital-twin-innovation-for-composite-repairs"
      }
    ],
    "link": "https://www.compositesworld.com/news/unisq-ilaunch-trailblazer-program-drive-digital-twin-innovation-for-composite-repairs"
  }
]