[
  {
    "published": "Fri, 16 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      17,
      0,
      0,
      4,
      136,
      0
    ],
    "title": "Exel Composites supports resilience of biomimetic hydrokinetic system by EEL Energy",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Exel Composites supports resilience of biomimetic hydrokinetic system by EEL Energy"
    },
    "summary": "Exel adapted carbon fiber&nbsp;profiles originally designed for wind turbines to meet the&nbsp;low-drag, high-flexibility and long-term fatigue performance demands of this renewable energy system&rsquo;s nature-inspired membrane.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Exel adapted carbon fiber&nbsp;profiles originally designed for wind turbines to meet the&nbsp;low-drag, high-flexibility and long-term fatigue performance demands of this renewable energy system&rsquo;s nature-inspired membrane."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hydrokinetic system in action.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eelenergy-hydrokinetic-system.jpg;maxWidth=720\" /> </div>\n\n<p>Source (All Images) | EEL Energy</p>\n</div>\n\n<p>A recent case study describes how a collaboration with <a href=\"https://www.compositesworld.com/suppliers/exel-composites-plc\" target=\"_blank\">Exel Composites</a> (Vantaa, Finland) supported the development of a biomimetic hydrokinetic system for generating electricity developed by deep tech startup&nbsp;<a href=\"https://www.eel-energy.fr/en/\" target=\"_blank\">EEL Energy</a>&nbsp;(Paris, France).&nbsp;</p>\n\n<p>EEL Energy seeks&nbsp;to redefine how we&nbsp;harness energy from nature. Specializing in&nbsp;hydrokinetic machines, the company&rsquo;s&nbsp;patented undulating membrane draws inspiration from the movements of fish tails. This biomimetic design captures kinetic energy from water currents, providing a sustainable method for generating electricity that is efficient and nondisruptive to aquatic ecosystems.</p>\n\n<p>The undulating membrane traces its origins to research in the medical field by Jean-Baptiste Drevet in 1996. He leveraged a polymer membrane that mimicked the undulating movement of marine animals to propel fluids, functioning as a pump that creates flow similar to the human heart. This technology has proven effective in medical devices and is adaptable for use in renewable energy generation. The vortices created by turbulent flow in water can be captured by a flexible membrane and the undulating motion used to drive an electrical generator</p>\n\n<p>&ldquo;Our membrane used to be made up of a semi-rigid structure covered in a rubber layer,&rdquo; explains&nbsp;Xavier Peroutka, CEO at EEL. &ldquo;The rubber acted as a sail, capturing the pressure from the water&rsquo;s current and transmitting it to the membrane&rsquo;s skeleton. As the membrane deformed, strain energy was generated and transformed into electricity through electromagnetic converters positioned on the membrane.</p>\n\n<p>&ldquo;Coils of wire placed within the structure moved relative to magnets embedded in the system during deformation,&rdquo; continues Peroutka.&nbsp;&ldquo;This movement induces an electrical current through electromagnetic induction, converting the membrane&rsquo;s mechanical energy into electrical energy.&rdquo;</p>\n\n<p>However, as EEL embarks on bringing hydrokinetic energy production to market, it faces significant challenges. The underwater environment is particularly demanding, necessitating materials that can withstand extreme stress and pressure.</p>\n\n<p>&ldquo;Hydrokinetic generation exerts up to 30 times more mechanical stress on equipment than wind energy production,&rdquo; notes&nbsp;Peroutka. &ldquo;Despite the challenges, it&rsquo;s worth persevering.&nbsp;While&nbsp;a wave power generator relies on intermittent wave action and solar and wind depend on favorable weather conditions, hydrokinetic generators can produce energy constantly throughout their life by leveraging the water currents in rivers or tidal flow. The predictability of hydrokinetic energy generation is needed by communities across the globe.&rdquo;</p>\n\n<h3>Seeking material expertise</h3>\n\n<p>Initially, EEL reinforced its membrane with fiberglass, but this original design revealed a critical flaw: delamination. Under the harsh cyclic loading of the underwater conditions, the membrane underwent large deformations, inducing high strains in the structure. The strain caused the layers of the membrane to separate, enabling water to infiltrate and compromise its functionality.</p>\n\n<p>Recognizing the serious implications of this issue &mdash; where a failure of the membrane during operation could jeopardize the entire hydrokinetic system &mdash; EEL sought the expertise of materials specialist Exel Composites&nbsp;to develop a solution capable of withstanding the continuous mechanical stress required for effective operation.&nbsp;</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>EEL Hydrokinetic generators</h3>\n\n<p><strong>30-kilowatt version</strong></p>\n\n<ul>\n\t<li>Membrane size : 5 &times; 7 meters</li>\n\t<li>Rated Power: 30 kilowatts&nbsp;@ 2.8 meters/second</li>\n\t<li>Annual production: 105-150 megawatt-hours</li>\n\t<li>Min. water depth: 4.5 meters</li>\n\t<li>Water velocity: 1.2-3.0 meters/second</li>\n\t<li>Current seam: 3.5 meters</li>\n</ul>\n\n<p><strong>300-kilowatt version</strong></p>\n\n<ul>\n\t<li>Membrane Size: 10 &times;&nbsp;15 meters</li>\n\t<li>Rated power: 300 kilowatts at&nbsp;3.2 meters/second</li>\n\t<li>Annual production: 0.8-1.2 gigawatt-hours</li>\n\t<li>Min. water depth: 10 meters</li>\n\t<li>Water velocity: 1.5-3.5 meters/second</li>\n\t<li>Current seam: 6 meters</li>\n</ul>\n</div>\n</div>\n\n<p>For Exel, specializing in&nbsp;pultruded and pull-wound composite materials, this challenge illustrated the complexity of creating a solution that was both durable, while balancing flexibility and resilience. The quest for a material that could endure the rigors of underwater energy generation became the focal point of the collaboration.</p>\n\n<p>Interestingly, the solution didn&rsquo;t require inventing something new. Rather, it resided in a proven material already designed to withstand the rigors of renewable energy production. One that can resist bending without breaking under the demands of the environment.</p>\n\n<p>&ldquo;The key to our successful collaboration was recognizing that our carbon fiber flats, originally designed for wind turbine blades, could be repurposed for EEL&rsquo;s hydrokinetic membranes,&rdquo; explains&nbsp;Neil Dykes, R&amp;D&nbsp;manager at Exel Composites. &ldquo;These flats provide the stiffness and strength required to withstand harsh wind conditions, making them ideal for this application.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eelenergy-hydrokinetic-system-above.jpg\" target=\"_blank\"><img alt=\"Hydrokinetic system construction.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-eelenergy-hydrokinetic-system-above.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>Exel used multiple layers of discrete carbon flat profiles, the same as those developed for wind turbine applications. These carbon fiber flats are stacked to create beams which were strategically integrated into the membrane. Three bars were placed across it at 50%, 80%&nbsp;and 100% of its length. This arrangement prevents bulging and limits overall deformation, ensuring the membrane maintains structural integrity and operates optimally.</p>\n\n<p>Excessive deformation, particularly uneven bulging outside the intended undulatory motion, can significantly reduce energy capture efficiency. When the membrane deforms, it disrupts the smooth oscillating flow of water over its surface, diminishing the area available for energy conversion and leading to suboptimal mechanical energy transfer to the electromagnetic converters.</p>\n\n<h3>How did carbon flats improve the design?</h3>\n\n<p>The integration of these carbon fiber flats was crucial for enhancing the membrane&rsquo;s mechanical performance. By increasing stiffness and resistance to deformation, they help preserve the membrane&rsquo;s shape during operation, ensuring effective energy capture while adhering to biomimetic design principles.</p>\n\n<p>The high strength and stiffness provided by the carbon fiber flats supplied by Exel Composites resolved the delamination issues previously encountered with glass fiber-reinforced composites (GFRP), which compromised the membrane&rsquo;s effectiveness.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<blockquote>\n<p>Inspired by fish tails, EEL Energy&rsquo;s membrane flexes continuously with the current &mdash; more than 6,000 times a day &mdash; making fatigue resistance a critical hurdle.</p>\n</blockquote>\n</div>\n\n<p>Notably, the&nbsp;mechanical properties of Exel&rsquo;s&nbsp;carbon fiber-reinforced polymer (CFRP) composites were essential to the membrane&rsquo;s success. With an E-modulus of approximately 120 GPa, CFRP exhibits higher stiffness than traditional GFRP, which is only a third of CFRP&nbsp;stiffness. This high stiffness ensures the membrane retains its shape under operational stress, preventing excessive deformation and energy loss.</p>\n\n<p>CFRP&rsquo;s tensile strength of 2,500 MPa, compared to GFRP&rsquo;s&nbsp;1,000 MPa also enables the former&nbsp;to withstand greater forces without failure. Additionally, CFRP&rsquo;s compressive strength, at 1,500 MPa, is much greater than the 600 MPa typical of GFRP. This increased strength, combined with CFRP&rsquo;s optimal fatigue resistance, ensures the membrane can handle the cyclic loading conditions experienced during operation, supporting up to 6,000 full reversal cycles per day. This durability is key for maintaining high efficiency in energy capture over the long term.</p>\n\n<h3>The future of EEL hydrokinetics</h3>\n\n<p>With these challenges resolved, EEL is now shifting its focus to the development of the main hydrokinetic generator, a crucial step toward commercialization after nearly a decade of membrane refinement. This transition also opens new opportunities for Exel Composites&rsquo;&nbsp;carbon flats, which could be pivotal in meeting future performance demands.</p>\n\n<p>EEL&rsquo;s current project includes developing a medium-sized hydrokinetic generator designed to generate 50 kilowatts&nbsp;per hour. This generator targets isolated communities across the Americas, where many areas face significant energy access challenges due to geographic isolation from the main grid. The vast expanse of this region leaves numerous rural populations disconnected from centralized power sources. EEL aims to support local governments by providing consistent, reliable hydrokinetic energy tailored to the communities&rsquo; needs, eliminating reliance on expensive and polluting hydrocarbon generators.</p>\n\n<p>In parallel, EEL is developing a larger hydrokinetic generator aimed at energy producers such as EDF and Octopus, targeting an output of 1 megawatt&nbsp;per hour. These installations are envisioned as hydrokinetic farms located in rivers and coastal areas. A single hydrokinetic generator could power 796 North American homes, and generator farms with multiple generators could enhance regional energy capacity.</p>\n\n<p>EEL says its&nbsp;hydrokinetic technology promises predictable, sustainable energy, reducing reliance on fossil fuel-powered generators prevalent in remote areas. As the company prepares for commercialization, ongoing discussions with electricity providers and local governments demonstrate its commitment to supporting communities in the shift toward&nbsp;cleaner energy sources.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/exel-composites-supports-resilience-of-biomimetic-hydrokinetic-system-by-eel-energy"
      }
    ],
    "link": "https://www.compositesworld.com/news/exel-composites-supports-resilience-of-biomimetic-hydrokinetic-system-by-eel-energy"
  },
  {
    "published": "Fri, 16 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      16,
      0,
      0,
      4,
      136,
      0
    ],
    "title": "Hexagon Agility reaches milestone with additional orders supporting X15-N natural gas trucks",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexagon Agility reaches milestone with additional orders supporting X15-N natural gas trucks"
    },
    "summary": "Additional natural gas fuel system orders at a value of&nbsp;$4.3 million&nbsp;include more than&nbsp;20 Class 8 fleets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Additional natural gas fuel system orders at a value of&nbsp;$4.3 million&nbsp;include more than&nbsp;20 Class 8 fleets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hexagonagility-heavyduty-trucks-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orange heavy-duty truck.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hexagonagility-heavyduty-trucks-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Hexagon Agility</p>\n</div>\n\n<p><a href=\"http://hexagonagility.com/\" target=\"_blank\">Hexagon Agility</a>&nbsp;(Costa Mesa, Calif., U.S.), a subsidiary of <a href=\"https://www.compositesworld.com/suppliers/hexagon-composites-asa\" target=\"_blank\">Hexagon Composites ASA</a> (&Aring;lesund, Norway) providing natural gas (CNG/RNG) fuel systems, has over the past months received new orders for natural gas fuel systems installations on trucks powered by <a href=\"https://www.cummins.com/\" target=\"_blank\">Cummins</a>&rsquo; (Columbus, Ind., U.S.) X15N natural gas engine, designed specifically for the North American heavy-duty commercial truck market.</p>\n\n<p>The new orders are valued at $4.3 million and include more than&nbsp;20 Class 8 fleets (read &ldquo;<a href=\"https://www.compositesworld.com/news/hexagon-agility-receives-wave-of-rng-fuel-system-orders-for-class-8-trucks\">Hexagon Agility receives wave of RNG fuel system orders for Class 8 trucks</a>&rdquo;). This brings the total accumulated value of orders that Hexagon Agility has received for natural gas fuel systems for X15N-powered trucks to $20 million, including the UPS order announced in May 2024 and orders announced in October 2024.</p>\n\n<p>At the end of April 2025, Daimler Truck North America announced it had opened orders for Freightliner Cascadia trucks equipped with the Cummins X15N. Daimler, Kenworth and Peterbilt, three leading Class 8 truck OEMs in North America, now offer natural gas truck options powered by the X15N engine.</p>\n\n<p>&ldquo;Despite freight market and macro-economic uncertainty, we see a strong uptick in the interest for natural gas solutions,&rdquo; says Eric Bippus, chief commercial officer at Hexagon Composites. &ldquo;The 15-liter engine [X15N]&nbsp;is now enabling fleets to access the fuel cost and emissions reduction benefits of natural gas, with performance that matches diesel in both power and range. Equipped with a fuel system from Hexagon Agility, Class 8 trucks with the X15N can achieve a range of up to 1,200 miles. This has unlocked a whole new segment of the truck market previously constrained to just diesel fuel.&rdquo;</p>\n\n<p>With power ratings up to 500 horsepower&nbsp;(~370 kilowatts) and torque up to 1,850 pound-foot, the X15N engine is reported to meet&nbsp;the needs of long-haul/heavy-load demands for high horsepower and offers a range of up to 1,200 miles (2,000 kilometers), matching the capabilities of diesel.</p>\n\n<p>Natural gas trucking is supported by a robust network of more than&nbsp;1,600 public and private CNG/RNG fueling stations across key transport corridors in North America.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexagon-agility-reaches-milestone-with-additional-orders-supporting-x15-n-natural-gas-trucks"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexagon-agility-reaches-milestone-with-additional-orders-supporting-x15-n-natural-gas-trucks"
  },
  {
    "published": "Fri, 16 May 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      15,
      30,
      0,
      4,
      136,
      0
    ],
    "title": "Joby flies two eVTOL aircraft simultaneously in testing milestone",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Joby flies two eVTOL aircraft simultaneously in testing milestone"
    },
    "summary": "The latest in the company&rsquo;s flight testing program targets certification testing acceleration and support of its passenger-carrying goals by 2026.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The latest in the company&rsquo;s flight testing program targets certification testing acceleration and support of its passenger-carrying goals by 2026."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-joby-twoaircraft-flight-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-joby-twoaircraft-flight-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Two Joby air taxis (N541JX and N544JX) fly simultaneously in the skies over Marina, California. Source | Joby Aviation</p>\n</div>\n\n<p><a href=\"https://www.jobyaviation.com/\" target=\"_blank\">Joby Aviation Inc.</a>&nbsp;(Santa Cruz, Calif., U.S.) has successfully flown&nbsp;two of its electric vertical takeoff and landing (eVTOL) aircraft simultaneously for the first time, marking another important milestone in the company&rsquo;s flight testing program.</p>\n\n<p>The two-aircraft flight, completed in Marina, California on May 9, is further demonstration of the maturity of Joby&rsquo;s test program, and comes just two weeks after the company reached another testing landmark &mdash;&nbsp;successfully completing flights with a full transition from vertical to cruise flight, and back again, with a pilot onboard.</p>\n\n<p>&ldquo;Our air taxi is designed, manufactured and assembled here in the U.S., with employing&nbsp;engineers and other experts across 40 different U.S. states,&rdquo; says JoeBen Bevirt, founder and CEO of Joby.&nbsp;&ldquo;With six aircraft in our test fleet, flying multiple aircraft at a time will play an important role in accelerating our certification testing and supporting our plans to carry our first passengers next year [2026].&rdquo;</p>\n\n<p>Joby has partnered with Delta Air Lines and Uber to bring its service to the U.S. and expects Los Angeles and New York City to be launch markets. Service is planned to start shortly after Joby receives type certification from the Federal Aviation Administration (FAA).&nbsp;&nbsp;</p>\n\n<p>Outside the U.S., Joby recently announced a partnership with Virgin Atlantic to bring its service to the U.K. and has partnered with ANA Holdings Inc., Japan&rsquo;s largest airline, to bring its service to Japan.</p>\n\n<p>Joby&rsquo;s&nbsp;<a href=\"https://joby-site.cdn.prismic.io/joby-site/aBu0USdWJ-7kRuZx_2025Q1-Report.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Q1 2025 Shareholder Letter</a>&nbsp;celebrates&nbsp;a second consecutive quarter of record progress toward certifying its aircraft with the FAA and reiterated plans to start passenger operations in Dubai in early 2026. The company has completed more than 40,000 miles of test flights across multiple aircraft, including demonstration flights in New York City, Japan, and Korea.</p>\n\n<p>The sixth aircraft to join Joby&rsquo;s flight test program is currently undergoing final functional checks, having been powered on for the first time in April 2025. Two aircraft are positioned at Edwards Air Force Base where they are completing testing in conjunction with the company&rsquo;s defense customers.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/joby-flies-two-evtol-aircraft-simultaneously-in-testing-milestone"
      }
    ],
    "link": "https://www.compositesworld.com/news/joby-flies-two-evtol-aircraft-simultaneously-in-testing-milestone"
  },
  {
    "published": "Fri, 16 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      15,
      0,
      0,
      4,
      136,
      0
    ],
    "title": "MVP, Composites One grow partnership into Mexico",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "MVP, Composites One grow partnership into Mexico"
    },
    "summary": "Customers in Mexico will gain direct access to equipment, services, technical knowledge and reliable delivery brought by both companies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Customers in Mexico will gain direct access to equipment, services, technical knowledge and reliable delivery brought by both companies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-mvp-compone-mexico.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Mexico map with logos.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-mvp-compone-mexico.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Magnum Venus Products (MVP)</p>\n</div>\n\n<p>In early March 2025, <a href=\"https://www.compositesworld.com/suppliers/magnum-venus-products\" target=\"_blank\">Magnum Venus Products</a> (MVP, Knoxville, Tenn., U.S.) and <a href=\"https://www.compositesworld.com/suppliers/composites-one\" target=\"_blank\">Composites One</a> (Schaumburg, Ill., U.S.) expanded a longstanding partnership&nbsp;into Mexico. For decades, MVP and Composites One have worked together to serve the composites industry across the U.S., delivering not only high-performance equipment and materials, but also hands-on training, technical expertise&nbsp;and dedicated customer support. With this expansion, manufacturers in Mexico will now benefit from the same combination of innovation, reliability&nbsp;and industry knowledge.</p>\n\n<p>As part of this expanded relationship, MVP officially recognizes Composites One as its authorized distributor in Mexico. This designation strengthens the infrastructure needed for MVP to support more efficient, productive manufacturing operations. MVP offers a full range of solutions &mdash; from straightforward systems that help manufacturers transition from manual processes to fully automated technologies that maximize throughput and precision. Through this partnership, customers in Mexico will gain direct access to MVP&rsquo;s equipment and the expert support needed to scale with confidence.</p>\n\n<p>&ldquo;Through our joint efforts, we&rsquo;ll be able to deliver a tangible competitive advantage to customers in a market that is ripe for growth,&rdquo; says Joan Tracy, MVP director of international sales.</p>\n\n<p>Composites One is one of the largest distributor of composite materials in North America, serving more than&nbsp;9,000 customers across industries such as marine, aerospace, wind energy, transportation&nbsp;and construction. With a network of more than 40 distribution centers throughout the U.S. and Canada, Composites One has built its reputation on service, technical knowledge and reliable delivery. The move into Mexico reflects both companies&rsquo; strategic commitment to supporting the growing composites market in the region.</p>\n\n<p>&ldquo;We see potential in Mexico and are committed to investing in this market as part of our strategic growth plan,&rdquo; says&nbsp;Dave Smith, chief commercial officer of Composites One.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/mvp-composites-one-grow-partnership-into-mexico"
      }
    ],
    "link": "https://www.compositesworld.com/news/mvp-composites-one-grow-partnership-into-mexico"
  },
  {
    "published": "Fri, 16 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      16,
      14,
      0,
      0,
      4,
      136,
      0
    ],
    "title": "Swinburne highlights composites and Industry 4.0 activities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Swinburne highlights composites and Industry 4.0 activities"
    },
    "summary": "Swinburne University of Technology&rsquo;s facilities and research expertise have attained milestone developments in a UAV wingbox, customized carbon fiber components, digital manufacturing and 3D printing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Swinburne University of Technology&rsquo;s facilities and research expertise have attained milestone developments in a UAV wingbox, customized carbon fiber components, digital manufacturing and 3D printing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-swinburne-manufacturingweek.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-swinburne-manufacturingweek.jpg;maxWidth=720\" /> </a></div>\n\n<p>At Australian Manufacturing Week, Swinburne&nbsp;showcased its capabilities in everything from advanced manufacturing, high-rate and automated production, advanced joining techniques and digital transformation, to custom carbon fiber&nbsp;products, thermoplastic composites and 3D printed parts. Source | Swinburne University of Technology <a href=\"https://www.linkedin.com/school/swinburne-university-of-technology/posts/?feedView=all\" target=\"_blank\">LinkedIn</a></p>\n</div>\n\n<p><a href=\"https://www.swinburne.edu.au/\" target=\"_blank\">Swinburne University of Technology</a>&rsquo;s (Melbourne, Australia) experts have attained several milestones in space, aerospace and automotive applications featuring the use of composite materials, as well as novel approaches to high-rate manufacturing,&nbsp;digital twins and&nbsp;joining complex components. These activities are further bolstered through Swinburne&rsquo;s support of&nbsp;Australia&rsquo;s $270.5 million research initiative that aims to&nbsp;transform healthcare, aerospace and construction through additive manufacturing.</p>\n\n<p><strong>Uncrewed aerial vehicle (UAV) wingbox.&nbsp;</strong>Developed at the <a href=\"https://www.compositesworld.com/news/swinburne-csiro-testlab-grows-composites-competency-via-industrial-scale-3d-printing\" target=\"_blank\">Swinburne-CSIRO National Industry 4.0 Testlab</a>, this drone wingbox highlights innovations in stamp forming and automated manufacturing processes for joining thermoplastic composite (TPC) parts. The wingbox&nbsp;uses aerospace-grade TPC&nbsp;like LMPAEK for high-performance and lightweight structures, said to be a first for Australian aerospace applications.</p>\n\n<p>The automated production process features a digital twin to simulate and optimize every stage, from cutting to welding and final assembly. </p>\n\n<p><strong>Customized carbon fiber&nbsp;road bike frame.&nbsp;</strong>Also manufactured at the Industry 4.0 Testlab, Swinburne experts guided R&amp;D, design, engineering and production. The bike frame demonstrates Swinburne&rsquo;s ability to develop products from concept to scaled production, showcasing highly intricate geometrical shapes that can be tailored to specific user needs, and highlights the university&rsquo;s capability in manufacturing custom carbon fiber&nbsp;components for aerospace, space&nbsp;and defense (detection and protection) applications.</p>\n\n<p><strong>Digital </strong><strong>manufacturing</strong>. Swinburne&rsquo;s Testlab provides&nbsp;fully digitally supported engineering and manufacturing solutions for parts, processes and entire systems in automotive, aerospace, production and more.</p>\n\n<p>The university highlights the capabilities of its Factory of the Future, its industry&nbsp;portal for advanced manufacturing, which focuses on digital transformation for small-to-medium enterprises.&nbsp;Located on the ground floor of Swinburne&rsquo;s $100 million Advanced Manufacturing and Design Centre (AMDC Building), the Factory of the Future includes capabilities/services in Industry 4.0/5.0 (digital manufacturing), design to manufacture, applied AI and machine learning, software engineering and rapid prototyping, applied R&amp;D and servitization.</p>\n\n<p>The Australian Research Council (ARC) Industrial Transformation Research Hub in Future Digital Manufacturing (Digital Manufacturing Hub) is also homed at Swinburne.&nbsp;</p>\n\n<p><strong>3D printed parts from the Factory of the Future.&nbsp;</strong>Swinburne also features expertise in additive manufacturing. In particular it mentions a disc made of&nbsp;AlSi12 alloy 3D printed vis selective laser melting;&nbsp;a CubSat that has been topologically optimized,&nbsp;meaning the&nbsp;design has been adjusted to use the least amount of material while still maintaining strength and performance; and a copper-coated toilet door push plate using a&nbsp;Cold Spray Additive Manufacturing process.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/swinburne-highlights-composites-and-industry-40-activities"
      }
    ],
    "link": "https://www.compositesworld.com/news/swinburne-highlights-composites-and-industry-40-activities"
  },
  {
    "published": "Thu, 15 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      15,
      17,
      0,
      0,
      3,
      135,
      0
    ],
    "title": "Ford Motor Q1 Award recognizes SGL Carbon GFRP leaf springs",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Ford Motor Q1 Award recognizes SGL Carbon GFRP leaf springs"
    },
    "summary": "SGL Carbon&rsquo;s Austrian site has been identified by its years of serving the&nbsp;U.S. automotive manufacturer with quality composite products and efficient production.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "SGL Carbon&rsquo;s Austrian site has been identified by its years of serving the&nbsp;U.S. automotive manufacturer with quality composite products and efficient production."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-sglcarbon-ford-q1-award.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"SGL Carbon and Ford Motor celebrate award.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-sglcarbon-ford-q1-award.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | SGL Carbon SE</p>\n</div>\n\n<p>In early May 2025, Ford Motor Co. (Dearborn, Mich., U.S.) visited <a href=\"https://www.compositesworld.com/suppliers/sgl-carbon-se\" target=\"_blank\">SGL Carbon</a>&rsquo;s (Wiesbaden, Germany)&nbsp;site in Ort im Innkreis, Austria, to present its Q1 award &mdash; the&nbsp;highest honor Ford bestows on its suppliers&nbsp;&mdash; recognizing SGL&rsquo;s work in glass fiber-reinforced polymer (GFRP) leaf springs.&nbsp;</p>\n\n<p>The Ford Q1 Award is a global benchmark for the best suppliers. To qualify for this status, suppliers must meet a number of criteria that are scored on a point system. Suppliers must demonstrate the highest standards of quality and reliability but also drive continuous improvement to ensure mutual success.</p>\n\n<p>&ldquo;SGL Carbon&rsquo;s production site in Ort im Innkreis&nbsp;has achieved the highest quality standard for Ford,&rdquo; says Luk&aacute;&scaron; Brdl&iacute;k, site STA engineer chassis at Ford Motor Co. in Prague. &ldquo;SGL Carbon has been a strong partner for many years and will hopefully remain so in the future.&rdquo;</p>\n\n<p>SGL&rsquo;s Composite Solutions business unit manufactures fiber-reinforced composite components for the automotive industry in large series in Austria, with a&nbsp;focus on leaf springs and battery case components.</p>\n\n<p>Since 2019, the site has also been supplying Ford with GFRP leaf springs for several vehicle models, such as longitudinal leaf springs for the rear axle of the Ford <em>Transit</em>. For Ford, this was the first leaf spring project with composites in series worldwide.</p>\n\n<p>In 2021, Ford won the SPE Innovation Award for the spring system in its <a href=\"https://www.compositesworld.com/articles/hybrid-steelcomposite-leaf-spring-targets-light-weight-high-volume-applications\" target=\"_blank\">F-150 pickup truck model</a>, which also uses a leaf spring component from SGL Carbon.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ford-motor-q1-award-recognizes-sgl-carbon-gfrp-leaf-springs"
      }
    ],
    "link": "https://www.compositesworld.com/news/ford-motor-q1-award-recognizes-sgl-carbon-gfrp-leaf-springs"
  },
  {
    "published": "Thu, 15 May 2025 08:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      15,
      12,
      0,
      0,
      3,
      135,
      0
    ],
    "title": "U.S. Navy contract to advance Cambium C/C composites for hypersonics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "U.S. Navy contract to advance Cambium C/C composites for hypersonics"
    },
    "summary": "Cambium aims to further optimize its phthalonitrile-based thermal protection portfolio&nbsp;to create a secure domestic supply for U.S. hypersonics.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Cambium aims to further optimize its phthalonitrile-based thermal protection portfolio&nbsp;to create a secure domestic supply for U.S. hypersonics."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cambium-hypersonics.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hypersonic aircraft rendering.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cambium-hypersonics.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Cambium</p>\n</div>\n\n<p><a href=\"https://cambium-usa.com/\" target=\"_blank\">Cambium</a>&nbsp;(El Segundo, Calif., U.S.), a company developing and producing advanced composites for defense and dual-use applications, is bringing its hypersonics-ready product portfolio&nbsp;to the next level through a contract with the U.S. Navy. Specifically, the company is&nbsp;optimizing the processing and production of its&nbsp;phthalonitrile material systems to ensure that they continue to deliver on their potential to reduce the cost and time needed to produce hypersonics-ready&nbsp;carbon/carbon (C/C) composite parts by around 70%. &nbsp;</p>\n\n<p>Cambium uses an&nbsp;AI-driven material discovery and development platform to rapidly and cost-effectively produce hypersonic-ready products through a domestic supply chain. Its&nbsp;phthalonitrile material systems include resins, prepreg and film adhesive that are capable of withstanding extreme environments in a range of applications from aerospace to hypersonics.</p>\n\n<p>Cambium&rsquo;s resins, for example, feature&nbsp;high service temperatures and thermal stability, reportedly outperforming traditional matrices; typical glass transition temperatures of the company&rsquo;s phthalonitrile matrices exceed 400&deg;C (750&deg;F). In addition, phthalonitrile products&nbsp;offer a higher-performing alternative to traditional polyimides. Cambium&rsquo;s phthalonitrile resins, prepregs&nbsp;and adhesives are room temperature stable, eliminating the need for cold storage of traditional composite materials.</p>\n\n<p>Cambium is working with a sense of urgency to optimize these systems in its contract with the Navy&rsquo;s Office of Naval Research (ONR), to create a secure domestic supply for hypersonics&nbsp;by significantly reducing lead times and cost roadblocks. Importantly, Cambium says its&nbsp;phthalonitrile-based high-temperature composite materials address key adoption issues in processing and production that were thought to be insurmountable, including developing C/C composite parts that are&nbsp;capable of surviving and performing in the extreme conditions that structures encounter at hypersonic speeds up to Mach 20.</p>\n\n<p>&ldquo;The U.S. must establish a secure, scalable supply chain for advanced materials to support hypersonic systems at speed and scale,&rdquo; says&nbsp;Simon Waddington, Cambium&rsquo;s co-founder and CEO. &ldquo;Cambium is tackling this challenge head-on, developing next-generation thermal protection systems that are not only high-performing but also cost-effective and domestically manufactured. This Navy contract is another step forward in our mission to deliver materials solutions that strengthen national security and technological leadership.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/us-navy-contract-to-advance-cambium-cc-composites-for-hypersonics"
      }
    ],
    "link": "https://www.compositesworld.com/news/us-navy-contract-to-advance-cambium-cc-composites-for-hypersonics"
  },
  {
    "published": "Wed, 14 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      14,
      17,
      0,
      0,
      2,
      134,
      0
    ],
    "title": "Hufschmied, CMS open up advanced materials machining potential",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hufschmied, CMS open up advanced materials machining potential"
    },
    "summary": "Technical partnership combining cutting tool technology and CNC machining will open up&nbsp;new possibilities for comprehensive process efficiency, quality and sustainability for composite materials and engineered plastics.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Technical partnership combining cutting tool technology and CNC machining will open up&nbsp;new possibilities for comprehensive process efficiency, quality and sustainability for composite materials and engineered plastics."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hufschmied-cms-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-hufschmied-cms-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>From left to right: Thomas Niefenecker, Roberto Milesi, Christel Hufschmied, Matteo Radicioni, Patrick Pulendran, Mirella Locatelli and Stefano Locher. Source | Hufschmied Zerspanungssysteme</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/hufschmied-zerspanungssysteme\" target=\"_blank\">Hufschmied Zerspanungssysteme GmbH</a>&nbsp;(Bobingen, Germany), a manufacturer of&nbsp;of material- and process-specific cutting tools, and CNC machine tool manufacturer&nbsp;<a href=\"https://www.cms.it/en_US\" target=\"_blank\">CMS SpA</a> (Zogno, Italy) have entered a technical partnership, joining forces to fundamentally improve the machining strategies for advanced materials.</p>\n\n<p>The expertise and resources of both companies will be used to develop comprehensive process engineering solutions for current customer needs. The cooperation includes the expansion of existing customer projects, joint trade show appearances and the development of new machining concepts. The advantages of integrated machining solutions will be demonstrated to a broad audience in Europe and beyond at joint workshops, webinars and open house days.</p>\n\n<p>The partnership focuses on the development of advanced machining strategies for high-performance materials such as composite materials and engineering plastics. Through this combination, Hufschmied and CMS are able to offer integrated solutions that combine machine design, cutting tool technology and optimized machining. The&nbsp;CMS Ares&nbsp;machine, for example, which has been specially adapted to the specifications of Hufschmied and is available at the Bobingen site, is being used to create such a platform. Ares makes it&nbsp;possible to carry out tests, to refine machining strategies and to gain valuable insights for the further development of the digital manufacturing solution. These insights are incorporated not only into the design of tools and machines, but also into customized solutions for customers.</p>\n\n<blockquote>\n<p>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/articles/developing-milling-for-cmc-because-grinding-takes-too-long\">Developing milling for CMC because grinding takes too long</a>.&rdquo;</p>\n</blockquote>\n\n<p>A central aspect of the collaboration is joint commitment to process optimization. Thanks to the comprehensive expertise of both partners, each phase of the value chain &mdash;&nbsp;from material preparation to final processing &mdash;&nbsp;is being integrated. The result?&nbsp;Higher efficiency, reduced scrap rates and high machining quality.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hufschmied-cms-open-up-advanced-materials-machining-potential"
      }
    ],
    "link": "https://www.compositesworld.com/news/hufschmied-cms-open-up-advanced-materials-machining-potential"
  },
  {
    "published": "Wed, 14 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      14,
      16,
      0,
      0,
      2,
      134,
      0
    ],
    "title": "Kent continues pultrusion legacy under new leadership",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Kent continues pultrusion legacy under new leadership"
    },
    "summary": "Michael Pollard is shifting ownership of Kent Automation and Kent Pultrusion to Sean Robbins to support the company&rsquo;s sustained growth and future development.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Michael Pollard is shifting ownership of Kent Automation and Kent Pultrusion to Sean Robbins to support the company&rsquo;s sustained growth and future development."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-kentpultrusion-new-ownership.jpg;maxWidth=720\" /> </div>\n\n<p>Kent celebrates new milestone. Source | Michael Pollard</p>\n</div>\n\n<p>Kent Automation and Kent Pultrusion (Kent, Ohio, U.S.)&nbsp;owned by MNM IND Inc.,&nbsp;the&nbsp;business development and investment holding company&nbsp;of&nbsp;president and CEO Michael Pollard, has announced the transition of its ownership to Sean Robbins.&nbsp;Robbins is local to Kent and plans to work with the existing team to ensure Kent&rsquo;s growth over the coming decades.&nbsp;MelCap served as&nbsp;the&nbsp;exclusive investment banker and financial advisor to Kent through the sale of the business.&nbsp;</p>\n\n<p>Kent designs, manufactures and supplies turnkey pultrusion systems, vinyl and fiberglass machinery, window and door secondary operation equipment, integration solutions and custom machine solutions. The company serves a variety of end markets, including building products, power and utilities, fluid systems, transportation and consumer products.</p>\n\n<p>Pollard acquired Kent Automation and Kent Pultrusion as part of the MNM IND Group back in September 2014. &ldquo;Kent Automation&rsquo;s vast history in the market dates back to 1995 with over 5,000 window and door and custom automation installations throughout North America,&rdquo; says Pollard. &ldquo;Being blessed with a great team, together we developed a fully electric pultrusion line in 2015, establishing Kent Pultrusion LLC, and trademarked the name ServoPul. This success and growth will continue with the the exciting partnership with Kent Automation Systems LLC, and we want to say thank you to MelCap for guiding us through this process from start to finish and aligning us with the right partner for the future!&rdquo;</p>\n\n<p>Pollard says Kent&rsquo;s legacy will continue under the leadership of Robbins, believing that his strategic vision and commitment will ensure a path of sustained growth and development for the company. A newly formed entity, Kent Automation Systems LLC&nbsp;will own the operating businesses and the entire Kent Pultrusion and Kent Automation teams remain in place. Michael Pollard will continue working with Robbins as a consultant for at least 12 months.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/kent-continues-pultrusion-legacy-under-new-leadership"
      }
    ],
    "link": "https://www.compositesworld.com/news/kent-continues-pultrusion-legacy-under-new-leadership"
  },
  {
    "published": "Wed, 14 May 2025 11:23:35 -0400",
    "published_parsed": [
      2025,
      5,
      14,
      15,
      23,
      35,
      2,
      134,
      0
    ],
    "title": "The new Slate truck costs less than $20,000, uses PP composite body panels",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "The new Slate truck costs less than $20,000, uses PP composite body panels"
    },
    "summary": "Stylish vehicle EV pickup model is supported by a simplified manufacturing process. It is also capable of customization from two seats to five seats.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Stylish vehicle EV pickup model is supported by a simplified manufacturing process. It is also capable of customization from two seats to five seats."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-slate-opener.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Slate Auto new EV truck with polypropylene composite body panels\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-slate-opener.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Slate Auto</p>\n</div>\n\n<p><a href=\"https://www.slate.auto/en\" target=\"_blank\">Slate Auto</a> (Troy, Mich., U.S.) is&nbsp;a new company founded on a disruptive business model of simplifying the vehicle manufacturing process and removing unnecessary content to reduce cost and increase reliability.&nbsp;&ldquo;The definition of what&rsquo;s affordable is broken,&rdquo; says Slate CEO Chris Barman.</p>\n\n<p>The Slate Truck is a simplified yet stylish electric vehicle (EV) two-seat pickup, produced in a single configuration from the factory in Indiana.<strong> </strong>It features crank windows and HVAC knobs, a large frunk plus cargo area with a 1,400-pound payload.</p>\n\n<p>&ldquo;Slate exists to put the power back in the hands of customers who have been ignored by the auto industry,&rdquo; notes Barman. &ldquo;It&nbsp;is a radical truck platform so customizable that it can transform from a two-seat pickup to a five-seat SUV.&rdquo;</p>\n\n<p>Polypropylene composites are also a key feature. &ldquo;We developed highly dent-resistant composite body panels,&rdquo; explains Eric Keipper, head of engineering for Slate Auto. These are attached to a high-strength steel chassis frame. &ldquo;We focused a lot on making sure we got the right material in the right place,&rdquo; he adds, noting the first essential was safety &mdash; Slate is an <a href=\"https://www.nhtsa.gov/press-releases/nhtsa-2024-crash-test-vehicles-5-star-safety-ratings\" target=\"_blank\">NCAP five-star rated vehicle</a> &mdash; &nbsp;followed by reliability and durability, where he cites composites as a key enabler.</p>\n\n<p>Owners can personalize their Slate truck with more than&nbsp;100 accessories, available individually or bundled, at the time of purchase or as their needs change. These include bumper and fender styles, interior trim, roof racks and more. The flat-pack accessory SUV Kit, for example, turns the truck into a five-seat SUV, with a roll cage, airbags and rear seat. Owners can choose to install these extras themselves or have a partner auto shop help. Three levels of vehicle wrapping are also available for a customized exterior via vinyl wraps that is affordable while enabling inventive and easily updated looks.</p>\n\n<div></div>\n\n<p>Additional specifications include:</p>\n\n<ul>\n\t<li>52.7-kilowatt-hour&nbsp;battery pack</li>\n\t<li>150-kilowatt&nbsp;rear-wheel drive</li>\n\t<li>Targeted range of 150 miles; optional accessory 84.3-kilowatt-hour&nbsp;battery pack targets 240 miles</li>\n\t<li>NACS port charge on a household outlet overnight or fast-charge to 80% at 120 kilowatts&nbsp;in under 30 minutes</li>\n\t<li>Active emergency braking, forward collision warning, up to eight airbags.</li>\n</ul>\n\n<p>As reported by <em><a href=\"https://www.caranddriver.com/news/a64654479/slate-ev-pickup-factory-location/\" target=\"_blank\">Car and Driver</a></em>, Slate is backed by Jeff Bezos and plans to manufacture its trucks at a repurposed 1.4-million-square-foot facility in Warsaw, Indiana. The company is currently retooling the factory, targeting delivery of its first EVs in 2026. It says it will keep costs low via direct-to-consumer sales and a nationwide service network.</p>\n\n<p>Vehicle cost is estimated at $27,500 but drops below $20,000 with federal EV tax credits. Customers can order their truck online, take delivery near their home, and find service locations in their neighborhood. Refundable $50 vehicle reservations are being accepted now.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/the-new-slate-truck-costs-less-than-20000-uses-pp-composite-body-panels"
      }
    ],
    "link": "https://www.compositesworld.com/news/the-new-slate-truck-costs-less-than-20000-uses-pp-composite-body-panels"
  }
]