[
  {
    "published": "Mon, 22 Sep 2025 00:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      22,
      4,
      0,
      0,
      0,
      265,
      0
    ],
    "title": "Introducing GROW: A full-funnel marketing solutions provider",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Introducing GROW: A full-funnel marketing solutions provider"
    },
    "summary": "GROW is the newly formed marketing services arm of Gardner Business Media. Offering custom content, marketing, creative, research&nbsp;and data services, GROW expands and builds on the company&rsquo;s deep first-party reach into the discrete parts manufacturing sector.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "GROW is the newly formed marketing services arm of Gardner Business Media. Offering custom content, marketing, creative, research&nbsp;and data services, GROW expands and builds on the company&rsquo;s deep first-party reach into the discrete parts manufacturing sector."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a href=\"https://www.gardnerweb.com/grow\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/AM/2025-AM/0925-am-growlogo.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gardner-business-media\" target=\"_blank\">Gardner Business Media</a> (GBM, Cincinnati, Ohio, U.S.), a leader in media and marketing solutions to industrial markets, has recently launched GROW, a full-funnel marketing services provider.</p>\n\n<p>GROW combines GBM&rsquo;s first-party audience network, industry-expert content creators, owned media brands (such as <em>CompositesWorld,</em>&nbsp;<a href=\"https://www.mmsonline.com/\" target=\"_blank\"><em>Modern Machine Shop</em></a>, <a href=\"https://www.compositesworld.com/\" target=\"_blank\"><em>CompositesWorld</em></a><em> </em>and <a href=\"https://www.ptonline.com/\" target=\"_blank\"><em>Plastics Technology</em></a>), and extensive data insights to help industrial manufacturing companies reach their brand and business goals.</p>\n\n<p>GROW is comprised of four pillars.<strong> GROW Performance</strong>, a campaign performance and audience insights platform, launched earlier this year with exclusive access for GBM clients. On the heels of GROW Performance&rsquo;s successful launch, GROW has expanded to include GROW Marketing, GROW Studio&nbsp;and GROW Intelligence.</p>\n\n<p>The <strong>GROW Marketing</strong> team takes an audience-first approach to crafting strategic marketing programs for clients that build brand, drive demand&nbsp;and connect businesses with qualified prospects.</p>\n\n<blockquote>\n<p>&ldquo;Our clients are getting more than campaign support, they&rsquo;re gaining access to trusted<strong> </strong>content, vetted audience reach&nbsp;and established media channels.&rdquo;</p>\n</blockquote>\n\n<p>To fuel those marketing programs, <strong>GROW Studio</strong>, an experienced team of industry writers, designers&nbsp;and videographers, works with clients to craft compelling original content.</p>\n\n<p><strong>GROW Intelligence</strong> (formerly Gardner Intelligence) offers custom research services to inform go-to-market strategies through brand affinity and market analysis studies. In addition, GROW Intelligence will continue to produce familiar studies including the <a href=\"https://www.gardnerintelligence.com/report/gbi\" target=\"_blank\">Gardner Business Index</a>, <a href=\"https://www.gardnerintelligence.com/report/world-machine-tool\" target=\"_blank\">World Machine Tool Survey</a>, <a href=\"https://www.gardnerintelligence.com/report/top-shops-benchmarking\" target=\"_blank\">Top Shops Benchmarking</a>&nbsp;and the <a href=\"https://www.gardnerweb.com/manufacturing-insights/ibi\" target=\"_blank\">Industrial Buying Influence Survey</a>.</p>\n\n<p>&ldquo;GBM&rsquo;s brands are proven leaders in providing media and marketing solutions in industrial markets. Building on that established success, GROW Marketing will deliver the same level of professional service and commitment GBM is known for,&rdquo; says Debi Williams, director of GROW marketing services. &ldquo;As a dedicated and informed marketing partner, we see ourselves as an extension of our clients&rsquo; marketing teams, offering strategic planning, creative services&nbsp;and campaign monitoring.&rdquo;</p>\n\n<p>&ldquo;Backed by the Gardner Industrial Network, our clients are getting more than campaign support, they&rsquo;re gaining access to trusted<strong> </strong>content, vetted audience reach&nbsp;and established media channels,&rdquo; says Rick Kline, Jr., president of GBM. &ldquo;We are uniquely positioned to understand both the position of our clients and the needs and interests of the industrial audience.&rdquo;</p>\n\n<p>For more information about GROW, visit <a href=\"https://www.gardnerweb.com/grow\" target=\"_blank\">gardnerweb.com/grow</a> or connect on <a href=\"https://www.linkedin.com/showcase/grow-industrial-marketing\" target=\"_blank\">LinkedIn</a>. For those existing GBM clients, login to your <a href=\"https://grow.gardnerweb.com/landing\" target=\"_blank\">GROW Performance dashboard</a> for campaign performance and audience insights.</p>\n\n<p><em>Gardner Business Media has been the premier publisher for the heart of manufacturing in North America since 1928,&nbsp;providing one-of-a-kind, relevant information of keen interest to the people who power plants, shops&nbsp;and factories.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/introducing-grow-a-full-funnel-marketing-solutions-provider-6"
      }
    ],
    "link": "https://www.compositesworld.com/news/introducing-grow-a-full-funnel-marketing-solutions-provider-6"
  },
  {
    "published": "Fri, 19 Sep 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      19,
      18,
      0,
      0,
      4,
      262,
      0
    ],
    "title": "Management team acquires Hexcel Neumarkt manufacturing site",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Management team acquires Hexcel Neumarkt manufacturing site"
    },
    "summary": "Paul Leitner and Manfred Bankhammer will secure the future of the industrial composites manufacturing site, providing stability and focused growth under new ownership.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Paul Leitner and Manfred Bankhammer will secure the future of the industrial composites manufacturing site, providing stability and focused growth under new ownership."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-hexcel-neumarket-site.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerial view of the Neumarkt site.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0925-cw-news-hexcel-neumarket-site.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Hexcel Corp.</p>\n</div>\n\n<p>In a strategic move to secure the future of the Neumarkt manufacturing site, long-standing management team members Paul Leitner and Manfred Bankhammer have signed an agreement to acquire the facility from <a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel</a> (Stamford, Conn., U.S.). The transaction is expected to be finalized upon completion of customary conditions</p>\n\n<p>&ldquo;This acquisition marks a significant milestone for us personally and for the entire Neumarkt team,&rdquo; says&nbsp;Bankhammer. &ldquo;We are proud to continue the legacy of excellence built over decades and look forward to deepening our relationships with customers in our core markets.&rdquo;</p>\n\n<p>Founded in 1947 and part of Hexcel since 1996, the Neumarkt site has been a cornerstone of the company&rsquo;s industrial composites production, manufacturing high-performance materials such as glass- and carbon fiber-reinforced epoxy prepregs, laminates and polyurethane formulations. These products serve a wide range of industries including wind energy, winter sports, marine and automotive.</p>\n\n<p>&ldquo;As new owners, our commitment remains unchanged,&rdquo; emphasizs&nbsp;Leitner. &ldquo;We will continue to deliver high quality, reliable service and on-time delivery &mdash;&nbsp;values that define our promise to customers and partners.&rdquo;</p>\n\n<p>The continuity of operations ensures stability for employees and customers alike, while opening new opportunities for focused growth and innovation under the new ownership. At the same time, Hexcel will continue to serve the industrial market and applications where it&nbsp;can leverage its premium aerospace-grade carbon fiber.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/management-team-acquires-hexcel-neumarkt-manufacturing-site"
      }
    ],
    "link": "https://www.compositesworld.com/news/management-team-acquires-hexcel-neumarkt-manufacturing-site"
  },
  {
    "published": "Fri, 19 Sep 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      19,
      17,
      0,
      0,
      4,
      262,
      0
    ],
    "title": "European Flax-Linen & Hemp expands technical capabilities with addition of Circular Structures",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "European Flax-Linen & Hemp expands technical capabilities with addition of Circular Structures"
    },
    "summary": "New member that includes Greenboats and Greenlander brands strengthens platform for advancing natural fiber composites across industries.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New member that includes Greenboats and Greenlander brands strengthens platform for advancing natural fiber composites across industries."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-europeanalliance-circularstructures.jpg\" target=\"_blank\"><img alt=\"Sherpa camper.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-europeanalliance-circularstructures.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Circular Structures</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://eucia.eu/\" target=\"_blank\">European Composites Industry Association</a>&nbsp;(EuCIA, Brussel, Belgium) welcomes <a href=\"https://www.circular-structures.com/\" target=\"_blank\">Circular Structures</a> (Germany), a&nbsp;Bremen-based platform for sustainable material development and product incubation, to its Technical Section. This addition further enhances the Alliance&rsquo;s mission to accelerate the industrial adoption of European-grown flax and hemp fibers in high-performance composite applications.</p>\n\n<p>Circular Structures, together with its brands Greenboats (marine) and Greenlander (mobility), joins a diverse and growing network of more than 25 members, including fiber&nbsp;growers, spinners, weavers, processors and solutions providers. Together, these partners span the entire value chain, from agriculture to advanced manufacturing, enabling a coordinated and scalable approach to sustainable material development.</p>\n\n<p>&ldquo;Circular Structures brings valuable expertise in engineering and real-world application of flax-based composites, with proven brand implementations such as Greenboats in marine and Greenlander in off-road mobility,&rdquo; says Bruno Pech, innovation project manager at the Alliance. &ldquo;Their addition reinforces the Alliance&rsquo;s technical depth and strengthens our collective ability to meet industrial performance standards while reducing environmental impact.&rdquo;</p>\n\n<p>The Alliance Technical Section serves as a collaborative platform where members share data, validate materials&nbsp;and align on technical goals to overcome barriers to adoption, including performance validation, supply chain integration&nbsp;and market education. Through Circular Structures, sustainable material incubation, panel production and open collaboration with third-party brands will contribute to these shared development efforts.</p>\n\n<p><em>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/articles/scaling-up-optimizing-the-flax-fiber-composite-camper\">Scaling up, optimizing the flax fiber composite camper</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/european-flax-linen-hemp-expands-technical-capabilities-with-addition-of-circular-structures"
      }
    ],
    "link": "https://www.compositesworld.com/news/european-flax-linen-hemp-expands-technical-capabilities-with-addition-of-circular-structures"
  },
  {
    "published": "Fri, 19 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      19,
      16,
      0,
      0,
      4,
      262,
      0
    ],
    "title": "California Polytechnic State takes first U.S. research payload leap on Dawn Aerospace Aurora",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "California Polytechnic State takes first U.S. research payload leap on Dawn Aerospace Aurora"
    },
    "summary": "Student-built payload successfully flew on the&nbsp;reusable commercial spaceplane&nbsp;in June, the&nbsp;first to fly aboard Aurora and a step toward more aerospace accessibility for universities.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Student-built payload successfully flew on the&nbsp;reusable commercial spaceplane&nbsp;in June, the&nbsp;first to fly aboard Aurora and a step toward more aerospace accessibility for universities."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-dawnaerospace-polytechnicstate-flight.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Completed mission.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-dawnaerospace-polytechnicstate-flight.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Dawn Aerospace</p>\n</div>\n\n<p><a href=\"https://www.dawnaerospace.com/\" target=\"_blank\">Dawn Aerospace</a>&nbsp;(ChristChurch, New Zealand) successfully flew its <em>Aurora</em> spaceplace&nbsp;carrying <a href=\"https://www.calpoly.edu/\" target=\"_blank\">California Polytechnic State University</a>&rsquo;s (Cal Poly) student-built payload, reaching Mach 0.79 and an altitude of 37,000 feet.&nbsp;</p>\n\n<p>This June 24<sup>th</sup> flight &mdash; <em>Aurora</em>&rsquo;s first from Dawn&rsquo;s newly operational launch facility at Tāwhaki National Aerospace Centre &mdash; carried Cal Poly&rsquo;s payload, making it the first U.S. student-built experiment to fly aboard <em>Aurora</em> and marking a major milestone for university-led research in reusable spaceplane development.&nbsp;</p>\n\n<p>&ldquo;This mission is putting student-built hardware on the frontlines of aerospace innovation,&rdquo; says&nbsp;Dr. Kurt Colvin, Cal Poly professor and payload advisor. &ldquo;Working with a next-gen spaceplane like <em>Aurora</em> gave our team firsthand experience integrating a payload for a reusable commercial spaceplane &mdash; a paradigm shift from traditional expendable rocket launches.&rdquo;</p>\n\n<p>Cal Poly&rsquo;s payload was designed to test whether student-built hardware could withstand the rigors of&nbsp; high-altitude, spaceflight-like environments. Using a modified data system from Bolder Flight Systems (Minneapolis, Minn., U.S.), the mission focused on proving that the team could build and operate a payload ready to integrate with a commercial spaceplane. Just as importantly, it served as a training mission &mdash; giving students hands-on experience and laying the groundwork for future Cal Poly launches from the upcoming Paso Robles, California Spaceport.</p>\n\n<p><em>Aurora</em>&rsquo;s horizontal launch architecture &mdash; taking off and landing like a conventional aircraft &mdash; offers benefits for academic institutions include rapid, reusable operations; reduced infrastructure costs; and expanded university access through commercial partnership.</p>\n\n<div style=\"text-align: center;\"></div>\n\n<p>This mission builds on Dawn&rsquo;s recently announced partnership with the State of Oklahoma and the Department of Aerospace and Aeronautics (formerly Oklahoma Space Industry Development Authority), to bring the <em>Aurora</em> spaceplane to the Oklahoma Air &amp; Space Port in Burns Flat &mdash; operations set to begin with first flights in 2027. This collaboration underscores a leap forward in scaling reusable suborbital spaceflight across the U.S.&nbsp;with operations at the Oklahoma Air &amp; Space Port set to extend <em>Aurora</em>&rsquo;s flight profile to 100 kilometers. By teaming with Cal Poly, Dawn says it is demonstrating how academic institutions can help lead this transformation while highlighting the opportunity for U.S. research units to leverage Oklahoma&rsquo;s forward‑looking spaceport as a national hub for innovation and direct access to space.</p>\n\n<p>&ldquo;<em>Aurora</em> is the perfect tool for students to not only learn the theories of aerospace, but also design, build, qualify&nbsp;and operate in the real world,&rdquo; says James Powell, spaceplane&nbsp;chief engineer and co-founder. &ldquo;Because we recover the payload, customers gain deeper insight into performance and can more easily modify and upgrade for future flights.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/california-polytechnic-state-takes-first-us-research-payload-leap-on-dawn-aerospace-aurora"
      }
    ],
    "link": "https://www.compositesworld.com/news/california-polytechnic-state-takes-first-us-research-payload-leap-on-dawn-aerospace-aurora"
  },
  {
    "published": "Fri, 19 Sep 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      19,
      15,
      0,
      0,
      4,
      262,
      0
    ],
    "title": "BIOS MATER project to drive safe, circular and low-carbon construction",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "BIOS MATER project to drive safe, circular and low-carbon construction"
    },
    "summary": "Four bio-based products testing materials like&nbsp;bio-based thermoplastics and fiber-reinforced bio-resin composites&nbsp;will be developed and tested under real conditions to prove their performance, scalability and environmental impact.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Four bio-based products testing materials like&nbsp;bio-based thermoplastics and fiber-reinforced bio-resin composites&nbsp;will be developed and tested under real conditions to prove their performance, scalability and environmental impact."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bios-mater-consortium.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"BIO MATERs consortium group.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bios-mater-consortium.jpg;maxWidth=720\" /> </a></div>\n\n<p>BIO MATERs consortium. Source | Aimplas</p>\n</div>\n\n<p>A European consortium led by the <a href=\"https://www.fcirce.es/en\" target=\"_blank\">Circe</a>&nbsp;(Zaragoza, Spain) research center&nbsp;has officially launched <a href=\"https://www.cbe.europa.eu/projects/bios-mater\" target=\"_blank\">BIOS MATER</a>, a Horizon Europe project co-funded by the Circular Bio-Based Europe Joint Undertaking (CBE JU) and the European Union (EU). The initiative, running from June 2025 to May 2029&nbsp;aims to transform the construction sector by introducing advanced bio-based materials, applying circular economy principles&nbsp;and implementing safe-and-sustainable-by design (SSbD) solutions to ensure health, safety&nbsp;and environmental responsibility throughout the building life cycle.</p>\n\n<p>The project brings together 22 partners from 10 countries, including&nbsp;<a href=\"https://www.aimplas.net/\" target=\"_blank\">Aimplas</a>, the Plastics Technology Centre&nbsp;(Valencia, Spain), which contributes its expertise in polymer-based solutions that minimize the environmental impact and improve energy efficiency in the construction industry. United by a shared commitment to innovation and sustainability, the BIOS MATER consortium integrates research institutions, SMEs, large industry players&nbsp;and policy stakeholders to develop high-performance building products derived from renewable resources, paving the way for safer, low-carbon&nbsp;and scalable construction practices across Europe.</p>\n\n<p>BIOS MATER responds to the urgent need for change in a sector that accounts for approximately 37% of global CO<sub>₂</sub> emissions. By reimagining conventional materials, the project will deliver bio-based alternatives that match or exceed current standards in durability, safety&nbsp;and performance. Through a holistic and innovation-driven approach, BIOS MATER will integrate circular economy strategies to reduce waste and promote market adoption, supported by digital transparency and active stakeholder engagement.</p>\n\n<p>A central focus of the project is the development of four bio-based construction products:</p>\n\n<ul>\n\t<li>Sandwich panels for flooring, interior paneling and furniture</li>\n\t<li>Wall panels and flooring tiles made from bio-based thermoplastics</li>\n\t<li>Exterior cladding panels using fiber-reinforced bio-resin composites</li>\n\t<li>Biodegradable, plantable tiles from bio-based foams for interior drywalls.&nbsp;</li>\n</ul>\n\n<p>These solutions will be tested under real-world conditions in a dedicated demonstration park (DEMOpark), designed to showcase their performance, scalability&nbsp;and environmental benefits in practical applications.</p>\n\n<p>&ldquo;This is an exciting opportunity to rethink the foundations of our built environment,&rdquo; says Carlos P&eacute;rez, project coordinator at Circe. &ldquo;It is truly inspiring to see partners from all over Europe working toward&nbsp;the same goal: decarbonizing&nbsp;the construction sector. The diversity and expertise within the BIOS MATER consortium empower us to create innovations that are both sustainable and practical for the market. I am eager to see these actions being accomplished.&rdquo;</p>\n\n<p>BIOS MATER directly supports the European Green Deal, the EU&rsquo;s Circular Economy Action Plan&nbsp;and climate neutrality goals.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/bios-mater-project-to-drive-safe-circular-and-low-carbon-construction"
      }
    ],
    "link": "https://www.compositesworld.com/news/bios-mater-project-to-drive-safe-circular-and-low-carbon-construction"
  },
  {
    "published": "Thu, 18 Sep 2025 00:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      18,
      4,
      0,
      0,
      3,
      261,
      0
    ],
    "title": "Altair 2025 Enlighten Award winners, runner-ups push automotive boundaries",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Altair 2025 Enlighten Award winners, runner-ups push automotive boundaries"
    },
    "summary": "Hemp nylon-reinforced PA6 automotive exteriors, TPC acoustic elements, glass fiber stator cooling design and other innovations are recognized for their sustainability focus, holistic capabilities and lightweight designs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Hemp nylon-reinforced PA6 automotive exteriors, TPC acoustic elements, glass fiber stator cooling design and other innovations are recognized for their sustainability focus, holistic capabilities and lightweight designs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-altair-enlighten2025-winners.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Collage of Altair winning technologies for 2025.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-altair-enlighten2025-winners.jpg;maxWidth=720\" /> </a></div>\n\n<p>Altair 2025 Enlighten Award winners. Source | Altair</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/altair-engineering\" target=\"_blank\">Altair Engineering Inc.</a> (Troy, Mich., U.S.) has named the winners of the 2025 Altair Enlighten Award. Presented in association with the <a href=\"https://www.cargroup.org/\" target=\"_blank\">Center for Automotive Research</a> (CAR, Ann Arbor, Mich., U.S.), the award honors sustainability and lightweighting advancements that successfully reduce carbon footprint, mitigate water and energy consumption, and leverage material reuse and recycling efforts.</p>\n\n<p>&ldquo;In a rapidly transforming automotive landscape, organizations must continuously push the boundaries of sustainability innovation. Throughout its 13-year history, the Enlighten Award remains the premier honor showcasing the automotive industry&rsquo;s groundbreaking achievements in sustainable technology,&rdquo; says&nbsp;Sam Mahalingam, CTO of&nbsp;Altair. &ldquo;We are proud to once again celebrate the organizations driving a more sustainable future.&rdquo;</p>\n\n<p>The Enlighten Award winners were&nbsp;announced in an awards ceremony at the CAR Management Briefing Seminars in Detroit, Michigan, on Sept. 16, 2025. What follows is the&nbsp;complete list of all winning organizations, runners-up&nbsp;and honorable mentions.</p>\n\n<blockquote>\n<p>See Altair&rsquo;s <a href=\"https://www.compositesworld.com/news/altair-announces-12th-annual-enlighten-award-winners\" target=\"_blank\">2024 Enlighten Award winners here</a>.</p>\n</blockquote>\n\n<h3><strong>Future of Lightweighting</strong></h3>\n\n<p><strong>Winner:</strong> <a href=\"https://www.vortex-cae.com/\" target=\"_blank\">Vortex CAE &ndash;&nbsp;Enlighten</a> (Leicestershire, U.K.):&nbsp;<em>A Novel Holistic Topometry Based Optimizer for the Design of Lightweight Crash Structures</em></p>\n\n<p>Vortex CAE&rsquo;s new solver offers direct crash and impact optimizations using full fidelity models. The outputs produce holistic and pre-validated CAE solutions. Additionally, the company developed a computationally efficient 3D generative-design methodology to identify and size fundamental structural features early on. A generative design case study cut 77% from the body-in-white (BIW) mass while meeting or exceeding structural performance in 13 primary crash load cases. Assuming a 50% mass-retention loss, Vortex CAE<strong>&nbsp;</strong>estimate that $500 million in raw material costs for this vehicle could have been saved, along with 1.35 million tons of C0<sub>2</sub> from manufacturing alone.<strong> </strong></p>\n\n<p><em>Editor&rsquo;s note: This</em>&nbsp;<em>technology works with composite materials, however the wing innovation description above highlights a steel structure.</em></p>\n\n<p><strong>Runner-Up:</strong> <a href=\"https://www.magna.com/\" target=\"_blank\">Magna International</a><em> </em>(Aurora, Canada):<em>&nbsp;Hemp-PA6 Composite Roof Rack Inner </em></p>\n\n<p>Magna successfully demonstrated the use of hemp nylon (PA6) in automotive exteriors, enhancing sustainability. The sustainable material replaces talc in traditional nylon resin and was developed in collaboration with BASF and Heartland. The lightweight, renewable material absorbs CO<sub>₂</sub> during growth, supports decarbonization&nbsp;and delivers performance and processing equivalent to the original resin, marking a major advancement in the use of natural fibers for automotive applications.</p>\n\n<h3>Enabling Technology</h3>\n\n<p><strong>Winner:&nbsp;</strong><a href=\"https://compositeedge.de/en/home-en/\" target=\"_blank\">CompositeEdge GmbH</a>&nbsp;(Braunschweig, Germany) and <a href=\"https://www.atamute.com/\" target=\"_blank\">ATA Mute B.V.</a> (Eindhoven, Netherlands): <em>Adaptive Ultra-Thin Noise Solution</em></p>\n\n<p>CompositeEdge GmbH and ATA Mute B.V. have developed an acoustic element under 1 millimeter thick that offers up to 97% sound absorption, particularly at low frequencies where conventional materials are less effective.&nbsp;It is waterproof, fire-resistant&nbsp;and fully recyclable, produced without adhesives from natural, carbon&nbsp;or glass fibers combined with thermoplastics. The material maintains its performance in humid and high-temperature environments and is suitable for a wide range of applications such as cars, heat pumps&nbsp;and interior facades.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong><a href=\"https://lucidmotors.com/\" target=\"_blank\">Lucid Motors</a> (Newark, Calif., U.S.): Modal Transient Analysis-Based Durability CAE Workflow</p>\n\n<p>Lucid Motors, in collaboration with the Altair&nbsp;OptiStruct&nbsp;development team, developed and implemented a seamless durability CAE workflow that progressed from MBD-based vehicle dynamics simulation to FEM-based strength, stiffness and fatigue analysis, and ultimately to structural optimization. The workflow could be applied to a wide range of components, including the BIW, subframes, battery pack, suspension components, powertrain&nbsp;and closures, using a global-local analysis approach for detailed local assessments with refined meshing.</p>\n\n<p><strong>Honorable Mention: </strong><a href=\"https://group.mercedes-benz.com/company/business-units/mercedes-benz-cars/\" target=\"_blank\">Mercedes-Benz AG</a>&nbsp;(Stuttgart, Germany) and <a href=\"https://www.mbrdi.co.in/\" target=\"_blank\">Mercedes-Benze Research and Development India Private Ltd.</a>&nbsp;(Karnataka):&nbsp;<em>An Automated Sustainable Process for Generating Superelements</em></p>\n\n<p>This fully automated process streamlines setup to just 15 minutes for complex parts, eliminates user errors&nbsp;and requires no manual intervention. This innovation enables agile, iterative optimizations with fast design feedback, while cutting computational demands,&nbsp;achieving more than&nbsp;90% runtime reduction, lower hardware utilization&nbsp;and more efficient resource use.</p>\n\n<h3><strong>Module Lightweighting</strong></h3>\n\n<p><strong>Winner:&nbsp;</strong><a href=\"https://www.compositesworld.com/suppliers/solvay-composite-materials\" target=\"_blank\">Syensqo</a> (Brussels, Belgium) and <a href=\"https://global.geely.com/\" target=\"_blank\">Geely Global</a> (Hangzhou, China):&nbsp;<em>Amodel PPA Stator Cooling Systems&nbsp;</em></p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Syensqo and Geely technology and blurb.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-altair-2025-syensqo-geely.jpg;maxWidth=385\" /></div>\n</div>\n\n<p>Geely improved e-motor efficiency with an innovative stator cooling design using Syensqo&rsquo;s&nbsp;short glass fiber Amodel&nbsp;PPA, achieving 47% weight and 36% cost savings versus metal. The metal-to-plastic conversion reduces weight, enables part integration&nbsp;and streamlines high-volume assembly through injection molding, laser welding&nbsp;and snap fits. Highly resistant to automotive fluids, Amodel&nbsp;PPA retains nearly 70% burst pressure resistance after 2,000 hours of aging at 150℃ ATF, ensuring safety&nbsp;and reliability. This design achieves precise lubrication with lower oil pump power consumption, effectively reducing the risk of overheating spots.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong><a href=\"https://www.aam.com/\" target=\"_blank\">American Axle &amp; Manufacturing</a> (AAM, Detroit, Mich., U.S.):&nbsp;<em>Modular Lightweight Axle Housing Innovation</em></p>\n\n<p>AAM&rsquo;s modular lightweight axle housing innovation replaced two-axle configurations with a single&nbsp;modular design, cutting complexity and cost. Delivering up to 10% mass reduction, around 1.3 million pounds annually across 145,000 units, the design was optimized using Altair&rsquo;s Multi-Model Optimization to balance weight and strength. Fully compatible with existing assembly lines and preserving back-serviceability, the solution reduces fuel consumption and emissions through material efficiency and streamlined logistics.</p>\n\n<h3>Sustainable Computing</h3>\n\n<p><strong>Winner:&nbsp;</strong>Lucid Motors:&nbsp;<em>Design-Driven Structural Assessment To Enable Accelerated Product Development</em></p>\n\n<p>Lucid Motors&rsquo; Design-Driven Structural Assessment approach accelerates product development using Altair SimSolid&rsquo;s meshless solver. Engineers can run rapid design iterations directly within their CAD environment, eliminating the need for complex meshing or switching tools. The highly customizable workflow streamlines setup and empowers teams to optimize designs with greater speed and ease.</p>\n\n<p><strong>Runner-Up:</strong><em> </em>Mercedes-Benz AG &amp; Mercedes-Benz Research and Development India Private Ltd.: <em>An Automated Sustainable Process for Generating Superelements&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </em></p>\n\n<p>This fully automated process streamlines setup to just 15 minutes for complex parts, eliminates user errors and requires no manual intervention. The innovation enables agile, iterative optimizations with fast design feedback, while cutting computational demands &mdash; achieving more than&nbsp;90% runtime reduction, lower hardware utilization&nbsp;and more efficient resource use.</p>\n\n<h3><strong>Sustainable Process</strong></h3>\n\n<p><strong>Winner:</strong> <a href=\"https://www.marelli.com/en.html\" target=\"_blank\">Marelli</a> (Lombardy, Italy):&nbsp;<em>Adhesive Wastewater Recovery Solution</em></p>\n\n<p>Marelli implemented a cleaning process for adhesive manufacturing equipment, such as robots and spray guns, used in bonding topcoat skins to substrates for cut, sew&nbsp;and wrap parts. By using a three-part chemical agent, the process separates adhesive waste from the cleaning water, enabling recovery and reuse of approximately 85% of adhesive wastewater. This process reduced the plant&rsquo;s water consumption by 8,160 kilograms annually, with the recovered non-potable water able to be reused within manufacturing operations.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong><a href=\"https://www.dicastal.com/en/\" target=\"_blank\">CITIC Dicastal Co. Ltd.</a> (Qin Huangdao City, He Bei Province, China):&nbsp;<em>Key Technology for Integrated Forming of Large Aluminum Alloy Structural Components</em></p>\n\n<p>This innovation consolidates 98 parts into a single component, reducing weight by 30% and lowering both cycle time and cost. It marks the first application of a non-heat-treated Al-Mg alloy in commercial vehicle structures. A closed-loop thermal balance system ensures consistent forming quality, while rapid process simulation and C123 variable cross-section design optimize material use and accelerate the design-to-validation cycle.</p>\n\n<h3>Sustainable Product</h3>\n\n<p><strong>Winner:&nbsp;</strong><a href=\"https://www.nio.com/\" target=\"_blank\">Nio Inc.</a>&nbsp;(Shanghai, China) and <a href=\"https://www.akzonobel.com/en\" target=\"_blank\">AkzoNobel</a>&nbsp;(Amsterdam, Netherlands):&nbsp;<em>Bottom Plate&nbsp;Coating for Battery Pack to Improve Lifespan During Battery Swap for Electrical Vehicles</em></p>\n\n<p>Nio&nbsp;and AkzoNobel extended the lifespan of the bottom plate coating from 5 to 15 years while reducing coating thickness by 90%, cutting vehicle weight by 2.2 kilograms&nbsp;and developing powder coating technology for electric vehicles (EVs). The innovation replaced non-recyclable materials with recyclable alternatives, eliminated volatile organic compound (VOC) emissions,&nbsp;and improved coating efficiency by 55%,&nbsp;delivering significant sustainability benefits. Established through a unique carmaker Tier 5 partnership, this scalable solution enhanced cost and efficiency across Tiers 1 to 3 and has been mass-produced since November 2024, applied widely on Nio, Onvo and Firefly EV models.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong><a href=\"https://www.cheryinternational.com/\" target=\"_blank\">Chery Automobile Co. Ltd.</a>&nbsp;(Wuhu, China):&nbsp;<em>Answering Earth with Low-Carbon Recycled Aluminum</em></p>\n\n<p>Chery Automobile&rsquo;s low-carbon aluminum initiative uses 100% recycled aluminum in a closed-loop system with more than 99% impurity removal and employs heat-treatment-free integrated die-casting, cutting manufacturing energy by up to 95%. Achieving over 80% reduction in raw-material carbon emissions, it meets global low-carbon standards while maintaining strength and safety, and fosters collaborative ecosystems for scalable green manufacturing.</p>\n\n<h3>Responsible AI</h3>\n\n<p><strong>Winner:</strong> Lucid Motors:<em> Predicting Crash Modes with Altair&nbsp;PhysicsAI</em></p>\n\n<p>Lucid Motors transformed crash CAE by applying AI-driven insights to predict complex, non-linear deformation behaviors under realistic off-axis and oblique impact scenarios. By integrating Altair PhysicsAI with LS-DYNA, the company trained surrogate models to classify crash modes, such as axial crush and bending, well before physical testing. This approach reduced design iterations, minimizing prototype reliance&nbsp;and accelerating delivery of lightweight, crash-robust structures with high safety confidence. This scalable methodology was applied across multiple crash-critical components and contributed to sustainability by minimizing material use, reducing test waste and supporting corporate decarbonization goals.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong>Lucid Motors:&nbsp;<em>Agentic AI for Engineering Automation</em></p>\n\n<p>Lucid Motors automated CAD data retrieval, custom script execution, analysis&nbsp;and reporting by implementing AI-driven natural language support, which eliminated the need to learn each individual tool. By simply stating broad concepts, the AI handled intricate details and seamlessly chained multiple applications, allowing data to flow automatically through the workflow pipeline. This approach enabled instant execution of ideas without waiting for manual intervention and avoided complex API use by automating interactions directly through the GUI.</p>\n\n<div class=\"article_sidebar\">\n<p>Partners for the 2025 Enlighten Award include Auto Bild Japan, Autocar Professional, Automobil Industrie, Auto Messe Web, Auto Messe Web Worldwide, CAR, Google Cloud, Korean Society of Automotive Engineers (KSAE), SAE Automotive Engineering and Tech Briefs.</p>\n\n<p>For more information about the Enlighten Award, visit <a href=\"http://www.altair.com/enlighten-award\" target=\"_blank\">www.altair.com/enlighten-award</a>.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/altair-2025-enlighten-award-winners-runner-ups-push-automotive-boundaries"
      }
    ],
    "link": "https://www.compositesworld.com/news/altair-2025-enlighten-award-winners-runner-ups-push-automotive-boundaries"
  },
  {
    "published": "Wed, 17 Sep 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      16,
      30,
      0,
      2,
      260,
      0
    ],
    "title": "Guanglian Aviation achieves milestone in carbon fiber circular chains development",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Guanglian Aviation achieves milestone in carbon fiber circular chains development"
    },
    "summary": "Following six years of R&amp;D, Guanglian Aviation has introduced circular chains made from carbon fiber and Kevlar that weigh 4-5X less than metal chains, offer 15-year saltwater corrosion resistance, and are poised for large-scale applications in marine engineering, mining&nbsp;and defense.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Following six years of R&amp;D, Guanglian Aviation has introduced circular chains made from carbon fiber and Kevlar that weigh 4-5X less than metal chains, offer 15-year saltwater corrosion resistance, and are poised for large-scale applications in marine engineering, mining&nbsp;and defense."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Carbon fiber circular chains.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-guanglian-carbon-fiber-chains.png;maxWidth=720\" /> </div>\n\n<p>Carbon fiber chains. Source (All Images) | Guanglian Aviation Industry Co. Ltd.</p>\n</div>\n\n<p>Since 2019,&nbsp;<a href=\"https://www.glavi.cn/%5d\" target=\"_blank\">Guanglian Aviation Industry Co. Ltd.</a>&rsquo;s<strong> </strong>scientific and technological innovation center for composite material forming, based in Heilongjiang Province, China, has researched and developed carbon fiber circular chains. Six years of continuous effort has led to the company&rsquo;s recent milestones.</p>\n\n<p>Circular chains made of carbon fiber are particularly suitable for (1) marine engineering (floating platform mooring chains), (2) shipbuilding (ultra-long anchor chains), (3) mineral mining (compact chains for scraper conveyors) and (4) deep sea buoy anchor chains or FPSO tanker mooring chains.</p>\n\n<p>Traditional industrial circular chains mainly use metal alloy steel materials, which have three disadvantages. First, its&nbsp;specific strength is relatively low compared to carbon fiber materials. This means that as the length of the chain increases, its own weight (self weight) will rapidly increase. For any circular chain of wire diameter specification, when the chain length exceeds the limit (usually 2,200 meters), the tension (i.e., the self weight of the entire chain) borne by the top link will exceed the break load of the link itself, causing the chain to break due to its own weight.</p>\n\n<p>A second disadvantage of the metal is its poor weather resistance and salt corrosion resistance. After applying inert anti-corrosion paint on the outer surface of the circular chain, service life can reach 6-8 years. If anti-corrosion treatment is not carried out, the service life may only be 2-4 years. In general, metal circular chains are not easily used in marine engineering or humid mining industries.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-guanglian-carbon-fiber-chains-testing.jpg\" target=\"_blank\"><img alt=\"Chains testing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-guanglian-carbon-fiber-chains-testing.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>Also, when high loads and high-frequency stresses are applied to the circular chain, metal creep is easily generated, causing deformation and instability failure. The lightweight, high-strength, inert anti-corrosion, high damage impedance, high fatigue resistance&nbsp;and bullet damage tolerance&nbsp;properties of carbon fiber can compensate for the shortcomings of these&nbsp;metal materials.</p>\n\n<p>Guanglian Aviation&rsquo;s&nbsp;innovation comprises carbon fiber and Kevlar, which are cured under high temperature and high pressure. These circular chains have lightweight, high-strength and inert anti-corrosion properties. The composite version can reach five times the length of metal chains when reaching the same weight; alternatively, the weight of the same length can be reduced by four to five times. The application prospects of ship anchor chains are broad.</p>\n\n<p>Additional challenges that the company has addressed include:</p>\n\n<ul>\n\t<li>Difficulties in forming complementary interference rings</li>\n\t<li>Tensile strength exceeds that of metals of the same size</li>\n\t<li>Mechanized and automated mass production line</li>\n\t<li>Cost control of fiber-reinforced materials.</li>\n</ul>\n\n<p>The company&rsquo;s carbon fiber circular chain has passed testing by a third-party authoritative organization, and has the same wire diameter compared to&nbsp;equal volume metal ring chains with international standards (ISO 20438). According to the comparative test report, it was found that the fracture load of these composite circular chains exceeded 1.75 times that of metals; they can resist seawater salt corrosion for 15 years; and they have a high-frequency fatigue load resistance 60,000 times that of metals (400 cycles/minute).</p>\n\n<p>After successively overcoming key technologies related to this product, Guanglian Aviation Industry Co.&nbsp;Ltd. has initiated its industrial application while simultaneously developing mechanized production lines to ensure product consistency and increase production capacity. Currently,&nbsp;planned areas for industrial application include the following aspects:</p>\n\n<p><strong>Ultra-long anchor chains exceeding 2,000 meters. </strong>The anchor chains of the U.S. Nimitz-class nuclear-powered aircraft carriers are more than&nbsp;1,500 meters long, while those of other aircraft carriers are approximately 470 meters. The length of anchor chains enhances the mooring area and reduces mooring time for vessels, thereby decreasing the energy consumption of ship dynamic positioning systems (DPS).</p>\n\n<p><strong>Providing mooring chains for floating semi-submersible platforms.</strong> Current solutions for floating drilling rigs, floating wind power,&nbsp;and deep-sea aquaculture often adopt a steel anchor chain plus&nbsp;polyester rope configuration. There is a need to reduce mooring costs.</p>\n\n<p>Due to the low specific strength of metal, when the length of the scraper conveyor exceeds 380 meters, the effective transportation capacity drops below 50% as a result of the compact chain&rsquo;s self-weight. Thanks to its high specific strength, carbon fiber compact chains can increase their length by 4.5 times under the same total weight, while offering corrosion resistance and fatigue resistance. Alternatively, at the same length, the self-weight can be reduced by three-quarters, significantly increasing the effective payload.</p>\n\n<p>Moreover, carbon fiber&rsquo;s&nbsp;curing temperature (180&deg;C) is&nbsp;far lower than that of metal (1200&deg;C). This allows chips to be embedded during the carbon fiber forming process to provide pre-failure warnings for the compact chain.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/guanglian-aviation-achieves-milestone-in-carbon-fiber-circular-chains-development"
      }
    ],
    "link": "https://www.compositesworld.com/news/guanglian-aviation-achieves-milestone-in-carbon-fiber-circular-chains-development"
  },
  {
    "published": "Wed, 17 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      16,
      0,
      0,
      2,
      260,
      0
    ],
    "title": "Altair, NIAR sign MOU to build aerospace innovation space",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Altair, NIAR sign MOU to build aerospace innovation space"
    },
    "summary": "Collaboration will expand digital twin adoption, empower aerospace startups and speed up product development and certification processes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaboration will expand digital twin adoption, empower aerospace startups and speed up product development and certification processes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-niar-altair.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-niar-altair.jpg;maxWidth=385\" /></a></div>\n\n<p>Wichita State University. Source | WSU NIAR</p>\n</div>\n\n<p>Computational intelligence company <a href=\"https://www.compositesworld.com/suppliers/altair-engineering\" target=\"_blank\">Altair</a> (Troy, Mich., U.S.) and aerospace research institution&nbsp;<a href=\"https://www.compositesworld.com/suppliers/national-institute-for-aviation-research\" target=\"_blank\">National Institute for Aviation Research</a> (NIAR) at Wichita State University (WSU, Kan., U.S.) have signed a memorandum of understanding (MOU)&nbsp;to advance innovation across the aerospace and defense industries.</p>\n\n<p>According to&nbsp;Pietro Cervellera, senior vice president of aerospace and defense at Altair, the partnership will enable new opportunities for bringing &ldquo;cutting-edge&nbsp;technology to the industry. By combining our expertise, we&rsquo;re helping companies and startups innovate faster, reduce costs&nbsp;and bring products to market more sustainably.&rdquo; The partnership focuses on three main areas:</p>\n\n<p><strong>Bringing digital twin technology to industry.</strong>&nbsp;Combining NIAR&rsquo;s certification by analysis (CBA) methodologies with Altair&rsquo;s simulation and data analytics tools, companies can design, test&nbsp;and optimize aircraft, drones and advanced air mobility vehicles faster and more efficiently, reducing the need for costly physical testing.</p>\n\n<p><strong>Supporting startups.</strong>&nbsp;Aerospace and defense startups working with NIAR and WSU will gain privileged access to Altair&rsquo;s platforms and training to accelerate their product development, testing, certification&nbsp;and production processes.</p>\n\n<p><strong>Exploring new applications.</strong>&nbsp;The collaboration will explore how digital twins and Altair technology can support broader applications, including maintenance, additive manufacturing, robotics&nbsp;and defense systems.</p>\n\n<p>&ldquo;This agreement with Altair provides our students, researchers and clients with access to tools and expertise that will help accelerate development to support the next generation of aerospace technology and innovation,&rdquo; says John Tomblin, WSU executive vice president for research and industry and defense programs and NIAR executive director.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/altair-niar-sign-mou-to-build-aerospace-innovation-pace"
      }
    ],
    "link": "https://www.compositesworld.com/news/altair-niar-sign-mou-to-build-aerospace-innovation-pace"
  },
  {
    "published": "Wed, 17 Sep 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      15,
      0,
      0,
      2,
      260,
      0
    ],
    "title": "Natural fibers power Cupra’s vision for sustainable mobility",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Natural fibers power Cupra’s vision for sustainable mobility"
    },
    "summary": "Cupra&rsquo;s latest concept vehicle, Tindaya, demonstrates Bcomp&nbsp;ampliTex through&nbsp;both visible interior and semi-structural parts.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Cupra&rsquo;s latest concept vehicle, Tindaya, demonstrates Bcomp&nbsp;ampliTex through&nbsp;both visible interior and semi-structural parts."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bcomp-cupra-tindaya1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Cupra Tindaya interior and exterior shots.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bcomp-cupra-tindaya1.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Cupra</p>\n</div>\n\n<p>Swiss cleantech company <a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a>&nbsp;(Fribourg), through its 3-year&nbsp;collaboration with e-hybrid and electric car brand <a href=\"https://www.cupraofficial.com/\" target=\"_blank\">Cupra</a>&nbsp;(Martorell, Spain), demonstrates the performance, circularity and increasing adoption of flax fiber concepts into mass production models&nbsp;via the Tindaya concept car.&nbsp;</p>\n\n<p>Both interior and exterior parts and structures feature ampliTex Twill 2/2, from Cupra&rsquo;s characteristic Cup bucket seats to the car&rsquo;s exterior bumper. Working&nbsp;closely with Cupra&rsquo;s Colour, Materials, Finish (CMF) and interior and exterior designers, Bcomp&rsquo;s team developed a custom copper color finish, echoing Cupra&rsquo;s&nbsp;signature aesthetic&nbsp;while its raw form connects with the materials and textures of the brand&rsquo;s visual identity.</p>\n\n<p>The adoption of this bio-based material for visible interior and semi-structural parts is expected to accelerate due to the decarbonization plans of OEMs and governing bodies&rsquo; regulatory pressure.&nbsp;</p>\n\n<p>&ldquo;For Cupra, sustainability goes beyond simply swapping internal combustion engines for battery-powered engines,&rdquo; says&nbsp;Nicolas Samson, sales manager at Bcomp.&nbsp;&ldquo;Tindaya is a proof that responsible design choices don&rsquo;t have to compromise on performance or aesthetics. With collaborators like Cupra, we&rsquo;re bringing these sustainable materials to a wider market.&rdquo;</p>\n\n<p><em>For related content, read, &ldquo;<a href=\"https://www.compositesworld.com/news/bcomp-amplitex-makes-appearance-in-cupra-ev-cup-bucket-seats\">Bcomp ampliTex makes appearance in Cupra EV Cup Bucket seats</a>&rdquo; and &ldquo;<a href=\"https://www.compositesworld.com/news/bcomp-natural-fiber-composites-to-be-used-in-future-bmw-group-production-cars\">Bcomp natural fiber composites to be used in future BMW Group production cars</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/natural-fibers-power-cupras-vision-for-sustainable-mobility"
      }
    ],
    "link": "https://www.compositesworld.com/news/natural-fibers-power-cupras-vision-for-sustainable-mobility"
  },
  {
    "published": "Wed, 17 Sep 2025 10:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      14,
      30,
      0,
      2,
      260,
      0
    ],
    "title": "Brembo SGL Carbon Ceramic Brakes expands disc production capacity by 50%",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Brembo SGL Carbon Ceramic Brakes expands disc production capacity by 50%"
    },
    "summary": "The 50/50 joint venture adds a combined 12,500 square meters of space at Italy&nbsp;and Germany sites, future-proofing carbon-ceramic disc production for premium cars, commercial vehicles.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The 50/50 joint venture adds a combined 12,500 square meters of space at Italy&nbsp;and Germany sites, future-proofing carbon-ceramic disc production for premium cars, commercial vehicles."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bsccb-brake-production-expansion.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bsccb-brake-production-expansion.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;Brembo SGL Carbon Ceramic Brakes (BSCCB)</p>\n</div>\n\n<p>After months of intensive planning and implementation, <a href=\"https://www.carbonceramicbrakes.com/\" target=\"_blank\">Brembo SGL Carbon Ceramic Brakes</a> (BSCCB) &mdash; a 50/50 joint venture between <a href=\"https://www.brembo.com/en\" target=\"_blank\">Brembo N.V.</a> and <a href=\"https://www.compositesworld.com/suppliers/sgl-carbon-se\" target=\"_blank\">SGL Carbon SE</a>&nbsp;&mdash;&nbsp; has successfully completed the expansion of its production capacities in Stezzano (Bergamo), Italy and Meitingen, Germany. The investments made have increased production capacity by around 50%. This extensive expansion enables BSCCB to meet the growing demand and increasing requirements of its automotive customers, particularly in the premium and luxury segments, where high brake performance is required.</p>\n\n<p>At the SGL Carbon site in Meitingen, two new production halls with a total area of around 8,500 square meters&nbsp;were constructed in just 14 months. At the Stezzano (Bergamo) site, production areas in the existing buildings were expanded by around 4,000 square meters. At both sites, production facilities with numerous modern systems were installed in a short period of time, enabling high-performance and efficient production. The entire process chain, from forming and machining to assembly, was expanded and optimized.</p>\n\n<p>The investments made will contribute to increasing capacity and improving process efficiency and quality. The degree of automation has been further increased, with conscious attention paid to maintaining necessary flexibility and experience in the manufacturing process.</p>\n\n<p>&ldquo;We are setting a decisive course for the future,&rdquo; explain&nbsp;Florian Hofner and Nicola Frambrosi, managing directors of BSCCB. &ldquo;We are making our production future-proof, thereby ensuring that we can reliably meet the demands and needs of our customers.&rdquo;</p>\n\n<p>Over the years, BSCCB has steadily increased its supply of carbon-ceramic brake discs, becoming a key partner for premium and luxury automotive manufacturers, where high brake performance is essential. Carbon-ceramic technology is a distinctive feature of high-performance vehicles, offering a combination of high&nbsp;braking performance and an exclusive design. Carbon-ceramic brake discs are valued for their lightweight construction, high heat resistance and long lifespan.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/brembo-sgl-carbon-ceramic-brakes-expands-disc-production-capacity-by-50"
      }
    ],
    "link": "https://www.compositesworld.com/news/brembo-sgl-carbon-ceramic-brakes-expands-disc-production-capacity-by-50"
  }
]