[
  {
    "published": "Tue, 22 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      22,
      16,
      0,
      0,
      1,
      203,
      0
    ],
    "title": "Uplift360 awarded Innovate UK Smart Grant for ChemR recycling",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Uplift360 awarded Innovate UK Smart Grant for ChemR recycling"
    },
    "summary": "The grant will support Uplift360&rsquo;s carbon fiber recycling technology, including a pilot-scale system and&nbsp;real-world demonstrations to support its eventual commercial roll-out.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The grant will support Uplift360&rsquo;s carbon fiber recycling technology, including a pilot-scale system and&nbsp;real-world demonstrations to support its eventual commercial roll-out."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-uplift360-chemr-min.png\" target=\"_blank\"><img alt=\"Resin-removed CFRP after exposure to ChemR. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-uplift360-chemr-min.png;maxWidth=385\" /></a></div>\n\n<p>Resin-removed CFRP after exposure to ChemR. Source | Uplift360</p>\n</div>\n\n<p>Cleantech&nbsp;company <a href=\"https://www.uplift360.tech/\" target=\"_blank\">Uplift360</a> (Luxembourg and Bristol, U.K.) has been awarded an Innovate UK Smart Grant: July 2024 round, to scale its low-energy chemical recycling technology, ChemR. Selected as one of only 44 successful projects from a pool of 2,134 applications, ChemR is an ambient-condition chemical recycling process for advanced composite materials. Uplift360 says it has the potential to transform carbon fiber&nbsp;waste management across aerospace, automotive, defense and clean energy sectors.</p>\n\n<p>&ldquo;This grant is a major step forward. ChemR shows that high-performance recycling can be both clean and scalable,&rdquo; says Harry Miller, product and engineering director at Uplift360.</p>\n\n<p>As much as 50% of carbon fiber-reinforced polymers (CFRP)&nbsp;is wasted during manufacturing; the U.K. alone currently produces between 30,000-50,000 tonnes of CFRP waste annually &mdash; material with a potential value exceeding &pound;1.2 billion if effectively recycled. With only 20% of CFRP waste currently recycled,&nbsp;and less than 2% reused due to limitations in thermal and mechanical recycling methods,&nbsp;there still remains an urgent need for scalable, sustainable recycling alternatives.</p>\n\n<p>Uplift360 says ChemR <a href=\"https://www.compositesworld.com/kc/sustainability/composites-suppliers-resource\" target=\"_blank\">addresses this critical gap</a> by enabling low-energy, high-quality recycling aligned with:</p>\n\n<ul>\n\t<li>The U.K. MOD&rsquo;s Defence Circularity Concept Note, by reinforcing the need for resilient supply chains and strengthening U.K. sovereign defense capability</li>\n\t<li>The U.K. Critical Minerals and Advanced Materials Strategies, by enhancing domestic recycling capacity</li>\n\t<li>Waste and circular economy policies, by offering a scalable route to reuse high-value fibers&nbsp;and reduce industrial reliance on imports.</li>\n</ul>\n\n<p>ChemR is a proprietary chemical recycling process that reuses its solvent between batches and is capable of operating at room temperature and pressure. It delivers high-purity recovered fibers ready for reinjection into composites manufacturing. Its direct solvent reuse and mild operating conditions offer a clean,&nbsp;cost-effective alternative for manufacturers facing carbon reduction targets and Extended Producer Responsibility (EPR) regulations.&nbsp;</p>\n\n<p>Uplift360&rsquo;s next steps include the delivery of&nbsp;a pilot-scale ChemR system, conducting real-world demonstrations with partners&nbsp;and building evidence to support commercial roll-out across high-value industries. The project will aim to scale the ChemR process to an integrated pilot line, demonstrate that chemical recycling can be cost-effective, preserve fiber quality with no degradation and adapt flexibly across different applications.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/uplift360-awarded-innovate-uk-smart-grant-for-chemr-recycling"
      }
    ],
    "link": "https://www.compositesworld.com/news/uplift360-awarded-innovate-uk-smart-grant-for-chemr-recycling"
  },
  {
    "published": "Mon, 21 Jul 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      21,
      18,
      0,
      0,
      0,
      202,
      0
    ],
    "title": "TransRail Connection announces ninth edition dedicated to rail, urban mobility",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "TransRail Connection announces ninth edition dedicated to rail, urban mobility"
    },
    "summary": "The two-day October 2025 event in France&nbsp;provides a crossroads for companies, startups, labs and research centers to exchange ideas and innovations modernizing&nbsp;rail and urban mobility ecosystems.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The two-day October 2025 event in France&nbsp;provides a crossroads for companies, startups, labs and research centers to exchange ideas and innovations modernizing&nbsp;rail and urban mobility ecosystems."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-transrailconnection.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-transrailconnection.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | TransRail Connection</p>\n</div>\n\n<p>First Connection, an agency specializing in the organization of trade fairs and conferences, announces the ninth edition of <a href=\"https://www.transrail-connection.com/en/\" target=\"_blank\">TransRail Connection</a>, an event dedicated to technological innovations for the rail industry and urban mobility, of which composite materials play a role. The event&nbsp;takes place Oct. 14-15, 2025 in&nbsp;La Communale&nbsp;(Saint-Ouen) in France.</p>\n\n<p>TransRail Connection, established in 2011, has become a strategic crossroads for players in the industry, bringing together nearly 500 participants each year &mdash; including 400 visitors and principals (manufacturers, operators, equipment suppliers, infrastructure managers) and 70 exhibitors representing innovative companies, startups, laboratories and research centers.</p>\n\n<p>TransRail Connection&rsquo;s encourage exchanges, stimulate collaboration and brings to light concrete technological solutions that meet the current and future challenges of the rail sector. The event highlights a range of expertise and innovations in fields as varied as on-board technologies, IoT, Big Data, electronics, engineering, maintenance, advanced materials and additive manufacturing.</p>\n\n<p>At the heart of this year&rsquo;s event will be a program&nbsp;of conferences and round tables exploring the three major themes shaping the future of railways: AI applied to rail, innovative materials and new industrial processes, and decarbonization solutions. Key players in the sector such as SNCF, Alstom, RATP, Siemens Mobility, Keolis,Transdev, Hitachi Rail and Colas Rail will be taking part in the event as both visitors and speakers. These experts will be sharing their visions and debating the transformations taking place between infrastructure modernization, the ecological transition and the digitalization of systems.</p>\n\n<p>TransRail Connections&rsquo;s Innovation Competition will also offer a selection of startups the opportunity to present their disruptive technologies for manufacturers in the sector. A springboard for these young companies, this competition is part of the drive to renew and accelerate the rail ecosystem.</p>\n\n<p>Learn more about the event <a href=\"https://www.transrail-connection.com/en/\" target=\"_blank\">here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/transrail-connection-announces-ninth-edition-dedicated-to-rail-urban-mobility"
      }
    ],
    "link": "https://www.compositesworld.com/news/transrail-connection-announces-ninth-edition-dedicated-to-rail-urban-mobility"
  },
  {
    "published": "Mon, 21 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      21,
      17,
      0,
      0,
      0,
      202,
      0
    ],
    "title": "EuCIA conducts analysis on thermoset composites waste, sees untapped recycling market potential",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "EuCIA conducts analysis on thermoset composites waste, sees untapped recycling market potential"
    },
    "summary": "Market analysis finds only 5% of 25% theoretical volume of&nbsp;thermoset composites waste accessible in Europe in 2025 is being recycled, information that will inform the activities of the ECCA.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Market analysis finds only 5% of 25% theoretical volume of&nbsp;thermoset composites waste accessible in Europe in 2025 is being recycled, information that will inform the activities of the ECCA."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-eucia-composites-recycling-market.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Estimated total thermoset composites waste in 2025.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-eucia-composites-recycling-market.png;maxWidth=720\" /> </a></div>\n\n<p>Source | EuCIA</p>\n</div>\n\n<p>Europe&rsquo;s transition to a circular economy makes sustainable composites waste management essential. To inform policy development and infrastructure planning, the&nbsp;<a href=\"https://eucia.eu/\" target=\"_blank\">European Composites Industry Association</a> (EuCIA,&nbsp;Brussel, Belgium) has estimated the volume of thermoset composites waste accessible for recycling. This data will also support the activities of the <a href=\"https://www.compositesworld.com/news/eucia-publishes-declaration-of-the-european-circular-composites-alliance\" target=\"_blank\">new European Circular Composites Alliance</a> (ECCA).</p>\n\n<p>The effective management of end-of-life (EOL) composites requires accurate data on waste volumes. However, the amount of composites waste generated in Europe is not officially monitored. EuCIA has therefore been collaborating with its members and partners to estimate the potential size of the composites recycling market.</p>\n\n<p>EuCIA has developed a model based on the gross domestic product (GDP) of European countries which predicts a total volume of thermoset composites waste of about 914 kilotons&nbsp;in Europe in 2025. In reality, the situation is more complex and the volume currently accessible for recycling is much lower for several reasons:</p>\n\n<ul>\n\t<li>Some composite components (like wind turbine blades) are exported for reuse outside of Europe.</li>\n\t<li>In many cases, composite parts are embedded in infrastructure that cannot be easily retrieved for recycling, such as underground pipes and tanks.</li>\n\t<li>Collection and sorting systems tailored to recycling composites are limited and therefore a large number of end-of-use composite products are not collected.</li>\n</ul>\n\n<p>EuCIA conducted a deeper analysis per market, taking into account a number of factors, including the existence of established collection and recycling routes. This indicates that the actual volume of thermoset composites waste accessible for recycling is likely to be around 228 kilotons in 2025, approximately 25% of the theoretical amount predicted by the GDP waste model. Of this, EuCIA estimates that currently a maximum of 5% is being recycled.</p>\n\n<p>These figures, EuCIA believes, clearly show an untapped resource that could potentially be returned to the value chain. But exploiting this opportunity will require the building of a robust European value chain and infrastructure to enable reuse and recycling of composite materials. Longer term, establishing systems to enable more widespread collection and sorting of composites waste will be key to fully realizing a circular economy for composite materials.</p>\n\n<p>Further information, including estimates of the size of the composites waste streams generated by different market sectors, is available in a new publication, &ldquo;Reimagining end-of-use composites as a new resource.&rdquo; This is available to download <a href=\"https://eucia.eu/knowledge-hub/sustainability\" target=\"_blank\">from the EuCIA Knowledge Hub here</a>.</p>\n\n<p>This waste data will be input into the activities of the ECCA, which aims to identify and resolve the legal, economic and technical barriers to composites recycling. The alliance will recommend essential policy updates, such as the creation of dedicated waste codes for EOL composites, to enable the scaling up of sustainable composites recycling solutions. It will also promote the building of markets for secondary (recycled) composites.</p>\n\n<p>The ECCA is a sectorial alliance of EuCIA, launched in partnership with JEC (Paris, France) in March 2025. All stakeholders <a href=\"https://eucia.eu/ecca\" target=\"_blank\">are invited</a> to join the alliance to drive collective action and build a circular and competitive future for Europe&rsquo;s composites industry. The first meetings of the ECCA Working Groups will take place in August 2025.</p>\n\n<p>&ldquo;The collaboration of Europe&rsquo;s composites stakeholders is essential to achieve the full circularity of composite materials,&rdquo; states Rapha&euml;l Pleynet, EuCIA&rsquo;s managing director. &ldquo;ECCA members will commit to this goal, working together to fully establish the circular economy for composites by implementing strategies for greater reuse, repair, repurposing and recycling, and setting and delivering on targets for the recycling of existing products.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/eucia-conducts-analysis-on-thermoset-composites-waste-sees-untapped-recycling-market-potential"
      }
    ],
    "link": "https://www.compositesworld.com/news/eucia-conducts-analysis-on-thermoset-composites-waste-sees-untapped-recycling-market-potential"
  },
  {
    "published": "Mon, 21 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      21,
      16,
      0,
      0,
      0,
      202,
      0
    ],
    "title": "L3Harris to build more than 20 new large solid rocket motor facilities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "L3Harris to build more than 20 new large solid rocket motor facilities"
    },
    "summary": "Facilites located in Arkansas will provide a six-fold increase in L3Harris&rsquo; manufacturing capacity.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Facilites located in Arkansas will provide a six-fold increase in L3Harris&rsquo; manufacturing capacity."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-l3harris-solidrocketmotortest.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerial view of solid rocket motor testing in Camden. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-l3harris-solidrocketmotortest.jpg;maxWidth=720\" /> </a></div>\n\n<p>Solid rocket motor testing in Camden. Source | L3Harris</p>\n</div>\n\n<p><a href=\"https://www.l3harris.com/\" target=\"_blank\">L3Harris Technologies</a> (Melbourne, Fla., U.S.) has&nbsp;announced plans to build more than 20 new manufacturing facilities in Calhoun County, Arkansas, that will produce large solid rocket motors, which L3Harris confirmed are manufactured using materials like&nbsp;fiber-reinforced composites. The new manufacturing facilities will add to L3Harris&rsquo; existing site in south Arkansas.</p>\n\n<p><strong>&ldquo;</strong>Arkansas is a place for L3Harris to fortify the domestic solid rocket motor industrial base with its dedicated workforce and strong state and local partnerships,&rdquo; says&nbsp;Christopher E. Kubasik, chair and CEO, L3Harris. &ldquo;Large solid rocket motors are essential to our nation&rsquo;s missile and strategic defense.&rdquo;</p>\n\n<p>L3Harris is investing nearly half a billion dollars across its major production sites to support solid rocket motor production, including $193 million to be spent in Arkansas, with Arkansas businesses, to support the construction and activation of these new Camden LSRM facilities. Construction of more than 20 buildings in Calhoun County will add more than 130,000 square feet of manufacturing and office space supporting production of large solid rocket motors that can power missile defense targets, interceptors and hypersonic vehicles. L3Harris&rsquo;&nbsp;new LSRM production facilities are expected to provide a six-fold increase in manufacturing capacity.</p>\n\n<p>L3Harris Camden, Arkansas, site is the company&rsquo;s &ldquo;Center of Excellence for Solid Rocket Motor production.&rdquo; Approximately 1,300 Camden employees manufacture more than 100,000 solid rocket motors a year, from those that fit in the palm of your hand to the size of an SUV. In February 2025, L3Harris announced it began construction on four new solid rocket motor production facilities in Camden. That expansion effort is part of a cooperative agreement between the Defense Department&rsquo;s Defense Production Act Title III program and L3Harris to increase domestic rocket propulsion manufacturing capacity.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/l3harris-to-build-more-than-20-new-large-solid-rocket-motor-facilities"
      }
    ],
    "link": "https://www.compositesworld.com/news/l3harris-to-build-more-than-20-new-large-solid-rocket-motor-facilities"
  },
  {
    "published": "Mon, 21 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      21,
      15,
      0,
      0,
      0,
      202,
      0
    ],
    "title": "Fiber Elements raises €2.6 million seed funding for 3D basalt fiber",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Fiber Elements raises €2.6 million seed funding for 3D basalt fiber"
    },
    "summary": "The company&rsquo;s approach combines FEA&nbsp;with advanced manufacturing processes to create mineral composites that are 3X stronger than steel while weighing two-thirds less, aiming&nbsp;to&nbsp;replace steel reinforcement in construction.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company&rsquo;s approach combines FEA&nbsp;with advanced manufacturing processes to create mineral composites that are 3X stronger than steel while weighing two-thirds less, aiming&nbsp;to&nbsp;replace steel reinforcement in construction."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-fiberelements-basalt-fibers1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"3D basalt fiber structure production.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-fiberelements-basalt-fibers1.png;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | Fiber Elements</p>\n</div>\n\n<p><a href=\"https://fiber-elements.com/\" target=\"_blank\">Fiber Elements</a>&nbsp;(Leoben, Austria), a startup specializing in automated basalt fiber manufacturing for the construction industry, has raised &euro;2.6 million in seed funding. The round was led by LEA Partners alongside the Amadeus APEX Technology Fund.</p>\n\n<p>Founded in 2023 by architect-turned-entrepreneur Wolfgang Fiel, Fiber Elements has developed a technology for the fully automated production of 3D basalt fiber structures, said to offer&nbsp;a sustainable alternative to steel-reinforced concrete. Its technology has been brought to market in collaboration with the Technical University of Leoben (MUL), the University of Natural Resources and Life Sciences, Vienna (BOKU)&nbsp;and the Vienna University of Technology (TU Wien).</p>\n\n<p>The company&rsquo;s approach combines finite element analysis (FEA) with advanced manufacturing processes to create mineral composites that are three times stronger than steel while weighing two-thirds less.</p>\n\n<p>In 2025, the hardware and building materials market worldwide generated a revenue <a href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.statista.com%2Foutlook%2Fcmo%2Fdiy-hardware-store%2Fhardware-building-materials%2Fworldwide&amp;data=05%7C02%7Cgnehls%40gardnerweb.com%7Cdaa492f82f2542bc3eb508ddc501a8b5%7Ce20a8cb0b30a43d2841c1690a0420621%7C1%7C0%7C638883336267539685%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C40000%7C%7C%7C&amp;sdata=beE9fa6majU7tJ9asI30Q0u0lQ4aqjeOn%2FE%2BN%2BcDQWs%3D&amp;reserved=0\" target=\"_blank\">of $1.79 trillion</a> and faces mounting pressure to decarbonize. Fiber Elements&rsquo;&nbsp;basalt-concrete solutions address this challenge head-on, offering up to 70% reduction in CO<sub>₂</sub> emissions compared to traditional steel reinforcement while maintaining high performance characteristics. Unlike steel, basalt fibers do not corrode, enabling complete material recycling at the end of their life.</p>\n\n<p>&ldquo;The most decisive factors behind generation-defining companies are timing and team. In Fiber Elements, I&rsquo;ve found a team poised to industrialize basalt in a way that could rewrite the Construction Eroom&rsquo;s Law,&rdquo; says&nbsp;Nils Seele, partner at LEA Partners. &ldquo;Its solution has the potential to become the industry standard for next-generation, sustainable reinforcement &mdash; scaling rapidly across infrastructure, tunnels, bridges&nbsp;and prefabricated systems.&rdquo;</p>\n\n<p>The company has successfully completed pilot projects and currently serves five customers while holding one granted patent with several additional applications filed in 2025. The fresh capital will accelerate industrial scaling, expand the team from 10 to 20 employees by year end&nbsp;and advance full automation of the digital workflow with AI-supported optimization.</p>\n\n<p>The company plans to introduce nano-factories for on-site production, which will&nbsp;reduce transport costs and environmental impact, while making sustainable, prefabricated concrete components more accessible across the construction industry.</p>\n\n<p>Fiber Elements has secured recognition through the Deep Tech Seed financing award from Austria Wirtschaftsservice (AWS) and participation in the EIT Manufacturing Venture Building Programme 2025, supported by the European Institute of Innovation and Technology.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fiber-elements-raises-26-million-seed-funding-for-3d-basalt-fiber"
      }
    ],
    "link": "https://www.compositesworld.com/news/fiber-elements-raises-26-million-seed-funding-for-3d-basalt-fiber"
  },
  {
    "published": "Fri, 18 Jul 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      18,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "Matlantis upgrades universal atomistic simulator for materials discovery, opens dedicated U.S. office",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Matlantis upgrades universal atomistic simulator for materials discovery, opens dedicated U.S. office"
    },
    "summary": "Training datasets for Matlantis&rsquo;&nbsp;core AI technology are now developed using r2SCAN, doubling accuracy in atomistic simulations compared to previous version&nbsp;while driving&nbsp;speed, elemental versatility&nbsp;and quantum-level accuracy.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Training datasets for Matlantis&rsquo;&nbsp;core AI technology are now developed using r2SCAN, doubling accuracy in atomistic simulations compared to previous version&nbsp;while driving&nbsp;speed, elemental versatility&nbsp;and quantum-level accuracy."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-matlantis.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Matlantic technology screenshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-matlantis.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Matlantis Inc.</p>\n</div>\n\n<p><a href=\"https://matlantis.com/en/\" target=\"_blank\">Matlantis Inc.</a>&nbsp;(Cambridge, Mass., U.S.),&nbsp;the U.S. hub of the materials discovery arm of Japan&rsquo;s AI company<a href=\"https://www.preferred.jp/en/\" target=\"_blank\"> Preferred Networks&nbsp;Inc.</a> (PFN, Tokyo) has announced an update to its&nbsp;Matlantis&nbsp;universal atomistic simulator, and the opening of its office in Cambridge, Massachusetts, both of which aim to accelerate the&nbsp;adoption of AI‑driven materials research across North America.</p>\n\n<p>Matlantis supports large-scale material discovery by reproducing new materials&rsquo; behavior at an atomic level on the computer.&nbsp;Launched in July 2021 as a cloud-based software-as-a-service (Saas), Matlantis is used by more than&nbsp;100 companies and organizations for discovering various materials including catalysts, batteries, semiconductors, alloys, lubricants, ceramics and chemicals. Its delivery of&nbsp;speed, elemental versatility&nbsp;and quantum-level accuracy also make it a&nbsp;powerful, flexible tool for composites manufacturers (<a href=\"#How can Matlantis support composites manufacturing?\" target=\"_self\">details below</a>).</p>\n\n<p>The recent update introduces Version 8 of PFN&rsquo;s AI technology named Preferred Potential (PFP), which&nbsp;the company says enables researchers across industries to accelerate discovery, improve predictive performance and unlock new frontiers in materials science with high&nbsp;levels of simulation accuracy.</p>\n\n<p>According to Matlantis, PFP 8.0 marks a significant milestone as the &ldquo;first&rdquo; universal machine learning interatomic potential (MLIP) to be trained with datasets developed with a method called r<sup>2</sup>SCAN (restored-regularized strongly constrained and appropriately normed) functional. PFP versions up to Version 7 previously relied on datasets generated with a method called Perdew-Burke-Ernzerhof (PBE)&nbsp;functional, which has also been widely adopted by MLIPs other than PFP. It is known, however, that PBE has certain limitations in simulation accuracy &mdash; how closely computer-based simulations of materials&rsquo;&nbsp;behavior align with real-world experimental results.</p>\n\n<p>The introduction of the r<sup>2</sup>SCAN method is the culmination of PFN&rsquo;s continuous efforts over the past couple of years to overcome the accuracy limitations of the PBE-based approach. Developing training datasets with the r<sup>2</sup>SCAN method is reported to be more computationally intensive, requiring three to five times the computing time compared to the PBE method. However, because PFP 8.0&nbsp;is now trained with the datasets built with r<sup>2</sup>SCAN as well as PBE, Matlantis users can achieve up to doubled the simulation accuracy in the same timeframe as the previous version.</p>\n\n<blockquote>\n<p>&ldquo;We believe this will further pave the way for the era of computer-based materials discovery,&rdquo; says Daisuke Okanohara, CEO of Matlantis.</p>\n</blockquote>\n\n<p>Matlantis enables research teams to:</p>\n\n<p><strong>Perform simulations from the first day of use. </strong>Provided as an Saas, users can access Matlantis via a browser and start searching for new materials. Because Matlantis&rsquo;&nbsp;MLIP&nbsp;has already been trained with massive datasets, users can immediately focus on material discovery without spending time building machine learning models.</p>\n\n<p><strong>Search a wide variety of undiscovered materials</strong>. As a universal atomistic simulator, Matlantis covers a wide variety of materials for batteries, semiconductors, catalysts and more, without the need of changing AI models depending on their types.</p>\n\n<p><strong>Accelerate materials discovery</strong>. Researchers can complete simulations in just a few hours that would otherwise require years of conventional DFT calculations. This speed-up transforms iterative design in materials discovery, reshaping the R&amp;D process so that computational insights lead experiments, instead of merely validating them afterward.</p>\n\n<p><strong>Achieve higher&nbsp;simulation accuracy.</strong>&nbsp;With the new training datasets built with the r<sup>2</sup>SCAN method, Matlantis can simulate material properties with higher accuracy than common MLIPs in the same timeframe, further narrowing the gap between simulations and experiments.</p>\n\n<div class=\"article_sidebar\">\n<h3><a id=\"How can Matlantis support composites manufacturing?\" name=\"How can Matlantis support composites manufacturing?\">How can Matlantis support composites manufacturing?</a></h3>\n\n<p>Matlantis PFP 8.0 supports everything from tailored fiber resin interfacial design to durability assessment and hybrid structure optimization, which can slash R&amp;D timelines, prototype cost&nbsp;and accelerate innovation in fiber-reinforced and honeycomb composites.</p>\n\n<p>More specifically, Matlantis can simulate complex architectures (such as fiber-matrix interfaces, damage progression and&nbsp;honeycomb tessellations) containing tens of thousands of atoms in seconds rather than months. This capability enables researchers to do virtual exploration of composite microstructures and interactions before committing to expensive experimental prototypes.</p>\n\n<p>The simulator can also model nearly any element, including those in carbon, glass and&nbsp;aramid fibers, metallic coatings, resin matrices&nbsp;and even core materials like aluminum honeycomb. Crucial interfacial phenomena like fiber sizing, resin adhesion&nbsp;or moisture uptake, can be accurately modeled at the atomic level, guiding surface treatments and coatings for better bonding.</p>\n\n<p>Finally, Matlantis accelerates hybrid R&amp;D workflows, evaluating wide ranges of fiber matrix combinations (such as carbon/epoxy, glass/vinyl ester, aramid with toughened resin and sandwich cores) computationally before physical testing. By narrowing down the most promising systems virtually, Matlantis reduces prototyping cycles and material waste &mdash;&nbsp;ideal for composites manufacturers aiming for faster time-to-market.</p>\n</div>\n\n<p>&ldquo;With PFP 8.0 we finally have an MLIP&nbsp;that keeps the best DFT‑level fidelity while spanning the most of periodic table,&rdquo; says&nbsp;Matlantis technical advisor professor&nbsp;Ju Li, Ph.D., widely recognized for his work on atomistic modeling and materials research. &ldquo;That accuracy‑plus‑speed combination lets engineers generate phase diagrams or screen multicomponent systems in hours or several days rather than weeks or months &mdash; work that directly informs alloy design, battery materials, and other high‑value applications. Establishing a U.S. office means we can collaborate even more closely with industrial and academic partners here, shorten feedback loops&nbsp;and bring new Matlantis capabilities to market faster.&rdquo;</p>\n\n<p>PFP 8.0 is developed using PFN&rsquo;s supercomputer and AI Bridge Cloud Infrastructure (ABCI) 2.0 and 3.0 provided by Japan&rsquo;s National Institute of Advanced Industrial Science and Technology (AIST) and AIST Solutions Co., Ltd. The use of ABCI 3.0 is supported by the ABCI 3.0 Development Acceleration Program.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/matlantis-upgrades-universal-atomistic-simulator-for-materials-discovery-opens-dedicated-us-office"
      }
    ],
    "link": "https://www.compositesworld.com/news/matlantis-upgrades-universal-atomistic-simulator-for-materials-discovery-opens-dedicated-us-office"
  },
  {
    "published": "Fri, 18 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      17,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "Joby expands California and Ohio manufacturing capacity, adds new aircraft to fleet",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Joby expands California and Ohio manufacturing capacity, adds new aircraft to fleet"
    },
    "summary": "Doubled space will enable production of 24 aircraft/year in Marina, ramp-up of renovated Dayton facility to&nbsp;manufacture and test aircraft components&nbsp;and produce&nbsp;500 aircraft/year.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Doubled space will enable production of 24 aircraft/year in Marina, ramp-up of renovated Dayton facility to&nbsp;manufacture and test aircraft components&nbsp;and produce&nbsp;500 aircraft/year."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-joby-marina-facility-expanded.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Joby’s new expanded facility in Marina, California.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-joby-marina-facility-expanded.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Joby&rsquo;s new expanded facility in Marina, California. Source | Joby Aviation.</p>\n</div>\n\n<p><a href=\"https://www.jobyaviation.com/\" target=\"_blank\">Joby Aviation</a> (Santa Cruz, Calif., U.S.) is expanding its manufacturing site&nbsp;in Marina, California, which will double its electric vertical takeoff and landing (eVTOL) aircraft production capacity at that location. The total site now spans approximately 435,500 square feet and will support the scale-up of commercial operations. Joby also expanded its flight test program with the addition of a new aircraft to its growing fleet.</p>\n\n<p>&ldquo;Reimagining urban mobility takes speed, scale&nbsp;and precision manufacturing. Our expanded manufacturing footprint in both California and Ohio is preparing us to do just that,&rdquo; says&nbsp;Eric Allison, chief product officer. &ldquo;We celebrated the opening of the new facility with the flight of our sixth aircraft, which earned airworthiness certification within a week of completion.&rdquo;&nbsp;</p>\n\n<p>The opening of the new manufacturing space is a big step forward as Joby gets ready to scale production and enter the market. Achieving this comes down to three key strengths:&nbsp;</p>\n\n<ul>\n\t<li>Drawing on talent at its California and Ohio facilities, Joby designs, builds&nbsp;and tests its aircraft in the U.S. Using tools like advanced data analytics and 3D printing, Joby produces components that are light, strong&nbsp;and flexible. With its newly expanded Marina facility, the company plans to add&nbsp;hundreds of full-time jobs&nbsp;to support increased aircraft production.</li>\n\t<li>Joby handles nearly every aspect of its aircraft and air taxi service in-house, from design and manufacturing to pilot training and operations. This vertical integration helps speed development, ensure quality&nbsp;and accelerate testing and certification. It also lets Joby quickly and efficiently adapt its platform for other uses, including&nbsp;hybrid&nbsp;hydrogen-electric&nbsp;propulsion testing.</li>\n\t<li>Toyota engineers are&nbsp;deeply integrated&nbsp;with the Joby team, providing counsel to support Joby&rsquo;s work across design, manufacturing&nbsp;and quality. Toyota also helps the Joby team optimize processes, streamline assembly and offer advice related to the development of custom tooling to accelerate production.</li>\n</ul>\n\n<p>Once fully operational, the expanded Marina site is expected to be able to produce up to 24 aircraft/year, which is nearly one every other week. It will also provide key capabilities including its initial FAA production certification, conforming ground and flight testing components, pilot training simulators and aircraft maintenance.</p>\n\n<p>This site strengthens Joby&rsquo;s broader manufacturing network, which includes three additional facilities: Santa Cruz, California, the headquarters driving innovation and system architecture; San Carlos, California, focused on powertrain and electronics; and&nbsp;Dayton, Ohio, <a href=\"https://www.compositesworld.com/news/joby-acquires-facility-in-ohio-scales-up-evtol-aircraft-manufacture\" target=\"_blank\">a newly renovated facility</a> that will manufacture and test aircraft components for Joby&rsquo;s&nbsp;Pilot Production Line. The Dayton site demonstrates the capabilities required for FAA production certification and supports the company&rsquo;s plans to scale operations. Equipment installation is underway, with production ramping up to eventually build up to 500 aircraft/year at that location.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/joby-expands-california-and-ohio-manufacturing-capacity-adds-new-aircraft-to-fleet"
      }
    ],
    "link": "https://www.compositesworld.com/news/joby-expands-california-and-ohio-manufacturing-capacity-adds-new-aircraft-to-fleet"
  },
  {
    "published": "Fri, 18 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      16,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "REGENT forms REGENT Defense, unveils defense seaglider product line",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "REGENT forms REGENT Defense, unveils defense seaglider product line"
    },
    "summary": "ISR, medevac and other maritime defense missions will be supported through the new line of&nbsp;high-speed, long-range, low-signature marine craft, which build off the company&rsquo;s composites-intensive Viceroy.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ISR, medevac and other maritime defense missions will be supported through the new line of&nbsp;high-speed, long-range, low-signature marine craft, which build off the company&rsquo;s composites-intensive Viceroy."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-regent-defense-seagliders.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Viceroy and Squire vessels.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-regent-defense-seagliders.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | REGENT Craft</p>\n</div>\n\n<p><a href=\"https://www.regentcraft.com/contact\" target=\"_blank\">Regional Electric Ground Effect Nautical Transport Craft Inc.</a>&nbsp;(REGENT, North Kingstown, R.I., U.S.), composites-intensive seaglider vessel developer and manufacturer, has announced the creation of REGENT Defense&nbsp;and unveiled a new product line of maritime craft designed&nbsp;for military applications. Complementing REGENT&rsquo;s $10 billion commercial backlog, the company will manufacture REGENT Defense seaglider vessels at its headquarters in Rhode Island.</p>\n\n<p>REGENT&rsquo;s hydrofoiling wing-in-ground-effect (WIG) seaglider design offers a combination of high-speed, long-range&nbsp;and low-signature capabilities &mdash; all at significantly reduced costs compared to legacy transportations solutions, the company reports. These advantages directly address the &ldquo;tyranny of distance&rdquo; often seen in littoral operations, where resupply and transport across vast ocean stretches has&nbsp;historically been difficult.</p>\n\n<p>As a Type A WIG craft, seaglider vessels operate exclusively over water within a wingspan of the water&rsquo;s surface, benefitting from the aerodynamic efficiencies of ground effect and remaining above sonar and below radar. This highly efficient, agile&nbsp;and low-signature design enables the craft to service a wide range of maritime defense missions, including:</p>\n\n<ul>\n\t<li>Troop and supply logistics</li>\n\t<li>Medical evacuation&nbsp; (medevac) and search and rescue</li>\n\t<li>Intelligence, surveillance&nbsp;and reconnaissance (ISR)</li>\n\t<li>Launched effects, including deployment of uncrewed systems from the seaglider vessel.</li>\n</ul>\n\n<p>&ldquo;We&rsquo;re building platforms engineered for maritime defense operations in contested and logistically complex maritime environments,&rdquo; says&nbsp;Tom Huntley, general manager of REGENT Defense.&nbsp;</p>\n\n<p>In addition to a defense version of REGENT&rsquo;s commercial all-electric, crewed <em>Viceroy</em> model, REGENT Defense is creating a product line of seaglider vessels that include a fully autonomous <em>Viceroy</em> vessel as well as hybrid versions, and a quarter-scale autonomous model called <em>Squire</em>.</p>\n\n<p>The <em>Viceroy</em>&nbsp;seaglider has a payload of 3,500 pounds&nbsp;and can travel at speeds up to 160 knots (180 miles per hour) for routes up to 160 nautical miles (180 miles) in the all-electric model and up to 1,400 nautical miles (1,600 miles) in the hybrid model. The autonomous hybrid <em>Squire</em> seaglider vessel has a payload of 50 pounds&nbsp;and can travel at speeds of up to 70 knots (80 miles per hour) for routes more than 100 nautical miles (115 miles).</p>\n\n<p>REGENT is a trusted partner of the U.S. Marine Corps, which continues to advance its strategic shift toward distributed maritime operations. In March 2025, REGENT announced a $10 million expanded collaboration with the Marine Corps Warfighting Lab through the second phase of a contract agreement to validate seaglider use cases across logistics, ISR, medevac, launched effects&nbsp;and other mission-critical areas.</p>\n\n<p>In addition to its work with the Marine Corps, REGENT has formalized development relationships with U.S. Special Operations Command (USSOCOM) and the U.S. Coast Guard Research and Development Center, supporting innovation in agile, next-generation maritime mobility.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/regent-forms-regent-defense-unveils-defense-seaglider-product-line"
      }
    ],
    "link": "https://www.compositesworld.com/news/regent-forms-regent-defense-unveils-defense-seaglider-product-line"
  },
  {
    "published": "Fri, 18 Jul 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      15,
      30,
      0,
      4,
      199,
      0
    ],
    "title": "Plasmatreat Technology Days 2025 celebrates 30 years of Openair-Plasma",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Plasmatreat Technology Days 2025 celebrates 30 years of Openair-Plasma"
    },
    "summary": "More than 200 guests accepted the Steinhagen-based family business&rsquo; invitation to discuss new applications of atmospheric plasma systems in surface pretreatment.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "More than 200 guests accepted the Steinhagen-based family business&rsquo; invitation to discuss new applications of atmospheric plasma systems in surface pretreatment."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechnologyDays-25.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Technology Days attendees aerial view.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechnologyDays-25.jpg;maxWidth=720\" /> </a></div>\n\n<p>Plasmatreat Technology Days 2025. Source (All Images) | Plasmatreat GmbH</p>\n</div>\n\n<p>July 2-3, 2025,&nbsp;<a href=\"https://www.compositesworld.com/suppliers/plastmatreat-gmbh\" target=\"_blank\">Plasmatreat GmbH</a> (Germany) celebrated the 30<sup>th</sup> anniversary of the patent application for its Openair-Plasma technology&nbsp;with Technology Days 2025 at its Steinhagen headquarters.&nbsp;Three decades ago, this process for pretreating surfaces with industrially compatible atmospheric plasma began Plasmatreat&rsquo;s advance, and has since optimized numerous industrial processes worldwide thanks to its process stability, efficiency, environmental friendliness&nbsp;and ease of integration into production environments. This was the focus of the high-profile event, where 200 guests, 16 industry partners and the international sales team were present.</p>\n\n<p>&ldquo;The future of plasma technology has only just begun &mdash; as has our journey together. We are still at the beginning,&rdquo; said&nbsp;Plasmatreat founder and CEO Christian Buske in his welcome speech.&nbsp;&ldquo;Our tool is ionized gas. All of our applications use this tool to modify the structure of surfaces of a variety of materials specifically. Our plasma technology provides countless possibilities for modifying the surfaces of plastics, metals, glass, cardboard, films, fibers, composites&nbsp;and recycled materials. We use plasma technology to give these materials special properties for further processing.&rdquo; These basic tasks include ultra-fine cleaning, activation, reduction&nbsp;and coatings for a wide range of industrial applications.</p>\n\n<blockquote>\n<p>Read &ldquo;<a href=\"https://www.compositesworld.com/articles/plasma-moves-beyond-improved-bonding-to-coatings-multifunctional-composites\">Plasma moves beyond improved bonding to coatings, multifunctional composites</a>&rdquo;</p>\n</blockquote>\n\n<p>&ldquo;Think ahead, experience innovation&rdquo;&nbsp;was the Technology Days motto. The agenda included a balanced mix of technical presentations, workshops&nbsp;and discussions at the exclusive partner exhibition. During workshops, Plasmatreat experts demonstrated how the company&rsquo;s solutions are used.</p>\n\n<h3>Technical lectures, presentations</h3>\n\n<p>Hans Beckhoff, Dr. Joerg Ihde from Fraunhofer IFAM, Dr. Alexander Stoppa from Irlbacher, Peter Auerbeck from GROB-Werken&nbsp;and Gunnar Melles from tesa organized and presented technical lectures at the Plasmatreat Technology Center. During their presentations, the experts discussed the latest trends in developing new products at their companies and explained how they use Plasmatreat solutions. Beckhoff provided insights into the latest automation innovations, while Stoppa spoke about hardware designs for glass-based HMIs in harsh industrial environments. Auerbeck and Melles focused their presentations on battery production for e-mobility.</p>\n\n<p>Eagerly awaited was the presentation by Buske. He reviewed the development history of Openair-Plasma technology, using the automotive industry as an example. The technology, he explained, originated from a joint project with a regional automotive supplier, in which both companies achieved a breakthrough in bonding headlights to polypropylene housings.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechDays-demo.jpg\" target=\"_blank\"><img alt=\"Plasmatreat demonstrations.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechDays-demo.jpg;maxWidth=385\" /></a></div>\n\n<p>Plasmatreat demonstrations.</p>\n</div>\n\n<p>&ldquo;Since then, we have collaborated closely with customers for over three decades to develop a wide range of solutions, from laboratory and standalone systems to fully automated lines,&rdquo; said Buske. &ldquo;Our portfolio of nozzles and nozzle heads alone includes many different variants for static or rotating systems for a variety of applications. This means that, even for new applications, we can often meet the requirements with existing solutions and minor adjustments.&rdquo;</p>\n\n<p>Plasmatreat technology is currently used in more than 100 automotive and battery production applications. &ldquo;Since development processes in the automotive industry are particularly sensitive and data-intensive, we now comply with TISAX standards for information security,&rdquo; added&nbsp;Buske. &ldquo;This is a logical step for us and a clear signal to our automotive industry partners: Plasmatreat is reliable in more ways than one.&rdquo;</p>\n\n<div class=\"article_sidebar\">\n<p>Plasmatreat&rsquo;s Technology Days 2025 exhibit area included 16 participating industry partners in the exhibitor area: Beckhoff Automation, Bodo M&ouml;ller&nbsp;Chemie, CeraCon, DreiBond Chemische Verbindungstechnik, Delo Industrieklebstoffe, Fraunhofer Institute for Manufacturing Technology and Applied Materials Research IFAM, HAHN Automation Group, Kr&uuml;ss, Tampoprint, OptiMel Schmelzgusstechnik, Hermann Otto, RAMPF Group, Sika Group, tesa, Venjakob Maschinenbau and Volz Selbstklebetechnik. Visitors found inspiration from these partners on how to optimize production and open new possibilities.</p>\n</div>\n\n<h3><strong>Hands-on workshop sessions</strong></h3>\n\n<p>Many visitors came to the workshops with ideas for new applications or drew inspiration from the examples of applications shown to optimize their companies&rsquo;&nbsp;production processes with Plasmatreat solutions.</p>\n\n<p>To enable efficient work in the interactive workshops, Plasmatreat surveyed guests&rsquo;&nbsp;main interests before the Technology Days. This enabled guests to be divided into smaller groups, so that each guest received an individual program at the beginning of the event.</p>\n\n<p>A total of eight workshops covered the current state and future of plasma technology in various application areas.</p>\n\n<p>The workshop, &ldquo;Perfect Images: Plasma for Demanding Printing Processes,&rdquo; in the PT-Print room at Plasmatreat&rsquo;s Technology Center&nbsp;is particularly noted. In addition to applications in packaging manufacturing and other areas, many participants found the production of a digitally printed, customized sports shoe to be a highlight of this workshop. The thermoplastic used in this process is activated with Openair-Plasma, which makes it ideal for printing with UV ink. Innovative nozzle technology in the form of a new nozzle for printing applications was also a focus.</p>\n\n<p>Another workshop, &ldquo;REDOX effect: Reduction to High-Performance Coatings,&rdquo; showed how oxidized and contaminated metal surfaces are cleaned in the semiconductor industry to meet the strictest standards for manufacturing electronic components. Plasma systems and reduction were also demonstrated live.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechDays-presentations.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Workshop attendance.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechDays-presentations.jpg;maxWidth=720\" /> </a></div>\n</div>\n\n<p>The workshop, &ldquo;Cleaning Reimagined: From Openair-Plasma to HydroPlasma,&rdquo; showcased a Plasmatreat&nbsp;innovation that involves adding distilled water to a plasma jet, which enhances the plasma treatment&rsquo;s effectiveness. Using small metal plates contaminated with fingerprints, the experts demonstrated that HydroPlasma can reliably remove even the most stubborn contaminants, such as oils, salts&nbsp;and fats, without the use of wet chemistry and in a manner that can be verified with measuring instruments.</p>\n\n<p>As the title of another workshop in the main building, &ldquo;Innovative Technology and Forward-Looking Coatings,&rdquo; suggested, this event focused on PlasmaPlus PT-Bond, a technology that enables the application of ultra-thin coatings to materials by injecting gaseous precursors into plasma jets via plasma nozzles. The plasma, enriched in this way, then hits surfaces that were previously treated with Openair-Plasma technology, coating them with ultra-thin, transparent plasma polymer layers. These layers can include bonding agents for structural bonding, as well as barrier and insulation layers for corrosion protection. The workshop featured a thermoforming application in which sheet metal was coated with an ultra-thin protective layer instead of a film to prevent scratching. This is one example of many applications in which plasma technology can replace consumables, positively impacting operating costs and process sustainability.</p>\n\n<p>As was made increasingly clear in the technical presentations, assembly bonding is becoming the preferred joining technology in an ever-growing number of industrial sectors. Lukas Buske&rsquo;s example of the complete bonding of all car body elements demonstrated how far development has progressed in this area. Further impressive examples were discussed in the workshop, &ldquo;Plasma Meets Polymer: Efficient Activation for Maximum Adhesion&rdquo; in the Application Technology Laboratory.</p>\n\n<p>Corrosion protection was also the subject of a separate workshop, &ldquo;AntiCorr as a protective shield for surfaces.&rdquo; This workshop took place in Plasmatreat&rsquo;s contract service area, and demonstrated the process of cleaning and coating a customer&rsquo;s battery housing made of aluminum die-cast and continuous cast aluminum with AntiCorr. For this purpose, a robot equipped with an Openair-Plasma nozzle and a PlasmaPlus nozzle was used. This process effectively protected the battery tray against crevice corrosion while using minimal precursors.</p>\n\n<p>Plasmatreat&rsquo;s plasma technology is now used in electronics, medical, aerospace, packaging and battery manufacturing industries, as well as numerous other sectors. A decisive factor for the company&rsquo;s global customers is that Plasmatreat has a worldwide presence and is therefore close to them, with its representatives and approximately 320 employees.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/plasmatreat-technology-days-2025-celebrates-30-years-of-openair-plasma"
      }
    ],
    "link": "https://www.compositesworld.com/news/plasmatreat-technology-days-2025-celebrates-30-years-of-openair-plasma"
  },
  {
    "published": "Fri, 18 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      15,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "Mokon becomes U.S. distributor for orcinus temperature, flow manifolds",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Mokon becomes U.S. distributor for orcinus temperature, flow manifolds"
    },
    "summary": "Mokon&nbsp;will manufacture the enesty GmbH brand&rsquo;s&nbsp;orca and smartshark touch-free temperature and flow manifold devices, for use with select water systems, at its&nbsp;facility in Buffalo, New York.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Mokon&nbsp;will manufacture the enesty GmbH brand&rsquo;s&nbsp;orca and smartshark touch-free temperature and flow manifold devices, for use with select water systems, at its&nbsp;facility in Buffalo, New York."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-mokon-orcinus1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orcinus smartshark manifolds.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-mokon-orcinus1.png;maxWidth=720\" /> </a></div>\n\n<p>Orcinus smartshark system. Source | Mokon, enesty GmbH</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/mokon\" target=\"_blank\">Mokon</a> (Buffalo, N.Y., U.S.) a manufacturer of high-quality circulating liquid temperature control systems, announces a partnership with orcinus, a brand by <a href=\"https://enesty.org/en/produkte/\" target=\"_blank\">enesty GmbH</a> (Hartha, Germany) with a strong presence in&nbsp;Europe and Asia.&nbsp;Mokon will now lead distribution and production of the orcinus orca and orcinus smartshark <a href=\"https://www.mokon.com/products/orcinus/\" target=\"_blank\">temperature control systems</a> for the U.S. at its facility in Buffalo.</p>\n\n<p>Both manifold systems continuously monitor water flow rate and temperature, resulting in high&nbsp;component quality and more process control. The orcinus orca is characterized by double ultrasonic measurement and provides noncontact, accurate flow measurements, making the use of filters superfluous. The manifolds also:</p>\n\n<ul>\n\t<li>Reduce&nbsp;pressure drop</li>\n\t<li>Enable increased flow in individual circuits</li>\n\t<li>Increase a mold&rsquo;s cooling effect and heat exchange</li>\n\t<li>Reduce cooling time and thus&nbsp;cycle time</li>\n\t<li>Bring transparency to the process</li>\n\t<li>Increase process reliability</li>\n\t<li>Reduce maintenance costs for temperature control and molds</li>\n\t<li>Lower production costs.</li>\n</ul>\n\n<p>These manifolds can be used independently or as accessories with Mokon water temperature control systems.&nbsp;</p>\n\n<p>Mokon systems are used on many different composite applications, providing process solutions for industries including aerospace, automotive, medical and so on. For more than 70 years, the company has actively developed new products, refined existing designs and created custom-engineered solutions.&nbsp;</p>\n\n<p>The company&rsquo;s product line has grown significantly since introducing its first water temperature control system in 1955 to include heat transfer oil systems, portable and central chillers, pump tanks, cooling towers, blown film coolers, cold climate coolers, engineered and pre-engineered control panels, maintenance products and custom-designed/engineered systems.</p>\n\n<p>Mokon&rsquo;s circulating liquid heating and chilling equipment is all designed and manufactured in the U.S. Mokon is an ISO9001 and ISO14001-certified company.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/mokon-becomes-us-distributor-for-orcinus-temperature-flow-manifolds"
      }
    ],
    "link": "https://www.compositesworld.com/news/mokon-becomes-us-distributor-for-orcinus-temperature-flow-manifolds"
  }
]