[
  {
    "published": "Mon, 5 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      5,
      17,
      0,
      0,
      0,
      125,
      0
    ],
    "title": "Clean Sky 2 outer wing box demonstrator validates OOA LRI, shimless assembly and SHM",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Clean Sky 2 outer wing box demonstrator validates OOA LRI, shimless assembly and SHM"
    },
    "summary": "Full-scale wing box project achieves TRL 5 with 2% weight reduction and 4% reduction in recurring production costs through improved manufacturing efficiency and assembly processes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Full-scale wing box project achieves TRL 5 with 2% weight reduction and 4% reduction in recurring production costs through improved manufacturing efficiency and assembly processes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cleansky2-herwingt-updates.png;maxWidth=385\" /></div>\n\n<p>The&nbsp;Outer Wing Box in its testing configuration. Source | Clean Sky 2</p>\n</div>\n\n<p>A milestone has been achieved with the&nbsp;testing of the Clean Sky 2 outer wing box&nbsp;(OWB) full-scale demonstrator which has achieved technology readiness level&nbsp;(TRL) 5,&nbsp;validating its&nbsp;feasibility for future applications and providing a foundation for advancements in&nbsp;aerospace manufacturing that will enable weight reduction and more efficient assembly techniques.</p>\n\n<p>The OWB demonstrator project &mdash; <a href=\"https://www.clean-aviation.eu/clean-sky-2/demonstrators/key-demonstrators/adaptive-wing-integrated-demonstrator-flying-test-bed-outer-wing-box\" target=\"_blank\">which ran between 2014 and 2024</a>&nbsp;&mdash; is representative&nbsp;of a regional aircraft wing configuration that aimed&nbsp;to validate emerging technologies such as out-of-autoclave liquid resin infusion&nbsp;(OOA LRI), in situ consolidation of thermoplastic composites, shimless&nbsp;assembly and structural health monitoring (SHM) sensor systems. It was a collaborative effort&nbsp;involving multiple aerospace industry leaders and research institutions, including&nbsp;Hellenic Aerospace Industry&nbsp;(HAI), the University of Nottingham in VADIS, the University of Naples (UNINA), ItalSystem Srl and&nbsp;and the Italian Aerospace Research Centre (CIRA)&nbsp;in Air Green 2. The topic manager was&nbsp;Leonardo.</p>\n\n<p>The full-scale OWB demonstrator,&nbsp;the structural core of an aircraft wing (and a key interface with the aircraft fuselage), is approximately 9.1 meters in width at the root rib of about 1.3 meters, and a width at the tip rib of about 0.7 meter. It includes several components manufactured via LRI/OOA processes, comprising:</p>\n\n<ul>\n\t<li>One stiffened upper panel including a removable panel</li>\n\t<li>One stiffened lower panel manufactured in one shot by a co-infusion of skin, stringers and rib feet</li>\n\t<li>Two LRI spars</li>\n\t<li>Fourteen LRI ribs</li>\n\t<li>Four&nbsp;metallic ribs.</li>\n</ul>\n\n<p>The primary goal of the OWB demonstrator was to validate advanced manufacturing processes and&nbsp;innovative assembly methodologies at full-scale level, as&nbsp;Vittorio Ascione, Clean Sky 2 REG IADP project manager at Leonardo&nbsp;notes.</p>\n\n<p>&ldquo;To have the assurance of the assessment of some technologies, you need to reach the full scale that will be used on the aircraft,&rdquo;&nbsp;Ascione&nbsp;says. &ldquo;Because by means of testing at full scale, you can find new issues that you never would be able to detect or foresee with a small scale demonstrator.&nbsp;Having a full-scale demonstrator included in the process gave us that assurance that all worked well, and the assessment of technologies was really complete. This was the first time that we had produced a more than 9-meter-long demonstrator &mdash;&nbsp;in itself a significant achievement &mdash;&nbsp;adding the possibility to check these new technologies at full size.&rdquo;</p>\n\n<p>However, developing large, integrated composite panels presented numerous challenges. Key technologies used to overcome these challenges included, OOA,&nbsp;LRI,&nbsp;shimless assembly,&nbsp;determinant assembly&nbsp;and part-to-part assembly:</p>\n\n<h3>OOA LRI process</h3>\n\n<p>This process was designed to manufacture large integral stiffened composite panels with greater efficiency and&nbsp;reduced environmental impact. Unlike traditional autoclave-based composites manufacturing, the use of OOA LRI, compared to a&nbsp;traditional composite process that uses prepreg in an autoclave, enables components to be &ldquo;cured&rdquo;&nbsp;using less energy&nbsp;(as pressurization during curing is not necessary), and large refrigerators are not required to maintain the composite material before starting production. This approach resulted in a&nbsp;2% weight reduction, which would &mdash;&nbsp;when applied to an in-service OWB&nbsp;&mdash;&nbsp;translate into fuel savings and emissions reductions.</p>\n\n<h3><strong>Shimless assembly</strong></h3>\n\n<p>The development of shimless assembly techniques necessitated the seamless integration of scanning, reverse engineering&nbsp;and CAM software.</p>\n\n<p>&ldquo;Traditionally, wing box assembly involves using shims to close gaps between ribs and panels. This process is time-consuming and expensive,&rdquo; explains Giuseppe Totaro, Clean Sky 2 REG IADP OWB demo leader at Leonardo. &ldquo;Our new approach uses digital twins and precise machining to create a shimless configuration.&rdquo;</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>GKN Fokker (<a href=\"https://www.gknaerospace.com/about-us/gkn-fokker/\" target=\"_blank\">acquired by GKN Aerospace</a>, Redditch, U.K.) announced it&nbsp;received the AFP&nbsp;layup tool for the Clean Aviation project HERWINGT&nbsp;on April 28. GKN Fokker has developed a laser AFP in situ consolidation (ISC) process for a lower cover for the outer wing box (OWB).&nbsp;</p>\n\n<p>This lower cover will have stringers that will be co-consolidated in a &ldquo;one-shot&rdquo; during the ISC layup of the skin. The self-heated tool has been developed together with Grunewald GmbH &amp; Co. KG. The stringers are provided by Xelis GmbH (<a href=\"https://www.compositesworld.com/news/avanco-composites-bundles-lightweight-composites-expertise-into-new-corporate-structure\" target=\"_blank\">part of Avanco&nbsp;Composites</a>) and are produced with continuous compression molding (CCM) technology.</p>\n\n<p>In the coming months, production trials will be executed to prepare for manufacturing the lower cover for the full-scale OWB, which will be assembled and tested by Leonardo.</p>\n</div>\n</div>\n\n<p>Shimless assembly is based on the study of tolerance propagation, and on a &ldquo;determinant assembly approach&rdquo; (DAA)&nbsp;This is a manufacturing and assembly methodology that ensures parts fit together with minimal adjustments, reducing the need for shims, rework&nbsp;or manual fitting during the assembly process. The DAA&nbsp;relies on&nbsp;precise engineering, digital design and tolerance management&nbsp;to create components that align perfectly when assembled. This approach, developed in Project VADIS (Variance Aware Determinate Assembly Integrated System), allows tolerances to be optimized by increasing them where possible with a reduction in manufacturing costs.</p>\n\n<p>This challenge was also addressed through the refinement of&nbsp;automatic software routines, ensuring compatibility with existing industry tools, such as Catia. Using reverse engineering, automatic software routines were developed to scan panel surfaces and determine final rib surfaces for precise part-to-part assembly &mdash; a method of creating assemblies by joining two or more parts, where the parts can either touch or intrude into each other, and can be used to create a new part or subassembly.</p>\n\n<p>The final demonstrator, measuring&nbsp;more than 9 meters in length, successfully demonstrated the efficiency of this approach by reducing the need for shims and enabling&nbsp;one-pass finished hole execution&nbsp;instead of multiple passes, leading to a&nbsp;4% reduction in manufacturing costs.</p>\n\n<h3><strong>Structural health monitoring (SHM)</strong></h3>\n\n<p>A key feature in the project was the integration of&nbsp;SHM&nbsp;piezoelectric sensors and optical fibers&nbsp;which were strategically embedded in the wing box&nbsp;in order to&nbsp;monitor the stresses and condition&nbsp;of the OWB structure. This was successfully tested, proving its effectiveness in&nbsp;detecting, localizing and tracking damage propagation&nbsp;in the composite structure, ensuring long-term reliability and safety.</p>\n\n<p>&ldquo;We collaborated with the Air Green 2 consortium to install electric sensors inside the complex wing box. This was done at full scale to validate the technologies, which was particularly significant given the 9.1-meter demonstrator length,&rdquo;&nbsp;says Leonardo&rsquo;s Ascione.</p>\n\n<p>This technology not only enhances aircraft safety by enabling real-time monitoring, it also helps with predictive maintenance&nbsp;by facilitating the collection of data that can be used to forecast when maintenance and repairs might be needed in the future.</p>\n\n<p>Following rigorous testing, including a&nbsp;full-scale&nbsp;static bending test, the project successfully validated these technologies, confirming a&nbsp;strong correlation between experimental data and numerical models. This validation was critical in achieving&nbsp;TRL 5, demonstrating the feasibility of these technologies for future aerospace applications.</p>\n\n<h3><strong>Future applications and next steps</strong></h3>\n\n<p>The success of the&nbsp;OWB demonstrator paves the way for further advancements in European aerospace&nbsp;manufacturing: The processes developed throughout the course of the project &mdash;&nbsp;notably the full-scale LRI manufacturing process for full-scale stiffened panels with integrated stringers, ribs and spars &mdash;&nbsp;can be applied not just for regional aircraft but for other aircraft sizes too (both larger and smaller), where production costs and environmental impact requirements are more challenging.</p>\n\n<p>&ldquo;The technologies developed have already been applied to other Clean Aviation projects,&rdquo;&nbsp;says Ascione. &ldquo;The LRI&nbsp;process is particularly suitable for wing, horizontal&nbsp;and vertical tail configurations with thicker composite structures.&rdquo;</p>\n\n<p>The development of the LRI process to produce stiffened wing panels will be continued in the Clean Aviation&nbsp;<a href=\"https://www.compositesworld.com/news/herwingt-project-to-design-novel-composite-wing-configuration-for-future-regional-aircraft\" target=\"_blank\">HERWINGT&nbsp;project</a>, where a different formulation of the resin will be studied to increase performance in terms of&nbsp;glass transition temperature&nbsp;and lighting strike protection.</p>\n\n<p>The part-to-part assembly technology, developed in OWB, has proven to hold potential, and will be further developed in upcoming national research projects.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/clean-sky-2-outer-wing-box-demonstrator-validates-ooa-lri-shimless-assembly-and-shm"
      }
    ],
    "link": "https://www.compositesworld.com/news/clean-sky-2-outer-wing-box-demonstrator-validates-ooa-lri-shimless-assembly-and-shm"
  },
  {
    "published": "Mon, 5 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      5,
      16,
      0,
      0,
      0,
      125,
      0
    ],
    "title": "Piasecki Aircraft grows UAV offerings with Kaman Kargo purchase",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Piasecki Aircraft grows UAV offerings with Kaman Kargo purchase"
    },
    "summary": "An agreement has been met in which Piasecki obtains Kaman&rsquo;s Kargo UAV program, with an immediate focus to transition it from prototype to production by late 2026.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "An agreement has been met in which Piasecki obtains Kaman&rsquo;s Kargo UAV program, with an immediate focus to transition it from prototype to production by late 2026."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-piasecki-kargouav.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-piasecki-kargouav.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Piasecki Aircraft Corp./<a href=\"https://www.newswire.com/news/piasecki-aircraft-acquires-kaman-air-vehicles-kargo-uav-program-22563596\" target=\"_blank\">News Wire</a></p>\n</div>\n\n<p><a href=\"https://piasecki.com/\" target=\"_blank\">Piasecki Aircraft Corp.</a> (Essington, Pa., U.S.) has acquired <a href=\"https://kaman.com/brands/kaman-air-vehicles/\" target=\"_blank\">Kaman Air Vehicles</a>&rsquo; (Bloomfield, Conn., U.S.) Kargo&nbsp;unmanned aerial vehicle (UAV)&nbsp;program. Already demonstrated in&nbsp;U.S. Marine Corps and U.S. Army military evaluation programs, trusted sources like <a href=\"https://aviationweek.com/defense/aircraft-propulsion/piasecki-acquires-heavy-lift-kargo-uav-kaman?check_logged_in=1\" target=\"_blank\"><em>Aviation Week</em> say</a> Piasecki is planning to &ldquo;accelerate development to have a production-ready vehicle prepared by late 2026.&rdquo;</p>\n\n<p>According to <a href=\"https://www.ainonline.com/aviation-news/defense/2025-04-28/piasecki-acquires-kamans-kargo-uav-program\" target=\"_blank\">ainonline.com</a>, Kaman has been working on the Kargo UAV since 2021-2022, progressing its performance targets &mdash; including a payload of up to 1,400 pounds, a range of 1,100 nautical miles and speeds up to 100 knots. The medium-lift, uncrewed logistics aircraft is designed for&nbsp;autonomous cargo delivery in contested and remote areas for both defense and commercial applications thanks to its robust&nbsp;construction, adaptability&nbsp;and a small logistical footprint.&nbsp;A <a href=\"https://www.thedroningcompany.com/blog/kaman-kargo-uav\" target=\"_blank\">2023 article</a> on the Kaman UAV by The Droning Company highlights the aircraft&rsquo;s fuselage &ldquo;composed largely of a composite shell around a lightweight aluminum structure, with the pod fitted underneath between two landing skids.&rdquo;&nbsp;</p>\n\n<p>Under the terms of the agreement, Kaman is selling all of its IP and two full-scale prototypes. <a href=\"https://www.airframer.com/news_story.html?report=33939\" target=\"_blank\"><em>Airframer</em></a> notes that all R&amp;D and operational work will now be relocated to Piasecki&rsquo;s Heliplex facility in Coatesville, Pennsylvania. The addition to Piasecki&rsquo;s&nbsp;existing rotorcraft portfolio will enhance&nbsp;its ability to deliver cutting-edge cargo transport solutions with agile logistics.</p>\n\n<p>&ldquo;This acquisition is a perfect fit for Piasecki&rsquo;s long-term vision for a family of autonomous VTOL UAS solutions to address a diverse range of customer mission requirements in both government and commercial markets,&rdquo; CEO John Piasecki has told many sources. &ldquo;Kaman&rsquo;s Kargo&nbsp;UAV program&nbsp;has already achieved significant milestones.&rdquo;</p>\n\n<p>This includes recently demonstrating&nbsp;autonomous lift capabilities for the U.S. Army and completed full flight testing using Near Earth Autonomy&rsquo;s Peregrine system.&nbsp;It has also completed the aforementioned&nbsp;military contracts.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/piasecki-aircraft-grows-uav-offerings-with-kaman-kargo-purchase"
      }
    ],
    "link": "https://www.compositesworld.com/news/piasecki-aircraft-grows-uav-offerings-with-kaman-kargo-purchase"
  },
  {
    "published": "Mon, 5 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      5,
      15,
      0,
      0,
      0,
      125,
      0
    ],
    "title": "Boeing sees early positive results in Q1 2025 report",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Boeing sees early positive results in Q1 2025 report"
    },
    "summary": "Company says that results, including&nbsp;$19.5 billion revenue,&nbsp;backlog growth of $545 billion and 737 production increase, indicate Boeing is moving in the right direction.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Company says that results, including&nbsp;$19.5 billion revenue,&nbsp;backlog growth of $545 billion and 737 production increase, indicate Boeing is moving in the right direction."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-boeing-787-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Boeing 787 Dreamliner.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-boeing-787-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>The Boeing Co. (Arlington, Va., U.S.) has recorded first quarter (Q1) 2025 results. The company cites a&nbsp;revenue of&nbsp;$19.5&nbsp;billion, primarily reflecting 130 commercial deliveries and the growth of total company backlog to $545 billion, including more than 5,600 commercial airplanes. The company reports that 737 production also gradually increased this quarter, which is still expected to reach 38/month in 2025. Overall, Boeing says Q1 2025 results reflect&nbsp;improved operational performance and commercial delivery volume. Results also reflect tariffs enacted only as of&nbsp;March 31.</p>\n\n<p>&ldquo;Our company is moving in the right direction as we start to see improved operational performance across our businesses from our ongoing focus on safety and quality,&rdquo; says&nbsp;Kelly Ortberg, Boeing president and CEO. &ldquo;We continue to execute our plan, are seeing early positive results and remain committed to making the fundamental changes needed to fully recover the company's performance while navigating the current environment.&rdquo;</p>\n\n<p>Operating cash flow was&nbsp;($1.6) billion&nbsp;in Q1, reflecting higher commercial deliveries, as well as working capital timing (Table 2). Cash and investments in marketable securities totaled&nbsp;$23.7 billion, compared to&nbsp;$26.3 billion&nbsp;at the beginning of the quarter, primarily driven by the free cash flow use in the quarter (Table 3). Debt was&nbsp;$53.6 billion, down from&nbsp;$53.9 billion&nbsp;at the beginning of the quarter due to the pay down of maturing debt. The company maintains access to credit facilities of&nbsp;$10.0 billion, which remain undrawn.</p>\n\n<p>Total company backlog at quarter end was&nbsp;$545 billion.</p>\n\n<h2><strong>Segment results</strong></h2>\n\n<p>In Boeing&rsquo;s <strong>Commercial Airplanes </strong>segment, t<span style=\"font-size: 1.1rem; letter-spacing: 0.008em;\">he 737 program gradually increased production in Q1 2025 and maintains plans to reach 3</span><span style=\"font-size: 1.1rem; letter-spacing: 0.008em;\">8/month. The 787 program continued to stabilize production at five/month in the quarter and still expects to increase to seven/month in 2025. The 777X program also began expanded FAA certification flight testing, and the company still anticipates first delivery of the 777-9 in 2026.</span></p>\n\n<p>Commercial Airplanes booked 221 net orders in Q1, including 20 777-9 and 20 787-10 airplanes for Korean Air and 50 737-8 airplanes for BOC Aviation. This segment delivered 130 airplanes (2024: 83) and backlog included more than&nbsp;5,600 airplanes valued at&nbsp;$460 billion.</p>\n\n<p>Airbus says Commercial Airplanes Q1&nbsp;revenue of&nbsp;$8.1&nbsp;billion (2024: $4.7)&nbsp;and operating margin of 6.6% (2024: 24.6%) primarily reflect higher deliveries compared to 2024.</p>\n\n<p>The <strong>Defense, Space &amp; Security</strong> segment was selected by the U.S. Air Force for a contract to design, build and deliver the F-47, its next-generation fighter aircraft. This order is not included in backlog at the end of Q1 pending completion of the source selection and evaluation review process. Backlog at Defense, Space &amp; Security was&nbsp;$62 billion, of which 29% represents orders from customers outside the U.S. Its revenue was&nbsp;$6.3 billion, and an operating margin of 2.5% reflects stabilizing operational performance.</p>\n\n<p><strong>Global Services</strong> delivered the 100th 767-300 Boeing Converted Freighter to SF Airlines and received a modification contract from the U.S. Air Force to integrate electronic warfare systems for the F-15 Eagle. In April, the company entered an agreement to sell portions of its Digital Aviation Solutions business, and the transaction is expected to close by the end of 2025 subject to regulatory approval and customary closing conditions.</p>\n\n<p>Overall, this segment&rsquo;s revenue ($5.1 billion), earnings and operation margins (18.6%) remained similar to 2024, highlighting a favorable performance and mix according to Boeing.</p>\n\n<p>Boeing provides charts and figures on its Q1 2025 results <a href=\"https://boeing.mediaroom.com/2025-04-23-Boeing-Reports-First-Quarter-Results\" target=\"_blank\">here</a>.</p>\n\n<p><em>For related content, read &ldquo;<a href=\"https://www.compositesworld.com/news/airbus-q1-2025-demonstrates-production-progress-despite-headwinds\" target=\"_blank\">Airbus Q1 2025 demonstrates production progress despite headwinds</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/boeing-sees-early-positive-results-in-q1-2025-report"
      }
    ],
    "link": "https://www.compositesworld.com/news/boeing-sees-early-positive-results-in-q1-2025-report"
  },
  {
    "published": "Mon, 5 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      5,
      14,
      0,
      0,
      0,
      125,
      0
    ],
    "title": "TAVieDA project team cuts aircraft door production time using thermoplastic composites, welding",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "TAVieDA project team cuts aircraft door production time using thermoplastic composites, welding"
    },
    "summary": "Fraunhofer groups, Trelleborg and Airbus develop&nbsp;modular, fully automated assembly system concept&nbsp;to replace metals and time-consuming assembly that shows potential for scalability.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Fraunhofer groups, Trelleborg and Airbus develop&nbsp;modular, fully automated assembly system concept&nbsp;to replace metals and time-consuming assembly that shows potential for scalability."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tavieda-clamping-element.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Clamping element.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-tavieda-clamping-element.jpg;maxWidth=720\" /> </a></div>\n\n<p>Clamping element developed at Fraunhofer IWU for automated clamping and joining of thermoplastic carbon fiber composites in aircraft doors (such as a crossbeam). Source (All Images)&nbsp;| Fraunhofer IWU</p>\n</div>\n\n<p>The TAVieDA research project by the&nbsp;Fraunhofer Institute for Machine Tools and Forming Technology (IWU, Chemnitz, Germany), the&nbsp;Fraunhofer Institute for Structural Durability and System Reliability (LBF, Darmstadt), Trelleborg (Sweden) and Airbus Helicopters (Marignane, France) demonstrates how replacing&nbsp;aluminum, titanium&nbsp;and thermosets&nbsp;primarily with carbon fiber-reinforced thermoplastic polymers&nbsp;(CFRTP) can reduce the manufacturing time for passenger aircraft doors.</p>\n\n<p>Aircraft doors are still primarily manufactured by hand. A particularly time-consuming aspect is assembling the door structures using screws and rivets. Numerous intermediate steps are required to prevent direct contact between different materials &mdash; which would otherwise lead to corrosion. Using CFRTP primarily could weld these structures together&nbsp;automatically without separating layers, partners note, dropping manufacturing time from 110 hours to 4 hours.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<blockquote>\n<p>Learn more about thermoplastic composites welding <a href=\"https://www.compositesworld.com/topics/welding\" target=\"_blank\">here</a>.</p>\n</blockquote>\n</div>\n\n<p>Another key factor in shortening assembly times is the modular design for different aircraft door variants. The project team specifically looked for components across various door models that could be standardized &mdash; and found success, for example, with the crossbeam. The researchers designed a fully automated assembly line for the most common models and developed fixtures and clamping elements suitable for resistance and ultrasonic welding technologies.</p>\n\n<p>&ldquo;Together with our colleagues at Airbus, we closely analyzed all door structures to adapt the geometries for automatic clamping and joining,&rdquo; says Dr. Rayk Fritzsche, project lead at Fraunhofer IWU. &ldquo;As a result, we could reorganize and fully automate the individual assembly steps. This way, we slash the lead time to a fraction of what it used to be.&rdquo; Manual labor is now only required to install the locking mechanism.</p>\n\n<p>Two almost identical assembly and joining lines ensure redundancy if one line is unavailable. Thanks to standardization measures, batches of 10 doors can now be organized, enabling fully automated line retooling at the end of each shift to accommodate the following model series. With a production capacity of 4,000 doors per year, partners agree that the&nbsp;new material and production concept leads&nbsp;to significant scalability benefits.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-tavieda-output-cost-model.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Cost modeling of TAVieDA project.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-tavieda-output-cost-model.jpg;maxWidth=720\" /> </a></div>\n\n<p>As part of a new approach, cost modeling was integrated directly into the simulation environment, allowing for simultaneous calculation of unit costs alongside simulation results.</p>\n</div>\n\n<p>Maxi Grobis, from IWU&rsquo;s factory planning, simulation&nbsp;and evaluation team, simulated all technical and economic aspects of the new assembly line &mdash;factors that often influence each other. Key technical assessment criteria included product and process complexity, opportunities and risks of automation (especially concerning flexibility and adaptability), and overall system availability across a chain of individual automated systems.</p>\n\n<p>Automating just for automation&rsquo;s sake wasn&rsquo;t an option. &ldquo;To deliver a truly integrated solution, we analyzed the entire door production and assembly process and translated it into a dynamic cost model,&rdquo; Grobis emphasizes. &ldquo;What works technically also has to make sense in terms of capital expenditure, machine hourly rates, maintenance effort, energy costs, capital commitment and depreciation. Focusing solely on labor cost savings or shorter lead times would be shortsighted.&rdquo;</p>\n\n<p>Considering all technical, logistical&nbsp;and financial factors, there is a clear recommendation to implement the newly developed automation solution. Grobis notes that her integrated simulation approach also reduced planning time by about 25%.&nbsp;</p>\n\n<p>&ldquo;Thinking about economics from the beginning saves unnecessary revision loops during planning,&rdquo; she concludes.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/-tavieda-project-team-cuts-aircraft-door-production-time-using-thermoplastic-composites-welding"
      }
    ],
    "link": "https://www.compositesworld.com/news/-tavieda-project-team-cuts-aircraft-door-production-time-using-thermoplastic-composites-welding"
  },
  {
    "published": "Fri, 2 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      17,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "Generative Orthoses project to reshape orthopedic care",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Generative Orthoses project to reshape orthopedic care"
    },
    "summary": "CRP Technology, MHOX and&nbsp;Istituto Ortopedico Rizzoli, one of the winners of the WORTH Partnership Project II, have developed&nbsp;bespoke orthoses using generative design, Windform GT fiberglass materials and PBF.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "CRP Technology, MHOX and&nbsp;Istituto Ortopedico Rizzoli, one of the winners of the WORTH Partnership Project II, have developed&nbsp;bespoke orthoses using generative design, Windform GT fiberglass materials and PBF."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-crp-customized-ankle-foot-orthoses.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orthosis solution.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-crp-customized-ankle-foot-orthoses.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | CRP Technology</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/crp-technology\" target=\"_blank\">CRP Technology</a> (Modena, Italy) and <a href=\"http://mhoxdesign.com/\" target=\"_blank\">MHOX Design</a>, a design research group with a focus on generative design and 3D&nbsp;printing, in collaboration with <a href=\"https://www.ior.it/\" rel=\"noopener\" target=\"_blank\">Istituto Ortopedico Rizzoli</a> (IOR, Bologna, Italy), are one of 69 winning projects under the WORTH Partnership Project II 3rd Call. The project, Generative Orthoses,&nbsp;was awarded for its use of additive technologies and high-performance composite materials to reshape orthopedic care.</p>\n\n<p>The&nbsp;WORTH II 3rd Call&nbsp;saw record-breaking participation, with&nbsp;142 applications&nbsp;and&nbsp;320 applicants&nbsp;from&nbsp;34 EU-COSME-associated countries. After a rigorous evaluation process,&nbsp;69 projects&nbsp;were selected for funding, featuring&nbsp;158 partners&nbsp;from&nbsp;25 countries&nbsp;across Europe.&nbsp;</p>\n\n<p>Over the past 8&nbsp;years, MHOX, CRP Technology, and Istituto Ortopedico Rizzoli have worked together to develop&nbsp;high-performance bespoke orthoses using body scanning, 3D digital design, CRP Technology&rsquo;s glass fiber-reinforced Windform GT composite material and the additive powder bed fusion (PBF) process.&nbsp;The project incorporates&nbsp;biomimetic design&nbsp;and advanced manufacturing techniques, improving both form and function while providing essential&nbsp;support, rehabilitation&nbsp;and postural correction.</p>\n\n<p>Using 3D printing in generative orthotics&nbsp;involves several major phases:</p>\n\n<ul>\n\t<li>Scanning of the patient&rsquo;s limb</li>\n\t<li>Generating the 3D model of the orthosis</li>\n\t<li>Construction of the orthosis using Windform&nbsp;materials and additive manufacturing.</li>\n</ul>\n\n<p>MHOX Design&nbsp;handled&nbsp;the first two stages by developing and using software designed for the automated management of systems for mass product customization.</p>\n\n<p>The procedure requires the digital uploading of the patient&rsquo;s limb that the orthosis is to fit, using scanning processes based mainly on infrared technology or structured light. The scanning process takes place directly at the doctor, thanks to the portability of the sensor and its plug-and-play features.</p>\n\n<p>Notably, generative design techniques and its simulation of&nbsp;biological phenomena make it possible to reproduce the shape of the orthosis and customize it to fit the patient&rsquo;s body for&nbsp;subsequent 3D printing. This has led to cost and time reduction, MHOX notes, and the final result mirrors the affected limb&nbsp;without the need for invasive medical examinations.</p>\n\n<p>CRP Technology&nbsp;used&nbsp;Windform&nbsp;GT, a&nbsp;glass fiber-reinforced polyamide for orthoses production. Its elasticity,&nbsp;impermeability and durability, as well as its ability to flex for extended period of time without the risk of damage made it ideal for this type of application. In addition, Windform GT&rsquo;s strength-to-weight ratio and dimensional stability ebsure that the orthotic devices remain lightweight and dirable while&nbsp;also being suitable for&nbsp;direct contact with the skin, as it is a&nbsp;skin-proof material.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-cfrp-mhox-orthoses.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-cfrp-mhox-orthoses.jpg;maxWidth=720\" /> </a></div>\n\n<p>3D printed generative and bespoke orthoses made in collaboration with MHOX.</p>\n</div>\n\n<p>CRP notes that the use of PBF is also significant, not just in terms of production speed, product performance and fit, and customization, but also regarding aesthetics for the user.</p>\n\n<p>All developed orthosis solutions have been&nbsp;subjected to a series of tests to assess their performance. The experimentation stage studied static mode, static mode applied to the patient and dynamic mode on the patient. The results have confirmed this new application for Windform&nbsp;materials and technology.</p>\n\n<p>CRP Technology&rsquo;s research into the manufacturing of generative orthotics has been met with great interest by industry professionals. The same method of construction can be used to make orthoses for upper and lower limbs, plaster casts and prosthetic fairings. CRP Technology and MHOX Design are working alongside professional physical therapists and rehabilitation specialists to investigate the construction of solutions for patients with peroneal nerve dysfunction, resulting in drop foot further to injury, leading to a &ldquo;slapping&rdquo; gait.</p>\n\n<p>Looking forward,&nbsp;CRP Technology,&nbsp;MHOX&nbsp;and Istituto Ortopedico Rizzoli continue to&nbsp;refine and automate the&nbsp;design processes, ensuring that the production of&nbsp;fully customized orthotic devices&nbsp;becomes scalable and market-ready for a broader patient base.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/generative-orthoses-project-to-reshape-orthopedic-care"
      }
    ],
    "link": "https://www.compositesworld.com/news/generative-orthoses-project-to-reshape-orthopedic-care"
  },
  {
    "published": "Fri, 2 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      17,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "Rocket Lab awarded HASTE launch contract for U.S. DOD",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Rocket Lab awarded HASTE launch contract for U.S. DOD"
    },
    "summary": "Under the MACH-TB 2.0 program led by Kratos, Rocket Lab will launch its&nbsp;full-scale HASTE rocket, a suborbital version of the Electron, to expand testing of hypersonic technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Under the MACH-TB 2.0 program led by Kratos, Rocket Lab will launch its&nbsp;full-scale HASTE rocket, a suborbital version of the Electron, to expand testing of hypersonic technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-rocketlab-kratos-haste-launch.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"HASTE rocket launch.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-rocketlab-kratos-haste-launch.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Rocket Lab USA Inc.</p>\n</div>\n\n<p>Global launch services and space systems company&nbsp;<a href=\"https://www.rocketlabusa.com/\" target=\"_blank\">Rocket Lab USA&nbsp;Inc.</a>&nbsp;(Long Beach, Calif., U.S.) has been selected by Kratos&nbsp;Defense (San Diego, Calif., U.S.) to launch a full-scale hypersonic test flight for the Department of Defense (DOD) under the Multi-Service Advanced Capability Hypersonic Test Bed (MACH-TB) 2.0 program. The mission will launch on Rocket Lab&rsquo;s HASTE rocket from Rocket Lab Launch Complex 2 on Wallops Island, Virginia, no earlier than Q1&nbsp;2026.</p>\n\n<p>The launch agreement is the first full-scale flight test to be awarded by Kratos under the MACH-TB 2.0 contract, a $1.45 billion program designed to rapidly expand the number and frequency of opportunities to test hypersonic technologies for the U.S.&nbsp;Rocket Lab was selected to join the Kratos-led team of subcontractors for MACH-TB 2.0&nbsp;in January 2025 after previously delivering multiple successful hypersonic test launches for the first iteration of the MACH-TB program from 2023. Successful missions to date include three launches for the DOD &mdash;&nbsp;including twice within just 21 days &mdash;&nbsp;from Rocket Lab&rsquo;s Launch Complex 2 in Virginia.</p>\n\n<p>A suborbital variant of the&nbsp;<a href=\"https://www.compositesworld.com/articles/rocket-lab-all-composite-electron-launch-vehicle\" target=\"_blank\"><em>Electron </em>orbital rocket</a>,<em> </em>HASTE includes much of the same innovative technology as <em>Electron</em>, including carbon fiber composite structures and 3D printed rocket engines, but has a modified upper kick stage tailored for hypersonic technology tests and a larger payload capacity of up to 700 kilograms. According to Rocket Lab,&nbsp;HASTE can deploy technologies at speeds of more than 7.5 kilometers per second to test air-breathing, glide and ballistic payloads, as well as technologies to re-enter Earth&rsquo;s atmosphere from space. Combined, Rocket Lab&rsquo;s HASTE and <em>Electron</em> launch vehicles have deployed 200-plus&nbsp;payloads to date.</p>\n\n<p>&ldquo;In less than two years since its first launch, HASTE has quickly emerged as a leading commercial test platform of hypersonic systems,&rdquo; says Sir Peter Beck, Rocket Lab founder and CEO. &ldquo;With our operational speed and cadence, and the ability to serve multiple mission profiles all in one platform, HASTE is helping to move the needle on hypersonic innovation.&rdquo;</p>\n\n<p>The mission is the latest to join an increasing manifest of HASTE launches for 2025 and 2026. Upcoming flight tests with HASTE include a mission for the Defense Innovation Unit to deploy a scram-jet powered vehicle at hypersonic speed; continuation of a multi-launch contract with Leidos to deploy five missions in total for the first iteration of the MACH-TB program; and a hypersonic test flight for a confidential customer.</p>\n\n<p>In addition to MACH-TB, HASTE has recently been onboarded to two significant defense initiatives. In the U.S., HASTE is now part of the $46 billion Enterprise-Wide Agile Acquisition Contract (EWAAC) under the U.S. Air Force. This inclusion enables Rocket Lab to compete to provide launch services and engineering expertise to support the development of new capabilities. In the U.K., HASTE has been added to the Ministry of Defence&rsquo;s&nbsp;Hypersonic Technologies &amp; Capability Development Framework (HTCDF), a &pound;1 billion (~$1.3 billion) program aimed at rapidly advancing the nation&rsquo;s hypersonic capabilities.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rocket-lab-awarded-haste-launch-contract-for-us-dod"
      }
    ],
    "link": "https://www.compositesworld.com/news/rocket-lab-awarded-haste-launch-contract-for-us-dod"
  },
  {
    "published": "Fri, 2 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      16,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "Airbus Q1 2025 demonstrates production progress despite headwinds",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus Q1 2025 demonstrates production progress despite headwinds"
    },
    "summary": "The company sticks to its full-year 2025 forecasts that exclude U.S. tariffs, including&nbsp;delivery of around 820 aircraft and production ramp-up targets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The company sticks to its full-year 2025 forecasts that exclude U.S. tariffs, including&nbsp;delivery of around 820 aircraft and production ramp-up targets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-airbus-a320-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airbus A320.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-airbus-a320-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p dir=\"ltr\">Airbus SE (Amsterdam, Netherlands) has reported consolidated financial results for the&nbsp;first quarter (Q1) of 2025, ended March 31. In that time, Airbus says that 136 commercial aircraft were delivered and revenues of&nbsp;&euro;13.5 billion were reached, with an&nbsp;&euro;0.6 billion EBIT Adjusted.</p>\n\n<p dir=\"ltr\">&ldquo;Our Q1 results demonstrate the progress we are making on our priorities across the business. We are ramping up production in line with our plan but the delivery profile will be backloaded, reflecting the specific supply chain challenges we are facing this year,&rdquo; says&nbsp;Guillaume Faury, Airbus CEO. &ldquo;We maintain the guidance that excludes tariffs which are adding complexity and remain uncertain in terms of implementation, scope and duration. We are closely monitoring and assessing the situation, but it is too early to quantify the impact today. When it comes to our defense activities, we support the recent approach to strengthen the European defense industry and we stand ready with our broad portfolio of products and solutions to respond to our customers&rsquo; requirements.&quot;</p>\n\n<p dir=\"ltr\">Gross commercial aircraft orders totaled 280 (Q1 2024: 170 aircraft) with net orders of 204 aircraft after cancellations (Q1 2024: 170 aircraft). The order backlog amounted to 8,726 commercial aircraft at the end of March 2025. Airbus Helicopters registered 100 net orders (Q1 2024: 63 units), which were well spread across the product range. Order intake by value at Airbus Defence and Space increased to &euro;2.6 billion (Q1 2024: &euro;2.0 billion), reflecting good momentum across its business lines for both platforms and services.</p>\n\n<p dir=\"ltr\">Consolidated<strong>&nbsp;revenues&nbsp;</strong>increased 6% year-on-year to &euro;13.5 billion (Q1 2024: &euro;12.8 billion). A total of 136 commercial aircraft were delivered (Q1 2024: 142 aircraft), comprising 17 A220s, 106 A320 Family, 4 A330s<sup>&nbsp;</sup>and 9 A350s. Revenues generated by Airbus&rsquo; commercial aircraft activities increased 4% to &euro;9.5 billion, mainly reflecting a more favorable foreign exchange environment which was partially offset by the lower number of deliveries.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-airbus-q125-consolidated-chart.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0525-cw-news-airbus-q125-consolidated-chart.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Airbus</p>\n</div>\n\n<p dir=\"ltr\">Airbus Helicopters&rsquo; revenues increased by 10% to &euro;1.6 billion, reflecting a solid performance from programs and growth in services. Helicopter deliveries totaled 51 units (Q1 2024: 50 units). Revenue&nbsp;at Airbus Defence and Space increased 11% year-on-year to &euro;2.7 billion, driven by higher volumes across its business lines.&nbsp;</p>\n\n<p dir=\"ltr\">Consolidated<strong>&nbsp;EBIT Adjusted&nbsp;</strong>totaled &euro;624 million (Q1 2024: &euro;577 million). EBIT&nbsp;Adjusted related to Airbus&rsquo;&nbsp;commercial aircraft activities was stable at &euro;494 million (Q1 2024: &euro;507 million), with the decrease in deliveries offset by the favorable hedge rate and lower R&amp;D expenses.</p>\n\n<p dir=\"ltr\">According to Airbus, the A320 Family program&nbsp;continues to ramp up toward a rate of 75 aircraft/month in 2027. The company is stabilizing the A330 monthly production rate at around four aircraft. Specific supply chain challenges, <a href=\"https://www.compositesworld.com/news/spirit-aerosystems-signs-divestiture-agreement-with-airbus\" target=\"_blank\">notably with Spirit AeroSystems</a>, are currently putting pressure on the ramp-up of the A350 and the A220. Airbus&nbsp;continues to target rate 12 for the A350 in 2028 and a monthly A220 production rate of 14 aircraft in 2026.</p>\n\n<blockquote>\n<p dir=\"ltr\">Read &ldquo;<a href=\"https://www.compositesworld.com/articles/composites-end-markets-aviation-and-advanced-air-mobility-(2025)\">Composites end markets: Aviation and advanced air mobility (2025)</a>&rdquo;</p>\n</blockquote>\n\n<p dir=\"ltr\">Airbus Helicopters&rsquo; EBIT Adjusted increased to &euro;78 million (Q1 2024: &euro;71 million), reflecting the solid performance in programs and services growth. In March, the new <a href=\"https://www.compositesworld.com/news/airbus-helicopters-introduces-light-twin-h140-with-2028-eic\" target=\"_blank\">H140 multi-mission helicopter</a> was introduced and received its first orders and commitments.&nbsp;&nbsp;</p>\n\n<p dir=\"ltr\">EBIT Adjusted at Airbus Defence and Space amounted to &euro;77 million (Q1 2024: &euro;-9 million), reflecting higher volumes and improved profitability mainly for Air Power services and Connected Intelligence. On the A400M program, the company remains in constructive discussions with the launch nations and OCCAR on the production plan. In light of uncertainties regarding the level of aircraft orders, Airbus continues to assess the potential impact on the program&rsquo;s manufacturing activities. Risks on the qualification of technical capabilities and associated costs remain stable.</p>\n\n<p dir=\"ltr\">Consolidated<strong>&nbsp;self-financed R&amp;D</strong>&nbsp;<strong>expenses&nbsp;</strong>totaled &euro;673 million (Q1 2024: &euro;743 million). Consolidated<strong>&nbsp;EBIT<sup>&nbsp;</sup>(reported)</strong>&nbsp;amounted to &euro;473 million (Q1 2024: &euro;609 million), including net adjustments of &euro;-151 million.</p>\n\n<p dir=\"ltr\">The financial result was &euro;621 million (Q1 2024: &euro;229 million), mainly reflecting the revaluation of certain equity investments, partially offset by the evolution of the U.S. dollar and the revaluation of financial instruments. Consolidated&nbsp;<strong>net income</strong>&nbsp;was &euro;793 million (Q1 2024: &euro;595 million) with consolidated reported&nbsp;<strong>earnings per share&nbsp;</strong>of &euro;1.01 (Q1 2024: &euro;0.76).</p>\n\n<p dir=\"ltr\">Consolidated<strong>&nbsp;free cash flow</strong>&nbsp;before customer financing&nbsp;was &euro;-310 million (Q1 2024: &euro;-1,791 million), reflecting the planned inventory buildup to support the ramp-up and the commercial momentum across the company. Consolidated&nbsp;<strong>free cash flow</strong>&nbsp;totaled &euro;-296 million (Q1 2024: &euro;-1,799 million). The&nbsp;<strong>gross cash position</strong>&nbsp;stood at &euro;26.1 billion at the end of March 2025 (year-end 2024: &euro;26.9 billion), with a consolidated&nbsp;<strong>net cash position</strong>&nbsp;of &euro;11.0 billion (year-end 2024: &euro;11.8 billion).</p>\n\n<h3>Outlook</h3>\n\n<p dir=\"ltr\">As the basis for its 2025 guidance, Airbus excludes the impact of tariffs on its business. The company&rsquo;s 2025 guidance includes the impact of the integration of certain Spirit AeroSystems work packages based on preliminary estimates and an assumed closing in the third quarter of 2025. The company assumes no additional disruptions to global trade or the world economy, air traffic, the supply chain, its internal operations and ability to deliver products and services. On that basis, Airbus targets to achieve in 2025:</p>\n\n<ul>\n\t<li>Around 820 commercial aircraft deliveries;</li>\n\t<li>EBIT Adjusted of around &euro;7.0 billion;</li>\n\t<li>Free cash flow before customer financing of around &euro; 4.5 billion.</li>\n</ul>\n\n<p dir=\"ltr\">The anticipated impact of the integration of certain Spirit AeroSystems work packages on the company&rsquo;s guidance remains in line with previous estimates.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-q1-2025-demonstrates-production-progress-despite-headwinds"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-q1-2025-demonstrates-production-progress-despite-headwinds"
  },
  {
    "published": "Fri, 2 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      16,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "Henkel, Synthomerpartner to cut carbon emissions in adhesives",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Henkel, Synthomerpartner to cut carbon emissions in adhesives"
    },
    "summary": "Integration of Synthomer Clima resins into Henkel Technomelt hot-melt adhesive portfolio targets&nbsp;significant Scope 3 GHG emissions reductions for electronics, automotive, comsumer and composites customers.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Integration of Synthomer Clima resins into Henkel Technomelt hot-melt adhesive portfolio targets&nbsp;significant Scope 3 GHG emissions reductions for electronics, automotive, comsumer and composites customers."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-henkel-hotmelt-adhesives.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Adhesive particles.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-henkel-hotmelt-adhesives.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Henkel Corp.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/henkel\" target=\"_blank\">Henkel Corp.</a> (Madison Heights, Mich., U.S.)&nbsp;a global adhesives, sealants and functional coatings supplier, and highly specialized polymers and ingredients supplier <a href=\"https://www.synthomer.com/\" target=\"_blank\">Synthomer</a> (Roebuck, S.C., U.S.) have formed a strategic partnership and supply agreement focused on enabling carbon emission reductions in Henkel&rsquo;s Technomelt&nbsp;hot melt adhesive product portfolio for the European, Indian, Middle Eastern and African markets. This collaboration highlights both companies&rsquo; leadership in advancing sustainable adhesives through innovative collaborations along the value chain.</p>\n\n<p>The&nbsp;partnership follows Synthomer&rsquo;s recent launch of Clima-branded products. Products with this designation, like the company&rsquo;s Regalite&nbsp;line, deliver at least a 20% reduction cradle-to-gate in the product carbon footprint by using renewable energy in the production process. Henkel and Synthomer have jointly developed a framework that links renewable energy use directly to specific adhesive products, enabling measurable reductions in carbon emissions.</p>\n\n<div class=\"article_sidebar\">\n<p>Hot-melt adhesives are used in a variety of industries and applications from packaging and consumer goods to electronics and automotive. They can also be a&nbsp;suitable option for some composite applications, offering benefits like fast cure times and easy application, particularly for bonding porous substrates.&nbsp;</p>\n\n<p>Technomelt adhesives are one of many solution options Henkel offers. Adhesives, sealants and surface treatment portfolios are available for composite applications, including those for repair, bonding&nbsp;and reinforcement.</p>\n</div>\n\n<p>Henkel and Synthomer&rsquo;s partnership is built on a mutual commitment to sustainability. Henkel aims to reduce absolute Scope 3 greenhouse gas (GHG) emissions by 30%&nbsp;by 2030 (base year 2021), with the goal of becoming net zero by 2045. To support this, it is incorporating raw materials with reduced process emissions footprint into adhesive formulations, lowering Scope 3 emissions while maintaining high-quality performance. Synthomer is contributing by reducing emissions from manufacturing operations, with a goal to cut absolute Scope 1 and 2 GHG&nbsp;emissions 47%&nbsp;by 2030, using 2019 as the base year in line with its Science-Based Target&nbsp;goals</p>\n\n<p>Synthomer&rsquo;s improved manufacturing approach leverages renewable electricity, biogas and process optimization to significantly reduce the carbon footprint of its products. These carbon reductions are measured through product carbon footprint (PCF) reporting, which follows ISO14067 standards and the Together for Sustainability (TfS) guidelines. The PCF methodology used in this collaboration is being externally validated by T&Uuml;V S&Uuml;D, adding a layer of verification and credibility.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/henkel-synthomer-partner-to-cut-carbon-emissions-in-adhesives"
      }
    ],
    "link": "https://www.compositesworld.com/news/henkel-synthomer-partner-to-cut-carbon-emissions-in-adhesives"
  },
  {
    "published": "Fri, 2 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      15,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "UTComp NDT inspection prepares FRP Class 40 racing sailboat",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "UTComp NDT inspection prepares FRP Class 40 racing sailboat"
    },
    "summary": "Ahead of the competitive Globe40 competition in September, UTComp&rsquo;s ultrasonic capabilities were used to test the viability of the craft&rsquo;s carbon fiber mast, boom and bowsprit on the water.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Ahead of the competitive Globe40 competition in September, UTComp&rsquo;s ultrasonic capabilities were used to test the viability of the craft&rsquo;s carbon fiber mast, boom and bowsprit on the water."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-utcomp-boat-ndt.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-utcomp-boat-ndt.jpg;maxWidth=385\" /></a></div>\n\n<p>Rob Kohli, UTComp engineering analyst, is conducting the inspection of <em>Whiskey Jack</em>. Source | Melodie Schaffer</p>\n</div>\n\n<p>Canadian composites inspection and engineering firm&nbsp;<a href=\"https://urldefense.com/v3/__http:/link.mediaoutreach.meltwater.com/ls/click?upn=7Ut9p2MRymDeJ6Cfb59TXXjdL4yxxMmYQn-2FcFc-2B-2Fdo4-3Dhn1y_62zRP68w1WV-2Bk4-2BaOruLEJ9-2BV2-2FR0sT81xH-2B9ylFc1J3sl9wM3bzHdUAugLkHuY5QfTLE-2FKpui8AmhkblZ31yOs714yoR57NqHZmMQCivO7lvDnlo8roG5nDSCdkkq7X70tFpHAt6Xka9VF5o-2FuY8cEU6tn59ixti1JJDNM829hFcUZ7fKARV6rB8quC2g4Rrq1uZD-2BupfXyU-2F-2BOaVoVO-2BSiJxeDoIgSCRXf7wLfwbyyvNuZIyX5cj7CX4TvHiSCRVFUaw2d0izQhH3p9tKr-2FdSUykluvUL3lZKbdfmAwETv5XcAU-2FhFOx-2BNU66JAxDps3nSKb2tuVtkyJNnb5fs6C-2BVC2DrWHFfBs76qQKaSjBE-2BWHFlJXB-2Fe-2B1RvtCCIn9Q-2FxSiXTXyFjWghoru64Ouw-3D-3D__;!!KeUdynatPK5p!7OAEOnpN1XwPZ2WoLrdDNcZ8mkuJORKiFBGO-VU2eXPyGy05j4I6fwS1PJmL1E_yi8r--82jFEF4W_CNvA$\" target=\"_blank\">UTComp</a>&nbsp;(Cambridge, Ontario) has achieved its first mechanical integrity inspection of a Class 40 racing sailboat ahead of the Globe40 around-the-world race. It began when UTComp&rsquo;s expertise in nondestructive assessment of fiber-reinforced polymer (FRP) industrial equipment prompted blue water sailboat racer, Melodie Schaffer, to reach out.</p>\n\n<p>&ldquo;Melodie approached us to see if we could nondestructively test the carbon fiber mast, boom and bowsprit of <em>Whiskey Jack</em>, her Class 40 offshore racing sailboat,&rdquo; explains&nbsp;Jo Anne Watton, CEO of UTComp. &ldquo;We were&nbsp;excited to provide this support &mdash;&nbsp;this project was a first for us!&rdquo;</p>\n\n<p>Schaffer is preparing the vessel for the second edition of&nbsp;<a href=\"https://www.globe40.com/en/\" target=\"_blank\">the&nbsp;Globe40</a>, a sailing race&nbsp;organized by Sirius Events.&nbsp;The first leg in the 8-month, 30,000 nautical mile event will be underway in Cadiz, Spain, starting in September 2025. It will be Schaffer&rsquo;s&nbsp;second attempt at the challenging double-handed race in which a crew of two manages all aspects of sailing, from navigation and sail handling to cooking and cleaning.</p>\n\n<p>Watton and UTComp CTO Geoff Clarkson met with Schaffer and co-skipper Jeff Engholm in Toronto in March 2025 for an up-close look at <em>Whiskey Jack</em> to start developing an UltraAnalytix inspection plan.</p>\n\n<p>Carbon fiber sailing masts and booms experience tremendous stresses and strains, especially on open water, including:</p>\n\n<ul>\n\t<li>Compression from rigging tension</li>\n\t<li>Bending from sail loads</li>\n\t<li>Local stresses at the gooseneck, which connects the boom to the mast</li>\n\t<li>Compression and shear forces at the mast step, where the base of the mast is secured to the deck or keel of the boat.</li>\n</ul>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-utcomp-whiskey-jack.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0425-cw-news-utcomp-whiskey-jack.png;maxWidth=385\" /></a></div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-UTComp-Melodie.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-UTComp-Melodie.png;maxWidth=720\" /> </a></div>\n</div>\n\n<p>From left to right: Jo Anne Watton, CEO of UTComp; Tom Shewfelt, director of sales and business development, UTComp; Geoff Clarkson, CTO of&nbsp;UTComp; Melodie Schaffer and Jeff Engholm, co-skippers of <em>Whiskey Jack</em>. Sources |&nbsp;UTComp.&nbsp;</p>\n</div>\n\n<p>It&rsquo;s not uncommon for a mast to break or fall over during a race, which is also&nbsp;devastating and potentially life-threatening for the racers.</p>\n\n<p>According to UTComp, ultrasonic&nbsp;inspection offers&nbsp;several key advantages over other nondestructive methods for assessing the condition of composite marine equipment. For example, ultrasound can be used&nbsp;to measure the thickness of the mast wall and identify voids, porosity, inclusions in the laminate and other defects in the material; flaws in the material, whether due to manufacturing defects or damage from corrosion and mechanical stresses, can result in failures.</p>\n\n<p>The UTComp inspection took place in April.</p>\n\n<p>&ldquo;In its basic form, a mast is simply a beam and our engineers are well trained to analyze and assess beams,&rdquo; Clarkson says. &ldquo;We checked every location where forces were applied to the mast to measure the effect of the forces on the polymer that holds the carbon fibers in place. We did not have details of the carbon fiber orientation and layup so we used a conservative approach that has been developed for Fitness for Service assessments of pressure vessels.&rdquo;</p>\n\n<p>The evaluation, which involves analyzing the ultrasound data using UTComp&rsquo;s proprietary algorithm,&nbsp;confirmed <em>Whiskey Jack</em> is fit for service.</p>\n\n<p>&ldquo;One more important step is complete to make sure <em>Whiskey Jack</em> is ready to race around the world,&rdquo; reports&nbsp;Schaffer on the <a href=\"https://www.instagram.com/p/DI49umSuhNB/?utm_source=ig_web_copy_link&amp;igsh=MzRlODBiNWFlZA==\" target=\"_blank\"><em>Whiskey Jack</em> 128&nbsp;Instagram page</a>.</p>\n\n<p>&ldquo;UTComp is proud to sponsor the <em>Whiskey Jack</em> crew by donating our inspection services,&rdquo; adds Watton. &ldquo;We wish them fair winds and good fortune in the Globe 40 race.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/utcomp-ndt-inspection-prepares-frp-class-40-racing-sailboat"
      }
    ],
    "link": "https://www.compositesworld.com/news/utcomp-ndt-inspection-prepares-frp-class-40-racing-sailboat"
  },
  {
    "published": "Fri, 2 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      2,
      14,
      0,
      0,
      4,
      122,
      0
    ],
    "title": "SPE Thermoset Topcon 2025 highlights thermoset technology opportunities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SPE Thermoset Topcon 2025 highlights thermoset technology opportunities"
    },
    "summary": "Industry is encouraged to attend this in-person May event which educates, promotes and recognizes technical advancements in thermosets across multiple industries. OEMs are invited to register for free.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Industry is encouraged to attend this in-person May event which educates, promotes and recognizes technical advancements in thermosets across multiple industries. OEMs are invited to register for free."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Tradeshow carpet.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-news-tradeshow-floor-GettyImages1.jpg;maxWidth=720\" /> </div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>The organizing committee for SPE&nbsp;Thermoset TopCon invites all thermoset industry professionals to register to attend the thermoset technology conference and&nbsp;expo&nbsp;<a href=\"https://spethermosets.org/topcon/\" target=\"_blank\">SPE Thermoset TopCon Conference</a> at the Monona Terrace Community &amp; Convention Center in Madison, Wisconsin from&nbsp;May 13-14, 2025.</p>\n\n<p>The SPE Thermoset Topcon 2025 event will feature technical presentations and exhibits highlighting advances in materials, processes&nbsp;and equipment for thermoset technologies in electrical, automotive, off-highway, appliance, aerospace, building and construction, oil and gas, and other industries. A list of 2025 event speakers and topics <a href=\"https://spethermosets.org/wp-content/uploads/2025/04/TOPCON25Speakers-1.pdf\" target=\"_blank\">is available here</a>.</p>\n\n<p>OEMS&nbsp;who manufacture finished products available for sale using thermoset technologies are invited to attend for FREE. To register, OEMs should select the OEM registration option. OEM companies can include the manufacture of vehicles and equipment in:</p>\n\n<ul>\n\t<li>Automotive</li>\n\t<li>Aerospace</li>\n\t<li>Military</li>\n\t<li>Heavy truck</li>\n\t<li>Lawn and garden</li>\n\t<li>Medical</li>\n\t<li>Oil and gas</li>\n\t<li>Construction</li>\n\t<li>Marine (ships, boats, etc.)</li>\n\t<li>Appliance</li>\n\t<li>Kitchen, bath and plumbing</li>\n\t<li>Electrical</li>\n\t<li>Power tools</li>\n\t<li>Doors and decks</li>\n\t<li>Recreational vehicles</li>\n\t<li>Manufactured housing</li>\n\t<li>Sports and leisure.</li>\n</ul>\n\n<p><a href=\"https://spethermosets.org/wp-content/uploads/2024/04/TOPCONSaveDate-8.pdf\" target=\"_blank\">Sponsorship opportunities are still available.</a> Contact Teri Chouinard at <a href=\"mailto:intuitgroup@gmai.com\" target=\"_blank\">intuitgroup@gmail.com</a> with inquiries.</p>\n\n<p>The SPE&rsquo;s mission is to promote scientific and engineering knowledge relating to plastics/polymers worldwide and to educate industry, academia and the public about technological advances.&nbsp;The <a href=\"https://www.compositesworld.com/suppliers/society-of-plastics-engineers-thermoset-division\" target=\"_blank\">SPE Thermoset Division</a>, a specialized technical division of SPE,&nbsp;is active in educating, promoting, recognizing&nbsp;and communicating technical advancements in thermoset technology in multiple industries.</p>\n\n<p>Thermosets offer the opportunity to consolidate complex parts, reduce weight and eliminate secondary operations&nbsp;while improving end-use performance and cost.&nbsp;They are injection, compression, and transfer moldable providing design freedom as well as a full range of properties, colors and high quality finishes.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spe-thermoset-topcon-2025-highlights-thermoset-technology-opportunities"
      }
    ],
    "link": "https://www.compositesworld.com/news/spe-thermoset-topcon-2025-highlights-thermoset-technology-opportunities"
  }
]