[
  {
    "published": "Wed, 6 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      6,
      17,
      0,
      0,
      2,
      218,
      0
    ],
    "title": "Anemoi wins U.K. funding to advance CFRP rotor sail designs",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Anemoi wins U.K. funding to advance CFRP rotor sail designs"
    },
    "summary": "Seven-month project will develop&nbsp;folding sail systems for Anemoi&rsquo;s 3.5-meter-diameter&nbsp;rotor sail, and&nbsp;cover additional design optimizations that are expected to improve the aerodynamic performance of wind-assisted vessels.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Seven-month project will develop&nbsp;folding sail systems for Anemoi&rsquo;s 3.5-meter-diameter&nbsp;rotor sail, and&nbsp;cover additional design optimizations that are expected to improve the aerodynamic performance of wind-assisted vessels."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-anemoi-5-meter-diameter-folding-rotorsails.png\" target=\"_blank\"><img alt=\"Five-meter-diameter folding rotor sails.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-anemoi-5-meter-diameter-folding-rotorsails.png;maxWidth=385\" /></a></div>\n\n<p>Anemoi&rsquo;s production base of existing 5-meter-diameter folding rotor sails. U.K. CMDC funding will be used to develop the folding system for Anemoi&rsquo;s smaller, 3.5-meter-diameter versions. Source | Anemoi</p>\n</div>\n\n<p><a href=\"https://anemoimarine.com/\" target=\"_blank\">Anemoi Marine Technologies</a>&nbsp;(London, U.K.), a company developing carbon fiber-reinforced polymer (CFRP) maritime rotor sails,&nbsp;has won funding under the sixth round of the Clean Maritime Demonstration Competition (CMDC). The &pound;1.2 million project will include the development of a next-generation folding sail system tailored to Kamsarmax and Panamax&nbsp;cargo bulk carriers, as well as aerodynamic design enhancements that will significantly increase fuel savings.</p>\n\n<p>The U.K. CMDC&nbsp;has so far directed &pound;136 million in government funding to engineering innovators developing cutting-edge maritime decarbonization solutions, with the aim of driving growth for coastal communities and cementing the U.K.&rsquo;s as a clean energy leader. The CMDC funding gives Anemoi the opportunity to further strengthen its technology leadership in the rapidly growing wind-assisted propulsion sector.</p>\n\n<blockquote>\n<p>For more information, read &ldquo;<a href=\"https://www.compositesworld.com/news/anemoi-installs-composite-rotor-sails-on-sohar-max-maritime-vessel\">Anemoi&nbsp;installs 35-meter-tall composite rotor sails on Sohar Max maritime vessel</a>&rdquo;</p>\n</blockquote>\n\n<p>&ldquo;While our rotor sails are already efficient and high-performing, ongoing innovation is essential to unlock further efficiency gains, adapt to evolving vessel designs&nbsp;and meet increasingly ambitious environmental targets,&rdquo; says Clare Urmston, CEO of Anemoi. &ldquo;This investment underscores Anemoi&rsquo;s potential to support the U.K. in sustainable shipping as the maritime industry works to cut emissions.&rdquo;</p>\n\n<p>Under the 7-month project, Anemoi will design, build and test a prototype of a novel&nbsp;folding system for its 3.5-meter&nbsp;rotor sail. The result will reportedly be an &ldquo;industry first&rdquo; for rotor sails of this size, as folding systems have previously only been used on larger 5-meter&nbsp;sails. By enabling sails to be lowered during port operations, the design has the potential to&nbsp;significantly reduce operational obstacles to the uptake of wind-assisted propulsion. Operational seamlessness is a core element of Anemoi&rsquo;s offering, as the company also offers a rail deployment system, which allows the rotor sails to move along the deck of the ship.</p>\n\n<p>In addition to folding system development, the project will cover additional design optimizations, which are expected to improve the aerodynamic performance of wind-assisted vessels, delivering increased fuel savings and emissions reductions compared to Anemoi&rsquo;s current state-of-the-art rotor sails.</p>\n\n<p>The test rig will be manufactured by U.K. company Pressure Design Hydraulics Engineers, with aerodynamic enhancements developed in partnership with Cape Horn Engineering, supported by Stehr Consulting. Victoria Steamship, a U.K.-based shipbroker, will contribute insights based on its fleet of nine vessels operating globally in the bulk carrier segment, a primary market for folding rotor sails. U.K. innovation accelerator Connected Places Catapult will conduct market research and a port and vessel integration study.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/anemoi-wins-uk-funding-to-advance-cfrp-rotor-sail-designs"
      }
    ],
    "link": "https://www.compositesworld.com/news/anemoi-wins-uk-funding-to-advance-cfrp-rotor-sail-designs"
  },
  {
    "published": "Wed, 6 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      6,
      16,
      0,
      0,
      2,
      218,
      0
    ],
    "title": "CRG Defense secures $2 million contract to build hybrid military vehicle electric motors/generators",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CRG Defense secures $2 million contract to build hybrid military vehicle electric motors/generators"
    },
    "summary": "The effort also supports&nbsp;a broader initiative to accelerate hybrid-electric propulsion technologies to&nbsp;ground and air platforms, leveraging FRP structures and composite-based magnetic retention systems.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The effort also supports&nbsp;a broader initiative to accelerate hybrid-electric propulsion technologies to&nbsp;ground and air platforms, leveraging FRP structures and composite-based magnetic retention systems."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-crg-defense.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Soldier inserts battery into tactical resupply vehicle.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-crg-defense.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | U.S. Army, Sgt. Alison Strout</p>\n</div>\n\n<p><a href=\"https://www.crgdefense.com\" target=\"_blank\">CRG Defense</a>&nbsp;(previously Cornerstone Research Group, Miamisburg, Ohio, U.S.), has secured a $2 million U.S. Army contract to design and prototype a lightweight electric motor/generator system for hybrid-electric military vehicles. The effort supports a broader $17.25 million initiative to accelerate hybrid-electric propulsion technologies for next-generation ground and air platforms.</p>\n\n<p>Under the contract, CRG Defense will develop a 50-kilowatt-class permanent magnet machine optimized for high-voltage (400-800 volt) military systems. The system will be designed, sourced&nbsp;and manufactured entirely in the U.S.</p>\n\n<p>To achieve an aerospace-grade electric machine capability tailored to high torque, speed&nbsp;and packaging demands,&nbsp;the company told <em>CW</em> that it is leveraging advanced composite methods including:</p>\n\n<ul>\n\t<li>High-rate compression molded composites for efficient, scalable production</li>\n\t<li>Fiber-reinforced polymer (FRP) structures to reduce weight while maintaining durability</li>\n\t<li>Composite-based magnetic retention systems to secure permanent magnets in high-speed rotors, where the machine topology calls for it.</li>\n</ul>\n\n<p>&ldquo;This is a clean sheet design tailored to meet Army mission needs,&rdquo; says&nbsp;Jake Monat, vice president of innovation at CRG Defense. &ldquo;We&rsquo;re building domestic capacity for power-dense electric machines that begin with defense applications and scale into commercial opportunities.&rdquo;</p>\n\n<p>According to CRG Defense, few U.S. suppliers currently offer high-voltage, high-power electric motors suitable for military use. Most are either foreign-made or designed for low-voltage systems. &ldquo;This investment helps fill a critical industrial gap,&rdquo; notes&nbsp;Chris Hemmelgarn, CTO. &ldquo;We&rsquo;re looking to partner with system integrators and OEMs that need custom-built, U.S.-made electric machines for air, land&nbsp;or maritime platforms.&rdquo;</p>\n\n<p>CRG Defense brings nearly three decades of experience developing integrated power and propulsion systems, including batteries, power electronics, controls&nbsp;and ducted fan technologies. This project builds on that foundation to deliver scalable, mission-ready solutions.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/crg-defense-secures-2-million-contract-to-build-hybrid-military-vehicle-electric-motorsgenerators"
      }
    ],
    "link": "https://www.compositesworld.com/news/crg-defense-secures-2-million-contract-to-build-hybrid-military-vehicle-electric-motorsgenerators"
  },
  {
    "published": "Wed, 6 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      6,
      15,
      0,
      0,
      2,
      218,
      0
    ],
    "title": "SGL Carbon manufactures natural fiber prepregs for motorsports",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SGL Carbon manufactures natural fiber prepregs for motorsports"
    },
    "summary": "SGL Carbon supplied prepreg&nbsp;materials made from Bcomp flax fiber fabric to Japanese company Tras Ltd. for the&nbsp;Toyota Hilux&rsquo;s natural fiber body.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "SGL Carbon supplied prepreg&nbsp;materials made from Bcomp flax fiber fabric to Japanese company Tras Ltd. for the&nbsp;Toyota Hilux&rsquo;s natural fiber body."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-sglcarbon-prepregs-motorsports.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Toyota Hilux with natural fiber body.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-sglcarbon-prepregs-motorsports.jpg;maxWidth=720\" /> </a></div>\n\n<p>Toyota Hilux. Source | SGL Carbon</p>\n</div>\n\n<p>In early July 2025, <a href=\"https://www.tras.co.jp/en/company\" target=\"_blank\">Tras Ltd.</a>&nbsp;(Mishima City), a Japan-based composites company, unveiled a natural fiber body for the Toyota <em>Hilux</em>, which will compete in the Asia Cross Country Rally in Thailand from August 8-16. <a href=\"https://www.compositesworld.com/suppliers/sgl-carbon-se\" target=\"_blank\">SGL Carbon</a> (Wiesbaden, Germany), supplied the flax fiber prepreg materials for the car&rsquo;s body.</p>\n\n<p>SGL Carbon says it has been involved in developing prepregs and components made from natural fibers, such as flax, for several years. The ampliTex natural fiber fabric is manufactured by <a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a> (Fribourg, Switzerland) &mdash; with which SGL has collaborated on various projects for some time&nbsp;&mdash; followed by&nbsp;pre-impregnation&nbsp;at SGL&rsquo;s&nbsp;site in Willich, Germany.</p>\n\n<p>&ldquo;A major challenge was the comparatively high moisture absorption of the flax fibers,&rdquo; explains Dr. Thomas Meinhardt, team lead technical marketing prepregs at SGL Carbon. &ldquo;We therefore used a special transparent, fast-curing resin system that has proven particularly resistant to, and is tolerant of, the high moisture content of natural fibers. This ensures an attractive component appearance,&nbsp;as well as&nbsp;good mechanical and thermal properties of the composite material, [all of] which are particularly important in motorsports.&rdquo;</p>\n\n<p>The finished prepregs were then processed into the final components by Tras. The company specializes in manufacturing, testing&nbsp;and demonstrating car bodies made from natural fibers. &ldquo;The use of the [SGL&rsquo;s] resin system was an important improvement for us, as we often face very high humidity in Asia, yet the components must still meet the rigorous demands of racing. With this natural car body, we now have a lightweight, sustainable component that looks great, too,&rdquo; says Masanao Nitta, CEO of Tras Ltd.</p>\n\n<p>Components made from Bcomp's flax fiber technologies offer up to 85% lower CO<sub>2</sub>&nbsp;footprint from cradle to gate compared to pure carbon fiber parts, thanks to the use of renewable raw materials and the possibility of end-of-life thermal energy recovery.</p>\n\n<p>Additionally, every gram of weight counts, especially in motorsports. In combination with Bcomp&rsquo;s powerRibs&nbsp;reinforcement grid, similar stiffness and weight as virgin carbon fiber components can be achieved. Furthermore, the natural fiber components perform well in crash tests and provide very good vibration damping, making them useful for demanding motorsport applications.</p>\n\n<p>Toyota subsidiary Toyota Customizing &amp; Development (TCD)&nbsp;and its brands TRD and Modellista, which specialize in converting vehicles into sports and special models, also expressed considerable interest in the project. Due to the high quality of the product, natural fibers may be used in future developments.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/sgl-carbon-manufactures-natural-fiber-prepregs-for-motorsports"
      }
    ],
    "link": "https://www.compositesworld.com/news/sgl-carbon-manufactures-natural-fiber-prepregs-for-motorsports"
  },
  {
    "published": "Wed, 6 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      6,
      14,
      0,
      0,
      2,
      218,
      0
    ],
    "title": "Third Re:Build Manufacturing site achieves AS9100 certification",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Third Re:Build Manufacturing site achieves AS9100 certification"
    },
    "summary": "New Kensington site certification expands Re:Build&rsquo;s aerospace and defense manufacturing footprint, offering customers an experienced, responsive partner capable of taking on mission-critical programs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New Kensington site certification expands Re:Build&rsquo;s aerospace and defense manufacturing footprint, offering customers an experienced, responsive partner capable of taking on mission-critical programs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-rebuild-site.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Re:Build exterior shot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-rebuild-site.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Re:Build Manufacturing</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/rebuild-manufacturing\" target=\"_blank\">Re:Build Manufacturing</a> (Framingham, Mass., U.S.), high-performance engineering and manufacturing company for the aerospace and defense industries, announces that its new&nbsp;manufacturing facility in New Kensington, Pennsylvania, which specializes in assembly, precision machining&nbsp;and welding, has achieved both ISO 9001 and AS9100 certifications, making it the third facility within the Re:Build ecosystem to do so.</p>\n\n<p>AS9100 is the internationally recognized quality management system (QMS) standard specifically developed for the aerospace and defense sectors. This certification reflects the site&rsquo;s commitment to delivering high-quality, reliable components and assemblies that meet the industry&rsquo;s stringent requirements. &ldquo;AS9100 certification strengthens our position as a trusted partner to our customers and opens new opportunities to support complex programmatic work in the aerospace and defense sector,&rdquo; adds Victor Mroczkowski, executive VP of&nbsp;Re:Build Manufacturing&rsquo;s New Kensington site.</p>\n\n<p>This certification supports product reliability through standardized, well-controlled processes and embeds robust quality assurance and risk management protocols throughout the production life cycle. Customers also benefit from faster qualification and audit processes, as well as more efficient collaboration through consistent documentation and traceability. Ultimately, it helps customers move faster, operate more confidently&nbsp;and meet the demands of increasingly complex aerospace and defense programs.</p>\n\n<p>Re:Build&rsquo;s&nbsp;facility has been purpose-built for scalability, with the infrastructure and resources to accommodate high-volume production.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/third-rebuild-manufacturing-site-achieves-as9100-certification"
      }
    ],
    "link": "https://www.compositesworld.com/news/third-rebuild-manufacturing-site-achieves-as9100-certification"
  },
  {
    "published": "Tue, 5 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      5,
      16,
      0,
      0,
      1,
      217,
      0
    ],
    "title": "Are you participating in National Composites Week?",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Are you participating in National Composites Week?"
    },
    "summary": "The future is lighter, stronger and more sustainable thanks to composites. Join us in spotlighting the materials shaping out world&nbsp;during #NationalCompositesWeek Aug. 25-29.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The future is lighter, stronger and more sustainable thanks to composites. Join us in spotlighting the materials shaping out world&nbsp;during #NationalCompositesWeek Aug. 25-29."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": ""
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/are-you-participating-in-national-composites-week"
      }
    ],
    "link": "https://www.compositesworld.com/news/are-you-participating-in-national-composites-week"
  },
  {
    "published": "Mon, 4 Aug 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      18,
      0,
      0,
      0,
      216,
      0
    ],
    "title": "CARBOWAVE studies microwave and plasma-induced carbonization for carbon fiber production",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CARBOWAVE studies microwave and plasma-induced carbonization for carbon fiber production"
    },
    "summary": "The European research consortium is holistically exploring the process&rsquo; improvement and commercialization for more energy-efficient, affordable materials manufacturing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The European research consortium is holistically exploring the process&rsquo; improvement and commercialization for more energy-efficient, affordable materials manufacturing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-carbowave-stabilization-furnace-pan.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Stabilization furnace for the oxidation of PAN fibers.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-carbowave-stabilization-furnace-pan.jpg;maxWidth=720\" /> </a></div>\n\n<p>Stabilization furnace for the oxidation of PAN fibers. Source | DITF</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://www.ditf.de/en/index/ditf.html\" target=\"_blank\">German Institutes of Textile and Fiber Research Denkendorf</a>&nbsp;(DITF), as part of the European CARBOWAVE research consortium, highlights a novel technology using microwaves and plasma heating to produce carbon fibers in an energy-efficient manner, which also results in more affordable production.</p>\n\n<p>Carbon fiber production is complex and energy-intensive.&nbsp;Stabilization and carbonization of the fibers, which are often made from petroleum-based polyacrylonitrile (PAN), requires slow process control in high-temperature furnaces. Despite the considerable energy input, a low material yield is achieved due to the long dwell time in the ovens.</p>\n\n<p>CARBOWAVE&rsquo;s&nbsp;solution replaces the stabilization and carbonization process. Energy is only induced into the fibers locally, thereby minimizing energy loss. This process also shortens the production time of carbon fibers, enabling higher production volumes with lower energy consumption.</p>\n\n<blockquote>\n<p>Read &ldquo;<a href=\"https://www.compositesworld.com/news/carbowave-project-finds-alternative-to-pan-conversion-with-up-to-70-less-energy-consumption\" target=\"_blank\">CARBOWAVE&nbsp;project finds alternative&nbsp;to PAN conversion with up to 70% less energy consumption</a>&rdquo;</p>\n</blockquote>\n\n<p>Their specific research objectives are to develop an optimal coating for PAN fibers that improves microwave adsorption, to develop a plasma heating system for the oxidative stabilization of PAN fibers&nbsp;and to advance microwave and plasma technology for continuous processes.</p>\n\n<p>The DITF&nbsp;is&nbsp;responsible for implementing these processes in continuous production and on pilot lines in a pilot plant. The DITF&rsquo;s central task is the stabilization of the precursor fibers with plasma technology. This involves combining plasma and low-pressure technology to reduce energy consumption in the stabilization process.</p>\n\n<p>The CARBOWAVE&nbsp;project includes recycling of carbon fibers. Partners believe that the new process will also enable&nbsp;microwave-assisted decomposition of carbon fiber composites.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/carbowave-studies-microwave-and-plasma-induced-carbonization-for-carbon-fiber-production"
      }
    ],
    "link": "https://www.compositesworld.com/news/carbowave-studies-microwave-and-plasma-induced-carbonization-for-carbon-fiber-production"
  },
  {
    "published": "Mon, 4 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      17,
      0,
      0,
      0,
      216,
      0
    ],
    "title": "IACMI’s Chad Duty presents SPE ACCE 2025 third keynote",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "IACMI’s Chad Duty presents SPE ACCE 2025 third keynote"
    },
    "summary": "Duty will share the ways in which IACMI, over its 10-year history, has led to successful and commercialized composites technologies in the automotive industry.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Duty will share the ways in which IACMI, over its 10-year history, has led to successful and commercialized composites technologies in the automotive industry."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2022-cw/1122-cw-news-chad-duty-iacmi-ceo1.jpeg;maxWidth=385\" /></div>\n\n<p>Source | IACMI</p>\n</div>\n\n<p>The SPE Automotive Division&rsquo;s (Troy, Mich., U.S.) executive planning committee has announced SPE ACCE 2025&rsquo;s third keynote speaker, Chad Duty, the CEO of&nbsp;the <a href=\"https://www.compositesworld.com/suppliers/institutef\" target=\"_blank\">Institute for Advanced Composites Manufacturing Innovation</a> (IACMI, Knoxville, Tenn., U.S.), or IACMI &ndash; The Composites Institute.</p>\n\n<p>Duty will presenting a &ldquo;Decade of Innovation: IACMI&rsquo;s Impact,&rdquo; outlining the pivotal&nbsp;role IACMI has played in accelerating advanced composites design, manufacturing, technical innovation and workforce solutions since its establishment&nbsp;by the U.S. Department of Energy (DOE)&nbsp;in 2015. IACMI celebrated its 10<sup>th</sup> anniversary on June 17, 2025. The organization leads composites technology innovation and workforce development solutions through public-private collaboration, funding projects, workforce development programs and more.</p>\n\n<p>IACMI automotive projects have led to commercialized products and technologies used in today&rsquo;s automotive industry.&nbsp;A key example is an IACMI-led project creating a compression molded composite liftgate for the Volkswagen <em>Atlas</em>, reducing weight by 35% and recurring cost by 9% versus the steel baseline.&nbsp;&nbsp;</p>\n\n<p>&ldquo;For 10 years, IACMI has harnessed the power of public-private partnerships to improve products, processes and people&rsquo;s lives through composites innovation and workforce solutions that secure America as a global leader in advanced manufacturing,&rdquo; says Duty. &ldquo;With steadfast investment and support from industry and government partners, notably the DOE and the Department of Defense, IACMI has empowered domestic manufacturers to accelerate design and commercialization, fostering a more reliable, secure and competitive U.S. economy.&rdquo;</p>\n\n<p>Duty assumed his role as IACMI CEO&nbsp;in April 2023. A professor in the Mechanical, Aerospace &amp; Biomedical Engineering Department at the University of Tennessee (UT), he also holds a joint faculty appointment with the Oak Ridge National Laboratory (ORNL).</p>\n\n<p>He has more than 20 years of research experience in advanced manufacturing &mdash;&nbsp;spanning technologies in thin film processing, printed electronics, solar energy&nbsp;and additive manufacturing of polymer composites. Before joining UT in 2015, Duty&nbsp;served as a research scientist and group leader at ORNL beginning in 2004 and helped to establish the DOE&rsquo;s Manufacturing Demonstration Facility at ORNL. Duty began his career as a senior aeronautical engineer at Lockheed Martin.</p>\n\n<p>He has a doctorate in mechanical engineering from Georgia Tech and bachelor&rsquo;s degree in mechanical engineering from Virginia Tech.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/iacmis-chad-duty-presents-spe-acce-2025-third-keynote"
      }
    ],
    "link": "https://www.compositesworld.com/news/iacmis-chad-duty-presents-spe-acce-2025-third-keynote"
  },
  {
    "published": "Mon, 4 Aug 2025 11:52:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      15,
      52,
      0,
      0,
      216,
      0
    ],
    "title": "Zoltek celebrates 50 years serving the carbon fiber industry",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Zoltek celebrates 50 years serving the carbon fiber industry"
    },
    "summary": "Since its founding in 1957 by Zsolt Rumy, Zoltek has grown its global carbon fiber capacity into what it is today, and is looking ahead to the next five decades under Toray leadership.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Since its founding in 1957 by Zsolt Rumy, Zoltek has grown its global carbon fiber capacity into what it is today, and is looking ahead to the next five decades under Toray leadership."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-zoltek-mexico-facility.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerial vehicle of Mexico facility.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-zoltek-mexico-facility.jpg;maxWidth=720\" /> </a></div>\n\n<p>Zoltek Mexico facility. Source | Zoltek</p>\n</div>\n\n<p>Industrial-grade carbon fibers company&nbsp;<a href=\"https://www.compositesworld.com/suppliers/zoltek\" target=\"_blank\">Zoltek</a>&nbsp;(St. Louis, Miss., U.S.) is celebrating&nbsp;the company&rsquo;s 50<sup>th</sup> anniversary since its founding in July 1975. Zoltek began as a small industrial distributor launched by Zsolt Rumy, a Hungarian-born engineer who came to the U.S. as a refugee in 1957.</p>\n\n<p>Rumy started Zoltek with just $8,000 and a vision to serve the chemical industry, later growing&nbsp;the company into its current position in the carbon fiber industry. His bold pivot into carbon fiber manufacturing in 1988 aided the beginning of the&nbsp;democratization of carbon fiber and laid the foundation for the company&rsquo;s global success. In 2014, Zoltek was acquired by Toray Group (Tokyo, Japan).</p>\n\n<p>&ldquo;This anniversary is a celebration of our industrial roots and a recommitment to our future,&rdquo; says&nbsp;Dave Purcell, CEO of Zoltek. &ldquo;We&rsquo;re honoring <a href=\"https://www.compositesworld.com/news/zoltek-founder-and-carbon-fiber-visionary-zsolt-rumy-passes-away-at-81\" target=\"_blank\">the legacy of Zsolt</a> with an eye on the next 50 years of innovation together now as part of the Toray Group.&rdquo;</p>\n\n<p>Zoltek&rsquo;s facilities in the U.S., Mexico&nbsp;and Hungary produce carbon fiber materials that enable lightweight solutions for wind turbine blades, aircraft, energy storage&nbsp;and a host of other industrial applications. Now with&nbsp;the support of Toray, the company is poised to enable new applications with material innovations for the next 50 years.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/zoltek-celebrates-50-years-serving-the-carbon-fiber-industry"
      }
    ],
    "link": "https://www.compositesworld.com/news/zoltek-celebrates-50-years-serving-the-carbon-fiber-industry"
  },
  {
    "published": "Mon, 4 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      15,
      0,
      0,
      0,
      216,
      0
    ],
    "title": "Airbus completes A350F freight horizontal stabilizer in Spain",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus completes A350F freight horizontal stabilizer in Spain"
    },
    "summary": "Like other parts of the large cargo aircraft, the HTP is composite, to be fitted to the first A350F aircraft for 2026-2027 flight tests.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Like other parts of the large cargo aircraft, the HTP is composite, to be fitted to the first A350F aircraft for 2026-2027 flight tests."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"A350F horizontal stabilizer.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-airbus-a350f-horizontal-stabilizer.jpg;maxWidth=385\" /></div>\n\n<p>Source | Airbus</p>\n</div>\n\n<p dir=\"ltr\">Airbus (Toulouse, France) has completed manufacturing the first horizontal stabilizer (HTP) for the A350F freighter at its plants in Spain. The C&aacute;diz facility manufactured the HTP parts, which were sent to the Getafe facility for&nbsp;assembly and outfitting.</p>\n\n<p dir=\"ltr\">The A350F is derived from the A350, which is a&nbsp;highly composites-intensive aircraft, largely made of carbon fiber-reinforced polymer&nbsp;(CFRP) materials. This includes the A350F&rsquo;s wings (Airbus completed its <a href=\"https://www.compositesworld.com/news/airbus-completes-first-a350f-wingset-in-broughton\" target=\"_blank\">first wingset</a>) and the HTP. In a June 2024 <a href=\"https://www.compositesworld.com/articles/plant-tour-aernnova-composites-toledo-and-illescas-spain\" target=\"_blank\">Aernnova Composites plant tour</a>, <em>CW</em>&rsquo;s Ginger Gardiner reports how &ldquo;Aernnova Illescas &hellip; uses automated tape laying (ATL) and fiber placement (AFP)&nbsp;to produce the CFRP&nbsp;leading edge (LE) and other components&nbsp;for the Airbus A350 horizontal tail plane.&rdquo;</p>\n\n<p dir=\"ltr\">The&nbsp;completed A350F HTP will be shipped to the Airbus Final Assembly Line (FAL) in Toulouse in the coming weeks to be joined with the fuselage of the first test aircraft. Airbus is manufacturing two A350F aircraft for flight testing in 2026 and 2027.</p>\n\n<p dir=\"ltr\">The A350F HTP can be manufactured in the same production line as the passenger version, delivering operational and industrial advantages and improvements.</p>\n\n<p dir=\"ltr\">&ldquo;The A350F will offer a clean sheet, specifically designed solution for air freight transport, bringing more efficiency and versatility to the cargo market,&rdquo; says Ricardo Rojas, president of Airbus&rsquo; Commercial Aircraft business in Spain. &ldquo;With more than 1,400 orders for the A350, including 66 A350Fs, Spain plays a key role in this program&nbsp;that presents the future in air cargo transportation.&rdquo;</p>\n\n<p dir=\"ltr\">All in all, the HTP, rear fuselage (section 19) and lower wing covers for both the A350 and A350F are manufactured in Spain. In addition, the A350F's main deck cargo door, said to be the largest in the industry, will also be manufactured in&nbsp;Spain. Made from composites, it has a 4.3-meter opening, making&nbsp;loading and unloading easier, faster and safer.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-completes-a350f-freight-horizontal-stabilizer-in-spain"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-completes-a350f-freight-horizontal-stabilizer-in-spain"
  },
  {
    "published": "Mon, 4 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      4,
      14,
      0,
      0,
      0,
      216,
      0
    ],
    "title": "Carbon fiber boosts dry-processed battery performance",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Carbon fiber boosts dry-processed battery performance"
    },
    "summary": "ORNL researchers have found that dry-processed films incorporating long carbon fibers&nbsp;improves strength and conductivity for more affordable lithium-ion battery electrodes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ORNL researchers have found that dry-processed films incorporating long carbon fibers&nbsp;improves strength and conductivity for more affordable lithium-ion battery electrodes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-ornl-carbon-fiber-snippets.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Carbon fiber snippets.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-ornl-carbon-fiber-snippets.jpg;maxWidth=720\" /> </a></div>\n\n<p>Although they barely cover a fingertip, these carbon fiber snippets are the longest to be incorporated into a battery film, enabling faster transfer of electrons. Source | Carlos Jones/ORNL, U.S. Department&nbsp;of Energy</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/oak-ridge-national-laboratory\" target=\"_blank\">Oak Ridge National Laboratory</a> (ORNL, Tenn., U.S.) researchers have overcome a barrier to using a more affordable, dry process &mdash; incorporating composite materials&nbsp;&mdash; for manufacturing lithium-ion batteries used in vehicles and electronic devices. The resulting batteries have been found to provide greater electricity flow and reduced risk of overheating.</p>\n\n<p>Dry processing is a method for making electrode films that eliminates the need for wet organic solvents that require increased factory floor space, time, energy, waste disposal and startup expenses. However, dry-processed films tear easily. So ORNL researchers&nbsp;<a href=\"https://www.ornl.gov/technology/202405686\" target=\"_blank\">incorporated long carbon fibers</a>, then tested coin cell batteries made from the material. They found the films were stronger&nbsp;and more flexible. The long fibers improved the mechanical strength of the material while transferring electrons further for faster charging and discharging rates.</p>\n\n<p>While others have experimented with nanoscale carbon fibers, ORNL is the first to use long carbon fibers, says&nbsp;scientist Jaswinder Sharma. The chemical cost savings would exceed the price of the fiber, which constitutes only 1% of the weight.&nbsp;</p>\n\n<p>&ldquo;We think this is the next step in bringing dry-processed electrodes near to widespread use,&rdquo; Sharma adds. &ldquo;By eliminating expensive solvents and simplifying manufacturing, this method could help U.S. battery producers compete more effectively in the global market.&rdquo;</p>\n\n<p>The ORNL project is funded by the Department of Energy&rsquo;s Advanced Materials and Manufacturing Technologies Office.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/carbon-fiber-boosts-dry-processed-battery-performance"
      }
    ],
    "link": "https://www.compositesworld.com/news/carbon-fiber-boosts-dry-processed-battery-performance"
  }
]