[
  {
    "published": "Tue, 21 Oct 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      21,
      15,
      0,
      0,
      1,
      294,
      0
    ],
    "title": "FlexCyle project targets TPC waste recovery, repurposing at same site",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FlexCyle project targets TPC waste recovery, repurposing at same site"
    },
    "summary": "Led by the Brightland Materials Center, consortium members are developing a flexible process chain, demonstrated via&nbsp;battery casings and wind blades, to repurpose waste directly where it is generated.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Led by the Brightland Materials Center, consortium members are developing a flexible process chain, demonstrated via&nbsp;battery casings and wind blades, to repurpose waste directly where it is generated."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<h3>&nbsp;</h3>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-materials-recycling-gettyimages1.jpg\" target=\"_blank\"><img alt=\"Female worker checks bags of plastic resin.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-materials-recycling-gettyimages1.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>What if industry could turn fiber-reinforced thermoplastic composites waste directly&nbsp;into functional products, right where the waste is generated? That is the driving question behind FlexCyle, a project led by the&nbsp;<a href=\"https://www.compositesworld.com/suppliers/brightlands-materials-center\" target=\"_blank\">Brightlands Materials Center</a>&nbsp;(Geleen, Netherlands) developing flexible and compact recycling solutions for thermoplastic composites (TPC).&nbsp;</p>\n\n<p>FlexCyle&rsquo;s consortium &mdash; TNO, CHILL, eModum, Novocycle and Poly Products&nbsp;&mdash; aims to solve this by combining shredding, compounding and extrusion-based 3D printing into one process chain. The result will be a&nbsp;flexible production line that can process TPC&nbsp;waste into functional products, right on-site.&nbsp;</p>\n\n<p>The project is based at the Brightlands Chemelot Campus in South Limburg and is co-funded by the European Union through the Just Transition Fund (JTF). Partners CHILL and eModum B.V. will develop an integrated recycling line that combines shredding, compounding&nbsp;and fused granulate fabrication 3D printing (FGF 3D printing) to locally turn TPC&nbsp;waste into new, functional products.&nbsp;&nbsp;</p>\n\n<p>The&nbsp;technology will also be demonstrated by two partners via&nbsp;two practical applications: Novocycle Technologies B.V. will recycle battery casings and Poly Products B.V. will develop structural parts for a wind turbine blade bridge.&nbsp;&nbsp;</p>\n\n<p>In FlexCyle, recovered&nbsp;plastics from dismantled battery packs used in mobility applications&nbsp;are granulated and compounded, sometimes with additional fillers like glass fibers, to retain or enhance performance. The material is then used&nbsp;in direct granulate 3D printing to create custom-fit casings for second-life batteries.</p>\n\n<p>In the decommissioned wind turbine blades use case, the blades are repurposed as structural elements in bridges. FlexCycle technology is to be used to 3D print custom components that link the curved blade shapes, enabling a robust, future-proof bridge structure from upcycled materials.&nbsp;</p>\n\n<p>In addition to its technical goals, the project involves at least 12 students and creates eight new jobs at CHILL and eModum.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/flexcyle-project-targets-tpc-waste-recovery-repurposing-at-same-site"
      }
    ],
    "link": "https://www.compositesworld.com/news/flexcyle-project-targets-tpc-waste-recovery-repurposing-at-same-site"
  },
  {
    "published": "Mon, 20 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      20,
      17,
      0,
      0,
      0,
      293,
      0
    ],
    "title": "Atomic-6 composite Space Armor shields space operation communications, spacecraft and astronauts",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Atomic-6 composite Space Armor shields space operation communications, spacecraft and astronauts"
    },
    "summary": "Lightweight radio frequency-permeable orbital debris shield mitigates the creation of harmful debris upon impact and has proven to protect against the high-speed particles traveling space.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Lightweight radio frequency-permeable orbital debris shield mitigates the creation of harmful debris upon impact and has proven to protect against the high-speed particles traveling space."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-atomic6-space-armor-tile.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Space Armor tile.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-atomic6-space-armor-tile.jpg;maxWidth=720\" /> </a></div>\n\n<p>Space Armor tile. Source (All Images) | Atomic-6</p>\n</div>\n\n<p><a href=\"https://www.atomic-6.com/\" target=\"_blank\">Atomic-6</a>&nbsp;(Marietta, Ga., U.S.), a manufacturer of advanced mobility composites, introduces <a href=\"https://www.atomic-6.com/spacearmor\" target=\"_blank\">Space Armor</a> tiles &mdash; a&nbsp;radio frequency-permeable, fragmentation-resistant orbital debris shield product for spacecraft and astronauts. Its ability to resist impact while enabling mission-critical radio communications makes it well suited for&nbsp;government and commercial satellites, protecting&nbsp;the future of human space activity and ensuring responsible space stewardship.</p>\n\n<p>Satellites and astronauts are constantly threatened by millions of untrackable, hypervelocity particles in orbit, capable of traveling at velocities greater than 7 kilometers per second &mdash; nearly 16,000 miles per hour&nbsp;&mdash; and causing violent explosions on impact, which could penetrate&nbsp;fuel tanks, space suits,&nbsp;and tear&nbsp;apart batteries and structures. Traditional&nbsp;ballistic space &ldquo;Whipple shields&rdquo; that&nbsp;have existed since the 1950s have a metallic makeup, which is&nbsp;prohibitively heavy, blocks vital radio signals&nbsp;and, when impacted, can often create more debris than it stops.</p>\n\n<p>Atomic-6 has demonstrated that its Space Armor&nbsp;tiles are both orbital debris shielding and RF-permeable, enabling hypervelocity impact protection for communications devices. &ldquo;This is a big deal. We made the first radomes that can stop orbital debris,&rdquo; says&nbsp;Trevor Smith, CEO of&nbsp;Atomic-6. &ldquo;You don&rsquo;t have to sacrifice communications to protect your spacecraft anymore. This little composite tile preserves mission-critical functions, thereby protecting spacecraft, space stations&nbsp;and people in orbit from increasingly prevalent, yet invisible threats.&rdquo;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-atomic6-space-armor-test.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-atomic6-space-armor-test.jpg;maxWidth=720\" /> </a></div>\n\n<p>Demonstrated test against an aluminum shield.</p>\n</div>\n\n<p>Space Armor&nbsp;tiles, developed via the company&rsquo;s proprietary manufacturing process,&nbsp;are lighter and thinner than traditional Whipple shields, easy to install&nbsp;and mitigates the creation of harmful debris. As demonstrated against aluminum,&nbsp;Space Armor&nbsp;tiles successfully stop a &gt;7 kilometer/second projectile,&nbsp;producing virtually no byproducts. The aluminum equivalent shield, on the other hand, creates fragments larger than the initial projectile, and spalling debris behind the point of impact, which could damage the system it's meant to protect.</p>\n\n<p>Atomic-6 has developed two scalable protection levels in either RF-permeable or RF-blocking configurations:</p>\n\n<ul>\n\t<li>Space Armor Lite: Withstands debris impacts up to 3 millimeters, which accounts for all untrackable debris and more than 90% of all low-Earth orbit (LEO) debris.</li>\n\t<li>Space Armor&nbsp;Max: Built for the most extreme conditions, it resists impacts up to 12.5 millimeters, rated for human space station protection.</li>\n</ul>\n\n<p>Both variants minimize shielding mass, stowage volume, post-impact ejecta and overall mission risk.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/atomic-6-composite-space-armor-shields-space-operation-communications-spacecraft-and-astronauts"
      }
    ],
    "link": "https://www.compositesworld.com/news/atomic-6-composite-space-armor-shields-space-operation-communications-spacecraft-and-astronauts"
  },
  {
    "published": "Mon, 20 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      20,
      16,
      0,
      0,
      0,
      293,
      0
    ],
    "title": "Purdue, AnalySwift launch CompositesAI platform to democratize air mobility structure design",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Purdue, AnalySwift launch CompositesAI platform to democratize air mobility structure design"
    },
    "summary": "CompositesAI integrates with AnalySwift&rsquo;s VABS and SwiftComp software to streamline the design, simulation&nbsp;and performance evaluation of composite structures &mdash; especially rotor blades, shells and panels.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "CompositesAI integrates with AnalySwift&rsquo;s VABS and SwiftComp software to streamline the design, simulation&nbsp;and performance evaluation of composite structures &mdash; especially rotor blades, shells and panels."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-analyswift-compositesai-actual1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CompositesAI platform chart.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-analyswift-compositesai-actual1.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Wenbin Yu</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/analyswift\" target=\"_blank\">AnalySwift LLC</a> (West Lafayette, Ind., U.S.) has partnered with Purdue University (West Lafayette) researchers to create CompositesAI, an AI platform that will help users more quickly&nbsp;create and analyze composite products designed with other AnalySwift software solutions.&nbsp;Designers and engineers can use the free platform at&nbsp;<a href=\"https://compositesai.com/\" target=\"_blank\">CompositesAI.com</a>.</p>\n\n<p>AnalySwift offers software for the burgeoning air mobility industry to design composite rotor blades and propellers, components common to these vehicles. As air mobility companies mature, says&nbsp;CEO Allan Wood, many engineers encounter&nbsp;difficulty in modeling complex multi-material, multilayer rotor blades.</p>\n\n<p>&ldquo;They [the air mobility industry] need blades with very specific shapes and performance characteristics such as inertial, elastic and strength properties,&rdquo; Wood explains. &ldquo;While air mobility engineers may have strong knowledge of composite materials and structures, blades often require specialized experience, which meant outsourcing this key component or hiring blade engineers. CompositesAI, paired with AnalySwift&rsquo;s blade modeling software, VABS, helps overcome this challenge.&rdquo;</p>\n\n<p>As an example, an engineer could describe a helicopter or air mobility blade in natural language through the platform. &ldquo;CompositesAI translates that language into the specialized input files needed to design the blade with VABS,&rdquo; Wood explains. &ldquo;This helps engineers more quickly develop products without requiring detailed technical knowledge related to using AnalySwift&rsquo;s tools, VABS and SwiftComp.&rdquo;</p>\n\n<p>AnalySwift partnered with&nbsp;Wenbin Yu&nbsp;on the CompositesAI project. Yu is the Milton Clauser Professor of Aeronautics and Astronautics at Purdue&rsquo;s&nbsp;College of Engineering&nbsp;and AnalySwift&rsquo;s chief technology officer.</p>\n\n<p>The CompositesAI project focused on four objectives:</p>\n\n<ul>\n\t<li>Train CompositesAI to be an AI-powered tech support system for AnalySwift products.</li>\n\t<li>Develop a feedback mechanism so users can provide questions and answers to further improve the performance of CompositesAI.</li>\n\t<li>Develop an AI-human interactive platform so AnalySwift engineers can collaborate with CompositesAI to answer customers and automatically collect answers to further improve CompositesAI.</li>\n\t<li>Develop application programming interfaces so input files can be easily generated and companion software can be invoked for AnalySwift products.</li>\n</ul>\n\n<p>Yu says&nbsp;CompositesAI is initially focused on rotor blades for air mobility, helicopters, unmanned aerial vehicles, drones and wind turbines, but its uses will expand.</p>\n\n<p>&ldquo;It will soon be able to handle other composite structures such as plates, shells, panels and other 3D structures used by engineers in designing the next generation of aerospace, defense, energy, medical and sporting goods applications,&rdquo; he notes. &ldquo;Once fully developed, CompositesAI will be capable of handling all aspects of composites with the precision of validated engineering software and authority of world-leading experts.&rdquo;</p>\n\n<p>AnalySwift has partnered with Indiana-based Applied Research Institute, an economic development organization whose innovation voucher program provided matching funding to further the objectives of the partnership with Purdue. AnalySwift licenses some of its innovations through the&nbsp;Purdue Innovates Office of Technology Commercialization.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/purdue-analyswift-launch-compositesai-platform-to-democratize-air-mobility-structure-design"
      }
    ],
    "link": "https://www.compositesworld.com/news/purdue-analyswift-launch-compositesai-platform-to-democratize-air-mobility-structure-design"
  },
  {
    "published": "Mon, 20 Oct 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      20,
      15,
      0,
      0,
      0,
      293,
      0
    ],
    "title": "Safran invests €350 million in Moroccan industrial LEAP engine footprint scale-up, extensions",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Safran invests €350 million in Moroccan industrial LEAP engine footprint scale-up, extensions"
    },
    "summary": "Between 2026-2027, Safran begins construction for two LEAP engine MRO facilities, a LEAP-1A assembly line and&nbsp;expansion of three existing sites.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Between 2026-2027, Safran begins construction for two LEAP engine MRO facilities, a LEAP-1A assembly line and&nbsp;expansion of three existing sites."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"LEAP engine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-leap-engine-cfminternational.jpg;maxWidth=385\" /></div>\n\n<p>LEAP engine. Source | CFM International</p>\n</div>\n\n<p><a href=\"https://www.safran-group.com/\" target=\"_blank\">Safran Aircraft Engines</a>&nbsp;(Paris, France) launched its new LEAP engine maintenance, repair and overhaul (MRO) shop on Oct. 13. This Casablanca, Morocco MRO facility, which was originally announced in October 2024, is located in the Casablanca airport zone. It will support the rapidly increasing demand for CFM International&nbsp;<em>(note: CFM is a&nbsp;50/50 joint venture between Safran and GE Aerospace)</em><span style=\"font-size: 13.2px;\"> </span>LEAP engines, which power the majority of new-generation single-aisle commercial jets &mdash; especially the Airbus A320neo and Boeing 737 <em>Max</em>.</p>\n\n<p>Spanning 25,000 square meters,&nbsp;the shop will be able to handle 150 engines a year. Operations are expected to begin in 2027, and some 600 new jobs will be created by 2030. The new facility represents an investment of around &euro;120 million.</p>\n\n<p>Safran has also chosen Morocco as the location for a new assembly line for LEAP-1A engines dedicated to Airbus aircraft. The facility will complement production at Safran&rsquo;s Villaroche site in France to support the significant ramp-up in production planned by CFM International &mdash; around 2,500 LEAP engines a year from 2028. Located on a 13,000-square-meter&nbsp;site, the plant will be operational by the end of 2027 and will have the capacity to assemble up to 350 engines per year. The company is investing &euro;200 million&nbsp;into the new facility.</p>\n\n<p>This industrial complex dedicated to new-gen&nbsp;aircraft engines will benefit from a single test bench for both new and overhauled LEAP engines.&nbsp;In addition, as part of its strategy to reduce carbon emissions from its operations<span style=\"font-size: 13.2px;\"> </span>by 50% by 2030, compared with 2018 levels, Safran also signed a memorandum of understanding guaranteeing access to renewable energy for most of its facilities in Morocco, taking effect in 2026.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>In 2024 alone, Safran made a series of announcement and agreements concerning related to LEAP engine production expansion and support:</p>\n\n<ul>\n\t<li><a href=\"https://www.compositesworld.com/news/safran-expands-leap-engine-production-capacity-in-queretaro\">Safran expands LEAP engine production capacity in Quer&eacute;taro</a></li>\n\t<li><a href=\"https://www.compositesworld.com/news/safran-invests-over-1-billion-to-develop-leap-engine-mro-network\">Safran invests over &euro;1 billion to develop LEAP engine MRO network</a></li>\n\t<li><a href=\"https://www.compositesworld.com/news/gkn-aerospace-expands-leap-engine-support-with-safran\">GKN Aerospace expands LEAP engine support with Safran</a></li>\n</ul>\n</div>\n</div>\n\n<p>Safran is further&nbsp;bolstering its presence in Morocco through the expansion of three existing sites: Safran Aerosystems &ndash; Tiflet, Safran Electronics &amp; Defense &ndash; Casablanca&nbsp;and Safran Electrical &amp; Power &ndash; Ain Atiq. These newly expanded facilities will begin operations between 2026 and 2027.&nbsp;</p>\n\n<p>Overall, Safran is investing more than &euro;350 million&nbsp;in Morocco in the two new LEAP engine facilities and the extensions. Furthermore, to support this scaling up of operations, Safran will be recruiting more than 2,000 people over the next 5&nbsp;years.&nbsp;</p>\n\n<p>Safran has been present in Morocco for 26 years and employs more than&nbsp;4,800 people at 10 sites. The group leads Morocco&rsquo;s aerospace sector and maintains close partnerships with local companies and the country&rsquo;s government institutions and training centers.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/safran-invests-350-million-in-moroccan-industrial-leap-engine-footprint-scale-up-extensions"
      }
    ],
    "link": "https://www.compositesworld.com/news/safran-invests-350-million-in-moroccan-industrial-leap-engine-footprint-scale-up-extensions"
  },
  {
    "published": "Mon, 20 Oct 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      20,
      14,
      0,
      0,
      0,
      293,
      0
    ],
    "title": "Composites sustainability wins: EcoVadis and CDP awards, water stewardship, GHG reduction",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composites sustainability wins: EcoVadis and CDP awards, water stewardship, GHG reduction"
    },
    "summary": "Composites companies like Syensqo, Daher, Kordsa, Henkel, Armacell, Gurit, Diab and Envalior&nbsp;are leading the charge in operations transparency, climate action, more sustainable infrastructure and other areas.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Composites companies like Syensqo, Daher, Kordsa, Henkel, Armacell, Gurit, Diab and Envalior&nbsp;are leading the charge in operations transparency, climate action, more sustainable infrastructure and other areas."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<h2>&nbsp;</h2>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-climateaction-gettyimages1.jpg\" target=\"_blank\"><img alt=\"Abstract image of climate action.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-climateaction-gettyimages1.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>Across the composites industry, leading companies are making measurable progress in aligning with global sustainability benchmarks. From pursuing top-tier EcoVadis ratings and CDP recognition&nbsp;to integrating environmental, social and governance (ESG)&nbsp;principles into core operations, these organizations are demonstrating that innovation in composites can go hand-in-hand with climate action and responsible business practices. Their efforts not only reduce environmental impact but also set new standards for transparency, circularity&nbsp;and long-term value across the supply chain.</p>\n\n<h2>Ecovadis&nbsp;awards</h2>\n\n<p>Founded in 2007, <a href=\"https://ecovadis.com/\" target=\"_blank\">EcoVadis</a>&nbsp;(Paris, France) assesses more than 130,000 companies across 180 countries and 220 industries, making it the largest and most trusted sustainability rating provider. It evaluates&nbsp;companies across four key themes: Environment, Labor &amp; Human Rights, Ethics&nbsp;and Sustainable Procurement.</p>\n\n<h3>Armacell&nbsp;foam manufacturing achieves Silver Medal in 2024</h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/armacell\" target=\"_blank\">Armacell</a>&rsquo;s&nbsp;(Brampton, Ontario, Canada)&nbsp;Thimister&nbsp;plant &mdash; producing&nbsp;PET foams, structural foam core and other related products for the composites industry&nbsp;&mdash; was awarded a Silver Medal in the EcoVadis sustainability assessment in 2024, placing it among the top 15% of more than 130,000 companies assessed globally.&nbsp;This Silver Medal recognition places Thimister in the 91st percentile globally, highlighting its commitment to sustainability and its comprehensive management systems for policy formulation, implementation&nbsp;and results reporting.&nbsp;&nbsp;</p>\n\n<h3><strong>Gurit&nbsp;earns Gold Metal for sustainability,&nbsp;performance commitment</strong></h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gurit-uk\" target=\"_blank\">Gurit</a>&nbsp;(Zurich, Switzerland), for the second time, was awarded a Gold Medal by EcoVadis earlier this year. Over the past 3&nbsp;years, the company&rsquo;s overall score has improved by 44%, placing it among the top 5% of companies assessed by EcoVadis globally.&nbsp;</p>\n\n<p>Gurit&rsquo;s success is a result of the collective efforts of dedicated colleagues. Across all functions, regions and levels, staff are engaged in sustainability initiatives, working together to make a positive impact on the planet and society. This collaborative approach is central to the company&rsquo;s achievements and long-term strategy.</p>\n\n<h3><strong>Diab Group&rsquo;s Gold Medal supports&nbsp;sustainability excellence</strong></h3>\n\n<p>Sandwich materials manufacturer <a href=\"https://www.compositesworld.com/suppliers/diab-international-ab\" target=\"_blank\">Diab</a> (Laholm, Sweden) has been awarded EcoVadis&rsquo; Gold Medal, the first time the company has reached this level, reflecting on the&nbsp;group&rsquo;s strengthened sustainability performance across all core areas.</p>\n\n<p>The strongest progress has been within the environmental area, where the science-based targets (SBTs) have now been validated and approved for a second time.&nbsp;The company&rsquo;s progress is made possible through the dedication and collaboration of employees across all parts of the organization &mdash;&nbsp;from production teams to management.</p>\n\n<h3>Kordsa&nbsp;receives Gold Metal for&nbsp;second consecutive year</h3>\n\n<p>Material technologies company <a href=\"https://www.compositesworld.com/suppliers/kordsa\" target=\"_blank\">Kordsa</a> (Izmut, Turkey) was once again awarded a Gold Medal by EcoVadis in November 2024 for its successful performance in sustainability.</p>\n\n<p>&ldquo;To achieve our sustainability goals, we shape our strategic roadmap with a holistic approach that encompasses all elements of ESG,&rdquo; explains Nevra Aydoğan G&uuml;rsoy, Kordsa&rsquo;s director of sustainability and communications. &ldquo;As an industrial company focused on advanced materials, we understand that the good practices we implement in key areas &mdash; such as environment, labor and human rights, ethics&nbsp;and sustainable procurement &mdash; are contributing to positive transformations in all areas we touch.&rdquo;</p>\n\n<h2>CDP drives sustainability progress</h2>\n\n<p><a href=\"https://connect-eu.notified.com/Tracker?data=W0vzKvPwk85L45a0Tvcfh4ColBDnbMOiSiRUfEVqr7ApwchPO07aQ3m_crrJCPoMdOK8JFkNdkygCtBTiamPtw==000340889631\" target=\"_blank\">CDP</a>&nbsp;(London, U.K.) is a&nbsp;global non-profit organization recognized for its environmental benchmarking platform, scoring companies on their transparency and performance related to climate change, water risks&nbsp;and deforestation.&nbsp;This information is used by investors and other stakeholders to make informed decisions and drive progress toward a more sustainable economy.</p>\n\n<h3>Syensqo achieves&nbsp;CDP&rsquo;s leadership tier in&nbsp;climate score, water stewardship</h3>\n\n<p>In September 2024, <a href=\"https://www.compositesworld.com/suppliers/solvay-composite-materials\" target=\"_blank\">Syensqo</a>&nbsp;(Brussels, Belgium) announced its first One Planet target for Nature, focusing on water stewardship. It reported a dedication to achieve&nbsp;a 20% average reduction in fresh water intake by 2030 compared to 2021 at sites exposed to water availability challenges. This ambitious goal translates to a reduction of more than 7 million cubic meters of fresh water intake. To meet this new goal and mitigate impact on water quality, the company concentrated efforts on 15 key sites, equipping them with&nbsp;comprehensive water stewardship plans to address water quantity and quality-related risks and impacts while aligning with the company&rsquo;s growth ambitions.</p>\n\n<p>As of&nbsp;September 2025,&nbsp;Syensqo has achieved an A-rating for Climate Change in the 2024 CDP assessment, a rating achieved by only around the top 5% of companies scored by CDP worldwide. In addition to its strong climate score, Syensqo received an A-rating for its Supplier Engagement Assessment (SEA), earning a place on CDP&rsquo;s &ldquo;SEA A List.&rdquo; Syensqo also earned a B-rating for water stewardship, reflecting robust management practices and its ongoing commitment to responsible water use, per its goal mentioned above.</p>\n\n<p>Syensqo&rsquo;s climate action is guided by its <a href=\"https://connect-eu.notified.com/Tracker?data=cdwpZKtMPAOX9o7uAuBylhQLujUFvRO9nVNoHgxTwqTeF_OTjCbCbosbvcla9UudsAuhd-cklE4du68kfKawM9zLH75UysMv1p1T5yqrS1vwYamUWcRikQ8cG0JSN6qLjzsZAcKmc-9U0xvYo75d6w==000340889631\" target=\"_blank\">One Planet roadmap</a>, with a goal of carbon-neutral operations (scope 1 and 2) by 2040. As of 2024, Syensqo has already achieved 50% of its 2030 GHG reduction targets, which cover scopes 1, 2 and 3 and have been validated by the science-based targets initiative (SBTi), through permanent&nbsp;structural changes.</p>\n\n<p>By 2030, Syensqo aims to reduce scope 1 and 2 GHG emissions from its own operations by 42% compared to a 2021 baseline. Today, three out of every four Syensqo sites are powered by renewable electricity, including all sites in the U.S. and China. For scope 3 emissions, Syensqo targets a 25% reduction by 2030 in Focus 5 categories&nbsp;of its value chain, compared to a 2021 baseline. To achieve this, the group is collaborating closely with suppliers and customers, particularly through its Supplier Climate Pledge, which covers 80% of Syensqo GHG emissions linked to raw material sourcing.</p>\n\n<h3><strong>Kordsa&nbsp;recognized on CDP 2024 Global A List</strong></h3>\n\n<p>Kordsa&nbsp;reported earlier this year that the company was&nbsp;recognized on the CDP&rsquo;s 2024 Global A List for both Climate Change and Water themes. This marks the first time Kordsa has achieved an A-rating in both categories.</p>\n\n<p>Kordsa previously secured a place on the Global A List for Water theme in 2021 and 2022. According to the CDP 2024 results, Kordsa has been evaluated among more than 22,000 corporate companies.</p>\n\n<h3>Daher implements concrete ESG action</h3>\n\n<p><a href=\"https://www.daher.com/en/\" target=\"_blank\">Daher</a>&rsquo;s&nbsp;(Nantes, France) ESG&nbsp;performance have been recognized by two globally renowned organizations. The Daher Group received a B-rating from the CDP for its contribution to fighting climate change, as well as the EcoVadis&nbsp;Bronze Medal for its work in environmental matters, human rights, ethics and responsible purchasing.</p>\n\n<p>These evaluations &mdash;&nbsp;combined with the renewal of the Supplier Relations and Responsible Purchasing (RFAR) and the Top Employer France labels for the third consecutive year &mdash; highlight Daher&rsquo;s ambition to implement ESG practices and deliver tangible results.</p>\n\n<p>With the EcoVadis bronze medal and a score of 64/100, Daher ranks among the top 20%&nbsp;of companies in the sustainability field. Daher particularly stands out in the area of responsible purchasing, where it earned a score of 70/100 (compared to an industry average of 40/100).&nbsp;<br />\n&nbsp;</p>\n\n<h2>Additional sustainability strategies</h2>\n\n<h3>Envalior&nbsp;aims for 100% GHG emission reduction by 2040, 100% renewable electricity by 2030</h3>\n\n<p>To fulfill <a href=\"https://www.envalior.com/\" target=\"_blank\">Envalior</a>&rsquo;s&nbsp;(D&uuml;sseldorf, Germany) sustainability aim, the company has formed several sustainability ambitions and joined the&nbsp;United Nations (UN) Global Compact. Envalior&rsquo;s&nbsp;goals&nbsp;focus on reducing its GHG emissions and extending its circular portfolio by:</p>\n\n<ul>\n\t<li>Achieving 100% renewable electricity by 2030</li>\n\t<li>Reducing GHG emissions by 75% by 2030</li>\n\t<li>Reducing GHG&nbsp;emissions by 100% by 2040</li>\n\t<li>Offering an entire portfolio of bio-based and/or recycled based alternatives by 2030.</li>\n</ul>\n\n<p>Based on 10 universal principles, the UN Global Compact pursues the vision of an inclusive and sustainable global economy and focuses on topics such as human rights, labor, environment&nbsp;and anti-corruption. Envalior commits to operating in accordance with these fundamental rights and will report annually on its progress, particularly in:</p>\n\n<ul>\n\t<li>SDG 7: Affordable and Clean Energy</li>\n\t<li>SDG 12: Responsible Consumption and Production</li>\n\t<li>SDG 13: Climate Action</li>\n\t<li>SDG 17: Partnerships for the Goals.</li>\n</ul>\n\n<p>Envalior&rsquo;s goal to achieve 100% renewable electricity by 2030 has a positive impact on SDG 7. The company&nbsp;has implemented various initiatives, including renewable power purchase agreement and solar panel installations that make electricity consumption cleaner. At the same time, these measures relate to SDG 13 as GHG&nbsp;emissions are decreasing. Other measure that enhances Envalior&rsquo;s emissions consumption is its nitrous oxide reduction plant in Antwerp, Belgium, that saves roughly 450,000 tons of CO<sub>2</sub>equivalent on a yearly basis. These are only some of several steps that Envalior is taking to become a frontrunner in sustainability.</p>\n\n<h3>Henkel makes further progress across all areas of its sustainability strategy</h3>\n\n<p>In March 2025,&nbsp;<a href=\"https://www.compositesworld.com/suppliers/henkel-ag-co-kgaa\" target=\"_blank\">Henkel</a>&nbsp;(D&uuml;sseldorf, Germany) published its 2024 sustainability report, noting progress in its climate change and circular economy goals.&nbsp;</p>\n\n<p>By the end of 2024, Henkel had reduced CO<sub>2</sub> emissions in its production per ton of product by 64%&nbsp;compared to the base year 2017 and increased the energy purchased from renewable sources to 47%.</p>\n\n<p>Henkel also set net-zero targets,&nbsp;which cover a larger part of the value chain than its climate targets before. By 2045, Henkel aims to reduce its absolute scope 1, 2 and 3 GHG&nbsp;emissions by 90%. As short-term climate targets, Henkel plans to reduce its absolute scope 1 and 2 GHG emissions by 42% and its absolute scope 3 GHG emissions by 30%&nbsp;by 2030 (compared to 2021). The new targets have been validated by the SBTi. By the end of 2024, Henkel had reduced its scope 1, 2 and 3 GHG emissions by 20%&nbsp;(compared to 2021).</p>\n\n<p>To further decarbonize the value chain and better capture CO<sub>2</sub> emissions in the supply chain (scope 3), Henkel accelerated its <a href=\"https://www.henkel.com/press-and-media/press-releases-and-kits/2024-04-08-henkel-launches-new-initiative-to-collaborate-with-suppliers-on-climate-action-1949908\" target=\"_blank\">engagement program for its global suppliers</a>&nbsp;in 2024. It collects emissions data and defines specific measures to reduce emissions.</p>\n\n<p>Other measures include more sustainable packaging solutions.&nbsp;Henkel further increased the share of recycled plastic in its consumer goods packaging to 25%, expecting to reach 30% by end of 2025.&nbsp;Henkel also aims to design all consumer packaging for recycling; end of 2024, this share had reached 89%. In addition, a&nbsp;new hot melt adhesive (Technomelt brand), used for food packaging, among other things, now consists of at least 49%&nbsp;bio-based raw materials, and less energy is required for customers during the application phase of the product.</p>\n\n<p>Externally,&nbsp;EcoVadis awarded Henkel the Gold Medal. In addition, Henkel was recognized as a Top-Rated Company by <em>Morningstar Sustainalytics</em> for its sustainability performance, and&nbsp;the company received another award from <em>Corporate Knights</em> in its 2025 Global 100 Most Sustainable Corporations in the World ranking. Henkel was also honored with the Sustainable Future Award 2024 by the F.A.Z. Institute and Cision Germany for its many years of credible sustainability communication.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/composites-sustainability-wins-ecovadis-and-cdp-awards-water-stewardship-ghg-reduction"
      }
    ],
    "link": "https://www.compositesworld.com/news/composites-sustainability-wins-ecovadis-and-cdp-awards-water-stewardship-ghg-reduction"
  },
  {
    "published": "Mon, 20 Oct 2025 05:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      20,
      9,
      0,
      0,
      0,
      293,
      0
    ],
    "title": "ICOMAT launches U.K. automated space manufacturing facility with £4.8 million backing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ICOMAT launches U.K. automated space manufacturing facility with £4.8 million backing"
    },
    "summary": "At its opening, iCOMAT demonstrated how its specialized RTS production lines will support&nbsp;a variety of composite space&nbsp;innovations&nbsp;and build up the U.K. space sector.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "At its opening, iCOMAT demonstrated how its specialized RTS production lines will support&nbsp;a variety of composite space&nbsp;innovations&nbsp;and build up the U.K. space sector."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-icomat-factory1-jpg.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ICOMAT staff stands in new facility.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-icomat-factory1-jpg.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | iCOMAT</p>\n</div>\n\n<p>University of Bristol spin-out company <a href=\"https://www.compositesworld.com/suppliers/icomat\" target=\"_blank\">iCOMAT</a> (U.K.) has officially launched the opening of its&nbsp;new space manufacturing facility in Hardwicke, Gloucester, U.K., enabled by&nbsp;&pound;4.8 million in funding from the UK Space Agency&rsquo;s Space Clusters Infrastructure Fund (SCIF).</p>\n\n<p>The opening event welcomed representatives from the UK Space Agency, the European Space Agency (ESA)&nbsp;and international space sector companies including&nbsp;Orbex, Lockheed Martin&nbsp;and Thales Alenia Space who were treated to guided tours of the fully automated factory floor and live demonstrations of the installed technology.</p>\n\n<p>&ldquo;We are immensely grateful for the investment from the UK Space Agency, which has been pivotal in establishing this world-class facility,&rdquo; says Dr. Evangelos Zympeloudis, CEO and founder of iCOMAT. &ldquo;By leveraging our expertise in advanced materials, we are creating opportunities for the space industry to develop more efficient, sustainable vehicles, while&nbsp;creating a domestic supply chain and strengthening the U.K.&rsquo;s competitive position in the global market. Our team is excited to be fully operational.&rdquo;</p>\n\n<p>Work on the facility, which is located in the Western Gateway region to maximize collaboration with key players in the local space ecosystem, started in 2023 and has seen a total investment of &pound;8.2 million, including &pound;4.8 million SCIF funding and &pound;3.3 million match funding. ICOMAT has also received more than &pound;800,000 of funding through the UK Space Agency&rsquo;s membership of the European Space Agency&rsquo;s General Support Technology Programme (GSTP).&nbsp;&nbsp;</p>\n\n<p>The 45,000-square-foot&nbsp;facility represents a leap forward in composite materials manufacturing for space applications, housing iCOMAT&rsquo;s Rapid Tow Shearing (RTS) capabilities (read &ldquo;<a href=\"https://www.compositesworld.com/articles/industrializing-rapid-tape-shearing-for-high-rate-3d-composite-structures\">Industrializing rapid tape shearing for high-rate, 3D composite structures</a>&rdquo;). Two specialized&nbsp;production lines are featured, designed to serve multiple space market segments. The 2D-RTS line focuses on manufacturing flat structures and complex-shaped components, including satellite panels and solar array substrates. Meanwhile, the 3D-RTS production line handles geometrically complex components such as satellite and upper stage propellant tanks using advanced fiber&nbsp;steering technology on doubly curved parts.&nbsp;</p>\n\n<p>The Advanced Composites Manufacturing Enterprise (ACMA) cluster operates&nbsp;on a manufacturing access basis, enables end users and customers to benefit from RTS. Users can engage with the technology in various ways, from seeking lightweight improvements to existing vehicles to incorporating RTS capabilities into new design concepts.&nbsp;</p>\n\n<p>While primarily focused on serving the space industry, the facility&rsquo;s capabilities extend to closely adjacent sectors including aerospace and automotive applications, demonstrating the versatility of the RTS technology platform.&nbsp;</p>\n\n<p>According to&nbsp;Antonia Yendell, head of space ecosystem development at the UK Space Agency, the opening of this facility represents &ldquo;exactly the kind of innovation and industrial capability we want to see flourishing across the U.K. space sector.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/icomat-launches-uk-automated-space-manufacturing-facility-with-48-million-backing"
      }
    ],
    "link": "https://www.compositesworld.com/news/icomat-launches-uk-automated-space-manufacturing-facility-with-48-million-backing"
  },
  {
    "published": "Fri, 17 Oct 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      10,
      17,
      16,
      30,
      0,
      4,
      290,
      0
    ],
    "title": "Archer wins competitive bid process to acquire Lilium’s patent portfolio",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Archer wins competitive bid process to acquire Lilium’s patent portfolio"
    },
    "summary": "Acquisition bolsters Archer&rsquo;s rapidly growing patent portfolio by adding ~300 patent assets covering current and next-gen&nbsp;eVTOL technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Acquisition bolsters Archer&rsquo;s rapidly growing patent portfolio by adding ~300 patent assets covering current and next-gen&nbsp;eVTOL technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-archer-lilium.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Employee using a machine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-archer-lilium.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Archer Aviation</p>\n</div>\n\n<p>On Oct. 15,&nbsp;<a href=\"https://www.archer.com/\" target=\"_blank\">Archer Aviation</a>&nbsp;(Santa Clara, Calif., U.S.) announced that it has won the&nbsp;competitive bid process to acquire <a href=\"https://lilium.com/\" target=\"_blank\">Lilium GmbH</a>&rsquo;s (Munich, Germany) portfolio of ~300 advanced air mobility (AAM) patent assets for &euro;18 million, including patents relating to key innovations in high-voltage systems, battery management, advanced aircraft design, flight controls, electric engines, propellers&nbsp;and ducted fans.&nbsp;Archer&rsquo;s&nbsp;portfolio now includes more than 1,000 patent assets worldwide.</p>\n\n<p>Lilium filed for <a href=\"https://www.compositesworld.com/news/aam-startup-lilium-to-file-for-self-administered-insolvency\" target=\"_blank\">insolvency</a> in November 2024, but was committed to finding fresh support to ensure the Lilium Jet eVTOL&nbsp;program&rsquo;s <a href=\"https://www.compositesworld.com/news/lilium-launches-ma-process-targets-evtol-program-continuation\" target=\"_blank\">continuation</a>. This most recent transaction by Archer&nbsp;follows industry consolidation in the AAM&nbsp;sector, including a recent acquisition of Volocopter <a href=\"https://www.compositesworld.com/news/diamond-aircraft-acquires-volocopter-after-insolvency\" target=\"_blank\">by a Chinese buyer</a>.</p>\n\n<p>&ldquo;Lilium&rsquo;s work advanced the frontier of eVTOL design and technology, and we&rsquo;re excited to bring their cutting-edge technologies into the fold at Archer as we advance our product roadmap,&rdquo; says&nbsp;Adam Goldstein, founder and CEO of Archer.</p>\n\n<p>Over the course of its development since its founding in 2015, Lilium spent more than $1.5 billion&nbsp;to develop the key enabling technologies related to its visionary eVTOL platform that was regarded by many as &ldquo;technologically ahead of its time.&rdquo; Through this purchase, Archer gains key enabling technologies that bolster its current platforms.</p>\n\n<p>In July 2025, the U.S. Department of Transportation and Federal Aviation Administration (FAA) announced the modernization of the&nbsp;airworthiness certification (MOSAIC) final rule to drive innovation across the light sport sector. Archer believes Lilium&rsquo;s ducted fan technology could unlock future development in both the light sport and regional air mobility sectors.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/archer-wins-competitive-bid-process-to-acquire-lilium-patent-portfolio"
      }
    ],
    "link": "https://www.compositesworld.com/news/archer-wins-competitive-bid-process-to-acquire-lilium-patent-portfolio"
  },
  {
    "published": "Fri, 17 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      17,
      16,
      0,
      0,
      4,
      290,
      0
    ],
    "title": "Strongwell wins Manufacturing Innovation Award for Strongdek composite decking",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Strongwell wins Manufacturing Innovation Award for Strongdek composite decking"
    },
    "summary": "Two-part design and replaceable cap, enabling high strength and sustainable, cost-effective maintenance and installation,&nbsp;made this FRP construction solution stand out for this year&rsquo;s SVAM awards.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Two-part design and replaceable cap, enabling high strength and sustainable, cost-effective maintenance and installation,&nbsp;made this FRP construction solution stand out for this year&rsquo;s SVAM awards."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-strongwell-strongdek-residential.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Decking for residential building.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-strongwell-strongdek-residential.jpg;maxWidth=720\" /> </a></div>\n\n<p>Residential building features Strongwell&rsquo;s pultruded FRP planks. Source (All Images) | Strongwell (USA)</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/strongwell\" target=\"_blank\">Strongwell</a> (Bristol, Va., U.S.) was recently awarded the 2025 Manufacturing Innovations Award by the Southwest Virginia Alliance for Manufacturing (SVAM, Abingdon, U.S.) for its patented Strongdek&nbsp;structural composite decking system.</p>\n\n<p>Produced at Strongwell&rsquo;s Bristol and Highlands facilities, Strongdek combines a pultruded fiber-reinforced polymer (FRP)&nbsp;plank with a snap-on hybrid composite top cap. This two-part design delivers high strength, durability&nbsp;and safety, while offering easy installation and virtually no maintenance.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-Strongwell-Strongdek-product-min.png\" target=\"_blank\"><img alt=\"Pultruded FRP planks.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-Strongwell-Strongdek-product-min.png;maxWidth=385\" /></a></div>\n</div>\n\n<p>&ldquo;Strondek&nbsp;redefines what a composite deck can be,&rdquo; says&nbsp;Barry Myers, Strongwell&rsquo;s corporate director of marketing and communications. &ldquo;Receiving this recognition from SVAM underscores the innovation and teamwork that made this product possible.&rdquo;</p>\n\n<p>The Strongdek&nbsp;system stands out for its replaceable cap design, which enables walking surfaces to be refreshed quickly and cost-effectively without replacing the underlying structure. The product is also engineered to exceed the strength of traditional wood and high-end composite boards, supporting wider joist spacing and higher loads while maintaining a lighter weight. Engineered for long-term performance, the system not only delivers strength but also advances sustainability with a closed-mold manufacturing process that reduces waste and emissions, along with a service life that minimizes replacement cycles and environmental impact.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/strongwell-wins-manufacturing-innovation-award-for-strongdek-composite-decking"
      }
    ],
    "link": "https://www.compositesworld.com/news/strongwell-wins-manufacturing-innovation-award-for-strongdek-composite-decking"
  },
  {
    "published": "Fri, 17 Oct 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      17,
      15,
      0,
      0,
      4,
      290,
      0
    ],
    "title": "Inversion Space looks to 2026 orbital flight for space delivery vehicle Arc",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Inversion Space looks to 2026 orbital flight for space delivery vehicle Arc"
    },
    "summary": "California startup, with its spacecraft made from lightweight metals and heat-resistant composites, plans to use space to quickly and autonomously deliver cargo within an hour anywhere in the world.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "California startup, with its spacecraft made from lightweight metals and heat-resistant composites, plans to use space to quickly and autonomously deliver cargo within an hour anywhere in the world."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-InversionSpace-Arc.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Arc rendering in space.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-InversionSpace-Arc.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Inversion Space</p>\n</div>\n\n<p><a href=\"https://www.inversionspace.com/\" target=\"_blank\">Inversion Space</a> (Los Angeles, U.S.),&nbsp;a California reentry startup, has unveiled its flagship lifting body spacecraft,&nbsp;<em>Arc,</em>&nbsp;intended for &ldquo;mission-enabling cargo&rdquo; &mdash; that is, it can send and deliver cargo from space to any place on Earth in less than an&nbsp;hour. The&nbsp;vehicle is&nbsp;&ldquo;made from lightweight metals and heat-resistant composites&rdquo; according to <a href=\"https://www.designboom.com/technology/inversion-debuts-arc-first-space-delivery-vehicle-transports-materials-earth-10-06-2025/#:~:text=Reusable%20and%20modular%20spacecraft%20made,from%20space%20into%20the%20atmosphere.\" target=\"_blank\">a <em>DesignBoom</em> article</a> and confirmed by Inversion Space personnel, whom told <em>CW</em> that composite materials are being used within&nbsp;<em>Arc</em>&rsquo;s thermal protection system (TPS).</p>\n\n<p><em>Arc</em> builds upon the company&rsquo;s first spacecraft demonstrator named <em>Ray</em>, which&nbsp;launched as part of SpaceX&rsquo;s Transporter-12 mission in January 2025. &ldquo;It&rsquo;s&nbsp;not a space capsule, it&rsquo;s not a space plane, it is in between &mdash; a lifting body reentry vehicle,&rdquo; Inversion CEO Justin Fiaschetti<a href=\"https://payloadspace.com/inversion-space-unveils-arc-reentry-vehicle/\" target=\"_blank\"> tells&nbsp;Payload</a>.</p>\n\n<p>Payload reports that <em>Arc</em>&nbsp;can hold and store about 500 pounds of payload in orbit for up to 5 years, it is fully reusable and it is built to withstand speeds over Mach 20 &mdash; making it not only useful for defense, medical and other emergency needs, but also as a platform for hypersonic flight testing. The 4-foot-wide, 8-feet-tall spacecraft is &ldquo;equipped with control flaps, ACS thrusters, a deorbit engine&nbsp;and an autonomously maneuverable parachute,&rdquo; says Payload. &ldquo;&nbsp;It can cover a total reentry range of over 1,000 kilometers&nbsp;and land on a target within 50 feet.&rdquo; <em>DesignBoom</em> notes that it relies on Inversion Space&rsquo;s&nbsp;custom-built processing core and is powered by AI and control algorithms.</p>\n\n<p>Inversion&rsquo;s vision is to deploy constellations of <em>Arc</em>s in-orbit to ensure that allied militaries can access critical cargo at a moment&rsquo;s notice &mdash; even in denied environments.&nbsp;&ldquo;The long-term vision for the company is that space becomes a new mode of transportation,&rdquo; Fiaschetti tells Payload. &ldquo;We&rsquo;re fully focused on defense right now.&rdquo;</p>\n\n<p>On Oct. 2, 2025, the team conducted precision drop testing, showcasing that <em>Arc</em> is able to land and ship goods on its own. The company is preparing for the spacecraft&rsquo;s first orbital flight in 2026, with an aim to build hundreds of <em>Arc</em>s per year longer term.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/inversion-space-looks-to-2026-orbital-flight-for-space-delivery-vehicle-arc"
      }
    ],
    "link": "https://www.compositesworld.com/news/inversion-space-looks-to-2026-orbital-flight-for-space-delivery-vehicle-arc"
  },
  {
    "published": "Fri, 17 Oct 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      17,
      14,
      0,
      0,
      4,
      290,
      0
    ],
    "title": "Caracol raises $40 million Series B to progress global scale-up",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Caracol raises $40 million Series B to progress global scale-up"
    },
    "summary": "The international round marks a key milestone, consolidating Caracol&rsquo;s leadership in Europe, the U.S.&nbsp;and the Middle East, supporting its exponential growth and&nbsp;fueling expansion into new markets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The international round marks a key milestone, consolidating Caracol&rsquo;s leadership in Europe, the U.S.&nbsp;and the Middle East, supporting its exponential growth and&nbsp;fueling expansion into new markets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-caracol-founders.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Caracol founders standing in front of LFAM robot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-caracol-founders.jpg;maxWidth=720\" /> </a></div>\n\n<p>Caracol founders (left to right): Francesco De Stefano, CEO; Paolo Cassis, COO;&nbsp;Jacopo Gervasini, CFO; and Giovanni Avallone, chief innovation officer. Source | Caracol</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/caracol\" target=\"_blank\">Caracol</a> (Milan, Italy and Austin, Texas, U.S.) has closed its&nbsp;$40 million Series B round, co-led by Omnes Capital, Move Capital Fund I, alongside CDP Venture Capital &ndash; Large Ventures Fund, which played a key role as a catalyst for international investors. These international funds, together with&nbsp;Italian institutional investors, will accompany Caracol into its next phase of global growth, alongside continued backing from long-standing shareholders (Primo Capital SGR, Eureka! Venture SGR&nbsp;and Neva SGR).&nbsp;</p>\n\n<p>This funding will further accelerate Caracol&rsquo;s global scaling and international expansion. The company says it will cement its leadership in Europe, the U.S. and the Middle East while expanding further into high-growth markets such as the Asia Pacific, building on the strong traction it has already achieved in Japan.</p>\n\n<p>On the technology side, Caracol will deepen the capabilities of its multi-process, multi-material platforms, with a focus on software, automation and AI to deliver data-driven process control and high quality. The company will also intensify the ramp-up of its metal additive manufacturing technologies, particularly in highly regulated sectors such as aerospace and defense, energy and maritime, while continuing to expand its polymer offering in key verticals such as transportation, construction&nbsp;and architecture.</p>\n\n<p>Finally, Caracol will continue growing its global team, bringing on board top international talent to drive innovation and scale-up. The company currently employs more than&nbsp;100 people, across three offices in Milan (Italy), Austin (U.S.)&nbsp;and Dubai (UAE), and has a global footprint with a presence in over 50 countries.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Caracol has...</h3>\n\n<ul>\n\t<li>Delivered&nbsp;up to 70% cost savings on finished parts for yacht manufacturer Ferretti Group (Italy).</li>\n\t<li>Cut production lead times by 50% on carbon fiber tooling with composite expert Duqueine (France) in automotive and motorsport.</li>\n\t<li>Enabled circular economy loops and reduced&nbsp;waste in construction projects such as with general contractor HITT (U.S.).</li>\n</ul>\n</div>\n</div>\n\n<p>Over the past 5&nbsp;years, Caracol established itself as a dynamic player&nbsp;in advanced robotic manufacturing, building a strong track record with more than 100 robotic platforms installed worldwide and hundreds of projects delivered across industries. Revenues have more than doubled year-over-year, a trend that continued in H1 2025.&nbsp;</p>\n\n<p>Recent milestones include the expansion of Caracol&rsquo;s headquarters <a href=\"https://www.compositesworld.com/news/caracol-opens-up-texas-hq-and-lfam-production-center\" target=\"_blank\">in Texas</a>, strengthening its North American presence and creating a hub for local manufacturing of its technology for the region. The new funding also builds on the <a href=\"https://www.compositesworld.com/news/caracol-acquires-hans-webers-additive-manufacturing-assets\" target=\"_blank\">strategic acquisition</a> of Hans Weber Maschinenfabrik GmbH&rsquo;s additive robotic IP and technologies in Germany, reinforcing Caracol&rsquo;s European technology base and enhancing its supply capabilities across the DACH region.</p>\n\n<p>Caracol delivers turnkey robotic manufacturing platforms for&nbsp;advanced parts, leveraging both polymers and metals. The company integrates proprietary hardware, software&nbsp;and automation, providing customers with full end-to-end control and support. Its vision is to advance industrial manufacturing.</p>\n\n<p><em>Caracol thanks the firms that supported the successful completion of its Series B: Growth Capital acting as sole financial advisor to Caracol leading the deal structuring, negotiations&nbsp;and execution, together with the law firms: Fieldfisher, which advised Caracol; Legance, which advised CDP Venture Capital SGR, Omnes Capital and Move Capital; Portolano Cavallo, which advised NEVA SGR S.p.A.; and Target Law, which advised Primo Capital SGR and Eureka! Venture SGR.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/caracol-raises-40-million-series-b-to-progress-global-scale-up"
      }
    ],
    "link": "https://www.compositesworld.com/news/caracol-raises-40-million-series-b-to-progress-global-scale-up"
  }
]