[
  {
    "published": "Wed, 11 Jun 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      11,
      18,
      0,
      0,
      2,
      162,
      0
    ],
    "title": "Gurit celebrates 190 years and its heritage in advanced materials",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Gurit celebrates 190 years and its heritage in advanced materials"
    },
    "summary": "Prior to the composite materials provider&nbsp;industry&nbsp;knows today, Gurit was founded as a small textile finishing business. The company looks back at its roots, people and products over the years.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Prior to the composite materials provider&nbsp;industry&nbsp;knows today, Gurit was founded as a small textile finishing business. The company looks back at its roots, people and products over the years."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-gurit-1960s.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Gurit Freienbach entrance.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-gurit-1960s.jpg;maxWidth=720\" /> </a></div>\n\n<p>Gurit&nbsp;Freienbach in the late 1960s. Source (All Images) | Gurit AG</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gurit-uk\" target=\"_blank\">Gurit</a>&nbsp;(Zurich, Switzerland), celebrating 190 years, looks back at&nbsp;its journey from serving the textiles industry, to its current work in composite materials.</p>\n\n<p>In 1835, Georg Philipp Heberlein founded&nbsp;a small textile finishing business in Wattwil, Switzerland. What was originally a craft business grew into an industrial operation, starting with the use of synthetic dyes, then a garment dyeing plant in 1897, followed by a printing plant in 1916. Over the years, generations of the Heberlein family have pioneered advancements in synthetic fibers and textile machinery, establishing a strong reputation in a burgeoning industry in Eastern Switzerland.</p>\n\n<p>In 1929, the company expanded into rubber and synthetic foam manufacturing with the creation of Gurit, a Heberlein-owned company, in Richterswil, Switzerland. Gurit was named after &ldquo;Gummiwerk Richterswil&rdquo; (Richterswil rubber factory). This new company laid the foundation for what would become a significant transformation for the business.</p>\n\n<p>The textile and plastics divisions developed independently through the mid-1960s, both driven however by materials innovation. After World War 2, as natural fibers were in short supply, demand for artificial alternatives surged.&nbsp; Heberlein modernized and expanded its dyeing facilities, but it was the invention and patenting of Helanca &mdash; a method for adding stretch to synthetic fibers &mdash; that fueled major growth. By the late 1960s, the Wattwil plant employed more than 2,500 people,&nbsp;with the entire Heberlein Group employing over 5,000. However, a global synthetic fiber crisis in the 1970s led to the collapse of the textile division. Major restructuring followed, with the Helanca brand eventually sold to Saurer and the textile business gradually wound down.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-gurit-archived-labels.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-gurit-archived-labels.jpg;maxWidth=385\" /></a></div>\n\n<p>Gurit&nbsp;Helanca labels.</p>\n</div>\n\n<p>Gurit, the plastics division, had a slow start in the 1930s, but flourished after World War 2. By 1960, it employed some 700 people, producing plastic goods of all kinds, from raincoats to vinyl flooring. In the mid-60s, the Gurit Essex division was added (a joint venture between Gurit and Essex Chemical and then Dow Chemical), followed by the acquisition of Coltane (specializing in dental products),&nbsp;the founding of Gurit&nbsp;Schaumstoff&nbsp;and&nbsp;acquisition of&nbsp;the&nbsp;film manufacturer,&nbsp;Worbla.&nbsp;By the late 1960s,&nbsp;Gurit had outgrown its original site in Richterswil and expanded to Freienbach.</p>\n\n<p>In 1984, following the growth of the Gurit division and its future, an&nbsp;unusual step was taken to create the company Gurit-Heberlein, with the subsidiary becoming the parent company, paving the way for new investment and a new path to success.</p>\n\n<p>In partnership with Essex Chemical, Gurit helped transform the automotive industry and became, what it says was the largest European supplier of automotive adhesives, sealants and body engineered systems for the automotive OEM and aftermarket at the time. As the global car market evolved, Gurit sold its stake to Dow Chemical in 2000. This enabled the company to focus on healthcare and composite materials. The cash injection enabled the well-executed closure of the struggling textiles business, with a further 13 years needed to complete the thorough demolition, cleanup and sale of the land.</p>\n\n<p>The 2000s marked a period of strategic growth. Gurit acquired materials manufacturers specializing in aerospace, marine, wind energy&nbsp;and other high-performance sectors, bringing depth of expertise and breadth of experience in materials such as prepregs, epoxies, core materials, engineering services, tooling and kitting. These acquisitions strengthened the company&rsquo;s position in performance materials. In 2006, Gurit listed the healthcare division, Medisize, as an independent company on the SIX Swiss Exchange, with Gurit Holding AG&rsquo;s sole focus now advanced composite materials. Further, in 2024, Gurit sharpened its focus, responding to challenging market conditions by rightsizing its business and divesting selected product lines. &nbsp;</p>\n\n<p>Today, as Gurit celebrates nearly two decades of performance materials, the company says it continues to push the boundaries of innovation in advanced composites. Committed to sustainability and forward-thinking solutions, Gurit partner with clients in the wind, marine, transportation, construction and other sectors to shape a smarter, more sustainable future.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gurit-celebrates-190-years-and-its-heritage-in-advanced-materials"
      }
    ],
    "link": "https://www.compositesworld.com/news/gurit-celebrates-190-years-and-its-heritage-in-advanced-materials"
  },
  {
    "published": "Wed, 11 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      11,
      17,
      0,
      0,
      2,
      162,
      0
    ],
    "title": "Toray, Daher and Tarmac Aerosave announce End-of-Life Aircraft Recycling Program",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Toray, Daher and Tarmac Aerosave announce End-of-Life Aircraft Recycling Program"
    },
    "summary": "Collaborative initiative&nbsp;aims to reuse secondary structural TPC&nbsp;parts from EOL&nbsp;Airbus A380 aircraft and repurpose them for other aeronautical applications in order to collectively advance TPC recycling technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaborative initiative&nbsp;aims to reuse secondary structural TPC&nbsp;parts from EOL&nbsp;Airbus A380 aircraft and repurpose them for other aeronautical applications in order to collectively advance TPC recycling technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-airbus-a30-pylon-cover-toraycetexpps.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airbus A30 pylon cover.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-airbus-a30-pylon-cover-toraycetexpps.jpg;maxWidth=720\" /> </a></div>\n\n<p>This Airbus A30 pylon cover is made using Toray Cetex carbon fiber-reinforced thermoplastic PPS. Source | Toray Advanced Composites B.V.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/toray-advanced-composites-bv\" target=\"_blank\">Toray Advanced Composites B.V.</a> (Nijverdal, The Netherlands), <a href=\"https://www.daher.com/en/\" target=\"_blank\">Daher</a>&nbsp;(Paris, France) and <a href=\"https://www.tarmacaerosave.aero/\" target=\"_blank\">Tarmac Aerosave</a>&nbsp;(Azereix, France) announce the launch of a joint End-of-Life Aerospace Recycling Program for commercial aircraft production. Working with Airbus (Toulouse, France), this collaborative initiative will focus on advancing recycling technology practices in aerospace manufacturing by recovering and reusing end-of-life (EOL) secondary structural components made from continuous fiber-reinforced thermoplastic composites (TPC).</p>\n\n<p>The project aims to extend the useful life of composite materials and contribute to the aviation industry&rsquo;s net-zero goals by developing remanufacturing processes and creating a closed-loop recycling system &mdash; minimizing waste and driving recycling innovation across the aerospace industry. The initiative aims to reuse secondary structural TPC&nbsp;parts from EOL&nbsp;Airbus A380 aircraft and repurpose them for other aeronautical applications.</p>\n\n<p>Expertise from the aerospace and materials sectors is being brought together in this collaborative initiative. Airbus provides support for the advanced material reuse framework, while Tarmac Aerosave will ensure components are dismantled without damage, preserving material integrity. Daher is leading the reshaping and the quality validation (performed as serial production conditions) of repurposed parts, while Toray, as a materials supplier, is monitoring the material quality for the second-life application.</p>\n\n<p>At the core of this initiative is the EOL recycling of the A380 pylon cover, specifically the&nbsp;Toray Cetex&nbsp;TC1100 (carbon fiber/PPS) TPC&nbsp;structure. As TPC parts become more prevalent in next-generation aircraft, this pilot case sets the foundation for new methodologies in recycling, repurposing&nbsp;and reprocessing composite materials. The A380 alone contains more than&nbsp;10,000 flying parts made from continuous fiber-reinforced TPC, making it an ideal platform for testing and validating recycled material recovery practices.</p>\n\n<p>&ldquo;Through this initiative, we aim to build on that strength by exploring new opportunities for recycling technology development &mdash; where our high-performance materials are not just recycled, but meaningfully reused and reintegrated into other structural aerospace applications&rdquo; states Scott Unger, CEO of Toray Advanced Composites. &ldquo;As demand for commercial aircraft continues to increase, it is critical we make progress on recyclability of thermoplastic and thermoset composite materials, and reduce the impact of our industry on the environment.&rdquo;</p>\n\n<p>Julie Vadour, R&amp;D director at Daher, notes that for many years Daher has relied on TPC to develop&nbsp;structural parts for next-generation aircraft. &ldquo;These materials offer lightness, high production compatibility&nbsp;and &mdash;&nbsp;crucially &mdash; true sustainability,&rdquo; Vadour says.&nbsp;&ldquo;Beyond their weldability and reusability, we are actively advancing recycling processes for both EOL&nbsp;parts and manufacturing waste, particularly on our Nantes site.&rdquo;</p>\n\n<p>For Tarmac Aerospace&rsquo;s part, the company is&nbsp;constantly working to improve its recycling rate, which currently stands at 92%. &ldquo;This joint work on the reuse of TPC&nbsp;contributes to our expertise in A380 recycling and our contribution to the eco-design of the new generation of aircraft,&rdquo; concludes Alexandre Brun, president.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/toray-daher-and-tarmac-aerosave-announce-end-of-life-aircraft-recycling-program"
      }
    ],
    "link": "https://www.compositesworld.com/news/toray-daher-and-tarmac-aerosave-announce-end-of-life-aircraft-recycling-program"
  },
  {
    "published": "Wed, 11 Jun 2025 11:58:14 -0400",
    "published_parsed": [
      2025,
      6,
      11,
      15,
      58,
      14,
      2,
      162,
      0
    ],
    "title": "SPE Thermoset TopCon 2025 successfully showcased thermoset composites advances",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SPE Thermoset TopCon 2025 successfully showcased thermoset composites advances"
    },
    "summary": "The annual thermosets-focused event included 30 sponsorships and/or exhibits, nearly 200 registrations, 19 technical presentations, five student posters, two keynote addresses and an executive roundtable.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The annual thermosets-focused event included 30 sponsorships and/or exhibits, nearly 200 registrations, 19 technical presentations, five student posters, two keynote addresses and an executive roundtable."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-spetopcon2025.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-spetopcon2025.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | SPE Thermoset Division</p>\n</div>\n\n<p>The SPE&nbsp;Thermoset TopCon conference, held May 13-14, 2025 in Madison, Wisonsin, provided value to exhibitors/sponsors and attendees &mdash; representing OEMs, Tier suppliers, academia and other composites industry professionals&nbsp;&mdash; highlighting advances in thermoset technologies. According to the&nbsp;<a href=\"https://www.compositesworld.com/suppliers/society-of-plastics-engineers-thermoset-division\" target=\"_blank\">SPE&nbsp;Thermoset Division</a>&nbsp;(Bethel, Conn., U.S.), this year&rsquo;s event featured more sponsorships and registration than previous years, emphasizing its success.</p>\n\n<p>&ldquo;Thank you to everyone who attended the 2025 SPE Thermoset TopCon conference and to our sponsors and board members who made the conference possible,&rdquo; says&nbsp;Sean Campbell, SPE Thermoset TopCon chair and commercial director &ndash; engineering composites at LyondellBasell (LYB).&nbsp;&ldquo;Our board was pleased to see terrific feedback from the surveys we shared with attendees, with many noting how valuable this conference is for the thermoset industry. We are already looking forward to next year&rsquo;s event, May 12-13, 2026 back in Madison, Wisconsin,&nbsp;at the Monona Terrace Community and Convention Center.&rdquo;</p>\n\n<p>A number of thermoset leaders from industry provided direction and support for the event.&nbsp;<span style=\"font-size: 1.1rem; letter-spacing: 0.008em;\">Teri Chouinard, president of Intuit Group, provided leadership as the SPE Thermoset TopCon marketing chair and administrative support for the technical program and event management overall.</span></p>\n\n<p>Keynotes presented at the Thermoset TopCon 2025 event included &ldquo;Making a Compelling Case for Thermosets,&rdquo; by Amanda Nummy (Hyundai),&nbsp;and &ldquo;Why I Chose Thermoset Over Thermoplastic for My Underground Water Storage System,&rdquo; by Joe Miskovich (Triton Stormwater Solutions). Both keynotes were well attended by conference attendees and provided knowledge and insight to the speakers&rsquo;s&nbsp;respective topics.</p>\n\n<p>An executive roundtable discussed the state of the industry today, including changes over the past 12 months, what is driving the changes&nbsp;and markets for growth for their companies and the industry over the next 5&nbsp;years. The discussion was&nbsp; moderated by Sean Campbell.&nbsp;Panelists included Cindy L. Squires, president and&nbsp;CEO of the American Composites Manufacturers Association (ACMA);&nbsp;Scott Eastman, president of SPE: Inspiring Plastics Professionals; Leon Garoufalis, president and&nbsp;CEO of Composites One;&nbsp;Scott Balogh, president and&nbsp;CEO of Mar-Bal; and Len Nunnery, VP marketing, sales and technical service at Plastics Engineering Co.&nbsp;(Plenco).</p>\n\n<p>The Thermoset TopCon 2025 technical program included 19 presentations on advances in the following categories: Materials, Business, Molding, Application, Sustainability&nbsp;and Additives.&nbsp;</p>\n\n<p>In addition, four students from the North Dakota State University and a student from the University of Wisconsin &ndash;&nbsp;Madison featured innovative research related to thermosets via the annual Student Poster Competition. This year&rsquo;s winner was &ldquo;In-Nozzle Impregnation-Based 3D Printing of Thermoset Composites Using a UV Light Assisted Printing Process,&rdquo; by Prashant Lakhemaru, a Ph.D.&nbsp;student in the Department of Mechanical Engineering at North Dakota State University.</p>\n\n<p>The fun kicked off early this year on May 12, the day before the conference, filled&nbsp;with networking and social activities around Madison. Golf in the morning at the University Ridge Golf Course was enjoyed by 26 players. Close to a dozen attendees toured the Plastics Engineering Center (PEC) at University of Wisconsin &ndash; Madison. A sunset boat ride around Lake Monona was enjoyed by 16 attendees.</p>\n\n<p>The 2025 SPE Thermoset Topcon was made possible by the support of its many sponsors.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spe-thermoset-topcon-2025-successfully-showcased-thermoset-composites-advances"
      }
    ],
    "link": "https://www.compositesworld.com/news/spe-thermoset-topcon-2025-successfully-showcased-thermoset-composites-advances"
  },
  {
    "published": "Wed, 11 Jun 2025 10:59:06 -0400",
    "published_parsed": [
      2025,
      6,
      11,
      14,
      59,
      6,
      2,
      162,
      0
    ],
    "title": "Dawn Aerospace secures suborbital research with U.S. universities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Dawn Aerospace secures suborbital research with U.S. universities"
    },
    "summary": "Flight collaboration with Arizona State, California Polytechnic State and John Hopkins will support additional flight research, aided by Dawn&rsquo;s highly composite rocket-powered aircraft&nbsp;Mk-II Aurora.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Flight collaboration with Arizona State, California Polytechnic State and John Hopkins will support additional flight research, aided by Dawn&rsquo;s highly composite rocket-powered aircraft&nbsp;Mk-II Aurora."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-dawn-mkii-aurora-runway.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Mk-II Aurora at the Tāwhaki National Aerospace Centre runway.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-dawn-mkii-aurora-runway.jpg;maxWidth=720\" /> </a></div>\n\n<p>Mk-II <em>Aurora</em> at the Tāwhaki National Aerospace Centre, New Zealand. Source | Dawn Aerospace</p>\n</div>\n\n<p>In April 2025,<strong>&nbsp;</strong><a href=\"https://www.dawnaerospace.com/\" target=\"_blank\">Dawn Aerospace</a>&nbsp;(ChristChurch, New Zealand) announced plans to fly&nbsp;research payloads from three U.S. institutions &mdash;&nbsp;Arizona State University&nbsp;(Tempe),&nbsp;California Polytechnic State University&nbsp;(San Luis Obispo) and&nbsp;Johns Hopkins Applied Physics Lab&nbsp;(Laurel, Md.) &mdash; on its rocket-powered composite aircraft, the Mk-II <em>Aurora</em>.</p>\n\n<p>The flights, scheduled for April and&nbsp;June 2025, will showcase the Mk-II <em>Aurora</em>&rsquo;s&nbsp;capabilities as a reusable, high-cadence suborbital vehicle. Dawn Aerospace will also fly payloads for Scout Space (Reston, Va.), a U.S.-based commercial customer, during the same campaign.</p>\n\n<p>These missions will take place from the Tāwhaki National Aerospace Centre at Kaitorete, just outside Christchurch, as Dawn&rsquo;s first commercial flights since runway facilities were established in 2024.</p>\n\n<p>The three pathfinder flights will support groundbreaking research in their respective fields:</p>\n\n<ul>\n\t<li>Arizona State University, a space science and engineering university, will fly a modified version of its Themis&nbsp;visual imaging system (LEO-TIMS).</li>\n\t<li>Johns Hopkins Applied Physics Laboratory, an R&amp;D institution that has designed and built spacecraft and specialized instruments that have visited the Sun and every planet in the solar system,&nbsp;will fly a payload interface system known as Janus-Lite that measures the <em>Aurora</em>&rsquo;s payload bay environment, collecting data on magnetic field, acceleration, pressure and thermal conditions.</li>\n\t<li>\n\t<p>California Polytechnic State University,<strong>&nbsp;</strong>well-known for its CubeSat program and aerospace engineering, will test a student-developed flight path reconstruction data acquisition system to collect GPS and air data in calibration with the Mk-II&rsquo;s systems.</p>\n\t</li>\n</ul>\n\n<p>&ldquo;The Mk-II <em>Aurora</em> presents a rapidly reusable space capability, with the power to unlock new economic, environmental&nbsp;and scientific value,&rdquo; explains Stefan Powell, CEO, Dawn Aerospace. &ldquo;This initiative plants&nbsp;the seed that will grow into ongoing international collaboration and expansion for many years to come.&rdquo;</p>\n\n<p>The vehicle used for the pathfinder flights is the &ldquo;Mk-IIA,&rdquo; <a href=\"https://www.compositesworld.com/news/dawn-aerospace-breaks-sound-barrier-hypersonic-global-records\" target=\"_blank\">which in November 2024</a>, was reported to be the first civil aircraft to break the sound barrier since the Concorde, as well as breaking climb rate records and reaching a 25-kilometer&nbsp;altitude.</p>\n\n<p>The Mk-IIB, according to Dawn Aerospace, will be &ldquo;the highest and fastest flying vehicle ever to take off from a runway,&rdquo; reaching Mach 3.5 and 100-kilometer altitudes. The vehicle is made for high performance,&nbsp;same-day reusability&nbsp;and easily accessible payload bay designed for environmental instruments.</p>\n\n<p>The three flights are supported by the Ministry of Business, Innovation and Employment (MBIE) on behalf of the New Zealand Government.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dawn-aerospace-secures-suborbital-research-with-us-universities"
      }
    ],
    "link": "https://www.compositesworld.com/news/dawn-aerospace-secures-suborbital-research-with-us-universities"
  },
  {
    "published": "Wed, 11 Jun 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      11,
      14,
      0,
      0,
      2,
      162,
      0
    ],
    "title": "Ronald Krueger is honored with ASTM’s top annual award",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Ronald Krueger is honored with ASTM’s top annual award"
    },
    "summary": "The Award of&nbsp;Merit recognizes Krueger&rsquo;s work in the&nbsp;design, analysis, development&nbsp;and sustainment of safe composite structures and contributions to D30.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Award of&nbsp;Merit recognizes Krueger&rsquo;s work in the&nbsp;design, analysis, development&nbsp;and sustainment of safe composite structures and contributions to D30."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-astm-ronkrueger.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-astm-ronkrueger.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | ASTM International</p>\n</div>\n\n<p>On June 6, <a href=\"https://www.astm.org/\" target=\"_blank\">ASTM International</a> (West Conshohocken, Pa., U.S.) presented its top annual award,&nbsp;the Award of Merit,&nbsp;to Ronald Krueger for his contributions to its composite materials committee (D30).</p>\n\n<p>The prestigious award, which includes the accompanying title of fellow, is ASTM&rsquo;s highest recognition for distinguished service and outstanding participation in ASTM International committee activities. Krueger was recognized for his leadership in design, analysis, development&nbsp;and sustainment of safe composite structures, as well as his work in advancing composite material and structure test methods. He was also recognized and for expanding the outreach of D30.</p>\n\n<p>An ASTM International member since 1994, Krueger has been previously recognized with the Certificate of Appreciation (2005), and three Awards of Appreciation (2012, 2015, 2016).</p>\n\n<p>Krueger has retired, but was most recently a research fellow at the National Institute of Aerospace (NIA), which he joined as a senior research engineer in 2003. Krueger received both his master of science degree and his doctoral degree in aerospace engineering from the University of Stuttgart, Germany, in 1989 and 1996, respectively.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ronald-krueger-is-honored-with-astms-top-annual-award"
      }
    ],
    "link": "https://www.compositesworld.com/news/ronald-krueger-is-honored-with-astms-top-annual-award"
  },
  {
    "published": "Tue, 10 Jun 2025 21:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      11,
      1,
      0,
      0,
      2,
      162,
      0
    ],
    "title": "Advanced Carbons Council releases carbon fiber market report",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Advanced Carbons Council releases carbon fiber market report"
    },
    "summary": "Primary research and data breaks down&nbsp;critical trends shaping carbon fiber&rsquo;s role in future manufacturing and mobility.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Primary research and data breaks down&nbsp;critical trends shaping carbon fiber&rsquo;s role in future manufacturing and mobility."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-acc-carbonfiberreport-cover.png\" target=\"_blank\"><img alt=\"Carbon Fiber Report 2025 cover.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-acc-carbonfiberreport-cover.png;maxWidth=385\" /></a></div>\n\n<p>Source | The Advanced Carbons Council</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://www.advmat.org/\" target=\"_blank\">Advanced Carbons Council</a>&nbsp;(ACC, Zug, Switzerland), a global trade association launched <a href=\"https://www.compositesworld.com/news/global-trade-association-the-advanced-carbons-council-launches\" target=\"_blank\">earlier this year</a> connecting more than 40,000 materials professional globally, has released its&nbsp;2025 &ldquo;Carbon Fiber Market Report.&rdquo; This report is based on primary research and describes the size and scope of the global carbon fiber market, including major trends, forecasts and developments.</p>\n\n<p>The carbon fiber sector is facing challenges from many directions, including an uncertain future demand in all primary applications and&nbsp;the emergence of new carbon fiber production &mdash; not only from China but from other geographies including Europe, the Middle East and India. The sector is also under pressure to reduce its carbon footprint, as well as making the material more accessible to a broader range of markets and applications via lowered cost.</p>\n\n<p>In this report, the ACC addresses sustainability and recycling with extensive analysis. It also features company profiles, supply/demand data, new capacity&nbsp;and critical trends shaping carbon fiber&rsquo;s role in future manufacturing and mobility, with segment breakdowns, company intelligence and a long-term outlook.</p>\n\n<p>The vision and mission of the ACC is that advanced carbons &mdash; including carbon fiber, carbon nanotubes (CNTs), graphene, reclaimed carbons and others &mdash; work best when used in combination, and that&nbsp;producers and users should collaborate to identify next-generation material solutions. This includes creating higher-performance materials with repeatable quality&nbsp;that are sustainable.</p>\n\n<p>The ACC, in support of <em>CompositesWorld</em>&rsquo;s annual <a href=\"https://www.carbonfiberevent.com/\" target=\"_blank\">Carbon Fiber conference</a>, will be presenting key highlights and market updates from this report in Wichita, Kansas in November 2025.</p>\n\n<p>To access this report, <a href=\"https://advancedcarbonscouncil.org/page/MarketReportsandData\" target=\"_blank\">visit the ACC website</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/advanced-carbons-council-releases-carbon-fiber-market-report"
      }
    ],
    "link": "https://www.compositesworld.com/news/advanced-carbons-council-releases-carbon-fiber-market-report"
  },
  {
    "published": "Mon, 9 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      9,
      17,
      0,
      0,
      0,
      160,
      0
    ],
    "title": "Jekta begins flight testing of scaled PHA-ZE 100 amphibious aircraft",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Jekta begins flight testing of scaled PHA-ZE 100 amphibious aircraft"
    },
    "summary": "Trials of 1:9 scaled composite prototype marks new milestones in the program&rsquo;s development, including plans to introduce the new aircraft globally in 2030.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Trials of 1:9 scaled composite prototype marks new milestones in the program&rsquo;s development, including plans to introduce the new aircraft globally in 2030."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-jekta-pha-ze100-flight-test.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-jekta-pha-ze100-flight-test.jpg;maxWidth=385\" /></a></div>\n\n<p>Jekta&nbsp;flight testing begins for PHA-ZE 100 program. Source | Jekta Switzerland</p>\n</div>\n\n<p><a href=\"https://jekta.swiss/\" target=\"_blank\">Jekta Switzerland S.A.</a>&nbsp;(Payerne, Switzerland), the company behind the passenger hydro aircraft &ndash;zero emissions 100 (PHA-ZE 100)&nbsp;amphibious aircraft, has begun flight trials with a 1:9 scaled prototype. Using a distributed electric powerplant to draw energy from onboard batteries, testing will verify the aerodynamic and hydrodynamic configurations of the production aircraft. The remotely controlled model will generate data representative of the full-size aircraft to verify and confirm the results of computational modeling already completed.</p>\n\n<p>Following on from digital simulations, real-world testing is expected to deliver valuable data on how the aircraft performs during landing, taxiing and takeoff from water. To optimize the full potential of flight testing, the 1:9 aerodynamic prototype will be used for initial verification work. Two amphibious flying boats are currently being modified as proof-of-concept aircraft and will be used subsequently to validate the combined digital and real-world data. The purpose-built, ultra-light test beds will further de-risk the program and inform detailed design modifications ahead of full-scale prototype construction.</p>\n\n<div class=\"article_sidebar\">\n<p>The electrically powered, all-composite PHA-ZE 100 amphibious flying boat, incorporating hydrogen fuel cell technologies, will be certified to Part 23 standards for fixed-wing passenger aircraft.&nbsp;Jekta plans to build it with an &ldquo;all-composite fuselage that can land directly on water without external &lsquo;floater&rsquo;&nbsp;structures,&rdquo; according to a <a href=\"https://www.ainonline.com/news-article/2023-03-22/jekta-signs-deal-gayo-aviation-10-pha-ze-100-amphibious-aircraft\" target=\"_blank\">2023 article</a> on <em>Aviation International News</em>.&nbsp;The&nbsp;PHA-ZE 100&nbsp;is expected to deliver lower operating costs, comfort, zero emissions&nbsp;and flexible configurations to support multiple applications, including luxury tourism, experiential flight, regional transportation&nbsp;and civil use.</p>\n\n<p>The PHA-ZE 100 will operate from coastal waters in waves up to 1.2 meters high, lakes, waterways, and runways, the latter using its standard retractable wheeled landing gear.</p>\n\n<p>Learn more about the watercraft <a href=\"https://www.circularbusinessreview.com/jektas-electric-amphibious-aircraft-pioneers-green-aviation/\" target=\"_blank\">from this 2024 interview </a>with George Alafinov, co-founder and CEO.</p>\n</div>\n\n<p>&ldquo;After extensive virtual trials and simulations, our engineers are excited to begin flying the 1:9 prototype. The flight testing marks an important milestone on our journey to bring next-generation electric amphibious aircraft to operators globally,&rdquo; says CEO and co-founder George Alafinov. &ldquo;Flying the scaled models and modified ultra-lights moves Jekta&nbsp;one step closer to flying a full-scale prototype of the PHA-ZE 100, confirming that we&rsquo;re on track with plans to introduce our new aircraft to the global air transport network in 2030. Testing presents an excellent opportunity for us to showcase progress to date and the future potential of the PHA-ZE 100 to investors and customers.&rdquo;&nbsp;</p>\n\n<p>Flight testing is taking place at an undisclosed location and is scheduled to be completed in September 2025. Jekta&rsquo;s team has already gained extensive experience with amphibious aircraft design through the production of more than 90 single-engine ultra-light and twin-engine flying boats. Alafinov adds, &ldquo;We are drawing on years of amphibious aircraft experience by basing our full-size test beds on ultra-light aircraft of our design. That experience means our customers can be confident that the PHA-ZE 100 is built on solid foundations by engineers who understand how to trial the real-world application of amphibious aircraft design successfully.&rdquo;</p>\n\n<p>The Jekta&nbsp;PHA-ZE 100 already has more than $1 billion of forward commitments from customers and is scheduled to begin production at its Payerne facility in 2028/2029.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/jekta-begins-flight-testing-of-scaled-pha-ze-100-amphibious-aircraft"
      }
    ],
    "link": "https://www.compositesworld.com/news/jekta-begins-flight-testing-of-scaled-pha-ze-100-amphibious-aircraft"
  },
  {
    "published": "Mon, 9 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      9,
      16,
      0,
      0,
      0,
      160,
      0
    ],
    "title": "Moore Brothers Co. acquires Symmetrix Bristol in Rhode Island",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Moore Brothers Co. acquires Symmetrix Bristol in Rhode Island"
    },
    "summary": "Merging of the two teams, which includes the acquisition of Symmetrix&rsquo;s composite tooling assets and a move to its flagship facility, will establish wide-ranging and complementary skills.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Merging of the two teams, which includes the acquisition of Symmetrix&rsquo;s composite tooling assets and a move to its flagship facility, will establish wide-ranging and complementary skills."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-moorebrothers-symmetrix.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-moorebrothers-symmetrix.jpg;maxWidth=720\" /> </a></div>\n\n<p>Pictured are Moore Brothers&rsquo; Oliver Moore&nbsp;and Sam Moore and Symmetrix&rsquo;s&nbsp;Jon Barnitt. Source | Moore Brothers Co</p>\n</div>\n\n<p><a href=\"https://www.moorebro.co/\" target=\"_blank\">Moore Brothers Co.</a> (Bristol, R.I., U.S.)&nbsp;has announced the acquisition of&nbsp;full-service composite tooling provider <a href=\"https://www.compositesworld.com/suppliers/symmetrix-composite-tooling\" target=\"_blank\">Symmetrix Composite Tooling</a>&rsquo;s (Bristol) shop and assets, a strategic merger benefiting both companies.</p>\n\n<p>The agreement will see Symmetrix consolidate operations to its facility in Statesville, North Carolina, while Moore Brothers will assume occupancy of the Symmetrix&nbsp;facility at 115 Broadcommon Road. Both Symmetrix and Moore Brothers will continue to offer full-service composite tooling.</p>\n\n<p>With expanded machine capacity and the addition of Symmetrix skilled staff, Moore Brothers will offer vertically integrated services spanning large-scale composite tooling, component fabrication&nbsp;and prototyping of all sizes. The building, purpose-built in 2008, spans 45,600 square feet and houses an 80 &times; 20-foot&nbsp;large-format CNC machine and 100 &times; 30-foot&nbsp;paint booth/oven, to which Moore Brothers will add a five-axis CMS (Zogno, Italy) Ares and 60-foot autoclave.</p>\n\n<p>Founded by brothers Oliver and Sam Moore in 2014, Moore Brothers Co.&nbsp;has experienced steady growth with the execution of larger projects. The company serves its core market in the marine industry alongside automotive, industrial and aerospace clients, most recently committing to additional work within aerospace. The company&rsquo;s latest large-scale project will leverage the full capabilities of Symmetrix &mdash; where the tooling is underway &mdash; and Moore Brothers engineering and composite fabrication.</p>\n\n<p>&ldquo;Each step in our growth has come as the result of partnering with established teams in the marine composites industry,&rdquo; says Oliver Moore, Moore Brothers co-founder and vice president. &ldquo;The addition of the Symmetrix&nbsp;[Rhode Island] team and our move to 115 Broadcommon is an opportunity to take another step, raising the ceiling on the size and volume of projects we can accommodate. We look forward to operating in a more efficient space and continuing the legacy of composites manufacturing in the northeast.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/moore-brothers-co-acquires-symmetrix-bristol-in-rhode-island"
      }
    ],
    "link": "https://www.compositesworld.com/news/moore-brothers-co-acquires-symmetrix-bristol-in-rhode-island"
  },
  {
    "published": "Mon, 9 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      9,
      15,
      0,
      0,
      0,
      160,
      0
    ],
    "title": "MSS to distribute Strongwell FRP composite products in Europe",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "MSS to distribute Strongwell FRP composite products in Europe"
    },
    "summary": "Module Solutions &amp; Systems (MSS) is authorized to distribute Strongwell&rsquo;s standard and non-standard products throughout Europe, excluding the U.K.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Module Solutions &amp; Systems (MSS) is authorized to distribute Strongwell&rsquo;s standard and non-standard products throughout Europe, excluding the U.K."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-strongwell-duragrid-phenolic.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"FRP grating product.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-strongwell-duragrid-phenolic.jpg;maxWidth=720\" /> </a></div>\n\n<p>Duragrid Phenolic product. Source | Strongwell</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/strongwell\" target=\"_blank\">Strongwell</a> (Bristol, Va., U.S.), a pultruder of fiber-reinforced polymer (FRP) composites, announces a European distributor agreement with <a href=\"https://modulesolutions.no/\" target=\"_blank\">Module Solutions &amp; Systems AS</a> (MSS, Sola, Norway). The distribution agreement marks a strategic step in expanding Strongwell&rsquo;s international footprint by providing improved access to its composite solutions across Europe and beyond.</p>\n\n<p>Under the terms of the agreement, MSS is authorized to distribute Strongwell&rsquo;s products in Europe, excluding the U.K. MSS will serve customers using product warehoused and shipped locally, as well as the potential for factory-direct shipments.</p>\n\n<p>MSS will distribute both standard and non-standard FRP products from Strongwell, including Phenolic Safrail fiberglass industrial handrail systems and Duragrid and Duragrid phenolic custom fiberglass gratings.</p>\n\n<p>The&nbsp;partnership brings Strongwell&rsquo;s corrosion-resistant, low-maintenance FRP products to more European customers, backed by MSS&rsquo;&nbsp;technical knowledge and service.</p>\n\n<p>&ldquo;MSS&rsquo; experience and presence in the region will allow us to better serve international customers with Strongwell&rsquo;s high-performance&nbsp;composite products,&rdquo; notes David Gibbs, Strongwell VP of sales and engineering.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/mss-to-distribute-strongwell-frp-composite-products-in-europe"
      }
    ],
    "link": "https://www.compositesworld.com/news/mss-to-distribute-strongwell-frp-composite-products-in-europe"
  },
  {
    "published": "Mon, 9 Jun 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      9,
      14,
      0,
      0,
      0,
      160,
      0
    ],
    "title": "Deutsche Aircraft rolls out D328eco test aircraft",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Deutsche Aircraft rolls out D328eco test aircraft"
    },
    "summary": "The D328eco turboprop is an advanced evolution of the Dornier 328 with advanced features and a composites-intensive design. Its flight campaign is expected to begin soon.\n\n&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The D328eco turboprop is an advanced evolution of the Dornier 328 with advanced features and a composites-intensive design. Its flight campaign is expected to begin soon.\n\n&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-d328eco-deutscheaircraft-rollout.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"TAC 1 aircraft.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-d328eco-deutscheaircraft-rollout.png;maxWidth=720\" /> </a></div>\n\n<p>Deutsche Aircraft&rsquo;s first D328eco test aircraft, TAC 1, lines up outside its Oberpfaffenhofen facility. Source | Deutsche Aircraft</p>\n</div>\n\n<p>At the end of May 2025,&nbsp;<a href=\"https://www.deutscheaircraft.com/\" target=\"_blank\">Deutsche Aircraft</a>&nbsp;(Oberpfaffenhofen, Germany) unveiled its first D328eco test aircraft&nbsp;(TAC 1). Following the announcement of the initial fuselage cut at the Farnborough International Airshow in July 2024, the program&nbsp;has maintained steady momentum as it drives progress toward&nbsp;a more efficient and environmentally conscious future for regional air travel.</p>\n\n<p>Building upon the legacy of the Dornier 328, the company says the&nbsp;D328eco&nbsp;is an advanced evolution &mdash; not a clean sheet aircraft. It is reported to deliver enhanced performance, fuel efficiency,&nbsp;an elevated customer experience and lower emissions, while retaining versatility and reliability. This is achieved through modernized aerodynamics and propulsion systems, optimized operational performance &mdash;&nbsp;capable of handling challenging runways, remote locations and extreme weather conditions&nbsp;&mdash; and integration of next-gen avionics and&nbsp;manufacturing processes.&nbsp;<a href=\"https://www.compositesworld.com/news/deutsche-aircraft-begins-final-assembly-facility-construction-for-d328eco-turboprop\" target=\"_blank\">It is also highly composites-intensive</a>.</p>\n\n<p>&ldquo;The rollout of our first test aircraft marks a significant achievement in the D328eco program,&rdquo; says Nico Neumann, co-CEO of Deutsche Aircraft. &ldquo;This milestone represents our transition from conceptual design to practical testing and industrialization.&rdquo;</p>\n\n<p>Following this&nbsp;rollout, Deutsche Aircraft is to&nbsp;start the test campaign&nbsp;for type certification and the aircraft&rsquo;s subsequent entry into service in Q4 2027. The development of the D328eco is propelled by close collaboration with regulatory authorities, strategic industry partners and a highly skilled global supply chain. These partnerships ensure that the aircraft will adhere to the highest standards of performance, safety and sustainability.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/deutsche-aircraft-rolls-out-d328eco-test-aircraft"
      }
    ],
    "link": "https://www.compositesworld.com/news/deutsche-aircraft-rolls-out-d328eco-test-aircraft"
  }
]