[
  {
    "title": "Kunststoffverarbeitung: Leichtes Umsatzminus im ersten Halbjahr 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Kunststoffverarbeitung: Leichtes Umsatzminus im ersten Halbjahr 2025"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/kunststoffverarbeitung-leichtes-umsatzminus-im-ersten-halbjahr-2025/"
      }
    ],
    "link": "https://www.avk-tv.de/kunststoffverarbeitung-leichtes-umsatzminus-im-ersten-halbjahr-2025/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Tue, 16 Sep 2025 06:58:10 +0000",
    "published_parsed": [
      2025,
      9,
      16,
      6,
      58,
      10,
      1,
      259,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Gesamtverband Kunststoffverarbeitende Industrie e.V. (GKV)",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=9070",
    "guidislink": false,
    "summary": "Gesamtverband Kunststoffverarbeitende Industrie e.V. (GKV) Die Umsätze der Kunststoff verarbeitenden Industrie in Deutschland gingen im ersten Halbjahr 2025 im Vergleich zum Vorjahreszeitraum von einem sehr mäßigem Niveau nochmals leicht zurück. ... <a class=\"read-more\" href=\"https://www.avk-tv.de/kunststoffverarbeitung-leichtes-umsatzminus-im-ersten-halbjahr-2025/\" title=\"Kunststoffverarbeitung: Leichtes Umsatzminus im ersten Halbjahr 2025\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Gesamtverband Kunststoffverarbeitende Industrie e.V. (GKV) Die Umsätze der Kunststoff verarbeitenden Industrie in Deutschland gingen im ersten Halbjahr 2025 im Vergleich zum Vorjahreszeitraum von einem sehr mäßigem Niveau nochmals leicht zurück. ... <a class=\"read-more\" href=\"https://www.avk-tv.de/kunststoffverarbeitung-leichtes-umsatzminus-im-ersten-halbjahr-2025/\" title=\"Kunststoffverarbeitung: Leichtes Umsatzminus im ersten Halbjahr 2025\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><a href=\"https://www.gkv.de/de/\">Gesamtverband Kunststoffverarbeitende Industrie e.V. (GKV)</a></p>\n\n\n\n<p><strong>Die Umsätze der Kunststoff verarbeitenden Industrie in Deutschland gingen im ersten Halbjahr 2025 im Vergleich zum Vorjahreszeitraum von einem sehr mäßigem Niveau nochmals leicht zurück. Die Arbeit der neuen Bundesregierung hat bisher keine Impulse für Wachstum gesetzt.</strong></p>\n\n\n\n<p>Die Umsätze der Kunststoff verarbeitenden Industrie gingen im ersten Halbjahr 2025 im Vergleich zum Vorjahr nochmals um ca. 1 Prozent zurück. Rückläufig waren ins-besondere die Umsätze der Hersteller von Kunststoffverpackungen, die um 3,8 Pro-zent im Vergleich zum Vorjahreszeitraum zurückgingen, sowie &#8211; mit einem Minus von 2,8 Prozent &#8211; die Umsätze der Hersteller sonstiger Kunststoffwaren, zu denen u.a. die technischen Kunststoff-Teile zählen. Eine Seitwärtsbewegung vollzogen die Umsätze der Hersteller von Baubedarfsartikeln aus Kunststoff. Eine leichte Erholung mit einem Plus von 1,8 Prozent nach deutlichen Umsatzeinbußen im vergangenen Jahr verzeichneten die Umsätze der Hersteller von Kunststoff-Halbzeugen (Platten, Folien usw.). Verantwortlich für die Umsatzentwicklung des Industriezweigs ist die weiter rückläufige Inlandsnachfrage nach Kunststoffprodukten.<br />Seit 2023 gehen die Umsätze der Kunststoffverarbeitung in Deutschland zurück. Das Geschäftsklima in der Kunststoff verarbeitenden Industrie scheint sich seit Juni zwar leicht aufzuhellen, insgesamt fehlt es aber bislang an ausreichenden Impulsen für eine Umkehr des Konjunkturtrends in Richtung Wachstum. „Die neue Bundesregie-rung sendet bisher widersprüchliche Signale in Richtung Wirtschaft. Es fehlt an kon-kreten Reformen zur deutlichen Entlastung der mittelständischen Industrie von Bü-rokratie und hohen Energiekosten sowie zur Senkung der Lohnnebenkosten.“, so GKV-Hauptgeschäftsführer Dr. Oliver Möllenstädt. Der GKV fordert deshalb von der Bundesregierung entschlossenere und schnellere Reformschritte. Von der Weltleit-messe der Kunststoffindustrie K 2025, die im Oktober in Düsseldorf stattfindet, wer-den positive Impulse für die Kunststoff verarbeitende Industrie erwartet.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Jetzt die gesamte Pressemeldung lesen:</p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/250825_pm_Leichtes_Minus_im_ersten_Halbjahr.pdf\">Pressemeldung (DE)</a></div>\n</div>"
      }
    ]
  },
  {
    "title": "Composite Rotor Sleeves Projekt abgeschlossen – Exklusives Web-Meeting für OEMs und Entwickler von E-Motoren zur Präsentation technologischer Einblicke und Vernetzung der Wertschöpfungskette",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composite Rotor Sleeves Projekt abgeschlossen – Exklusives Web-Meeting für OEMs und Entwickler von E-Motoren zur Präsentation technologischer Einblicke und Vernetzung der Wertschöpfungskette"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/composite-rotor-sleeves-projekt-abgeschlossen-exklusives-web-meeting-fuer-oems-und-entwickler-von-e-motoren-zur-praesentation-technologischer-einblicke-und-vernetzung-der-wertschoepfungskette/"
      }
    ],
    "link": "https://www.avk-tv.de/composite-rotor-sleeves-projekt-abgeschlossen-exklusives-web-meeting-fuer-oems-und-entwickler-von-e-motoren-zur-praesentation-technologischer-einblicke-und-vernetzung-der-wertschoepfungskette/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Fri, 12 Sep 2025 05:22:31 +0000",
    "published_parsed": [
      2025,
      9,
      12,
      5,
      22,
      31,
      4,
      255,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "AZL Aachen GmbH",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=9018",
    "guidislink": false,
    "summary": "AZL Aachen GmbH OEMs und Tier-1-Zulieferer im Bereich elektrischer Antriebsstränge sehen sichwachsenden Anforderungen gegenüber, die Leistung, Effizienz und Skalierbarkeit ihrer Antriebssysteme zuverbessern. Ein wichtiger Faktor, der nun die industrielle Massenproduktion ... <a class=\"read-more\" href=\"https://www.avk-tv.de/composite-rotor-sleeves-projekt-abgeschlossen-exklusives-web-meeting-fuer-oems-und-entwickler-von-e-motoren-zur-praesentation-technologischer-einblicke-und-vernetzung-der-wertschoepfungskette/\" title=\"Composite Rotor Sleeves Projekt abgeschlossen &#8211; Exklusives Web-Meeting für OEMs und Entwickler von E-Motoren zur Präsentation technologischer Einblicke und Vernetzung der Wertschöpfungskette\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "AZL Aachen GmbH OEMs und Tier-1-Zulieferer im Bereich elektrischer Antriebsstränge sehen sichwachsenden Anforderungen gegenüber, die Leistung, Effizienz und Skalierbarkeit ihrer Antriebssysteme zuverbessern. Ein wichtiger Faktor, der nun die industrielle Massenproduktion ... <a class=\"read-more\" href=\"https://www.avk-tv.de/composite-rotor-sleeves-projekt-abgeschlossen-exklusives-web-meeting-fuer-oems-und-entwickler-von-e-motoren-zur-praesentation-technologischer-einblicke-und-vernetzung-der-wertschoepfungskette/\" title=\"Composite Rotor Sleeves Projekt abgeschlossen &#8211; Exklusives Web-Meeting für OEMs und Entwickler von E-Motoren zur Präsentation technologischer Einblicke und Vernetzung der Wertschöpfungskette\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><a href=\"https://azl-aachen-gmbh.de/\">AZL Aachen GmbH</a></p>\n\n\n\n<p>OEMs und Tier-1-Zulieferer im Bereich elektrischer Antriebsstränge sehen sich<br />wachsenden Anforderungen gegenüber, die Leistung, Effizienz und Skalierbarkeit ihrer Antriebssysteme zu<br />verbessern. Ein wichtiger Faktor, der nun die industrielle Massenproduktion erreicht, sind Rotorhülsen auf<br />Verbundwerkstoffbasis. Diese leichten, leistungsstarken Komponenten bieten erhebliche Vorteile hinsichtlich<br />der mechanischen Aufnahme von Rotorkomponenten, um effizientere Konstruktionen für Rotationen mit hoher Drehzahl zu erzielen – insbesondere in anspruchsvollen Automobil-, Luftfahrt- und Industrieanwendungen.</p>\n\n\n\n<p>Nach neunmonatiger gemeinsamer Forschung hat ein Konsortium aus 15 führenden Unternehmen – Arkema<br />Group, Covenstro Deutschland AG, DOMO Engineering Plastics Europe S.p.A., Hexcel Composites SASU,<br />Huntsman Advanced Materials, Hutchinson SA CRI, Kümpers GmbH, LG Electronics Deutschland GmbH, Maru<br />Hachi Corporation, Rassini Supensiones S.A. de C.V., Schunk Kohlenstofftechnik GmbH, Swancore<br />Netherlands B.V., Syensqo, Toray Carbon Fibres Europe S.A., Toyota Motor Europe N.V./S.A. – unter der<br />Leitung der AZL Aachen GmbH ein umfassendes Analyse- und Benchmarking-Projekt abgeschlossen. Das<br />Projekt analysierte systematisch den Stand der Technik und verglich Materialien, Konstruktionsstrategien und<br />Verarbeitungsmethoden für Rotormanschetten aus kohlefaserverstärkten duroplastischen und<br />thermoplastischen Kunststoffen. Das Ergebnis ist eine umfassende Markt- und Technologieanalyse, die in<br />einem 384-seitigen Abschlussbericht dokumentiert ist – und bereit für die Implementierung in Kooperationen.</p>\n\n\n\n<p>Um OEMs und Motorenentwickler bei der Nutzung dieser Erkenntnisse zu unterstützen, veranstaltet das AZL<br />nun ein Web-Meeting, das speziell darauf ausgerichtet ist, die praktische Relevanz, die Reife der Lieferkette<br />und die technischen Details von Verbundrotorhülsen für Elektroantriebe zu demonstrieren. Die Teilnahme ist<br />kostenlos.</p>\n\n\n\n<p>Die Veranstaltung bietet einen strategischen Überblick über die Möglichkeiten der Technologie und zeigt das<br />konkrete Potenzial für die Integration in die Serienproduktion auf. Sie beginnt mit einer Einführung in den<br />aktuellen Stand der Technologie und ihre Rolle bei der Entwicklung der nächsten Generation von<br />Elektromotoren. Anschließend präsentiert das AZL die konsolidierten Ergebnisse aus den Arbeitspaketen des<br />Projekts. Zu den wichtigsten Erkenntnissen gehören Vergleiche von Rotorhülsenkonstruktionen<br />(Presspassung vs. Direktwicklung), Materialklassen (kohlefaserverstärkte thermoplastische und<br />duroplastische Kunststoffe), mechanische und thermische Leistungsbenchmarks sowie Produktions-KPIs.</p>\n\n\n\n<p>Im zweiten Teil des Meetings haben die Teilnehmer die Möglichkeit, das Konsortium hinter dem kürzlich<br />abgeschlossenen Projekt kennenzulernen – von Lieferanten für Verbundwerkstoffe und Maschinenherstellern<br />bis hin zu Produzenten von Rotormanschetten. Jeder Partner wird kurz seine einzigartigen Fachkenntnisse und Angebote vorstellen und so den OEMs dabei helfen, zuverlässige Ansprechpartner für Umsetzungsprojekte zu finden.</p>\n\n\n\n<p>Fabian Köster, Development Engineer Composites bei der Schunk Kohlenstofftechnik GmbH, erklärt: “Schunk<br />als Technologieführer und Großserienhersteller im Bereich Rotor-Armierungen sieht es als entscheidend an, Innovationen aktiv mitzugestalten. Die Teilnahme am AZL-Projekt unterstreicht unsere Überzeugung,<br />Zukunftsfähigkeit und Wettbewerbsstärke durch frühzeitige Einbindung in technologische Entwicklungen zu<br />sichern. Die AZL-Informationsveranstaltung bietet OEM´s und Partnern entlang der gesamten<br />Wertschöpfungskette eine wertvolle Gelegenheit, sich über den aktuellen Stand bei Motor-Armierungen und<br />Trends auszutauschen, Impulse zu setzen und gemeinsame Lösungen für die Herausforderungen von morgen<br />zu entwickeln.”</p>\n\n\n\n<p>Für OEMs bietet diese Veranstaltung neben einem Überblick über neue Technologien auch direkten Zugang<br />zu einem einsatzbereiten Partnernetzwerk. Außerdem markiert sie den offiziellen Start eines Folgeprojekts.</p>\n\n\n\n<p>Diese Folgeinitiative wird sich von der theoretischen Analyse zur experimentellen Validierung verlagern. Ihr<br />Ziel ist es, die Leistung verschiedener Material- und Prozesskombinationen unter realen Produktions- und<br />Betriebsbedingungen zu benchmarken.</p>\n\n\n\n<p>Das folgende Projekt umfasst vier Arbeitspakete. Das erste Arbeitspaket definiert die Produktionskonzepte und<br />Materialien, die experimentell getestet werden sollen, einschließlich der Konzeption von Testmethoden und<br />Hilfsausrüstung für Presspassvorgänge. Das zweite Arbeitspaket zielt auf einen Produktionsprozess ab, der<br />aus separatem Wickeln und Presspassen auf dem Rotor besteht. Es umfasst die Herstellung von Hülsen mittels<br />Nasswickeln, Tow-Prep-Wickeln und thermoplastischem Bandwickeln. Bei der Festigkeitsprüfung der Hülsen<br />werden verschiedene Vorspannungsstufen berücksichtigt, während gleichzeitig die Qualität des Laminats<br />bewertet wird. Das dritte Arbeitspaket umfasst die gleichen Untersuchungen, jedoch in diesem Fall für einen<br />Prozess, bei dem direkt auf den Rotor gewickelt wird. Die Bewertung umfasst auch Hochtemperaturtests und<br />Langzeitbeständigkeit. Schließlich werden im vierten Arbeitspaket alle Prozess- und Festigkeitsprüfergebnisse<br />hinsichtlich Kosten, Qualität und Leistung bewertet, was zu einem Benchmarking verschiedener Materialien<br />und klaren Empfehlungen für kosteneffiziente Rotorhülsen führt.</p>\n\n\n\n<p>Das Web-Meeting, das am 25. September 2025 stattfindet, steht OEMs, Motorenentwicklern,<br />Innovationsmanagern und Systemintegratoren offen, die ihre nächste Generation elektrischer Antriebsstränge<br />beschleunigen möchten. Allen interessierten Teilnehmern wird ein Link zur Anmeldung zur Verfügung gestellt.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Jetzt die gesamte Pressemedung lesen:</p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/2025-09_OEM-RS_DE.pdf\">Pressemeldung (DE)</a></div>\n\n\n\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/2025-09_OEM-RS_EN.pdf\">Pressemeldung (EN)</a></div>\n</div>"
      }
    ]
  },
  {
    "title": "Stellantis vertraut auf KIMW – Akkreditierte Brennprüfungen bestätigt –",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Stellantis vertraut auf KIMW – Akkreditierte Brennprüfungen bestätigt –"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/stellantis-vertraut-auf-kimw-akkreditierte-brennpruefungen-bestaetigt/"
      }
    ],
    "link": "https://www.avk-tv.de/stellantis-vertraut-auf-kimw-akkreditierte-brennpruefungen-bestaetigt/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Thu, 11 Sep 2025 07:48:16 +0000",
    "published_parsed": [
      2025,
      9,
      11,
      7,
      48,
      16,
      3,
      254,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Kunststoff-Institut Lüdenscheid",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=9042",
    "guidislink": false,
    "summary": "Kunststoff-Institut Lüdenscheid Seit Juli ist das Kunststoff-Institut Lüdenscheid als geprüftes und gelistetes Prüflabor für die Brennprüfung (LP.7M079) nun auch durch den internationalen Automobilkonzern Stellantis anerkannt – zusätzlich zu zahlreichen weiteren ... <a class=\"read-more\" href=\"https://www.avk-tv.de/stellantis-vertraut-auf-kimw-akkreditierte-brennpruefungen-bestaetigt/\" title=\"Stellantis vertraut auf KIMW – Akkreditierte Brennprüfungen bestätigt &#8211;  \">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Kunststoff-Institut Lüdenscheid Seit Juli ist das Kunststoff-Institut Lüdenscheid als geprüftes und gelistetes Prüflabor für die Brennprüfung (LP.7M079) nun auch durch den internationalen Automobilkonzern Stellantis anerkannt – zusätzlich zu zahlreichen weiteren ... <a class=\"read-more\" href=\"https://www.avk-tv.de/stellantis-vertraut-auf-kimw-akkreditierte-brennpruefungen-bestaetigt/\" title=\"Stellantis vertraut auf KIMW – Akkreditierte Brennprüfungen bestätigt &#8211;  \">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><a href=\"http://www.kimw.de\">Kunststoff-Institut Lüdenscheid</a></p>\n\n\n\n<p>Seit Juli ist das Kunststoff-Institut Lüdenscheid als geprüftes und gelistetes Prüflabor für die Brennprüfung (LP.7M079) nun auch durch den internationalen Automobilkonzern Stellantis anerkannt – zusätzlich zu zahlreichen weiteren OEMs.</p>\n\n\n\n<p>Die Grundlage dieser Anerkennung bildet die bestehende Akkreditierung gemäß relevanter Normen wie DIN EN ISO 3795 und FMVSS 302, die bereits seit mehreren Jahren am KIMW etabliert sind.</p>\n\n\n\n<p>Stellantis vereint Marken wie Peugeot, Fiat, Opel und Jeep unter einem Dach und zählt zu den weltweit größten Fahrzeugherstellern. Die Anerkennung durch einen solchen Global Player unterstreicht die hohe Qualität und Zuverlässigkeit der Prüfleistungen des Instituts.</p>\n\n\n\n<p>Akkreditierungen im Prüfbereich sind essenziell, da sie die Einhaltung internationaler Standards garantieren und eine objektive, nachvollziehbare Bewertung sicherstellen. Für Kunden bedeutet die Listung als anerkanntes Prüflabor eine erhebliche Vereinfachung in der Projektabwicklung: Prüfberichte werden direkt akzeptiert, zusätzliche Validierungen entfallen, und die Time-to-Market kann deutlich verkürzt werden.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Jetzt die gesamte Pressemeldung lesen:</p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/PM_Stellantis_vertraut_auf_KIMW_Akkreditierte_Brennpruefungen_bestaetigt.pdf\">Pressemeldung (DE)</a></div>\n</div>\n\n\n\n<p><br /></p>"
      }
    ]
  },
  {
    "title": "AI Circular Economy Conference 2026: Deadline für den Call for Abstracts verlängert bis 26 Oktober 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AI Circular Economy Conference 2026: Deadline für den Call for Abstracts verlängert bis 26 Oktober 2025"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/ai-circular-economy-conference-2026-deadline-fuer-den-call-for-abstracts-verlaengert-bis-26-oktober-2025/"
      }
    ],
    "link": "https://www.avk-tv.de/ai-circular-economy-conference-2026-deadline-fuer-den-call-for-abstracts-verlaengert-bis-26-oktober-2025/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Wed, 10 Sep 2025 07:25:34 +0000",
    "published_parsed": [
      2025,
      9,
      10,
      7,
      25,
      34,
      2,
      253,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Nova-Institut",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=9034",
    "guidislink": false,
    "summary": "nova-Institut GmbH Mit KI das volle Potenzial erneuerbaren Kohlenstoffs aus Biomasse, CCU und Recycling erschließen Künstliche Intelligenz (KI) ist längst mehr als nur ein technologischer Trend: KI ist eine transformative ... <a class=\"read-more\" href=\"https://www.avk-tv.de/ai-circular-economy-conference-2026-deadline-fuer-den-call-for-abstracts-verlaengert-bis-26-oktober-2025/\" title=\"AI Circular Economy Conference 2026: Deadline für den Call for Abstracts verlängert bis 26 Oktober 2025\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "nova-Institut GmbH Mit KI das volle Potenzial erneuerbaren Kohlenstoffs aus Biomasse, CCU und Recycling erschließen Künstliche Intelligenz (KI) ist längst mehr als nur ein technologischer Trend: KI ist eine transformative ... <a class=\"read-more\" href=\"https://www.avk-tv.de/ai-circular-economy-conference-2026-deadline-fuer-den-call-for-abstracts-verlaengert-bis-26-oktober-2025/\" title=\"AI Circular Economy Conference 2026: Deadline für den Call for Abstracts verlängert bis 26 Oktober 2025\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>nova-Institut GmbH</p>\n\n\n\n<p><strong>Mit KI das volle Potenzial erneuerbaren Kohlenstoffs aus Biomasse, CCU und Recycling erschließen</strong></p>\n\n\n\n<p>Künstliche Intelligenz (KI) ist längst mehr als nur ein technologischer Trend: KI ist eine transformative Kraft, die den Übergang von fossilen Brennstoffen zu erneuerbaren Kohlenstoffquellen in der Chemie- und Werkstoffindustrie beschleunigt. Dies ist eine der größten industriellen Herausforderungen seit Beginn der Industrialisierung und erfordert die fortschrittlichsten digitalen Lösungen. KI ist der Schlüssel zu dieser Transformation.<br />Das nova-Institut präsentiert stolz seine neue Highlight-Veranstaltung, die die besten Innovatoren, Forscher und Praktiker dieser grundlegenden digitalen Transformation unserer Gesellschaft zusammenbringt: die „AI Circular Economy Conference”, die am 4. und 5. März 2026 in Köln und online stattfindet. Nehmen Sie an dieser bahnbrechenden Konferenz teil und erfahren Sie, wie fortschrittliche KI-Tools und -Anwendungen die Zukunft der Kreislaufwirtschaft und nachhaltiger Materialien gestalten, indem sie das volle Potenzial von erneuerbarem Kohlenstoff aus Biomasse, Kohlenstoffabscheidung und -nutzung (CCU) sowie Recycling erschließen:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Hightech-Innovatoren liefern modernste KI-Lösungen für Wissenschaft und Industrie.</li>\n\n\n\n<li>Chemie- und Kunststoffhersteller nutzen KI, um schneller, effizienter und nachhaltiger zu agieren.</li>\n\n\n\n<li>In der Agrar- und Biomassebranche wird KI eingesetzt, um neue Rohstoffquellen zu erschließen und Materialkreisläufe zu schließen.</li>\n\n\n\n<li>Präsentation modernster KI-Anwendungen, einschließlich KI-gestützter Modellierung von CCU-Prozessen und Katalysatoren, Optimierung der CO₂-Abscheidung und Entwicklung neuartiger chemischer Verfahren wie der Elektrochemie.</li>\n\n\n\n<li>Einsatz von KI zur Prozesssteuerung und -optimierung bei der Depolymerisation, zur fortgeschrittenen Sortierung von Abfallströmen, zur Analyse von Rohstoffen und zur Qualitätssicherung von recycelten Materialien.</li>\n</ul>\n\n\n\n<p>Auf dieser interdisziplinären Veranstaltung, an der führende Experten aus den Bereichen KI-Entwicklung, Chemie- und Kunststoffherstellung, Biotechnologie, Landwirtschaft, Recycling und Nachhaltigkeit teilnehmen, werden die neuesten Entwicklungen präsentiert. Ganz gleich, ob Sie als Data Scientist an neuen industriellen Anwendungen arbeiten, als Werkstoffexperte nach praktischen Werkzeugen suchen oder als Mitglied des Managements und Teil der Investment-Community nach strategischen und finanziellen Möglichkeiten Ausschau halten – diese Konferenz wird Ihnen umsetzbare Erkenntnisse, wertvolle Anwendungsbeispiele und Möglichkeiten zur Zusammenarbeit bieten. Die „AI Circular Economy Conference“ bringt alle relevanten Interessengruppen zusammen, um den Bedarf an KI-Lösungen in einer Kreislaufwirtschaft im Chemie- und Materialsektor zu diskutieren und mit den technischen Lösungen von Wissenschaftlern und Entwicklern abzugleichen.</p>\n\n\n\n<p><strong>Konferenzthemen</strong></p>\n\n\n\n<p>Wir laden Sie ein, Ihre Abstracts für Präsentationen auf der „AI Circular Economy Conference” einzureichen. Mit diesen können Sie dazu beitragen, KI in zirkulären und nachhaltigen Materialsystemen voranzubringen. Die Themen umfassen die folgenden Bereiche, sind aber nicht darauf beschränkt:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Bio-basierte Materialien<br />KI-gesteuertes Design von bio-basierten und biologisch abbaubaren Polymeren (digitale Zwillinge)<br />Maschinelles Lernen für die Optimierung von Enzymen und Proteinen<br />Präzisionslandwirtschaft und intelligenter Biomasseanbau<br /></li>\n\n\n\n<li>CO₂-basierte Lösungen (Kohlenstoffabscheidung und -verwertung).<br />KI-gestützte Modellierung von CCU-Prozessen und Katalysatoren<br />KI zur Optimierung der CO₂-Abscheidung<br />KI-Design für neue chemische Verfahren einschließlich Elektrochemie<br /></li>\n\n\n\n<li>Fortschrittliches Recycling<br />KI für die Prozesssteuerung und -optimierung bei der Depolymerisation<br />Sortierung von Abfallströmen und Analyse von Rohstoffen<br />Qualitätssicherung von recycelten Materialien<br /></li>\n\n\n\n<li>Übergreifende und interdisziplinäre Themen<br />Lieferkettenvorhersage und Risikoanalyse<br />KI für Nachhaltigkeitsbewertungen und Politikmodellierung<br />Infrastruktur, Datenintegration und digitale Bereitschaft<br />Chemie- und Kunststoffhersteller nutzen KI, um schneller, effizienter und nachhaltiger zu innovieren<br />Hightech-Innovatoren liefern bahnbrechende KI-Lösungen für Wissenschaft und Industrie.<br />Vorhersage und Life-Cycle-Assessment<br /><br />Reichen Sie jetzt Ihr Abstract ein und präsentieren Sie Ihre Innovationen an vorderster Front KI-gesteuerter Lösungen für eine zirkuläre und nachhaltige Chemie- und Materialindustrie. Einsendeschluss ist der 26. Oktober 2025. Spätere Einreichungen sind möglich und können bei besonderen Schwerpunkten und Qualitäten auch noch akzeptiert werden.<br /><br /><a href=\"https://ai-circulareconomy.eu/call-for-abstracts/\">https://ai-circulareconomy.eu/call-for-abstracts/</a></li>\n</ol>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Jetzt die gesamte Pressemeldung lesen:</p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/25-09-10_Call-for-Abstracts_PR_DE.pdf\">Pressemeldung (DE)</a></div>\n\n\n\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/25-09-10_Call-for-Abstracts_PR_EN.pdf\">Pressemeldung (EN)</a></div>\n</div>"
      }
    ]
  },
  {
    "title": "KraussMaffei präsentiert auf der K 2025 den innovativen Frontscheinwerfer „FrontIQ Light“ – hergestellt mit der Technologie ColorForm",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "KraussMaffei präsentiert auf der K 2025 den innovativen Frontscheinwerfer „FrontIQ Light“ – hergestellt mit der Technologie ColorForm"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/kraussmaffei-praesentiert-auf-der-k-2025-den-innovativen-frontscheinwerfer-frontiq-light-hergestellt-mit-der-technologie-colorform/"
      }
    ],
    "link": "https://www.avk-tv.de/kraussmaffei-praesentiert-auf-der-k-2025-den-innovativen-frontscheinwerfer-frontiq-light-hergestellt-mit-der-technologie-colorform/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Wed, 10 Sep 2025 05:26:32 +0000",
    "published_parsed": [
      2025,
      9,
      10,
      5,
      26,
      32,
      2,
      253,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "KrausMaffei",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=9026",
    "guidislink": false,
    "summary": "KraussMaffei Auf der K 2025 zeigt KraussMaffei gemeinsam mit seinen Partnern LEONHARD KURZ und Rühl, wie die Frontleuchte von morgen aussieht: Das „FrontIQ Light“ vereint Design, Funktion und Schutz in ... <a class=\"read-more\" href=\"https://www.avk-tv.de/kraussmaffei-praesentiert-auf-der-k-2025-den-innovativen-frontscheinwerfer-frontiq-light-hergestellt-mit-der-technologie-colorform/\" title=\"KraussMaffei präsentiert auf der K 2025 den innovativen Frontscheinwerfer „FrontIQ Light“ – hergestellt mit der Technologie ColorForm\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "KraussMaffei Auf der K 2025 zeigt KraussMaffei gemeinsam mit seinen Partnern LEONHARD KURZ und Rühl, wie die Frontleuchte von morgen aussieht: Das „FrontIQ Light“ vereint Design, Funktion und Schutz in ... <a class=\"read-more\" href=\"https://www.avk-tv.de/kraussmaffei-praesentiert-auf-der-k-2025-den-innovativen-frontscheinwerfer-frontiq-light-hergestellt-mit-der-technologie-colorform/\" title=\"KraussMaffei präsentiert auf der K 2025 den innovativen Frontscheinwerfer „FrontIQ Light“ – hergestellt mit der Technologie ColorForm\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>KraussMaffei</p>\n\n\n\n<p><strong>Auf der K 2025 zeigt KraussMaffei gemeinsam mit seinen Partnern LEONHARD KURZ und Rühl, wie die Frontleuchte von morgen aussieht: Das „FrontIQ Light“ vereint Design, Funktion und Schutz in einem einzigen hochintegrierten Fertigungsprozess. Herzstück ist die ColorForm-Technologie, bei der Thermoplast-Bauteile im Spritzgießwerkzeug direkt mit einer präzisen Polyurethan-Oberfläche versehen werden.</strong></p>\n\n\n\n<p>Während bei konventionellen Frontscheinwerfern ein kostenintensives Hardcoating erforderlich ist, übernimmt beim „FrontIQ Light“ eine inline applizierte PUR-Schicht den Schutz vor UV-Strahlung, Steinschlag und chemischen Einflüssen. Die Lackschicht lässt sich präzise im Zehntelmillimeterbereich einstellen und ermöglicht variable haptische Effekte sowie eine selbstheilende Wirkung bei feinen Kratzern. „Mit unserer ColorForm-Technologie revolutioniert KraussMaffei die Frontleuchte: von der Designfreiheit mit bedruckten Folien bis hin zur präzisen 3D-Formung – alles in einer intelligent vernetzten Komplettlösung“, erklärt Dr. Frank Szimmat, Geschäftsführer der KraussMaffei Technologies.</p>\n\n\n\n<p>Eine Weltneuheit ist dabei das werkzeugintegrierte Folientiefziehen: Die Folie wird direkt im Werkzeug dreidimensional verformt. Damit entsteht höchste Designfreiheit – von edlen Tiefeneffekten bis hin zu individuellen Oberflächenmustern. Für Präzision sorgt eine Automationslösung, die die Folien vorab reinigt, exakt positioniert und passgenau verformt. Dank der integrierten Automation verfügt der Greifer über einen Heizprozess, der das Folientiefziehen überhaupt erst ermöglicht. Diese Innovation schafft eine extrem präzise und gleichmäßige Erwärmung der Folie – die Basis für höchste Qualität und perfekte Passgenauigkeit im Werkzeug. Trotz der Komplexität funktioniert der Prozess reibungslos, da alle Schritte aus einer Hand bereitgestellt werden.</p>\n\n\n\n<h6 class=\"wp-block-heading\"><strong>Designfreiheit durch Folienintegration</strong></h6>\n\n\n\n<p>Das Besondere: Die Kombination aus mehreren Thermoplasten, dekorativer Folie und PUR-Oberfläche eröffnet nahezu unbegrenzte Gestaltungsmöglichkeiten. Brillante Tiefeneffekte, individuelle Muster und dauerhafter Schutz entstehen direkt im Werkzeug – ohne nachträgliche Lackierprozesse. Die Gestaltung der Oberfläche erfolgt über Folien, bedruckt durch eine Dünnschichttechnologie, die im Werkzeug im Sheet to Sheet-Verfahren mit transparentem und schwarzem Polycarbonat hinterspritzt werden. „Automobildesign ist heute expressiver und emotionaler als je zuvor. Mit Konzepten wie dem „FrontIQ Light“ heben wir das Design auf das nächste Level – nahtlos, nachhaltig und voller neuer Möglichkeiten. Licht wird zur Sprache und Oberflächen werden zum Markenerlebnis“, sagt Luitpold Haarländer, Head of Sales Management Automotive bei LEONHARD KURZ.</p>\n\n\n\n<h6 class=\"wp-block-heading\"><strong>Schlüsselfertige Komplettlösungen aus einer Hand</strong></h6>\n\n\n\n<p>KraussMaffei liefert die ColorForm-Technologie als durchgängige Lösung von der Automation über die PUR-Technologie bis hin zur Spritzgießtechnik. Ergebnis ist ein hochintegrierter Prozess, bei dem Design, Funktion und Schutzschicht direkt im Werkzeug entstehen, ohne zusätzliche Nacharbeit.</p>\n\n\n\n<p>Auf der K 2025 können Besucher die Technologie live auf einer GXW 650 mit Wendeplatte erleben. Gezeigt wird ein 3K-Demonstrator im Design eines 720 Millimeter langen Frontscheinwerfers am Stand von LEONHARD KURZ in Halle 5 / A19.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Jetzt die gesamte Pressemeldung lesen:</p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/01_PM_2025_09_ColorForm_K2025_DE.pdf\">Pressemldung (DE)</a></div>\n</div>"
      }
    ]
  },
  {
    "title": "Neues Seminar zu LCA und ökologischer Produktionsgestaltung",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Neues Seminar zu LCA und ökologischer Produktionsgestaltung"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/neues-seminar-zu-lca-und-oekologischer-produktionsgestaltung/"
      }
    ],
    "link": "https://www.avk-tv.de/neues-seminar-zu-lca-und-oekologischer-produktionsgestaltung/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Thu, 04 Sep 2025 13:51:21 +0000",
    "published_parsed": [
      2025,
      9,
      4,
      13,
      51,
      21,
      3,
      247,
      0
    ],
    "tags": [
      {
        "term": "News",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8982",
    "guidislink": false,
    "summary": "Nachhaltige Produktion &#8211; Einsatz von Life Cycle Assessment und ökologischer Produktionsgestaltung Wirtschaftlich, nachhaltig und flexibel &#8211; so soll die Produktion von Faserverbundbauteilen in Zukunft sein. Doch welche Technologien sind im ... <a class=\"read-more\" href=\"https://www.avk-tv.de/neues-seminar-zu-lca-und-oekologischer-produktionsgestaltung/\" title=\"Neues Seminar zu LCA und ökologischer Produktionsgestaltung\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Nachhaltige Produktion &#8211; Einsatz von Life Cycle Assessment und ökologischer Produktionsgestaltung Wirtschaftlich, nachhaltig und flexibel &#8211; so soll die Produktion von Faserverbundbauteilen in Zukunft sein. Doch welche Technologien sind im ... <a class=\"read-more\" href=\"https://www.avk-tv.de/neues-seminar-zu-lca-und-oekologischer-produktionsgestaltung/\" title=\"Neues Seminar zu LCA und ökologischer Produktionsgestaltung\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><strong>Nachhaltige Produktion &#8211; Einsatz von Life Cycle Assessment und ökologischer Produktionsgestaltung</strong></p>\n\n\n\n<p>Wirtschaftlich, nachhaltig und flexibel &#8211; so soll die Produktion von Faserverbundbauteilen in Zukunft sein. Doch welche Technologien sind im jeweiligen Fall am besten geeignet und wie kann die Produktion ideal ausgelegt werden? Und wie kann dabei die ökologische Nachhaltigkeit der Produktion und der Produkte ermittelt und gesteigert werden?<br />Im Seminar wird dazu ein Grundverständnis zu ausgewählten Methoden der Fabrikplanung und dem Life Cycle Assessment vermittelt und geeignete Kennzahlen zur Bewertung vorgestellt. Die vermittelte Kompetenz<br />wird anhand von Praxisbeispielen in Übungen vertieft und planerische Softwaretools erprobt.<br /></p>\n\n\n\n<p class=\"has-accent-color has-text-color has-link-color wp-elements-621e5cebb23db65021b7b5e9c38bbf10\"><strong>SEMINARINHALT</strong></p>\n\n\n\n<p>Robust, wirtschaftlich, nachhaltig und flexibel soll die Produktion von Faserverbundbauteilen sein, aber welche Technologien eignen sich am besten für die gegebenen Produktionsbedingungen und Zielgrößen? Wie können die Prozesse optimal miteinander verkettet und wie kann eine neue Technologie optimal in ein bestehendes Produktionssystem integriert werden? Und wie kann dabei die ökologische Nachhaltigkeit der Produktion und der Produkte ermittelt und gesteigert werden?</p>\n\n\n\n<p>Im Rahmen des Seminars »Nachhaltige Produktion &#8211; Einsatz von Life Cycle Assessment (LCA) und ökologischer Produktionsgestaltung« werden genau diese Fragestellungen behandelt. Die hierfür notwendigen Simulationswerkzeuge und Bewertungsmethoden werden vorgestellt, wobei ein besonderer Schwerpunkt auf die Ökobilanzierung gelegt wird. Die Teilnehmer lernen somit den gesamten planerischen Prozess von der Entstehung der Daten bis hin zur virtuellen Integration neuer Prozessketten in bestehende Produktionssysteme kennen. Ein weiterer zentraler Bestandteil ist die Validierung und Bewertung hinsichtlich individueller Zielgrößen. Der Fokus des Seminars liegt dabei auf der Berechnung logistischer (Zeit, Kosten, Umlaufbestand) und ökologischer Zielgrößen.</p>\n\n\n\n<p>Den Teilnehmern wird ein Grundverständnis des Planungsprozesse der Produktion und Produktionsstruktur von Faserverbundbauteilen vermittelt. Sie werden in die Lage versetzt, planerische Softwaretools wie <em>Plant Simulation</em> anzuwenden und lernen Ökobilanzierungsansätze kennen und die grundlegenden Prinzipien anzuwenden sowie die entwickelten Konzepte und Planungsalternativen nach den Zielgrößen zu bewerten. Das gesamte Modul wird an Beispielen von Faserverbundkunststoff (FVK)-Bauteilen verdeutlicht, so werden Fiber Placement Technologien zur Datengenerierung, FVK-Prozessmodule zum Prozesskettenaufbau und FVK-Ökobilanzierungsdatenbanken zur Bewertung eingesetzt.<br /></p>\n\n\n\n<p class=\"has-accent-color has-text-color has-link-color wp-elements-f817e7be2d5362a8cc7e4525c9574e55\"><strong>IHR NUTZEN</strong></p>\n\n\n\n<p><img alt=\"✅\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2705.png\" style=\"height: 1em;\" /> Sie erwerben grundlegendes Wissen zur ökologischen Bewertung der Composite-Fertigung mittels Life Cycle Assessment (Ökobilanz) und erhalten einen Überblick über die Umweltwirkungen der Materialien und Prozesse</p>\n\n\n\n<p><img alt=\"✅\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2705.png\" style=\"height: 1em;\" /> Sie erwerben ein Grundverständnis darüber, wie die Eignung neuer Technologien in der Produktion bewertet werden und eine wirtschaftliche, ökologische und flexible Produktion geplant werden kann</p>\n\n\n\n<p><img alt=\"✅\" class=\"wp-smiley\" src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/2705.png\" style=\"height: 1em;\" /> Sie erhalten einen Überblick und eine Einführung in geeignete Methoden. Anhand von pra-<br />xisnahen Anwendungsbeispielen werden die Methoden angewendet und ein Einblick in gängige Softwares gegeben</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/veranstaltung/seminar-nachhaltige-produktion-einsatz-von-life-cycle-assessment-lca-und-oekologischer-produktionsgestaltung/\">Zur Veranstaltung</a></div>\n\n\n\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/2022251019-2.pdf\">Seminarflyer</a></div>\n</div>\n\n\n\n<p></p>"
      }
    ]
  },
  {
    "title": "Spritzgussfertigung biobasierter Bauteile mit gesteuerter Kompostierdauer",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Spritzgussfertigung biobasierter Bauteile mit gesteuerter Kompostierdauer"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/spritzgussfertigung-biobasierter-bauteile-mit-gesteuerter-kompostierdauer/"
      }
    ],
    "link": "https://www.avk-tv.de/spritzgussfertigung-biobasierter-bauteile-mit-gesteuerter-kompostierdauer/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Wed, 03 Sep 2025 08:37:10 +0000",
    "published_parsed": [
      2025,
      9,
      3,
      8,
      37,
      10,
      2,
      246,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "SKZ - Das Kunststoff-Zentrum",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=9048",
    "guidislink": false,
    "summary": "Forschungsprojekt LEAF soll die Herstellung von Kunststoffbauteilen mit kontrollierbarer Kompostierbarkeit ermöglichen SKZ – Das Kunststoff-Zentrum Mit dem Start des Forschungsprojekts LEAF wird ein innovativer Weg in der Entwicklung nachhaltiger Kunststoffbauteile ... <a class=\"read-more\" href=\"https://www.avk-tv.de/spritzgussfertigung-biobasierter-bauteile-mit-gesteuerter-kompostierdauer/\" title=\"Spritzgussfertigung biobasierter Bauteile mit gesteuerter Kompostierdauer\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Forschungsprojekt LEAF soll die Herstellung von Kunststoffbauteilen mit kontrollierbarer Kompostierbarkeit ermöglichen SKZ – Das Kunststoff-Zentrum Mit dem Start des Forschungsprojekts LEAF wird ein innovativer Weg in der Entwicklung nachhaltiger Kunststoffbauteile ... <a class=\"read-more\" href=\"https://www.avk-tv.de/spritzgussfertigung-biobasierter-bauteile-mit-gesteuerter-kompostierdauer/\" title=\"Spritzgussfertigung biobasierter Bauteile mit gesteuerter Kompostierdauer\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><strong>Forschungsprojekt LEAF soll die Herstellung von Kunststoffbauteilen mit kontrollierbarer Kompostierbarkeit ermöglichen</strong></p>\n\n\n\n<p><a href=\"https://www.skz.de/\">SKZ – Das Kunststoff-Zentrum</a></p>\n\n\n\n<p><em><strong>Mit dem Start des Forschungsprojekts LEAF wird ein innovativer Weg in der Entwicklung nachhaltiger Kunststoffbauteile eingeschlagen. Ziel des Projekts ist die Entwicklung biobasierter Materialien, die sich nicht nur effizient im Spritzgussverfahren verarbeiten lassen, sondern deren Kompostierdauer auch gezielt gesteuert werden kann.</strong></em></p>\n\n\n\n<p>Biologisch abbaubare Kunststoffe bieten eine nachhaltige Alternative zu herkömmlichen Kunststoffen wie Polyethylen (PE) und Polypropylen (PP), die mit erheblichen Umweltproblemen verbunden sind, da sie Hunderte bis Tausende Jahre benötigen, um sich zu zersetzen. Ihre lange Zersetzungsdauer führt dazu, dass Mikropartikel entstehen, die sich in Gewässern, Böden und der Nahrungskette anreichern. Diese Mikropartikel können bioakkumulieren und toxische Wirkungen entfalten. Biologisch abbaubare Kunststoffe wie Polymilchsäure (PLA), Polybutylensuccinat (PBS) und Polyhydroxyalkanoate (PHA) gelten als vielversprechende Alternativen zu herkömmlichen Kunststoffen. Doch ihre Zersetzung gelingt in vielen Fällen nur unter industriellen Bedingungen. Genau hier setzt das Projekt LEAF, unter der Leitung des Kunststoff-Zentrums in Kooperation mit den Partnern Dressel GmbH und Boßler Werkzeug &amp; und Formenbau GmbH an: Durch die Integration granularer Laubmaterialien in Biopolymer-Compounds sollen neue Materialien entstehen, die sowohl umweltfreundlich als auch industriell praktikabel sind.<br /><br />„Unser innovativer Ansatz ist die Nutzung granularer Laubmaterialien, die in Bioreaktoren aufbereitet werden. Diese Materialien eignen sich als Verstärkungsphase, zur Verbesserung der Fließfähigkeit und zur gezielten Steuerung der Kompostierdauer“, erklärt Christian Schlör, Wissenschaftler am SKZ.<br /><br />Das im Januar 2025 gestartete Projekt adressiert zentrale Herausforderungen wie thermische Stabilität und Phasenseparation. Das Ziel besteht darin, ein laubbasiertes Biopolymer zu entwickeln, das sich im Spritzgussverfahren verarbeiten lässt und eine definierte Zersetzungsdauer aufweist. Die Ergebnisse könnten insbesondere für Unternehmen aus der Verpackungs-, Automobil-, Textil- und Agrarindustrie von großer Bedeutung sein.<br /><br />LEAF steht damit für eine neue Generation nachhaltiger Materialien, die ökologische Verantwortung mit industrieller Effizienz vereinen.</p>\n\n\n\n<p><br /><br /><br /></p>\n\n\n\n<p></p>"
      }
    ]
  },
  {
    "title": "Das IKV auf der K 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Das IKV auf der K 2025"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/das-ikv-auf-der-k-2025/"
      }
    ],
    "link": "https://www.avk-tv.de/das-ikv-auf-der-k-2025/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Tue, 02 Sep 2025 08:00:00 +0000",
    "published_parsed": [
      2025,
      9,
      2,
      8,
      0,
      0,
      1,
      245,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "Institut für Kunststoffverarbeitung (IKV)",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8778",
    "guidislink": false,
    "summary": "Stand C16, Halle 14 IKV &#8211; Institut für Kunststoffverarbeitung in Industrie und Handwerk an der RWTH Aachen Mit drei zukunftsweisenden Themen präsentiert sich das Institut für Kunststoffverarbeitung (IKV) in Industrie ... <a class=\"read-more\" href=\"https://www.avk-tv.de/das-ikv-auf-der-k-2025/\" title=\"Das IKV auf der K 2025\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Stand C16, Halle 14 IKV &#8211; Institut für Kunststoffverarbeitung in Industrie und Handwerk an der RWTH Aachen Mit drei zukunftsweisenden Themen präsentiert sich das Institut für Kunststoffverarbeitung (IKV) in Industrie ... <a class=\"read-more\" href=\"https://www.avk-tv.de/das-ikv-auf-der-k-2025/\" title=\"Das IKV auf der K 2025\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p>Stand C16, Halle 14</p>\n\n\n\n<p><a href=\"https://ikv-aachen.de/\">IKV &#8211; Institut für Kunststoffverarbeitung in Industrie und Handwerk an der RWTH Aachen</a><br /></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Nachhaltige Produktion, Rezyklatverarbeitung und KI-Methoden in der Kunststoffindustrie</li>\n\n\n\n<li>Foam2Cycle: Komplett recyclingfähige Soft-Touch-Anwendung mit hohem Rezyklatanteil</li>\n\n\n\n<li>Detect before Defect: Walzeninspektionssystem zur Qualitäts- und Produktivitätsverbesserung in der Flachfolienextrusion</li>\n\n\n\n<li>KI4KI: Initiative zur Förderung der systematischen Nutzung von KI-Methoden in der gesamten Kunststoffwertschöpfungskette</li>\n</ul>\n\n\n\n<p>Mit drei zukunftsweisenden Themen präsentiert sich das Institut für Kunststoffverarbeitung (IKV) in Industrie und Handwerk an der RWTH Aachen vom 8. bis 15. Oktober 2025 auf der K 2025 in Düsseldorf: Im Fokus stehen die Entwicklung einer nachhaltigen, vollständig recyclingfähigen 2K-Soft-Touch-Anwendung, ein Walzeninspektionssystem zur Qualitätsverbesserung bei der Rezyklatverarbeitung in der Flachfolienextrusion sowie eine neue Initiative, die Unternehmen dabei unterstützt, die Potenziale von Digitalisierung und Künstlicher Intelligenz zu erkennen, systematisch zu bewerten und gezielt zu nutzen.<br /><br /><strong>Foam2Cycle:</strong><br /><strong>Wirtschaftliche Produktion kreislauffähiger Soft-Touch-Leichtbaukomponenten</strong><br /><br />Für mehrkomponentige Soft-Touch-Bauteile sind Design for Recycling und die Verringerung des CO2-Fußabdrucks über den Produktlebenszyklus hinweg eine besondere Herausforderung. Das IKV zeigt auf der K 2025 eine mechanisch rezyklierbare Leichtbaualternative für Soft-Touch-Anwendungen, die sowohl optisch als auch haptisch mit konventionellen Soft-Touch-Lösungen konkurrieren kann. Auf dem Stand C16 in Halle 14 produziert das IKV während der Messe Soft-Touch-Handballenablagen für Computertastaturen und beweist damit Leistungsfähigkeit, Serientauglichkeit und Wirtschaftlichkeit des neuen Produktionskonzeptes.<br />Die Handballenablage besteht aus einem Polypropylen-Träger, auf den als weiche Komponente ein thermoplastisches Elastomer aufgespritzt wird. Das hat den Vorteil, dass auch die Softkomponente ein Thermoplast ist und deshalb zusammen mit dem thermoplastischen Träger recycelt werden kann. Aus zerkleinerten Handballenablagen kann ein PP-Rezyklat compoundiert und für die Herstellung neuer PP-Träger genutzt werden. Die Umsetzung zeigt das IKV auf dem Stand anhand von mehrfach rezyklierten Formteilen mit Rezyklatgehalten von bis zu 30 %.<br />Gefertigt wird in einem 2K-Thermoplast-Schaumspritzgießverfahren (TSG) mit chemischem Treibmittel. Ein atmendes Werkzeug, bei dem sich das Kavitätsvolumen über den Zyklus verändert, ermöglicht hohe Aufschäumgrade bei gleichzeitig hochwertigen Oberflächen. Eine isolierende Werkzeugbeschichtung und die Prägung des Bauteils im Werkzeug verbessern die Oberflächenqualität zusätzlich. Durch das Schäumen kann die Dichte des Trägers um rund 8 % und die des TPE um bis zu 80 % reduziert werden.</p>\n\n\n\n<p>Aus der geringen Dichte und der Rezyklierbarkeit des Verbundes ergibt sich über die gesamte Lebensdauer des Bauteils ein deutlich verbesserter CO2-Fußabdruck. Durch die Verwendung von etablierten Technologien und Werkstoffen ist die kostengünstige Technologie unmittelbar in die industrielle Nutzung übertragbar. Eine 100 % Inline-Prüfung der haptischen und mechanischen Eigenschaften in der Fertigungszelle auf dem Stand zeigt die Serienreife des Prozesses.</p>\n\n\n\n<p>Dank der vom IKV-Spin-off OSPHIM entwickelten Digitalisierungslösungen wird der Prozess in Echtzeit intelligent eingerichtet, optimiert und überwacht. Zum Einsatz kommen dabei KI-Methoden, die ihren Ursprung in der Forschung am IKV haben.</p>\n\n\n\n<p><strong>Detect before Defect:</strong><br /><strong>Inspektionssystem zur Verfolgung der Walzenbelagsbildung bei der Flachfolienextrusion</strong></p>\n\n\n\n<p>Zur Qualitäts- und Produktivitätsverbesserung in der Flachfolienextrusion hat das IKV ein optisches Inspektionssystem entwickelt, mit dem sich die Belagsbildung auf den Kalanderwalzen im laufenden Prozess verfolgen und bewerten lässt. Die frühzeitige Detektion der Belagsbildung ist entscheidend, weil Ablagerungen auf der Walze eine Minderung der Folienqualität verursachen, die bis zum Produktionsabbruch führen kann. Insbesondere bei der Verarbeitung von Rezyklaten lässt sich die Belagsbildung aufgrund der Chargenschwankungen nicht voraussagen. Ohne Überwachung werden kritische Werte erst erkannt, wenn bereits Ausschuss produziert wird und die Produktion zur Reinigung der Walze unterbrochen werden muss.</p>\n\n\n\n<p>Das am IKV entwickelte Inspektionssystem kann einfach und kostengünstig in bestehende Anlagen integriert werden. Außerdem ist die Kopplung mit einem automatischen Walzenreinigungssystem möglich, das bei einer kritischen Belagsmenge ausgelöst wird. Grundlage des Inspektionssystems ist die optische Erfassung von Glanzveränderungen auf der Walzenoberfläche, die durch die Ablagerungen hervorgerufen werden. Über ein in die Anlage integriertes Kamerasystem wird für jede Walzenumdrehung ein Abbild der Walzenoberfläche erzeugt. Ein Bildverarbeitungsalgorithmus quantifiziert dann die Belagsbildung anhand der Grauwerte der Aufnahme, sodass die Belagsbildung über die Extrusionslänge verfolgt werden kann.</p>\n\n\n\n<p>Insbesondere kleine und mittlere Unternehmen, die häufig auf einfache und robuste Produktionsprozesse angewiesen sind, erhalten mit dem Inspektionssystem erstmals eine praxistaugliche Möglichkeit, kritischen Walzenbelag rechtzeitig zu erkennen und darauf zu reagieren, bevor Ausschuss produziert wird und es zu Anlagenstillständen kommt. Dem IKV steht mit dem System nun ein Prüfstand zur Verfügung, um die Interaktionen zwischen Kunststoffen und Walzenoberflächen mit geringem Materialeinsatz systematisch zu erforschen und daraus Handlungsempfehlungen für die industrielle Produktion abzuleiten.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img alt=\"\" class=\"wp-image-8961\" height=\"1920\" src=\"https://www.avk-tv.de/wp-content/uploads/2025/09/2_IKV_DetectbeforeDefect_68a842d23488f-edited-scaled.jpg\" style=\"width: 350px; height: auto;\" width=\"2560\" /></figure>\n\n\n\n<p><em>Das Inspektionssystem ist komplett in die Flachfolienextrusionsanlage integriert und erlaubt es, die Belagsbildung im laufenden Prozess zu verfolgen und aufzuzeichnen. (Quelle IKV)</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Jetzt die gesamte Pressemeldung lesen:</p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/08/IKVPMK2025-DT.pdf\">Pressemeldung (DE)</a></div>\n\n\n\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/08/IKVPRK2025-EN.pdf\">Pressemeldung (EN)</a></div>\n</div>"
      }
    ]
  },
  {
    "title": "Flacher. Leichter. Nachhaltiger. – SCA kündigt richtungsweisende Innovationen im Markt für Aufstelldächer an",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Flacher. Leichter. Nachhaltiger. – SCA kündigt richtungsweisende Innovationen im Markt für Aufstelldächer an"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/flacher-leichter-nachhaltiger-sca-kuendigt-richtungsweisende-innovationen-im-markt-fuer-aufstelldaecher-an/"
      }
    ],
    "link": "https://www.avk-tv.de/flacher-leichter-nachhaltiger-sca-kuendigt-richtungsweisende-innovationen-im-markt-fuer-aufstelldaecher-an/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Mon, 01 Sep 2025 11:12:40 +0000",
    "published_parsed": [
      2025,
      9,
      1,
      11,
      12,
      40,
      0,
      244,
      0
    ],
    "tags": [
      {
        "term": "Pressemeldungen Mitglieder",
        "scheme": null,
        "label": null
      },
      {
        "term": "C.F. Maier",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=9056",
    "guidislink": false,
    "summary": "C.F. Maier SCA 592 für den VW ID. Buzz &#124; Leichtbau-GFK-Dachrahmen &#124; Gewichts- und höhenoptimiert: SCA 324 und SCA 326 &#124; Grüne Naturfaser-Dachschale SCA, eine Marke der C.F. Maier-Firmengruppe, stellt ... <a class=\"read-more\" href=\"https://www.avk-tv.de/flacher-leichter-nachhaltiger-sca-kuendigt-richtungsweisende-innovationen-im-markt-fuer-aufstelldaecher-an/\" title=\"Flacher. Leichter. Nachhaltiger. – SCA kündigt richtungsweisende Innovationen im Markt für Aufstelldächer an\">Weiterlesen</a>",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "C.F. Maier SCA 592 für den VW ID. Buzz &#124; Leichtbau-GFK-Dachrahmen &#124; Gewichts- und höhenoptimiert: SCA 324 und SCA 326 &#124; Grüne Naturfaser-Dachschale SCA, eine Marke der C.F. Maier-Firmengruppe, stellt ... <a class=\"read-more\" href=\"https://www.avk-tv.de/flacher-leichter-nachhaltiger-sca-kuendigt-richtungsweisende-innovationen-im-markt-fuer-aufstelldaecher-an/\" title=\"Flacher. Leichter. Nachhaltiger. – SCA kündigt richtungsweisende Innovationen im Markt für Aufstelldächer an\">Weiterlesen</a>"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p><a href=\"https://www.c-f-maier.de/\">C.F. Maier</a></p>\n\n\n\n<p>SCA 592 für den VW ID. Buzz | Leichtbau-GFK-Dachrahmen | Gewichts- und höhenoptimiert: SCA 324 und SCA 326 | Grüne Naturfaser-Dachschale</p>\n\n\n\n<p>SCA, eine Marke der C.F. Maier-Firmengruppe, stellt vier technologische Neuerungen vor, die Gewicht, Bauhöhe und Werkstoffeinsatz von Aufstelldächern neu denken. Dazu gehören ein besonders flaches Aufstelldach für den VW ID. Buzz, ein eigens entwickelter Leichtbau-GFK-Dachrahmen, eine überarbeitete Version des SCA 324 mit reduzierter Gesamthöhe und reduziertem Gewicht für Ford Transit, Tourneo Custom und den baugleichen, neuen Transporter von VW (T8) sowie eine grüne, biobasierte und leichte Dachschale aus Naturfasern. Ziel der Innovationsoffensive ist es, SCA-Aufstelldächer in Zukunft noch alltagstauglicher, effizienter und nachhaltiger zu gestalten – im Sinne von Endkunden, Ausbaupartnern und OEMs.</p>\n\n\n\n<p><br /><strong>Flacher: Das SCA 592 für den VW ID. Buzz </strong></p>\n\n\n\n<p>Mit dem SCA 592 kündigt SCA ein neues Aufstelldach für den vollelektrischen VW ID. Buzz an. Es ermöglicht eine Gesamthöhe des Fahrzeugs von unter zwei Metern – ein wichtiger Faktor für die Nutzung von Garagen und Parkhäusern. Der werksseitige Panorama-Dachausschnitt des Fahrzeugs wird für den Dachaufbau genutzt. Dadurch bleibt die Struktur des Fahrzeugs unangetastet, und die Funktion sicherheitsrelevanter Systeme wie Airbags und Klimaanlage bleibt vollständig erhalten. Die Liegeeinheit bietet eine Breite von etwa 1,20 Metern. In der Standardvariante wird das Dach maximal 100 Kilogramm auf die Waage bringen. Optional wird es auch mit elektrischer Aufstellung verfügbar sein. Die Markteinführung ist für das zweite Quartal 2026 geplant.</p>\n\n\n\n<p><br /><strong>Leichter: GFK-Dachrahmen mit deutlichem Gewichtsvorteil </strong></p>\n\n\n\n<p>Eine weitere Neuentwicklung betrifft den Dachrahmen: Künftig setzt SCA, zunächst bei ausgewählten Modellen, auf eine Inhouse-gefertigte Rahmenkonstruktion aus unidirektionalem, glasfaserverstärktem Kunststoff (GFK), der durch die Ausrichtung der Fasern in nur eine Richtung besonders hohe mechanische Werte erreicht. Gegenüber der bisherigen Rahmenkonstruktion aus Stahl reduziert sich das Gewicht um etwa 25 Kilogramm und damit um fast 50 Prozent. Die strukturelle Stabilität bleibt dabei unberührt. Kunden profitieren durch den leichteren Rahmen von einem geringeren Fahrzeugschwerpunkt, einer höheren Gesamtzuladung sowie reduziertem Kraftstoff- bzw. Energieverbrauch und einer dementsprechend gesteigerten Reichweite.</p>\n\n\n\n<p><strong>Flacher und leichter: Neuauflagen des SCA 324 und SCA 326</strong></p>\n\n\n\n<p>Für den Ford Transit Custom, den Tourneo Custom sowie den baugleichen neuen Transporter von VW entwickelt SCA derzeit aktualisierte Varianten der bewährten Aufstelldächer SCA 324 (kurzer Radstand) und SCA 326 (langer Radstand) – die bisherigen Versionen bleiben aber weiterhin verfügbar. Beide Dächer werden künftig mit dem neuen GFK-Leichtbaurahmen ausgestattet. Die Variante für den kurzen Radstand wird zudem umfassend überarbeitet und erhält unter dem Namen SCA 524 nicht nur ein neues Design, sondern auch eine eigens entwickelte Liegeeinrichtung. Dadurch wird ermöglicht, die Fahrzeughöhe der Basisversion mit Aufstelldach auf unter zwei Metern zu senken – ohne Modifikationen am Fahrwerk oder an der Bereifung und bei unverändert nutzbarer Innenraumhöhe im geschlossenen Zustand. Die Markteinführung der neuen Varianten ist gestaffelt geplant: Das SCA 326 mit GFK-Leichtbaurahmen soll ab dem ersten Quartal 2026 erhältlich sein, das leichtere SCA 324 sowie die flachere Variante SCA 524 im zweiten Quartal 2026.</p>\n\n\n\n<p><strong>Nachhaltiger und leichter: Neue Dachschale aus Naturfasern</strong><br /><br />Im Bereich der Werkstoffe arbeitet SCA an einer neuen, biobasierten Dachschale auf Basis von Naturfasern aus europäischer Produktion. Ziel ist es, den Einsatz von Glasfasern in faserverstärkten Kunststoffen schrittweise durch nachhaltige Komponenten zu ersetzen. Die neue Technologie ermöglicht eine Gewichtsverringerung von 25 bis 30 Prozent und verbessert die CO₂-Bilanz um bis zu 40 Prozent. Zusätzlich ist das Material styrolfrei, robust, witterungsbeständig und bietet gute akustische sowie thermische Dämpfungseigenschaften. Die Einführung ist für Mitte 2026 angesetzt. Eine Anwendung auf alle gängigen SCA-Dachtypen ist langfristig vorgesehen.</p>\n\n\n\n<p><strong>Zukunft im Blick</strong></p>\n\n\n\n<p>«Mit unseren aktuellen Entwicklungen denken wir Aufstelldächer konsequent weiter – in Richtung Alltagstauglichkeit, Leichtbau und Nachhaltigkeit», sagt Ursula Lindl, Geschäftsführerin und Verantwortliche für den Vertrieb bei SCA. «Als Teil der C.F. Maier-Firmengruppe – einem der deutschen Pioniere im Bereich der Verarbeitung von Faserverbundwerkstoffen – können wir bei SCA auf umfangreiches Know-how in der Materialverarbeitung und eigene Fertigungskapazitäten an internationalen Standorten zurückgreifen. Das versetzt uns in die Lage, neue Technologien nicht nur zu entwickeln, sondern auch in Serie zu bringen.» Langfristig verfolgt SCA das Ziel, die Innovationen sukzessive in der gesamten Produktpalette zu etablieren. Die Vorteile für die Kundschaft – etwa geringeres Gewicht, erhöhte Alltagstauglichkeit und eine verbesserte CO₂-Bilanz – sind eindeutig. Gleichzeitig stärkt SCA damit seine Position als technologisch führender Anbieter für Aufstelldächer. SCA plant, alle vier Entwicklungen im Januar 2026 auf der CMT in Stuttgart erstmals der Öffentlichkeit vorzustellen. Bereits jetzt lädt das Unternehmen interessierte Kunden, Ausbaupartner, OEMs und Medienvertreter zum Dialog ein unter info@sca-mobil.de.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Jetzt die gesamte Pressemeldung lesen:</p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/09/Pressemitteilung_SCA_flacher_leichter_gruener_innovationen_im_Aufstelldachbau.pdf\">Pressemeldung (DE)</a></div>\n</div>"
      }
    ]
  },
  {
    "title": "AVK-Newsletter August 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AVK-Newsletter August 2025"
    },
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.avk-tv.de/avk-newsletter-august-2025/"
      }
    ],
    "link": "https://www.avk-tv.de/avk-newsletter-august-2025/",
    "authors": [
      {
        "name": "Katharina Wagner"
      }
    ],
    "author": "Katharina Wagner",
    "author_detail": {
      "name": "Katharina Wagner"
    },
    "published": "Wed, 13 Aug 2025 06:00:00 +0000",
    "published_parsed": [
      2025,
      8,
      13,
      6,
      0,
      0,
      2,
      225,
      0
    ],
    "tags": [
      {
        "term": "AVK Newsletter",
        "scheme": null,
        "label": null
      },
      {
        "term": "News",
        "scheme": null,
        "label": null
      },
      {
        "term": "Newsletter",
        "scheme": null,
        "label": null
      }
    ],
    "id": "https://www.avk-tv.de/?p=8812",
    "guidislink": false,
    "summary": "Highlights der aktuellen Ausgabe: VERANSTALTUNGEN MARKT NEWS AVK-PUBLIKATIONEN Lesen Sie hier den aktuellen Newsletter:",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Highlights der aktuellen Ausgabe: VERANSTALTUNGEN MARKT NEWS AVK-PUBLIKATIONEN Lesen Sie hier den aktuellen Newsletter:"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<p></p>\n\n\n\n<p>Highlights der aktuellen Ausgabe:</p>\n\n\n\n<p></p>\n\n\n\n<p><strong>VERANSTALTUNGEN</strong></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>JEC Forum DACH 2025</li>\n\n\n\n<li>SMCCREATE 2025</li>\n\n\n\n<li>WPC 2026: Call for Papers</li>\n</ul>\n\n\n\n<p><strong>MARKT</strong></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Composites Germany-Markterhebung 02/2025</li>\n</ul>\n\n\n\n<p><strong>NEWS</strong></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>EuCIA-Newsletter</li>\n</ul>\n\n\n\n<p><strong>AVK-PUBLIKATIONEN</strong></p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Composites Report 11</li>\n\n\n\n<li>Navigator</li>\n</ul>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Lesen Sie hier den aktuellen Newsletter:</p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/08/Newsletter_08-2025_DE-1.pdf\">Newsletter (DE)</a></div>\n\n\n\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.avk-tv.de/wp-content/uploads/2025/08/Newsletter_08-2025_EN-1.pdf\">Newsletter (EN)</a></div>\n</div>"
      }
    ]
  }
]