[
  {
    "published": "Thu, 18 Sep 2025 00:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      18,
      4,
      0,
      0,
      3,
      261,
      0
    ],
    "title": "Altair 2025 Enlighten Award winners, runner-ups push automotive boundaries",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Altair 2025 Enlighten Award winners, runner-ups push automotive boundaries"
    },
    "summary": "Hemp nylon-reinforced PA6 automotive exteriors, TPC acoustic elements, glass fiber stator cooling design and other innovations are recognized for their sustainability focus, holistic capabilities and lightweight designs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Hemp nylon-reinforced PA6 automotive exteriors, TPC acoustic elements, glass fiber stator cooling design and other innovations are recognized for their sustainability focus, holistic capabilities and lightweight designs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-altair-enlighten2025-winners.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Collage of Altair winning technologies for 2025.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-altair-enlighten2025-winners.jpg;maxWidth=720\" /> </a></div>\n\n<p>Altair 2025 Enlighten Award winners. Source | Altair</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/altair-engineering\" target=\"_blank\">Altair Engineering Inc.</a> (Troy, Mich., U.S.) has named the winners of the 2025 Altair Enlighten Award. Presented in association with the <a href=\"https://www.cargroup.org/\" target=\"_blank\">Center for Automotive Research</a> (CAR, Ann Arbor, Mich., U.S.), the award honors sustainability and lightweighting advancements that successfully reduce carbon footprint, mitigate water and energy consumption, and leverage material reuse and recycling efforts.</p>\n\n<p>&ldquo;In a rapidly transforming automotive landscape, organizations must continuously push the boundaries of sustainability innovation. Throughout its 13-year history, the Enlighten Award remains the premier honor showcasing the automotive industry&rsquo;s groundbreaking achievements in sustainable technology,&rdquo; says&nbsp;Sam Mahalingam, CTO of&nbsp;Altair. &ldquo;We are proud to once again celebrate the organizations driving a more sustainable future.&rdquo;</p>\n\n<p>The Enlighten Award winners were&nbsp;announced in an awards ceremony at the CAR Management Briefing Seminars in Detroit, Michigan, on Sept. 16, 2025. What follows is the&nbsp;complete list of all winning organizations, runners-up&nbsp;and honorable mentions.</p>\n\n<blockquote>\n<p>See Altair&rsquo;s <a href=\"https://www.compositesworld.com/news/altair-announces-12th-annual-enlighten-award-winners\" target=\"_blank\">2024 Enlighten Award winners here</a>.</p>\n</blockquote>\n\n<h3><strong>Future of Lightweighting</strong></h3>\n\n<p><strong>Winner:</strong> <a href=\"https://www.vortex-cae.com/\" target=\"_blank\">Vortex CAE &ndash;&nbsp;Enlighten</a> (Leicestershire, U.K.):&nbsp;<em>A Novel Holistic Topometry Based Optimizer for the Design of Lightweight Crash Structures</em></p>\n\n<p>Vortex CAE&rsquo;s new solver offers direct crash and impact optimizations using full fidelity models. The outputs produce holistic and pre-validated CAE solutions. Additionally, the company developed a computationally efficient 3D generative-design methodology to identify and size fundamental structural features early on. A generative design case study cut 77% from the body-in-white (BIW) mass while meeting or exceeding structural performance in 13 primary crash load cases. Assuming a 50% mass-retention loss, Vortex CAE<strong>&nbsp;</strong>estimate that $500 million in raw material costs for this vehicle could have been saved, along with 1.35 million tons of C0<sub>2</sub> from manufacturing alone.<strong> </strong></p>\n\n<p><em>Editor&rsquo;s note: This</em>&nbsp;<em>technology works with composite materials, however the wing innovation description above highlights a steel structure.</em></p>\n\n<p><strong>Runner-Up:</strong> <a href=\"https://www.magna.com/\" target=\"_blank\">Magna International</a><em> </em>(Aurora, Canada):<em>&nbsp;Hemp-PA6 Composite Roof Rack Inner </em></p>\n\n<p>Magna successfully demonstrated the use of hemp nylon (PA6) in automotive exteriors, enhancing sustainability. The sustainable material replaces talc in traditional nylon resin and was developed in collaboration with BASF and Heartland. The lightweight, renewable material absorbs CO<sub>₂</sub> during growth, supports decarbonization&nbsp;and delivers performance and processing equivalent to the original resin, marking a major advancement in the use of natural fibers for automotive applications.</p>\n\n<h3>Enabling Technology</h3>\n\n<p><strong>Winner:&nbsp;</strong><a href=\"https://compositeedge.de/en/home-en/\" target=\"_blank\">CompositeEdge GmbH</a>&nbsp;(Braunschweig, Germany) and <a href=\"https://www.atamute.com/\" target=\"_blank\">ATA Mute B.V.</a> (Eindhoven, Netherlands): <em>Adaptive Ultra-Thin Noise Solution</em></p>\n\n<p>CompositeEdge GmbH and ATA Mute B.V. have developed an acoustic element under 1 millimeter thick that offers up to 97% sound absorption, particularly at low frequencies where conventional materials are less effective.&nbsp;It is waterproof, fire-resistant&nbsp;and fully recyclable, produced without adhesives from natural, carbon&nbsp;or glass fibers combined with thermoplastics. The material maintains its performance in humid and high-temperature environments and is suitable for a wide range of applications such as cars, heat pumps&nbsp;and interior facades.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong><a href=\"https://lucidmotors.com/\" target=\"_blank\">Lucid Motors</a> (Newark, Calif., U.S.): Modal Transient Analysis-Based Durability CAE Workflow</p>\n\n<p>Lucid Motors, in collaboration with the Altair&nbsp;OptiStruct&nbsp;development team, developed and implemented a seamless durability CAE workflow that progressed from MBD-based vehicle dynamics simulation to FEM-based strength, stiffness and fatigue analysis, and ultimately to structural optimization. The workflow could be applied to a wide range of components, including the BIW, subframes, battery pack, suspension components, powertrain&nbsp;and closures, using a global-local analysis approach for detailed local assessments with refined meshing.</p>\n\n<p><strong>Honorable Mention: </strong><a href=\"https://group.mercedes-benz.com/company/business-units/mercedes-benz-cars/\" target=\"_blank\">Mercedes-Benz AG</a>&nbsp;(Stuttgart, Germany) and <a href=\"https://www.mbrdi.co.in/\" target=\"_blank\">Mercedes-Benze Research and Development India Private Ltd.</a>&nbsp;(Karnataka):&nbsp;<em>An Automated Sustainable Process for Generating Superelements</em></p>\n\n<p>This fully automated process streamlines setup to just 15 minutes for complex parts, eliminates user errors&nbsp;and requires no manual intervention. This innovation enables agile, iterative optimizations with fast design feedback, while cutting computational demands,&nbsp;achieving more than&nbsp;90% runtime reduction, lower hardware utilization&nbsp;and more efficient resource use.</p>\n\n<h3><strong>Module Lightweighting</strong></h3>\n\n<p><strong>Winner:&nbsp;</strong><a href=\"https://www.compositesworld.com/suppliers/solvay-composite-materials\" target=\"_blank\">Syensqo</a> (Brussels, Belgium) and <a href=\"https://global.geely.com/\" target=\"_blank\">Geely Global</a> (Hangzhou, China):&nbsp;<em>Amodel PPA Stator Cooling Systems&nbsp;</em></p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Syensqo and Geely technology and blurb.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-altair-2025-syensqo-geely.jpg;maxWidth=385\" /></div>\n</div>\n\n<p>Geely improved e-motor efficiency with an innovative stator cooling design using Syensqo&rsquo;s&nbsp;short glass fiber Amodel&nbsp;PPA, achieving 47% weight and 36% cost savings versus metal. The metal-to-plastic conversion reduces weight, enables part integration&nbsp;and streamlines high-volume assembly through injection molding, laser welding&nbsp;and snap fits. Highly resistant to automotive fluids, Amodel&nbsp;PPA retains nearly 70% burst pressure resistance after 2,000 hours of aging at 150℃ ATF, ensuring safety&nbsp;and reliability. This design achieves precise lubrication with lower oil pump power consumption, effectively reducing the risk of overheating spots.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong><a href=\"https://www.aam.com/\" target=\"_blank\">American Axle &amp; Manufacturing</a> (AAM, Detroit, Mich., U.S.):&nbsp;<em>Modular Lightweight Axle Housing Innovation</em></p>\n\n<p>AAM&rsquo;s modular lightweight axle housing innovation replaced two-axle configurations with a single&nbsp;modular design, cutting complexity and cost. Delivering up to 10% mass reduction, around 1.3 million pounds annually across 145,000 units, the design was optimized using Altair&rsquo;s Multi-Model Optimization to balance weight and strength. Fully compatible with existing assembly lines and preserving back-serviceability, the solution reduces fuel consumption and emissions through material efficiency and streamlined logistics.</p>\n\n<h3>Sustainable Computing</h3>\n\n<p><strong>Winner:&nbsp;</strong>Lucid Motors:&nbsp;<em>Design-Driven Structural Assessment To Enable Accelerated Product Development</em></p>\n\n<p>Lucid Motors&rsquo; Design-Driven Structural Assessment approach accelerates product development using Altair SimSolid&rsquo;s meshless solver. Engineers can run rapid design iterations directly within their CAD environment, eliminating the need for complex meshing or switching tools. The highly customizable workflow streamlines setup and empowers teams to optimize designs with greater speed and ease.</p>\n\n<p><strong>Runner-Up:</strong><em> </em>Mercedes-Benz AG &amp; Mercedes-Benz Research and Development India Private Ltd.: <em>An Automated Sustainable Process for Generating Superelements&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </em></p>\n\n<p>This fully automated process streamlines setup to just 15 minutes for complex parts, eliminates user errors and requires no manual intervention. The innovation enables agile, iterative optimizations with fast design feedback, while cutting computational demands &mdash; achieving more than&nbsp;90% runtime reduction, lower hardware utilization&nbsp;and more efficient resource use.</p>\n\n<h3><strong>Sustainable Process</strong></h3>\n\n<p><strong>Winner:</strong> <a href=\"https://www.marelli.com/en.html\" target=\"_blank\">Marelli</a> (Lombardy, Italy):&nbsp;<em>Adhesive Wastewater Recovery Solution</em></p>\n\n<p>Marelli implemented a cleaning process for adhesive manufacturing equipment, such as robots and spray guns, used in bonding topcoat skins to substrates for cut, sew&nbsp;and wrap parts. By using a three-part chemical agent, the process separates adhesive waste from the cleaning water, enabling recovery and reuse of approximately 85% of adhesive wastewater. This process reduced the plant&rsquo;s water consumption by 8,160 kilograms annually, with the recovered non-potable water able to be reused within manufacturing operations.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong><a href=\"https://www.dicastal.com/en/\" target=\"_blank\">CITIC Dicastal Co. Ltd.</a> (Qin Huangdao City, He Bei Province, China):&nbsp;<em>Key Technology for Integrated Forming of Large Aluminum Alloy Structural Components</em></p>\n\n<p>This innovation consolidates 98 parts into a single component, reducing weight by 30% and lowering both cycle time and cost. It marks the first application of a non-heat-treated Al-Mg alloy in commercial vehicle structures. A closed-loop thermal balance system ensures consistent forming quality, while rapid process simulation and C123 variable cross-section design optimize material use and accelerate the design-to-validation cycle.</p>\n\n<h3>Sustainable Product</h3>\n\n<p><strong>Winner:&nbsp;</strong><a href=\"https://www.nio.com/\" target=\"_blank\">Nio Inc.</a>&nbsp;(Shanghai, China) and <a href=\"https://www.akzonobel.com/en\" target=\"_blank\">AkzoNobel</a>&nbsp;(Amsterdam, Netherlands):&nbsp;<em>Bottom Plate&nbsp;Coating for Battery Pack to Improve Lifespan During Battery Swap for Electrical Vehicles</em></p>\n\n<p>Nio&nbsp;and AkzoNobel extended the lifespan of the bottom plate coating from 5 to 15 years while reducing coating thickness by 90%, cutting vehicle weight by 2.2 kilograms&nbsp;and developing powder coating technology for electric vehicles (EVs). The innovation replaced non-recyclable materials with recyclable alternatives, eliminated volatile organic compound (VOC) emissions,&nbsp;and improved coating efficiency by 55%,&nbsp;delivering significant sustainability benefits. Established through a unique carmaker Tier 5 partnership, this scalable solution enhanced cost and efficiency across Tiers 1 to 3 and has been mass-produced since November 2024, applied widely on Nio, Onvo and Firefly EV models.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong><a href=\"https://www.cheryinternational.com/\" target=\"_blank\">Chery Automobile Co. Ltd.</a>&nbsp;(Wuhu, China):&nbsp;<em>Answering Earth with Low-Carbon Recycled Aluminum</em></p>\n\n<p>Chery Automobile&rsquo;s low-carbon aluminum initiative uses 100% recycled aluminum in a closed-loop system with more than 99% impurity removal and employs heat-treatment-free integrated die-casting, cutting manufacturing energy by up to 95%. Achieving over 80% reduction in raw-material carbon emissions, it meets global low-carbon standards while maintaining strength and safety, and fosters collaborative ecosystems for scalable green manufacturing.</p>\n\n<h3>Responsible AI</h3>\n\n<p><strong>Winner:</strong> Lucid Motors:<em> Predicting Crash Modes with Altair&nbsp;PhysicsAI</em></p>\n\n<p>Lucid Motors transformed crash CAE by applying AI-driven insights to predict complex, non-linear deformation behaviors under realistic off-axis and oblique impact scenarios. By integrating Altair PhysicsAI with LS-DYNA, the company trained surrogate models to classify crash modes, such as axial crush and bending, well before physical testing. This approach reduced design iterations, minimizing prototype reliance&nbsp;and accelerating delivery of lightweight, crash-robust structures with high safety confidence. This scalable methodology was applied across multiple crash-critical components and contributed to sustainability by minimizing material use, reducing test waste and supporting corporate decarbonization goals.</p>\n\n<p><strong>Runner-Up:&nbsp;</strong>Lucid Motors:&nbsp;<em>Agentic AI for Engineering Automation</em></p>\n\n<p>Lucid Motors automated CAD data retrieval, custom script execution, analysis&nbsp;and reporting by implementing AI-driven natural language support, which eliminated the need to learn each individual tool. By simply stating broad concepts, the AI handled intricate details and seamlessly chained multiple applications, allowing data to flow automatically through the workflow pipeline. This approach enabled instant execution of ideas without waiting for manual intervention and avoided complex API use by automating interactions directly through the GUI.</p>\n\n<div class=\"article_sidebar\">\n<p>Partners for the 2025 Enlighten Award include Auto Bild Japan, Autocar Professional, Automobil Industrie, Auto Messe Web, Auto Messe Web Worldwide, CAR, Google Cloud, Korean Society of Automotive Engineers (KSAE), SAE Automotive Engineering and Tech Briefs.</p>\n\n<p>For more information about the Enlighten Award, visit <a href=\"http://www.altair.com/enlighten-award\" target=\"_blank\">www.altair.com/enlighten-award</a>.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/altair-2025-enlighten-award-winners-runner-ups-push-automotive-boundaries"
      }
    ],
    "link": "https://www.compositesworld.com/news/altair-2025-enlighten-award-winners-runner-ups-push-automotive-boundaries"
  },
  {
    "published": "Wed, 17 Sep 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      16,
      30,
      0,
      2,
      260,
      0
    ],
    "title": "Guanglian Aviation achieves milestone in carbon fiber circular chains development",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Guanglian Aviation achieves milestone in carbon fiber circular chains development"
    },
    "summary": "Following six years of R&amp;D, Guanglian Aviation has introduced circular chains made from carbon fiber and Kevlar that weigh 4-5X less than metal chains, offer 15-year saltwater corrosion resistance, and are poised for large-scale applications in marine engineering, mining&nbsp;and defense.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Following six years of R&amp;D, Guanglian Aviation has introduced circular chains made from carbon fiber and Kevlar that weigh 4-5X less than metal chains, offer 15-year saltwater corrosion resistance, and are poised for large-scale applications in marine engineering, mining&nbsp;and defense."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Carbon fiber circular chains.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-guanglian-carbon-fiber-chains.png;maxWidth=720\" /> </div>\n\n<p>Carbon fiber chains. Source (All Images) | Guanglian Aviation Industry Co. Ltd.</p>\n</div>\n\n<p>Since 2019,&nbsp;<a href=\"https://www.glavi.cn/%5d\" target=\"_blank\">Guanglian Aviation Industry Co. Ltd.</a>&rsquo;s<strong> </strong>scientific and technological innovation center for composite material forming, based in Heilongjiang Province, China, has researched and developed carbon fiber circular chains. Six years of continuous effort has led to the company&rsquo;s recent milestones.</p>\n\n<p>Circular chains made of carbon fiber are particularly suitable for (1) marine engineering (floating platform mooring chains), (2) shipbuilding (ultra-long anchor chains), (3) mineral mining (compact chains for scraper conveyors) and (4) deep sea buoy anchor chains or FPSO tanker mooring chains.</p>\n\n<p>Traditional industrial circular chains mainly use metal alloy steel materials, which have three disadvantages. First, its&nbsp;specific strength is relatively low compared to carbon fiber materials. This means that as the length of the chain increases, its own weight (self weight) will rapidly increase. For any circular chain of wire diameter specification, when the chain length exceeds the limit (usually 2,200 meters), the tension (i.e., the self weight of the entire chain) borne by the top link will exceed the break load of the link itself, causing the chain to break due to its own weight.</p>\n\n<p>A second disadvantage of the metal is its poor weather resistance and salt corrosion resistance. After applying inert anti-corrosion paint on the outer surface of the circular chain, service life can reach 6-8 years. If anti-corrosion treatment is not carried out, the service life may only be 2-4 years. In general, metal circular chains are not easily used in marine engineering or humid mining industries.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-guanglian-carbon-fiber-chains-testing.jpg\" target=\"_blank\"><img alt=\"Chains testing.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-guanglian-carbon-fiber-chains-testing.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>Also, when high loads and high-frequency stresses are applied to the circular chain, metal creep is easily generated, causing deformation and instability failure. The lightweight, high-strength, inert anti-corrosion, high damage impedance, high fatigue resistance&nbsp;and bullet damage tolerance&nbsp;properties of carbon fiber can compensate for the shortcomings of these&nbsp;metal materials.</p>\n\n<p>Guanglian Aviation&rsquo;s&nbsp;innovation comprises carbon fiber and Kevlar, which are cured under high temperature and high pressure. These circular chains have lightweight, high-strength and inert anti-corrosion properties. The composite version can reach five times the length of metal chains when reaching the same weight; alternatively, the weight of the same length can be reduced by four to five times. The application prospects of ship anchor chains are broad.</p>\n\n<p>Additional challenges that the company has addressed include:</p>\n\n<ul>\n\t<li>Difficulties in forming complementary interference rings</li>\n\t<li>Tensile strength exceeds that of metals of the same size</li>\n\t<li>Mechanized and automated mass production line</li>\n\t<li>Cost control of fiber-reinforced materials.</li>\n</ul>\n\n<p>The company&rsquo;s carbon fiber circular chain has passed testing by a third-party authoritative organization, and has the same wire diameter compared to&nbsp;equal volume metal ring chains with international standards (ISO 20438). According to the comparative test report, it was found that the fracture load of these composite circular chains exceeded 1.75 times that of metals; they can resist seawater salt corrosion for 15 years; and they have a high-frequency fatigue load resistance 60,000 times that of metals (400 cycles/minute).</p>\n\n<p>After successively overcoming key technologies related to this product, Guanglian Aviation Industry Co.&nbsp;Ltd. has initiated its industrial application while simultaneously developing mechanized production lines to ensure product consistency and increase production capacity. Currently,&nbsp;planned areas for industrial application include the following aspects:</p>\n\n<p><strong>Ultra-long anchor chains exceeding 2,000 meters. </strong>The anchor chains of the U.S. Nimitz-class nuclear-powered aircraft carriers are more than&nbsp;1,500 meters long, while those of other aircraft carriers are approximately 470 meters. The length of anchor chains enhances the mooring area and reduces mooring time for vessels, thereby decreasing the energy consumption of ship dynamic positioning systems (DPS).</p>\n\n<p><strong>Providing mooring chains for floating semi-submersible platforms.</strong> Current solutions for floating drilling rigs, floating wind power,&nbsp;and deep-sea aquaculture often adopt a steel anchor chain plus&nbsp;polyester rope configuration. There is a need to reduce mooring costs.</p>\n\n<p>Due to the low specific strength of metal, when the length of the scraper conveyor exceeds 380 meters, the effective transportation capacity drops below 50% as a result of the compact chain&rsquo;s self-weight. Thanks to its high specific strength, carbon fiber compact chains can increase their length by 4.5 times under the same total weight, while offering corrosion resistance and fatigue resistance. Alternatively, at the same length, the self-weight can be reduced by three-quarters, significantly increasing the effective payload.</p>\n\n<p>Moreover, carbon fiber&rsquo;s&nbsp;curing temperature (180&deg;C) is&nbsp;far lower than that of metal (1200&deg;C). This allows chips to be embedded during the carbon fiber forming process to provide pre-failure warnings for the compact chain.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/guanglian-aviation-achieves-milestone-in-carbon-fiber-circular-chains-development"
      }
    ],
    "link": "https://www.compositesworld.com/news/guanglian-aviation-achieves-milestone-in-carbon-fiber-circular-chains-development"
  },
  {
    "published": "Wed, 17 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      16,
      0,
      0,
      2,
      260,
      0
    ],
    "title": "Altair, NIAR sign MOU to build aerospace innovation pace",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Altair, NIAR sign MOU to build aerospace innovation pace"
    },
    "summary": "Collaboration will expand digital twin adoption, empower aerospace startups and speed up product development and certification processes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaboration will expand digital twin adoption, empower aerospace startups and speed up product development and certification processes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-niar-altair.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-niar-altair.jpg;maxWidth=385\" /></a></div>\n\n<p>Wichita State University. Source | WSU NIAR</p>\n</div>\n\n<p>Computational intelligence company <a href=\"https://www.compositesworld.com/suppliers/altair-engineering\" target=\"_blank\">Altair</a> (Troy, Mich., U.S.) and aerospace research institution&nbsp;<a href=\"https://www.compositesworld.com/suppliers/national-institute-for-aviation-research\" target=\"_blank\">National Institute for Aviation Research</a> (NIAR) at Wichita State University (WSU, Kan., U.S.) have signed a memorandum of understanding (MOU)&nbsp;to advance innovation across the aerospace and defense industries.</p>\n\n<p>According to&nbsp;Pietro Cervellera, senior vice president of aerospace and defense at Altair, the partnership will enable new opportunities for bringing &ldquo;cutting-edge&nbsp;technology to the industry. By combining our expertise, we&rsquo;re helping companies and startups innovate faster, reduce costs&nbsp;and bring products to market more sustainably.&rdquo; The partnership focuses on three main areas:</p>\n\n<p><strong>Bringing digital twin technology to industry.</strong>&nbsp;Combining NIAR&rsquo;s certification by analysis (CBA) methodologies with Altair&rsquo;s simulation and data analytics tools, companies can design, test&nbsp;and optimize aircraft, drones and advanced air mobility vehicles faster and more efficiently, reducing the need for costly physical testing.</p>\n\n<p><strong>Supporting startups.</strong>&nbsp;Aerospace and defense startups working with NIAR and WSU will gain privileged access to Altair&rsquo;s platforms and training to accelerate their product development, testing, certification&nbsp;and production processes.</p>\n\n<p><strong>Exploring new applications.</strong>&nbsp;The collaboration will explore how digital twins and Altair technology can support broader applications, including maintenance, additive manufacturing, robotics&nbsp;and defense systems.</p>\n\n<p>&ldquo;This agreement with Altair provides our students, researchers and clients with access to tools and expertise that will help accelerate development to support the next generation of aerospace technology and innovation,&rdquo; says John Tomblin, WSU executive vice president for research and industry and defense programs and NIAR executive director.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/altair-niar-sign-mou-to-build-aerospace-innovation-pace"
      }
    ],
    "link": "https://www.compositesworld.com/news/altair-niar-sign-mou-to-build-aerospace-innovation-pace"
  },
  {
    "published": "Wed, 17 Sep 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      15,
      0,
      0,
      2,
      260,
      0
    ],
    "title": "Natural fibers power Cupra’s vision for sustainable mobility",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Natural fibers power Cupra’s vision for sustainable mobility"
    },
    "summary": "Cupra&rsquo;s latest concept vehicle, Tindaya, demonstrates Bcomp&nbsp;ampliTex through&nbsp;both visible interior and semi-structural parts.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Cupra&rsquo;s latest concept vehicle, Tindaya, demonstrates Bcomp&nbsp;ampliTex through&nbsp;both visible interior and semi-structural parts."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bcomp-cupra-tindaya1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Cupra Tindaya interior and exterior shots.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bcomp-cupra-tindaya1.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Cupra</p>\n</div>\n\n<p>Swiss cleantech company <a href=\"https://www.compositesworld.com/suppliers/bcomp\" target=\"_blank\">Bcomp</a>&nbsp;(Fribourg), through its 3-year&nbsp;collaboration with e-hybrid and electric car brand <a href=\"https://www.cupraofficial.com/\" target=\"_blank\">Cupra</a>&nbsp;(Martorell, Spain), demonstrates the performance, circularity and increasing adoption of flax fiber concepts into mass production models&nbsp;via the Tindaya concept car.&nbsp;</p>\n\n<p>Both interior and exterior parts and structures feature ampliTex Twill 2/2, from Cupra&rsquo;s characteristic Cup bucket seats to the car&rsquo;s exterior bumper. Working&nbsp;closely with Cupra&rsquo;s Colour, Materials, Finish (CMF) and interior and exterior designers, Bcomp&rsquo;s team developed a custom copper color finish, echoing Cupra&rsquo;s&nbsp;signature aesthetic&nbsp;while its raw form connects with the materials and textures of the brand&rsquo;s visual identity.</p>\n\n<p>The adoption of this bio-based material for visible interior and semi-structural parts is expected to accelerate due to the decarbonization plans of OEMs and governing bodies&rsquo; regulatory pressure.&nbsp;</p>\n\n<p>&ldquo;For Cupra, sustainability goes beyond simply swapping internal combustion engines for battery-powered engines,&rdquo; says&nbsp;Nicolas Samson, sales manager at Bcomp.&nbsp;&ldquo;Tindaya is a proof that responsible design choices don&rsquo;t have to compromise on performance or aesthetics. With collaborators like Cupra, we&rsquo;re bringing these sustainable materials to a wider market.&rdquo;</p>\n\n<p><em>For related content, read, &ldquo;<a href=\"https://www.compositesworld.com/news/bcomp-amplitex-makes-appearance-in-cupra-ev-cup-bucket-seats\">Bcomp ampliTex makes appearance in Cupra EV Cup Bucket seats</a>&rdquo; and &ldquo;<a href=\"https://www.compositesworld.com/news/bcomp-natural-fiber-composites-to-be-used-in-future-bmw-group-production-cars\">Bcomp natural fiber composites to be used in future BMW Group production cars</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/natural-fibers-power-cupras-vision-for-sustainable-mobility"
      }
    ],
    "link": "https://www.compositesworld.com/news/natural-fibers-power-cupras-vision-for-sustainable-mobility"
  },
  {
    "published": "Wed, 17 Sep 2025 10:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      14,
      30,
      0,
      2,
      260,
      0
    ],
    "title": "Brembo SGL Carbon Ceramic Brakes expands disc production capacity by 50%",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Brembo SGL Carbon Ceramic Brakes expands disc production capacity by 50%"
    },
    "summary": "The 50/50 joint venture adds a combined 12,500 square meters of space at Italy&nbsp;and Germany sites, future-proofing carbon-ceramic disc production for premium cars, commercial vehicles.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The 50/50 joint venture adds a combined 12,500 square meters of space at Italy&nbsp;and Germany sites, future-proofing carbon-ceramic disc production for premium cars, commercial vehicles."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bsccb-brake-production-expansion.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-bsccb-brake-production-expansion.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;Brembo SGL Carbon Ceramic Brakes (BSCCB)</p>\n</div>\n\n<p>After months of intensive planning and implementation, <a href=\"https://www.carbonceramicbrakes.com/\" target=\"_blank\">Brembo SGL Carbon Ceramic Brakes</a> (BSCCB) &mdash; a 50/50 joint venture between <a href=\"https://www.brembo.com/en\" target=\"_blank\">Brembo N.V.</a> and <a href=\"https://www.compositesworld.com/suppliers/sgl-carbon-se\" target=\"_blank\">SGL Carbon SE</a>&nbsp;&mdash;&nbsp; has successfully completed the expansion of its production capacities in Stezzano (Bergamo), Italy and Meitingen, Germany. The investments made have increased production capacity by around 50%. This extensive expansion enables BSCCB to meet the growing demand and increasing requirements of its automotive customers, particularly in the premium and luxury segments, where high brake performance is required.</p>\n\n<p>At the SGL Carbon site in Meitingen, two new production halls with a total area of around 8,500 square meters&nbsp;were constructed in just 14 months. At the Stezzano (Bergamo) site, production areas in the existing buildings were expanded by around 4,000 square meters. At both sites, production facilities with numerous modern systems were installed in a short period of time, enabling high-performance and efficient production. The entire process chain, from forming and machining to assembly, was expanded and optimized.</p>\n\n<p>The investments made will contribute to increasing capacity and improving process efficiency and quality. The degree of automation has been further increased, with conscious attention paid to maintaining necessary flexibility and experience in the manufacturing process.</p>\n\n<p>&ldquo;We are setting a decisive course for the future,&rdquo; explain&nbsp;Florian Hofner and Nicola Frambrosi, managing directors of BSCCB. &ldquo;We are making our production future-proof, thereby ensuring that we can reliably meet the demands and needs of our customers.&rdquo;</p>\n\n<p>Over the years, BSCCB has steadily increased its supply of carbon-ceramic brake discs, becoming a key partner for premium and luxury automotive manufacturers, where high brake performance is essential. Carbon-ceramic technology is a distinctive feature of high-performance vehicles, offering a combination of high&nbsp;braking performance and an exclusive design. Carbon-ceramic brake discs are valued for their lightweight construction, high heat resistance and long lifespan.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/brembo-sgl-carbon-ceramic-brakes-expands-disc-production-capacity-by-50"
      }
    ],
    "link": "https://www.compositesworld.com/news/brembo-sgl-carbon-ceramic-brakes-expands-disc-production-capacity-by-50"
  },
  {
    "published": "Wed, 17 Sep 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      17,
      14,
      0,
      0,
      2,
      260,
      0
    ],
    "title": "Building Composites announces operational expansion to handle large-scale HyperWall FRP panel projects",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Building Composites announces operational expansion to handle large-scale HyperWall FRP panel projects"
    },
    "summary": "Investment adds critical infrastructure and a more spacious layout to support the company&rsquo;s long-term goals in sustainable building construction.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Investment adds critical infrastructure and a more spacious layout to support the company&rsquo;s long-term goals in sustainable building construction."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"Building Composites HQ front.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-buildingcomposites.jpeg;maxWidth=385\" /></div>\n\n<p>Source | Building Composites</p>\n</div>\n\n<p><a href=\"https://www.building-composites.com/\" target=\"_blank\">Building Composites LLC</a>&nbsp;(Dayton, Ohio, U.S.), a company that innovates structural&nbsp;composite exterior building skin systems, has announced an expansion of its operation that includes additional storage capacity and new office space to support the company&rsquo;s growth and commitment to quickly scaling operations.</p>\n\n<p>The company&rsquo;s existing manufacturing facility now features a new corporate office design and layout detailed with a spacious associate breakroom, locker room and bathrooms. It provides 5,000 square feet of space to accommodate the growing team and enhance operational efficiency.</p>\n\n<p>In addition, the company has leased a 4-acre lot situated near the main facility in Moraine, Ohio, that will provide storage and a much-needed staging area to support Building Composites&rsquo;&nbsp;aggressive production and shipping schedules.</p>\n\n<p>&ldquo;This expansion is a direct reflection of the momentum we&rsquo;ve built over the past year,&rdquo; says&nbsp;Andy Loff, CEO of Building Composites. &ldquo;We&rsquo;re thrilled with the new office space. It&rsquo;s comfortable and gives us the room we need to collaborate as well as quiet areas for more focused work.&rdquo;</p>\n\n<p>The company&rsquo;s flagship product, <a href=\"https://www.building-composites.com/discover-hyperwall?utm_source=pr_trade&amp;utm_medium=press-release&amp;utm_campaign=new_office\" target=\"_blank\">HyperWall</a>, is a sustainable, fiber-reinforced polymer (FRP) panel system&nbsp;that incorporates proven material, design and manufacturing technologies to simplify building construction while enabling greater versatility and lower overall project costs. HITT Contracting, a national commercial construction firm, has partnered with the company to construct its new headquarters in Falls Church, Virgina. The structure will feature 344 HyperWall panels.</p>\n\n<p>&ldquo;We deal with very large-scale projects that require significant space to build the panels and ready them for shipment,&rdquo; explains&nbsp;Loff. &ldquo;The panels can be as large as 40 feet by 10 feet. So the new lot gives us the footprint we need to ensure we can fulfill orders on schedule as we continue to grow. We&rsquo;re excited to see where this expansion takes us.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/building-composites-announces-operational-expansion-to-handle-large-scale-hyperwall-frp-panel-projects"
      }
    ],
    "link": "https://www.compositesworld.com/news/building-composites-announces-operational-expansion-to-handle-large-scale-hyperwall-frp-panel-projects"
  },
  {
    "published": "Tue, 16 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      16,
      16,
      0,
      0,
      1,
      259,
      0
    ],
    "title": "Stack3D invests in, integrates CEAD Hybrid Flexbot",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Stack3D invests in, integrates CEAD Hybrid Flexbot"
    },
    "summary": "Stack3D pairs the LFAM FlexBot with its own&nbsp;R&amp;D and materials processing capabilities to offer&nbsp;rapid, end-to-end production&nbsp;from prototyping to low-volume manufacturing.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Stack3D pairs the LFAM FlexBot with its own&nbsp;R&amp;D and materials processing capabilities to offer&nbsp;rapid, end-to-end production&nbsp;from prototyping to low-volume manufacturing."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-cead-flexbot-stack3d-2.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CEAD Flexbot at Stack3D with printed part.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-cead-flexbot-stack3d-2.jpg;maxWidth=720\" /> </a></div>\n\n<p>CEAD Flexbot at Stack3D with printed part. Source (All Images) | CEAD Inc.</p>\n</div>\n\n<p><a href=\"https://stack3ddm.com/\" target=\"_blank\">Stack3D</a>&nbsp;(River Falls, Wis., U.S.) a vertically integrated service for advanced 3D printing solutions, has partnered with <a href=\"https://www.compositesworld.com/suppliers/cead-bv\" target=\"_blank\">CEAD Inc.</a> (Detroit, Mich., U.S. and Delft, Netherlands), a global large-format additive manufacturer&nbsp;(LFAM), to integrate a CEAD Hybrid Flexbot system into its industrial facility in River Falls. This strategic investment marks a significant step forward in Stack3D&rsquo;s mission to deliver scalable, high-strength, large-scale parts and tooling for demanding industries such as aerospace, building and&nbsp;construction, furniture, signage and thermoforming.</p>\n\n<p>With the integration of CEAD&rsquo;s Flexbot, Stack3D expands its production capabilities with LFAM technology, complementing its existing selective laser sintering (SLS) and fused deposition modeling (FDM) technologies&nbsp;under one roof. This setup enables&nbsp;Stack3D to deliver custom, end-use parts in days instead of months. Backed by 60-plus&nbsp;years of combined AM experience, Stack3D combines agile production with material science and expertise.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-cead-flexbot-stack3d-1.jpg\" target=\"_blank\"><img alt=\"CEAD hybrid FlexBot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-cead-flexbot-stack3d-1.jpg;maxWidth=385\" /></a></div>\n\n<p>CEAD&nbsp;Hybrid FlexBot system.</p>\n</div>\n\n<p>&ldquo;Stack3D intends to become a leader in driving adoption of LFAM for custom, digital manufacturing solutions,&rdquo; says Brandon Cernohous, founder of Stack3D. &ldquo;Our collaboration with CEAD is central to our success. This is especially true when combined with our ability to develop custom material solutions in-house to meet our customers&rsquo; specific application needs.&rdquo;</p>\n\n<p>A key element of this partnership is the establishment of a regional LFAM innovation hub at Stack3D. With the installation of the Flexbot, and support from partners like Interfacial&nbsp;(read &ldquo;<a href=\"https://www.compositesworld.com/news/interfacial-cead-launch-strategic-lfam-partnership\">Interfacial, CEAD launch strategic LFAM partnership</a>&rdquo;), the hub offers a platform for material testing, print trials and application development.</p>\n\n<p>CEAD&rsquo;s large scale robotic-based Flexbot system enables automated, multi-axis 3D printing and CNC machining with industrial-grade materials. Known for its performance and modular design, the system offers flexible production options and allows manufacturers to solve manufacturing issues or limitations of traditional methods. CEAD is recognized not only for its technology, but also for its strong customer support and&nbsp;success programs. With a large installed base&nbsp;of LFAM systems in the U.S. and dedicated support teams across U.S. and Canada, the company takes a hands-on approach in supporting and scaling its customers&rsquo; success through every phase to deliver long-term value.</p>\n\n<p>The Flexbot was installed at Stack3D in June 2025, followed by on-site training in July. Within 2 weeks, the system was fully operational with customer projects currently lining up and being executed by Stack3D&rsquo;s team. Looking ahead, the teams are planning further collaborative efforts, such as joint events.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/stack3d-invests-in-integrates-cead-hybrid-flexbot"
      }
    ],
    "link": "https://www.compositesworld.com/news/stack3d-invests-in-integrates-cead-hybrid-flexbot"
  },
  {
    "published": "Mon, 15 Sep 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      15,
      18,
      0,
      0,
      0,
      258,
      0
    ],
    "title": "AZL composite rotor sleeves project is completed, presents findings at upcoming web meeting",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AZL composite rotor sleeves project is completed, presents findings at upcoming web meeting"
    },
    "summary": "OEMs and E-drive developers can participate in the free Sept. 25 meeting providing a strategic overview of the collaborative research report and ready-to-engage partner network for implementation projects.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "OEMs and E-drive developers can participate in the free Sept. 25 meeting providing a strategic overview of the collaborative research report and ready-to-engage partner network for implementation projects."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-rotor-sleeves-hightemps.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-rotor-sleeves-hightemps.png;maxWidth=720\" /> </a></div>\n\n<p>The effect of high temperature on rotor sleeves. Source (All Images) | AZL Aachen GmbH&nbsp;</p>\n</div>\n\n<p>Following 9 months of collaborative research, <a href=\"#Consortium members\" target=\"_self\">a consortium of 15 companies</a> has completed a comprehensive analysis and benchmarking project on composite-based rotor sleeves led by <a href=\"https://www.compositesworld.com/suppliers/azl-aachen-gmbh\" target=\"_blank\">AZL Aachen GmbH</a> (Germany). The project systematically analyzed the state-of-the art, comparing&nbsp;materials, design strategies&nbsp;and processing methods for rotor sleeves made from thermoset and thermoplastic carbon fiber composites. The result is a comprehensive market and technology analysis, documented in a 384-page final report that&nbsp;is&nbsp;ready to be implemented into other cooperations.&nbsp;</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3><a name=\"Consortium members\">Consortium members</a></h3>\n\n<ul>\n\t<li>Arkema Group</li>\n\t<li>Covenstro Deutschland AG</li>\n\t<li>DOMO Engineering Plastics Europe S.p.A.,</li>\n\t<li>Hexcel Composites SASU</li>\n\t<li>Huntsman Advanced Materials</li>\n\t<li>Hutchinson SA CRI</li>\n\t<li>K&uuml;mpers GmbH</li>\n\t<li>LG Electronics Deutschland GmbH</li>\n\t<li>Maru Hachi Corp.</li>\n\t<li>Rassini Supensiones S.A. de C.V.</li>\n\t<li>Schunk Kohlenstofftechnik GmbH</li>\n\t<li>Swancore Netherlands B.V.</li>\n\t<li>Syensqo</li>\n\t<li>Toray Carbon Fibers&nbsp;Europe S.A.</li>\n\t<li>Toyota Motor Europe N.V./S.A.</li>\n</ul>\n</div>\n</div>\n\n<p>To support OEMs and motor developers in leveraging these findings, AZL is now hosting a dedicated web meeting on Sept. 25 designed specifically to demonstrate the practical relevance, supply chain maturity&nbsp;and technology details of composite rotor sleeves for electric drives. Participation is free of charge.</p>\n\n<p>The event will provide a strategic overview of the technology&rsquo;s capabilities and will highlight the concrete potential for integration into series production. It starts with an introduction to the current state of the technology and its role in enabling the next generation of electric motors. AZL will then present the consolidated results from the project&rsquo;s work packages. Key insights include comparisons of rotor sleeve designs (press-fit versus direct-wound), material classes (thermoplastic and thermoset carbon fiber composites), mechanical and thermal performance benchmarks and production KPIs.&nbsp;</p>\n\n<p>In the second part of the meeting, participants will get the opportunity to meet the consortium behind the recently finished project &mdash;&nbsp;from composite material suppliers and machine manufacturers to rotor sleeve producers. Each partner will briefly pitch their expertise and offerings, helping OEMs identify reliable contacts for implementation projects.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-tight-fitting-requirement.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-azl-tight-fitting-requirement.png;maxWidth=385\" /></a></div>\n\n<p>Tight fitting requirements.&nbsp;</p>\n</div>\n\n<p>&ldquo;As a&nbsp;high-volume manufacturer in the field of rotor sleeves, Schunk considers it essential to actively shape innovation,&rdquo; says Fabian&nbsp;K&ouml;ster, development engineer composites at&nbsp;Schunk Kohlenstofftechnik GmbH, one of the consortium members. &ldquo;Our participation in the AZL project reflects our strong belief that future viability and competitiveness can only be secured through early involvement in technological developments. The AZL info event offers OEMs and partners across the entire value chain a valuable opportunity to exchange insights on the current state of rotor sleeve technologies, explore emerging trends&nbsp;and collaboratively develop solutions for tomorrow&rsquo;s challenges.&rdquo;</p>\n\n<p>For OEMs, this event provides not only an update on emerging technology, it also offers direct access to a ready-to-engage partner network. It also marks the official launch of a follow-up experimental project.</p>\n\n<p>This follow-up initiative will shift from theoretical analysis to experimental validation. Its goal is to benchmark the performance of different material and process combinations under real-world production and operating conditions. The&nbsp;follow-up&nbsp;project includes four work packages:</p>\n\n<ul>\n\t<li>The <strong>first work package</strong> will define the production concepts and materials to be tested experimentally, including the design of test methods and auxiliary equipment for press fit operations.</li>\n\t<li>The <strong>second work package</strong> is targeting a production process consisting of separate winding and press fitting on the rotor. It includes manufacturing of sleeves using wet winding, towpreg winding and thermoplastic tape winding. Strength testing of the sleeves will consider different prestress levels, while also the quality of the laminate will be evaluated.</li>\n\t<li>The <strong>third work package</strong> will do the same, but in this case for a process, directly winding on the rotor. Evaluation will also include high-temperature testing and long-term durability.</li>\n\t<li>Finally, in the <strong>fourth work package</strong>, all process and strength test results will be evaluated on cost, quality&nbsp;and performance, leading to benchmarking of various materials, and clear recommendations for cost-efficient rotor sleeves.</li>\n</ul>\n\n<p>The web meeting, hosted on Sept., 25, is open to OEMs, motor developers, innovation managers&nbsp;and system integrators seeking to accelerate their next electric powertrain generation. A registration link will be provided for all interested participants. Contact Phillip Fr&ouml;hlig&nbsp;for more info:&nbsp;<a href=\"mailto:philipp.froehlig@azl-aachen-gmbh.de\">philipp.froehlig@azl-aachen-gmbh.de</a></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/azl-composite-rotor-sleeves-project-is-completed-presents-findings-at-upcoming-web-meeting"
      }
    ],
    "link": "https://www.compositesworld.com/news/azl-composite-rotor-sleeves-project-is-completed-presents-findings-at-upcoming-web-meeting"
  },
  {
    "published": "Mon, 15 Sep 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      9,
      15,
      16,
      0,
      0,
      0,
      258,
      0
    ],
    "title": "MaruHachi Corp. to develop CFRTP cryogenic rocket fuel tank",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "MaruHachi Corp. to develop CFRTP cryogenic rocket fuel tank"
    },
    "summary": "MaruHachi is selected by the Japanese government&rsquo;s&nbsp;Space Strategic Fund, commencing&nbsp;joint development with&nbsp;University of Tokyo and Kanazawa Institute of Technology/ICC.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "MaruHachi is selected by the Japanese government&rsquo;s&nbsp;Space Strategic Fund, commencing&nbsp;joint development with&nbsp;University of Tokyo and Kanazawa Institute of Technology/ICC."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-space-flight-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Jet fuel from rocket launch.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-space-flight-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>In late July 2025, <a href=\"https://maruhachi.eu/\" target=\"_blank\">MaruHachi Corp.</a> (Fukui, Japan), a family-owned company specializing in composite materials, preforms and profiles, announced that its proposal, &ldquo;Advancement of Design and Manufacturing Technology for Low-Cost Thermoplastic CFRP Large Tanks Utilizing DX Technology,&rdquo;&nbsp;has been selected by the Japan Aerospace Exploration Agency (JAXA) under its Space Strategic Fund program.</p>\n\n<p>This project aims to establish the foundational technology for manufacturing propulsion fuel tanks for rockets using lightweight and low-cost carbon fiber-reinforced thermoplastics (CFRTP), a departure from conventional metal materials. This innovation will be tackled through industry-academia collaboration with the University of Tokyo and Kanazawa Institute of Technology/Innovation Composite Center (ICC).</p>\n\n<p>In the global space industry, a pressing challenge is the reduction of rocket launch costs. MaruHachi aims to contribute to a dramatic weight and cost reduction for rockets by establishing a manufacturing technology for CFRTP tanks capable of withstanding cryogenic liquid fuels. This will enhance the international competitiveness of Japan&rsquo;s space transportation business.</p>\n\n<p>&ldquo;The background of this project is the ATL technology from Fraunhofer IPT, which MaruHachi introduced through the AZL network about 8&nbsp;years ago,&rdquo; says Toshihide Sugahara, president of MaruHachi Corp. &ldquo;Building on this, MaruHachi has accumulated fundamental research on ATL molding technology and advanced its processing techniques, which led to this proposal. As MaruHachi celebrates its 88<sup>th</sup> anniversary, we are taking on the new challenge of the space domain by leveraging the composite material technologies we have cultivated. We are committed as a company to making this project a success and contributing to the development of not only Japan&rsquo;s space industry but also the global space industry and the creation of new regional industries where we are located.&rdquo;</p>\n\n<p>The primary R&amp;D initiatives behind this project include:</p>\n\n<ul>\n\t<li>Developing high-performance CFRTP tape materials that can withstand cryogenic environments.&nbsp;</li>\n\t<li>The build of a sophisticated design system using high-performance computing to streamline development.&nbsp;</li>\n\t<li>Introduction of a new, ultra-large-scale molding system for rockets to establish manufacturing technology.</li>\n\t<li>Analyzation of&nbsp;big data from in-process manufacturing through inline inspection to develop efficient quality assurance technology.</li>\n</ul>\n\n<p>This project completed its contract with JAXA in April 2025 and has commenced with R&amp;D partners Nobuhiro Yoshikawa, professor at the University of Tokyo&rsquo;s&nbsp;Institute of Industrial Science; and Kiyoshi Uzawa, director/professor of the ICC&nbsp;at&nbsp;Kanazawa Institute of Technology.</p>\n\n<p>To promote this project, MaruHachi established the Future Development Department&nbsp;in April 2025. The company strives to further expand its business through the commercialization of technology developed in the space sector and its application in the aerospace industry.&nbsp;</p>\n\n<hr />\n<p style=\"text-align: center;\"><em>This post is courtesy of the&nbsp;</em>CompositesWorld<em>&nbsp;and AZL Aachen GmbH media partnership.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/maruhachi-corp-to-develop-cfrtp-cryogenic-rocket-fuel-tank"
      }
    ],
    "link": "https://www.compositesworld.com/news/maruhachi-corp-to-develop-cfrtp-cryogenic-rocket-fuel-tank"
  },
  {
    "published": "Mon, 15 Sep 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      9,
      15,
      15,
      30,
      0,
      0,
      258,
      0
    ],
    "title": "Hexcel expands official Americas aerospace distribution network",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexcel expands official Americas aerospace distribution network"
    },
    "summary": "Broadened distribution footprint includes Composites One, Heatcon, GracoRoberts, Krayden and Pacific Coast Composites, building up&nbsp;Hexcel&rsquo;s supply chain strength and customer agility.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Broadened distribution footprint includes Composites One, Heatcon, GracoRoberts, Krayden and Pacific Coast Composites, building up&nbsp;Hexcel&rsquo;s supply chain strength and customer agility."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-camx-booth-display.jpeg\" target=\"_blank\"><img alt=\"Hexcel CAMX booth.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0925-cw-news-hexcel-camx-booth-display.jpeg;maxWidth=385\" /></a></div>\n\n<p>Source | Hexcel</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel Corp.</a> (Stamford, Conn., U.S.) has announced a significant expansion of its official Americas aerospace distribution network, now including <a href=\"https://www.compositesworld.com/suppliers/composites-one\" target=\"_blank\">Composites One</a>, <a href=\"https://www.compositesworld.com/suppliers/gracoroberts\" target=\"_blank\">GracoRoberts</a>, <a href=\"https://www.compositesworld.com/suppliers/heatcon-composite-systems\" target=\"_blank\">Heatcon</a>, <a href=\"https://www.compositesworld.com/suppliers/krayden\" target=\"_blank\">Krayden</a>&nbsp;and <a href=\"https://www.compositesworld.com/suppliers/pacific-coast-composites\" target=\"_blank\">Pacific Coast Composites</a>. This move reflects Hexcel&rsquo;s commitment to increasing agility and responsiveness across the aerospace sector, particularly for startups and fast-growing segments developing capabilities for unmanned vehicles, eVTOLs, hypersonics, and other defense and space applications.</p>\n\n<p>&ldquo;Our goal is to be as agile as the markets we serve,&rdquo; says Lyndon Smith, Hexcel&rsquo;s president of&nbsp;Americas and global fibers. &ldquo;Expanding our official distribution network enables us to deliver our aerospace materials through multiple channels, ensuring customers have access to the right products, in the right quantities, at the right time.&rdquo;</p>\n\n<p>Through this&nbsp;expanded distribution network, Hexcel&nbsp;will&nbsp;deliver its advanced composite materials more efficiently and flexibly. Customers will also benefit from broader geographic coverage, faster turnaround times&nbsp;and improved access to technical support. These distributors bring extensive infrastructure, specialized capabilities such as roll slitting and kitting&nbsp;and robust e-commerce platforms that make it easier for aerospace manufacturers to source the materials they need &mdash; whether in large volumes or small, customized quantities.</p>\n\n<p>As a vertically integrated manufacturer, Hexcel controls every stage of its production process &mdash; from fiber and resin development to prepreg manufacturing and engineered core solutions. This integration ensures consistent quality, supply chain reliability&nbsp;and technical excellence across its entire product portfolio.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexcel-expands-official-americas-aerospace-distribution-network"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexcel-expands-official-americas-aerospace-distribution-network"
  }
]