[
  {
    "published": "Wed, 8 Oct 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      8,
      18,
      0,
      0,
      2,
      281,
      0
    ],
    "title": "Avient, ReForm Composites accelerate TPC adoption in construction",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Avient, ReForm Composites accelerate TPC adoption in construction"
    },
    "summary": "ReForm&rsquo;s pultrusion technology with Avient&rsquo;s composite materials enables curved continuous fiber TPC&nbsp;profiles&nbsp;demonstrated in the PolyDowel infrastructure project.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ReForm&rsquo;s pultrusion technology with Avient&rsquo;s composite materials enables curved continuous fiber TPC&nbsp;profiles&nbsp;demonstrated in the PolyDowel infrastructure project."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-avient-reform-dowel-install.jpg\" target=\"_blank\"><img alt=\"Dowel installation project.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-avient-reform-dowel-install.jpg;maxWidth=385\" /></a></div>\n\n<p>Dowel installation. Source | Avient Corp., ReForm Composites Engineering</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/avient-corporation-composites\" target=\"_blank\">Avient Corp.</a> (Cleveland, Ohio, U.S.) has successfully collaborated with customer <a href=\"https://reformcomposites.com/\" target=\"_blank\">ReForm Engineering Composites LLC</a>&nbsp;(Bangor, Maine, U.S.), a company specializing in engineering and manufacturing continuous fiber-reinforced thermoplastic (CFRTP) composite solutions that are cost-effective and adaptable across concrete infrastructure applications in the construction market.</p>\n\n<p>ReForm processes CFRTP laminate materials into continuous profiles with its patented continuous forming machine (CFM), a thermoplastic pultrusion technology. By integrating in-line thermoforming, the CFM enables curves, complex shapes&nbsp;and multi-geometry designs, surpassing traditional pultrusion technology, which is typically limited to producing straight profiles. Building on these capabilities, ReForm is advancing CFRTP applications that leverage the material&rsquo;s lightweight and corrosion-resistant properties to support the next generation of concrete infrastructure.</p>\n\n<p>A recent success for ReForm is The PolyDowel, a CFRTP dowel for flat slab concrete construction, that was produced by ReForm using CFM and Avient&rsquo;s Polystrand continuous fiberglass-reinforced thermoplastic laminates. The TPC&nbsp;laminates are precision-cut to specific widths by Avient to enable a seamless manufacturing process and minimize scrap. The resulting TPC dowels provide optimal&nbsp;durability and corrosion resistance to improve concrete joint performance compared to traditional steel alternatives.</p>\n\n<p>The first demonstrator installation of The PolyDowel was completed in early 2025 as part of a high-traffic entertainment infrastructure project, validating its field performance. The PolyDowel has also been installed in Port St. Lucie, Florida, at the Mattamy Homes Heart of Tradition plaza, home to the iconic Heart in the Park, the world&rsquo;s tallest heart sculpture</p>\n\n<p>&ldquo;Construction has traditionally faced challenges adopting composites due to cost sensitivities for building projects,&rdquo; says&nbsp;Cody Sheltra, CEO of ReForm. &ldquo;Through our collaboration with Avient, we have delivered a cost-effective solution that brings the performance of advanced composites to concrete reinforcement, helping accelerate adoption in this market.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/avient-reform-composites-accelerate-tpc-adoption-in-construction"
      }
    ],
    "link": "https://www.compositesworld.com/news/avient-reform-composites-accelerate-tpc-adoption-in-construction"
  },
  {
    "published": "Wed, 8 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      8,
      17,
      0,
      0,
      2,
      281,
      0
    ],
    "title": "INEOS to close two chlorvinyl, specialty PVC plants in Germany",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "INEOS to close two chlorvinyl, specialty PVC plants in Germany"
    },
    "summary": "INEOS firmly criticizes the EU&rsquo;s absence of tariff protection, as well as crippling energy and carbon costs&nbsp;leading to the closure of two more of its plants and a deepening crisis across the European chemical sector.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "INEOS firmly criticizes the EU&rsquo;s absence of tariff protection, as well as crippling energy and carbon costs&nbsp;leading to the closure of two more of its plants and a deepening crisis across the European chemical sector."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-ineos-rheinburg-pvc-operations-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerial view of Rheinburg, Germany plant.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-ineos-rheinburg-pvc-operations-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | INEOS</p>\n</div>\n\n<p>Global chemical company&nbsp;<a href=\"https://www.ineos.com/\" target=\"_blank\">INEOS&nbsp;Group</a> (London, U.K.) has confirmed its intention to shut down two production units in Rheinberg, Germany, with the loss of 175 jobs. The proposed closures are the direct result of crippling energy and carbon costs, and a lack of tariff protection. The intention to close, which has been shared with employees, reflects a deepening crisis across Europe&rsquo;s chemical sector.</p>\n\n<p>&ldquo;While competitors in the U.S. and China benefit from cheap energy, European producers are being priced out by our own policies and absence of tariff protection,&rdquo; notes Stephen Dossett, CEO of INEOS Inovyn, the company&rsquo;s chlorvinyls and&nbsp;specialty PVC producer. These chemicals can be used in the production of fiber-reinforced composite materials.&nbsp;&ldquo;Meanwhile, high-emission imports flood our market unchecked. It&rsquo;s completely unsustainable and if not immediately addressed will lead to further closures, job losses and increased dependency on other regions for essential materials.&rdquo;</p>\n\n<p>Both plants produce essential chemicals. The Allylics unit makes the key ingredient for epoxy resins vital in defense, aerospace, cars and renewable energy infrastructure. The electrochemical facility produces chlorine crucial for clean water, medicines, industrial processes and sanitation.</p>\n\n<p>These closures are part of a wider trend as Europe&rsquo;s competitiveness collapses, INEOS points out. Since 2019, output in Germany has dropped by 18%, driving job losses and reduced investment. INEOS has closed plants in Grangemouth (U.K.) and Geel (Belgium). It is closing Gladbeck (Germany), and has mothballed assets in Tavaux (France) and Martorell (Spain).</p>\n\n<p>INEOS will now focus on preserving its remaining PVC operations in Rheinberg to support around 300 skilled jobs. This requires urgent state support to help cover significant local transitioning costs.</p>\n\n<p>The business deeply regrets the decision to close Rheinberg&rsquo;s cell rooms and Allylics operations, and is conscious of the impact it will have on staff and wider German supply chain. &ldquo;INEOS Inovyn will work closely with partners and employees to minimize the impact.&rdquo; says&nbsp;Dossett &ldquo;We are doing everything we can to protect what is still viable, but we can&rsquo;t do it alone. If governments want to keep strategic manufacturing in Europe, they must help manage this transition and restore competitiveness.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ineos-to-close-two-chlorvinyl-specialty-pvc-plants-in-germany"
      }
    ],
    "link": "https://www.compositesworld.com/news/ineos-to-close-two-chlorvinyl-specialty-pvc-plants-in-germany"
  },
  {
    "published": "Wed, 8 Oct 2025 12:30:00 -0400",
    "published_parsed": [
      2025,
      10,
      8,
      16,
      30,
      0,
      2,
      281,
      0
    ],
    "title": "Mel Composites materials, technical support enhances Aresa fishing vessel production efficiency",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Mel Composites materials, technical support enhances Aresa fishing vessel production efficiency"
    },
    "summary": "Mel delivered pre-processed structural components and engineering support for the four commercial vessels, reducing build time by approximately 15% through workflow optimization and CNC-cut Aircell HR80 core integration.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Mel delivered pre-processed structural components and engineering support for the four commercial vessels, reducing build time by approximately 15% through workflow optimization and CNC-cut Aircell HR80 core integration."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-melcomposites-aresashipyard.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Infused boat hull.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-melcomposites-aresashipyard.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Mel Composites, Aresa Shipyards</p>\n</div>\n\n<p><a href=\"https://melcomposites.es/en/\" target=\"_blank\">Mel&nbsp;Composites</a>&nbsp;(Barcelona, Spain) has successfully expanded its long-term collaboration with&nbsp;<a href=\"https://www.aresashipyard.com/\" target=\"_blank\">Aresa&nbsp;Shipyards</a>&nbsp;(Arenys de Mar, Barcelona) by delivering comprehensive composite&nbsp;materials and technical support for a series of four commercial fishing vessels.</p>\n\n<p>The latest project showcases Mel Composites&rsquo;&nbsp;ability to optimize production workflows through specialized engineering services and pre-processed structural components. Taking responsibility for mold preparation and consulting on the engineering and design for the main deck, upper deck and structural hull and&nbsp;deck bulkheads, Mel&nbsp;enabled Aresa&nbsp;to reduce build time by approximately 15% and significantly improve production efficiency.</p>\n\n<p>&ldquo;Our approach goes beyond simply supplying materials,&rdquo;&nbsp;explains Eduardo Galofre, CEO at Mel&nbsp;Composites. &ldquo;We leverage decades of composite expertise to provide complete solutions that address the technical and production challenges our clients face. With Aresa,&nbsp;we&rsquo;ve created a workflow that enables&nbsp;their team to focus on hull construction, while&nbsp;we optimize and manage the build of the complex internal structures.&rdquo;</p>\n\n<p>The fishing vessels feature glass fiber&nbsp;sandwich bulkheads manufactured using vacuum infusion with Mel&nbsp;Composites&rsquo;&nbsp;Aircell HR80 PVC core, which was precision-cut using CNC technology to<strong> </strong>integrate all necessary reinforcements into a single infusion process. The company&rsquo;s technical team specified grooved foam core that eliminated the need for mesh vacuum consumables, reducing material waste and processing time.</p>\n\n<p>Mel&nbsp;Composites partnered with <a href=\"https://fibervent.com/\" target=\"_blank\">Fibervent</a>&nbsp;(Tarragano, Spain) for the composites manufacturing, with all components carefully engineered with transverse and longitudinal support beams included as part of the single-shot resin infusion process. This coordinated approach allowed internal structures to be produced off-site and delivered just in time for integration into the hulls, optimizing Aresa&rsquo;s production schedule.</p>\n\n<p>The collaboration follows Mel&rsquo;s&nbsp;successful work <a href=\"https://www.compositesworld.com/news/mel-composites-aresa-shipyard-collaborate-on-one-shot-black-falcon-v20-vessel\" target=\"_blank\">on Aresa&rsquo;s&nbsp;<em>Black Falcon</em> V2.0</a>, a 15.2-meter high-speed interceptor vessel capable of exceeding 65 knots with its four 450-horsepower&nbsp;Yamaha engines. For this project, Mel&nbsp;provided a complete package of infusion support, kitted materials&nbsp;and consumables.</p>\n\n<p>As a comprehensive composite solutions provider, Mel&nbsp;Composites supplies the full range of materials required for advanced marine applications, including resins, reinforcements, foam cores, consumables, tools and equipment. This single-source approach simplifies procurement, ensures material compatibility&nbsp;and provides clients with a single point of contact for technical support.</p>\n\n<p>The company also has expanded its in-house production capability for pre-processed structural cores and kit manufacturing to serve marine manufacturers.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/mel-composites-materials-technical-support-enhances-aresa-fishing-vessel-production-efficiency"
      }
    ],
    "link": "https://www.compositesworld.com/news/mel-composites-materials-technical-support-enhances-aresa-fishing-vessel-production-efficiency"
  },
  {
    "published": "Wed, 8 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      8,
      16,
      0,
      0,
      2,
      281,
      0
    ],
    "title": "Aimplas to host third international plastics recycling seminar, PLASREC",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aimplas to host third international plastics recycling seminar, PLASREC"
    },
    "summary": "The event is a forum for dialogue between industry, tech centers, associations and public authorities, with the aim of promoting practical solutions to the challenges of plastics and composites recycling.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The event is a forum for dialogue between industry, tech centers, associations and public authorities, with the aim of promoting practical solutions to the challenges of plastics and composites recycling."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-aimplas-plasrec-2023.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"PLASREC 2023 seminar.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-aimplas-plasrec-2023.jpg;maxWidth=720\" /> </a></div>\n\n<p>PLASREC 2023. Source | Aimplas</p>\n</div>\n\n<p><a href=\"https://www.aimplas.net/\" target=\"_blank\">Aimplas</a>, the Plastics Technology Centre (Valencia, Spain), announces the third edition of its International Plastics Recycling Seminar, PLASREC, to be held Dec. 10-11, 2025 in Valencia. The event, organized for professionals in the recycling industry, will feature more than&nbsp;20 presentations by internationally renowned experts who will address the key challenges, technological advances and regulatory frameworks shaping the plastics and composites recycling sector.</p>\n\n<p><a href=\"https://www.aimplas.net/conferences/third-plasrec-international-seminar-plastics-recycling/\" target=\"_blank\">The seminar</a> will bring together national and international specialists to explore the main issues affecting the sector, with a cross-cutting approach that includes industries such as textiles, automotive, electronics, packaging and wind energy.</p>\n\n<p>The seminar program&rsquo;s&nbsp;presentations are&nbsp;structured into four thematic blocks. The first block will address the economic and legal context of plastics recycling. It will examine the impact of European regulations, such as the Packaging Regulation and REACH, as well as the role of initiatives like the Green Deal in shaping the sector&rsquo;s development. These topics will be presented by organizations including ANARPLA, ETRA, ANAIP&nbsp;and Plastics Europe.</p>\n\n<p>The second block will address waste collection and sorting, with a focus on advanced classification technologies such as AI&nbsp;and computer vision, and specific solutions for complex waste streams like textiles and footwear soles. Contributors include experts from Solver IA, Picvisa&nbsp;and Coleo.</p>\n\n<p>The third block will delve into recycling technologies, covering both mechanical and chemical recycling, as well as emerging innovations. Case studies and developments in pyrolysis, devulcanization, enzymatic depolymerization and advanced extrusion will be presented by companies such as Aceteo, Br&uuml;ggemann, Petcore, GSF, Plastic Energy, Entzimatiko, Modus, Messer, Promak, Kubota/Brabender and UBE.</p>\n\n<p>The final block will focus on sector-specific recycling targets, showcasing circularity strategies in key industries such as textiles, electrical and electronic equipment, automotive&nbsp;and composite materials used in wind turbine manufacturing. Organizations including Inditex, Sostenplas, Antol&iacute;n Ingenier&iacute;a and Aemac&nbsp;will share how they are adapting their processes to meet recycling goals.</p>\n\n<p>In addition to the main program, the event will feature a technical visit to Aimplas, workshops on the European project FREE4LIB and the national project CICLICOM, dedicated networking spaces&nbsp;and a congress dinner.</p>\n\n<p><em>PLASREC is supported by sponsoring companies including Picvisa, Gsfupcycling, Entzimatiko, Promak Solutions, Gravipes, Kubota/Brabender, ANARPLA, ANAIP, Mayper, Aceteco and Modus.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aimplas-to-host-third-international-plastics-recycling-seminar-plasrec"
      }
    ],
    "link": "https://www.compositesworld.com/news/aimplas-to-host-third-international-plastics-recycling-seminar-plasrec"
  },
  {
    "published": "Wed, 8 Oct 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      8,
      15,
      0,
      0,
      2,
      281,
      0
    ],
    "title": "L&L Products inaugurates central European logistics hub in Poland",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "L&L Products inaugurates central European logistics hub in Poland"
    },
    "summary": "Established alongside partner Geodis, the platform cuts transport times for key European automotive partners and&nbsp;enhances scalable production and logistics opportunities to mitigate&nbsp;current and future supply chain challenges.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Established alongside partner Geodis, the platform cuts transport times for key European automotive partners and&nbsp;enhances scalable production and logistics opportunities to mitigate&nbsp;current and future supply chain challenges."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Prep zone.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-llproducts-prep-zone.jpg;maxWidth=720\" /> </div>\n\n<p>Preparation zone at L&amp;L&rsquo;s new logistics hub in Poland. Source (All Images) | L&amp;L Products</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/ll-products\" target=\"_blank\">L&amp;L Products</a> (Romeo, Mich., U.S.) announces the official inauguration of its additional logistics hub in Wroclaw, Poland, marking a major milestone in its supply chain transformation initiative. Developed in partnership with European logistics company Geodis&nbsp;(Levallois-Perret, France), the hub prioritizes operational resilience and positions L&amp;L Products for scalable growth across central Europe.</p>\n\n<p>A launch event took place on Oct. 7 at Geodis Poland&rsquo;s location, featuring remarks from&nbsp;Geodis and L&amp;L Products leadership, including representatives from the project and operational teams.</p>\n\n<p>By separating the production expertise of subcontract partners and the operational expertise of Geodis, L&amp;L Products says it has created a resilient, future-ready platform that improves logistics, enhances service quality and mitigates operational risk. &ldquo;Geodis demonstrated professionalism and commitment throughout the development of this logistics hub,&rdquo; says&nbsp;Sophie Pacalet, supply chain&nbsp;manager at L&amp;L Products. &ldquo;Their ability to absorb complexity, train cross-functional teams&nbsp;and tailor solutions to L&amp;L&rsquo;s specific needs has been instrumental to the success of this project.&rdquo;</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-llproducts-rack-implementation.jpg\" target=\"_blank\"><img alt=\"Rack implementation.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-llproducts-rack-implementation.jpg;maxWidth=385\" /></a></div>\n\n<p>Rack implementation.</p>\n</div>\n\n<p>Implementation of the new logistics process began in January 2025, with the majority of clients onboarded by August 2025. The hub enhances customer relations through a faster, more reliable and more sustainable logistics workflow, ensuring products are delivered both on time and on budget.</p>\n\n<p>&ldquo;This logistics hub represents a turning point for L&amp;L Products, not just in how we solve supply chain challenges, but in how we build for the future, notes&nbsp;Jean-Michel Hollaender, president L&amp;L Products Europe. &ldquo;This logistics hub in Poland is a strategic platform that enhances our resilience, accelerates performance&nbsp;and positions us to scale rapidly across Europe. By separating production from logistics, we&rsquo;ve achieved efficiencies and created a model that is already delivering measurable value to our clients.&rdquo;</p>\n\n<p>Key benefits of this new hub include:</p>\n\n<ul>\n\t<li><strong>Faster deliveries.&nbsp;</strong>Up to 10 hours saved per shipment loop, improving response time and reducing lead times.</li>\n\t<li><strong>Reliable service.&nbsp;</strong>Enhanced shipment quality, better labeling and robust IT flows equal improved customer experience.</li>\n\t<li><strong>Lower CO<sub>2</sub> emissions:</strong> Shorter transport routes contribute to L&amp;L Products&rsquo; sustainability goals.</li>\n\t<li><strong>Future-readiness.</strong>&nbsp;Scalability through additional warehouse space and new logistics flows throughout Europe.</li>\n</ul>\n\n<p>L&amp;L Products is aiming to mitigate current and open future opportunities through this centralized hub as the company looks to make progress in attracting clients eastward as having a shipping point in central Europe provides a competitive advantage for L&amp;L Products France, Czechia and Bursa. The platform is intentionally future-ready and scalable with capacity to absorb new flows from other suppliers and regions in the future.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ll-products-inaugurates-central-european-logistics-hub-in-poland"
      }
    ],
    "link": "https://www.compositesworld.com/news/ll-products-inaugurates-central-european-logistics-hub-in-poland"
  },
  {
    "published": "Wed, 8 Oct 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      8,
      14,
      0,
      0,
      2,
      281,
      0
    ],
    "title": "RWC composite radomes facilitate R4 Integration military search and rescue operations",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "RWC composite radomes facilitate R4 Integration military search and rescue operations"
    },
    "summary": "Completed delivery of nine &ldquo;no tooling&rdquo; Ka-band and KaKu-band radomes&nbsp;are an extension of a previous program for a single proof-of-concept radome for C130 aircraft and similar platforms.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Completed delivery of nine &ldquo;no tooling&rdquo; Ka-band and KaKu-band radomes&nbsp;are an extension of a previous program for a single proof-of-concept radome for C130 aircraft and similar platforms."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-rwc-radome-panel-rftest.jpg\" target=\"_blank\"><img alt=\"Radome panel under radio frequency testing. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-rwc-radome-panel-rftest.jpg;maxWidth=385\" /></a></div>\n\n<p>Radome panel under radio frequency testing. Source | Rock West Composites (RWC)</p>\n</div>\n\n<p>The delivery of&nbsp;nine Ka-band and KaKu-band radomes to <a href=\"https://r4-integration.com/\" target=\"_blank\">R4 Integration&nbsp;Inc.</a>&nbsp;(Fort Walton Beach, Fla., U.S.) by <a href=\"https://www.compositesworld.com/suppliers/rock-west-composites\" target=\"_blank\">Rock West Composites</a> (RWC, San Diego, Calif., U.S.)&nbsp;completes a&nbsp;contract that continues work on a previous aerospace program facilitating military search and rescue operations. The sandwich panel radomes meet multiple demanding requirements including very low view angles, a large band of frequencies, truncated schedule&nbsp;and no tooling. The program is anticipated to have follow-on adjacent panel designs in 2026.</p>\n\n<p>The contract called for radomes made of a fiberglass and foam core sandwich configuration, following the design of the original proof of concept. The Ka-band radomes are made of Quartz Btcy1-A/4581 by <a href=\"https://www.compositesworld.com/suppliers/toray-advanced-composites\" target=\"_blank\">Toray Advanced Composites</a> (Morgan Hill, Calif., U.S.) and <a href=\"https://www.compositesworld.com/suppliers/diab-international-ab\" target=\"_blank\">Diab</a>&nbsp;(Laholm, Sweden) foam. The KaKu-band radomes are made of Toray 2510 and Diab foam with a foam tuning layer. The exterior shapes are the same and require very low view angles of 20&deg; relative to the horizon within several frequency ranges: 10.7-14.5 gigahertz (GHz), 17.7-21.2 GHz and 27.5-31 GHz. RWC met an abbreviated schedule and used no tooling by creating a highly optimized flat panel design. The company performed in-house radio frequency&nbsp;testing to verify performance to requirements.</p>\n\n<p>&ldquo;This opportunity has enabled Rock West to demonstrate a key capability, successfully producing radomes for aerospace applications without the need for tooling, bringing better value and improved schedules to our customers and end users,&rdquo; notes Adam Saunders, RWC program manager.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rwc-composite-radomes-facilitate-r4-integration-military-search-and-rescue-operations"
      }
    ],
    "link": "https://www.compositesworld.com/news/rwc-composite-radomes-facilitate-r4-integration-military-search-and-rescue-operations"
  },
  {
    "published": "Tue, 7 Oct 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      7,
      14,
      0,
      0,
      1,
      280,
      0
    ],
    "title": "Super Carbon Composites Technologies launches for C/C composite commercialization",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Super Carbon Composites Technologies launches for C/C composite commercialization"
    },
    "summary": "An offshoot of MATECH, SCCT will support straightforward implementation of FAST/SPS densification to more easily achieve high-performance C/C composites.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "An offshoot of MATECH, SCCT will support straightforward implementation of FAST/SPS densification to more easily achieve high-performance C/C composites."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-MATECH-brake-process.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"MATECH brake production process.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-MATECH-brake-process.jpg;maxWidth=720\" /> </a></div>\n\n<p>MATECH brake process. Source | MATECH</p>\n</div>\n\n<p><a href=\"http://www.matechgsm.com/index-6.html\" target=\"_blank\">MATECH</a>&rsquo;s founder&nbsp;(Westlake Village, Calif., U.S.) Edward J. A. Pope, Ph.D., has launched <a href=\"https://www.supercarbon.us/\" target=\"_blank\">Super Carbon Composites Technologies</a> (SCCT). The startup company, leveraging 2&nbsp;years of MATECH-funded&nbsp;independent research and development and U.S. pending patents, will commercialize&nbsp;ultra high-density carbon/carbon (UHDCC) composites for aviation,&nbsp;space, industrial, semiconductors&nbsp;and automotive.&nbsp;</p>\n\n<p>The foundation of SCCT is the manufacture of carbon/carbon (C/C) composites with high density and low porosity. SCCT combines C/C composites with field-assisted sintering technology (FAST) to produce what is claimed to be the world&rsquo;s densest C/C composites.&nbsp;This patent-pending technology features high wear&nbsp;resistance, ablation resistance&nbsp;and high performance for next-gen C/C composites.</p>\n\n<p>Applications for SCCT&rsquo;s UHDCC composites include:</p>\n\n<ul>\n\t<li>Wear-resistant C/C aviation brakes</li>\n\t<li>Hypercar automotive brakes</li>\n\t<li>Rocket nozzle throats</li>\n\t<li>Hypersonic missile nose tips</li>\n\t<li>Ballistic reenetry nose tips</li>\n\t<li>Low-ablation heat shields</li>\n\t<li>Furnace heaters and componentry</li>\n\t<li>Semiconductor processing fixtures</li>\n\t<li>Heat sinks in hybrid microelectronics</li>\n\t<li>Heat spreaders in cellphones</li>\n\t<li>Fuell cells.</li>\n</ul>\n\n<p>&ldquo;A $20 billion/year industry, the market for C/C&nbsp;composites has the potential to ramp up to more than $100 billion/year in less than a decade with the added performance SCCT&rsquo;s new technology,&rdquo; says Pope. &ldquo;For investors, the beauty of SCCT&rsquo;s business model is that it&rsquo;s based on material that already exists. The existing C/C&nbsp;composite materials, however, still have significant challenges and limitations. SCCT&rsquo;s goal is to remove those limitations and &lsquo;unleash the beast&rsquo; that is at the heart of C/C composites.&rdquo;</p>\n\n<p>Through MATECH&nbsp;the last 36&nbsp;years, Pope has developed and commercialized materials in the areas of&nbsp;optics, electronics, biomaterials and high-temperature ceramics and composites. Pope has successfully negotiated multiple multi-million-dollar intellectual property licensing transactions and previously launched three other earlier startup companies.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/super-carbon-composites-technologies-launches-for-cc-composite-commercialization"
      }
    ],
    "link": "https://www.compositesworld.com/news/super-carbon-composites-technologies-launches-for-cc-composite-commercialization"
  },
  {
    "published": "Mon, 6 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      6,
      17,
      0,
      0,
      0,
      279,
      0
    ],
    "title": "IRT Jules Verne, partners launch SCRATCH TPC assembly project",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "IRT Jules Verne, partners launch SCRATCH TPC assembly project"
    },
    "summary": "A continuation of SPECTRA, this project&rsquo;s&nbsp;technological building blocks will contribute to the deployment of a matured conduction&nbsp;welding solution to improve&nbsp;aerospace-grade TPC assembly.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A continuation of SPECTRA, this project&rsquo;s&nbsp;technological building blocks will contribute to the deployment of a matured conduction&nbsp;welding solution to improve&nbsp;aerospace-grade TPC assembly."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-irt-spectra-project.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-irt-spectra-project.png;maxWidth=720\" /> </a></div>\n\n<p>SPECTRA fuselage panel demonstrator with integral frames welded by conduction.&nbsp;Source |&nbsp;IRT Jules Verne&nbsp;</p>\n</div>\n\n<p><a href=\"https://www.irt-jules-verne.fr/en/\" target=\"_blank\">The French Institute for Technological Research</a>&nbsp;(IRT Jules Verne, Bouguenais) and its partners Airbus, Airbus Atlantic, Cero and Safran, have launched the SCRATCH project, a&nbsp;continuation of the <a href=\"https://www.irt-jules-verne.fr/en/projets/conduction-welding-of-thermoplastic-composites-for-the-aerospace-industry/\" target=\"_blank\">SPECTRA project</a> that focused on welding thermoplastic composites (TPC) for aeronautics.</p>\n\n<p>The 3-year project&rsquo;s objective is twofold:&nbsp;to increase production rates while reducing&nbsp;the assembly costs&nbsp;of composite elements, a key issue for the competitiveness of the aeronautics industry. To achieve this, SCRATCH aims to mature a conduction welding&nbsp;solution for aerospace-grade TPC materials via two chosen industrial case studies&nbsp;presenting complementary geometries and technical challenges.</p>\n\n<p>SCRATCH will&nbsp;consist of testing, evaluating and optimizing this welding technology on these two configurations, in order to better understand its potential and its limits. Several areas of development will be pursued including:</p>\n\n<ul>\n\t<li>Exploration of&nbsp;the performance and limits of the process&nbsp;according to the geometries studied</li>\n\t<li>Implementation of precise monitoring&nbsp;for better welding control</li>\n\t<li>Optimized clearance management&nbsp;during assembly</li>\n\t<li>Development of suitable tools&nbsp;based on advanced thermal simulations.</li>\n</ul>\n\n<p style=\"text-align: start;\">The expected advances will pave the way for&nbsp;broader industrial integration&nbsp;of conduction welding for high-performance TPC&nbsp;materials. In particular, they will enable new applications to be considered on complex parts requiring high mechanical&nbsp;strength.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/irt-jules-verne-partners-launch-scratch-tpc-assembly-project"
      }
    ],
    "link": "https://www.compositesworld.com/news/irt-jules-verne-partners-launch-scratch-tpc-assembly-project"
  },
  {
    "published": "Mon, 6 Oct 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      6,
      17,
      0,
      0,
      0,
      279,
      0
    ],
    "title": "ACS presents biocomposites research in final MAGISTRA project seminar",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ACS presents biocomposites research in final MAGISTRA project seminar"
    },
    "summary": "The initiative, its findings and the discovered value of biocomposites&rsquo; combined technological performance and environmental responsibility&nbsp;were shared in Italy.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The initiative, its findings and the discovered value of biocomposites&rsquo; combined technological performance and environmental responsibility&nbsp;were shared in Italy."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-magistra-project.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Final MAGISTAR seminar.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1025-cw-news-magistra-project.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Final MAGISTRA&nbsp;seminar. Source | Advanced Composites Solutions Srl (ACS)</p>\n</div>\n\n<p>Exploring the application prospects of biocomposites in industry, and highlighting the strategic role that research and innovation can play in their development.&nbsp;This was&nbsp;the goal behind&nbsp;the final seminar of the MAGISTRA (Next Generation Innovative Sustainable Technological Recyclable Advanced Composite Materials) project, promoted by <a href=\"https://www.acs-carbon.com/\" target=\"_blank\">Advanced Composites Solutions Srl</a> (ACS, Tortoreto, Italy)&nbsp;and funded with the support of the Abruzzo Region under the Abruzzo ERDF Regional Program 2021-2027.</p>\n\n<p>The initiative, under the patronage of the Confindustria Abruzzo Medio Adriatico Association, aimed&nbsp;to present the results achieved by the project, which ACS carried out in collaboration with the University of Catania (Italy) through a research pathway focused on biocomposites. These are composite materials in which at least one of the two main components &mdash;&nbsp;matrix or reinforcement &mdash;&nbsp;comes from renewable, natural&nbsp;or recycled sources.&nbsp;</p>\n\n<p>The final MAGISTRA project seminar took place at ACS&rsquo;&nbsp;new plant in Tortoreto (Teramo).&nbsp;After the opening remarks by Paolo Battista, LEAN systems designer and HR&nbsp;director of ACS, contributions followed from Fabio Fazzini and Romualdo Paino of the ACS technical department, who illustrated the manufacturing process of biocomposites and their integration using out-of-autoclave&nbsp;techniques. This dialogue was followed by Gianluca Cicala, professor of materials science and technology and deputy director of the Department of Civil Engineering and Architecture (DICAR)&nbsp;at the University of Catania, recently elected president of the Italian Association of Materials Engineering (AIMAT). His contribution, delivered online, focused on the role of research in the development of biocomposites and on the added value that the MAGISTRA project represents&nbsp;for industry.</p>\n\n<p>At the end of the presentations, a debate and discussion with the audience took place, followed by concluding remarks.</p>\n\n<p>&ldquo;With the MAGISTRA project we confirmed our commitment to sustainable innovation,&rdquo; says&nbsp;Roberto Catenaro, CEO of ACS. &ldquo;Biocomposites represent a bridge between academic research and concrete industrial applications, capable of combining technological performance and environmental responsibility. We are proud to have contributed to building more competitive and sustainable value chains.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/acs-presents-biocomposites-research-in-final-magistra-project-seminar"
      }
    ],
    "link": "https://www.compositesworld.com/news/acs-presents-biocomposites-research-in-final-magistra-project-seminar"
  },
  {
    "published": "Mon, 6 Oct 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      10,
      6,
      16,
      0,
      0,
      0,
      279,
      0
    ],
    "title": "GE Aerospace, Beta partner on hybrid-electric flight advancement",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "GE Aerospace, Beta partner on hybrid-electric flight advancement"
    },
    "summary": "The companies will co‑develop a hybrid‑electric turbogenerator for use in AAM systems, leveraging GE&rsquo;s engine tech and Beta&rsquo;s electric propulsion capabilities.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The companies will co‑develop a hybrid‑electric turbogenerator for use in AAM systems, leveraging GE&rsquo;s engine tech and Beta&rsquo;s electric propulsion capabilities."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-geaerospace-beta.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1025-cw-news-geaerospace-beta.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | GE Aerospace</p>\n</div>\n\n<p><a href=\"https://www.geaerospace.com/\" target=\"_blank\">GE Aerospace</a> (Cincinnati, Ohio, U.S.) and&nbsp;<a href=\"http://beta.team/\" target=\"_blank\">Beta Technologies</a>&nbsp;(South Burlington, Vt., U.S.) have signed a&nbsp;strategic partnership and equity investment agreement, subject to regulatory approval, to accelerate the development of hybrid-electric aviation by combining Beta&rsquo;s rapid innovation approach with GE Aerospace&rsquo;s global scale and experience.</p>\n\n<p>Under the new agreement, GE Aerospace and Beta&nbsp;plan to develop a hybrid-electric turbogenerator for advanced air mobility (AAM) applications, including long-range vertical takeoff and landing (VTOL) aircraft, future Beta aircraft&nbsp;and other potential applications. The collaboration brings Beta&rsquo;s expertise in high-performance, permanent magnet electric generators together with GE Aerospace&rsquo;s tested turbine, certification and safety expertise for large-scale manufacturing and electrical power systems expertise.</p>\n\n<p>This hybrid solution will tap into existing infrastructure and capabilities, such as GE Aerospace&rsquo;s CT7 and T700 engines, and is expected to bring significant enhancements in range, payload and speed performance compared to other aircraft in the same segment.</p>\n\n<p>Additionally, GE Aerospace will make an equity investment of $300 million in Beta, subject to regulatory approval, aligned with its commitment to work with key industry players to advance technologies that will support the future of flight. In connection with this partnership, GE Aerospace will also have the right to designate a director to join Beta&rsquo;s board.</p>\n\n<p>GE Aerospace is advancing a suite of technologies for the future of flight, including integrated hybrid-electric propulsion systems and advanced engine architectures. Multiple milestones have been achieved over the last decade, including a 2016 ground test of an electric motor-driven propeller. In 2022, GE Aerospace completed the first test of a megawatt-class and multi-kilovolt hybrid-electric propulsion system in altitude conditions up to 45,000 feet that simulate single-aisle commercial flight.</p>\n\n<p>Beta&nbsp;itself has built up electric flight distance and hours flown,&nbsp;generating valuable, real-world data. Beta&rsquo;s aircraft are engineered for all-weather performance and have been tested to operate reliably in a wide range of environmental conditions across the U.S. and Europe.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ge-aerospace-beta-partner-on-hybrid-electric-flight-advancement"
      }
    ],
    "link": "https://www.compositesworld.com/news/ge-aerospace-beta-partner-on-hybrid-electric-flight-advancement"
  }
]