[
  {
    "published": "Fri, 18 Jul 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      18,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "Matlantis upgrades universal atomistic simulator for materials discovery, opens dedicated U.S. office",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Matlantis upgrades universal atomistic simulator for materials discovery, opens dedicated U.S. office"
    },
    "summary": "Training datasets for Matlantis&rsquo;&nbsp;core AI technology are now developed using r2SCAN, doubling accuracy in atomistic simulations compared to previous version&nbsp;while driving&nbsp;speed, elemental versatility&nbsp;and quantum-level accuracy.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Training datasets for Matlantis&rsquo;&nbsp;core AI technology are now developed using r2SCAN, doubling accuracy in atomistic simulations compared to previous version&nbsp;while driving&nbsp;speed, elemental versatility&nbsp;and quantum-level accuracy."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-matlantis.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Matlantic technology screenshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-matlantis.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Matlantis Inc.</p>\n</div>\n\n<p><a href=\"https://matlantis.com/en/\" target=\"_blank\">Matlantis Inc.</a>&nbsp;(Cambridge, Mass., U.S.),&nbsp;the U.S. hub of the materials discovery arm of Japan&rsquo;s AI company<a href=\"https://www.preferred.jp/en/\" target=\"_blank\"> Preferred Networks&nbsp;Inc.</a> (PFN, Tokyo) has announced an update to its&nbsp;Matlantis&nbsp;universal atomistic simulator, and the opening of its office in Cambridge, Massachusetts, both of which aim to accelerate the&nbsp;adoption of AI‑driven materials research across North America.</p>\n\n<p>Matlantis supports large-scale material discovery by reproducing new materials&rsquo; behavior at an atomic level on the computer.&nbsp;Launched in July 2021 as a cloud-based software-as-a-service (Saas), Matlantis is used by more than&nbsp;100 companies and organizations for discovering various materials including catalysts, batteries, semiconductors, alloys, lubricants, ceramics and chemicals. Its delivery of&nbsp;speed, elemental versatility&nbsp;and quantum-level accuracy also make it a&nbsp;powerful, flexible tool for composites manufacturers (<a href=\"#How can Matlantis support composites manufacturing?\" target=\"_self\">details below</a>).</p>\n\n<p>The recent update introduces Version 8 of PFN&rsquo;s AI technology named Preferred Potential (PFP), which&nbsp;the company says enables researchers across industries to accelerate discovery, improve predictive performance and unlock new frontiers in materials science with high&nbsp;levels of simulation accuracy.</p>\n\n<p>According to Matlantis, PFP 8.0 marks a significant milestone as the &ldquo;first&rdquo; universal machine learning interatomic potential (MLIP) to be trained with datasets developed with a method called r<sup>2</sup>SCAN (restored-regularized strongly constrained and appropriately normed) functional. PFP versions up to Version 7 previously relied on datasets generated with a method called Perdew-Burke-Ernzerhof (PBE)&nbsp;functional, which has also been widely adopted by MLIPs other than PFP. It is known, however, that PBE has certain limitations in simulation accuracy &mdash; how closely computer-based simulations of materials&rsquo;&nbsp;behavior align with real-world experimental results.</p>\n\n<p>The introduction of the r<sup>2</sup>SCAN method is the culmination of PFN&rsquo;s continuous efforts over the past couple of years to overcome the accuracy limitations of the PBE-based approach. Developing training datasets with the r<sup>2</sup>SCAN method is reported to be more computationally intensive, requiring three to five times the computing time compared to the PBE method. However, because PFP 8.0&nbsp;is now trained with the datasets built with r<sup>2</sup>SCAN as well as PBE, Matlantis users can achieve up to doubled the simulation accuracy in the same timeframe as the previous version.</p>\n\n<blockquote>\n<p>&ldquo;We believe this will further pave the way for the era of computer-based materials discovery,&rdquo; says Daisuke Okanohara, CEO of Matlantis.</p>\n</blockquote>\n\n<p>Matlantis enables research teams to:</p>\n\n<p><strong>Perform simulations from the first day of use. </strong>Provided as an Saas, users can access Matlantis via a browser and start searching for new materials. Because Matlantis&rsquo;&nbsp;MLIP&nbsp;has already been trained with massive datasets, users can immediately focus on material discovery without spending time building machine learning models.</p>\n\n<p><strong>Search a wide variety of undiscovered materials</strong>. As a universal atomistic simulator, Matlantis covers a wide variety of materials for batteries, semiconductors, catalysts and more, without the need of changing AI models depending on their types.</p>\n\n<p><strong>Accelerate materials discovery</strong>. Researchers can complete simulations in just a few hours that would otherwise require years of conventional DFT calculations. This speed-up transforms iterative design in materials discovery, reshaping the R&amp;D process so that computational insights lead experiments, instead of merely validating them afterward.</p>\n\n<p><strong>Achieve higher&nbsp;simulation accuracy.</strong>&nbsp;With the new training datasets built with the r<sup>2</sup>SCAN method, Matlantis can simulate material properties with higher accuracy than common MLIPs in the same timeframe, further narrowing the gap between simulations and experiments.</p>\n\n<div class=\"article_sidebar\">\n<h3><a id=\"How can Matlantis support composites manufacturing?\" name=\"How can Matlantis support composites manufacturing?\">How can Matlantis support composites manufacturing?</a></h3>\n\n<p>Matlantis PFP 8.0 supports everything from tailored fiber resin interfacial design to durability assessment and hybrid structure optimization, which can slash R&amp;D timelines, prototype cost&nbsp;and accelerate innovation in fiber-reinforced and honeycomb composites.</p>\n\n<p>More specifically, Matlantis can simulate complex architectures (such as fiber-matrix interfaces, damage progression and&nbsp;honeycomb tessellations) containing tens of thousands of atoms in seconds rather than months. This capability enables researchers to do virtual exploration of composite microstructures and interactions before committing to expensive experimental prototypes.</p>\n\n<p>The simulator can also model nearly any element, including those in carbon, glass and&nbsp;aramid fibers, metallic coatings, resin matrices&nbsp;and even core materials like aluminum honeycomb. Crucial interfacial phenomena like fiber sizing, resin adhesion&nbsp;or moisture uptake, can be accurately modeled at the atomic level, guiding surface treatments and coatings for better bonding.</p>\n\n<p>Finally, Matlantis accelerates hybrid R&amp;D workflows, evaluating wide ranges of fiber matrix combinations (such as carbon/epoxy, glass/vinyl ester, aramid with toughened resin and sandwich cores) computationally before physical testing. By narrowing down the most promising systems virtually, Matlantis reduces prototyping cycles and material waste &mdash;&nbsp;ideal for composites manufacturers aiming for faster time-to-market.</p>\n</div>\n\n<p>&ldquo;With PFP 8.0 we finally have an MLIP&nbsp;that keeps the best DFT‑level fidelity while spanning the most of periodic table,&rdquo; says&nbsp;Matlantis technical advisor professor&nbsp;Ju Li, Ph.D., widely recognized for his work on atomistic modeling and materials research. &ldquo;That accuracy‑plus‑speed combination lets engineers generate phase diagrams or screen multicomponent systems in hours or several days rather than weeks or months &mdash; work that directly informs alloy design, battery materials, and other high‑value applications. Establishing a U.S. office means we can collaborate even more closely with industrial and academic partners here, shorten feedback loops&nbsp;and bring new Matlantis capabilities to market faster.&rdquo;</p>\n\n<p>PFP 8.0 is developed using PFN&rsquo;s supercomputer and AI Bridge Cloud Infrastructure (ABCI) 2.0 and 3.0 provided by Japan&rsquo;s National Institute of Advanced Industrial Science and Technology (AIST) and AIST Solutions Co., Ltd. The use of ABCI 3.0 is supported by the ABCI 3.0 Development Acceleration Program.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/matlantis-upgrades-universal-atomistic-simulator-for-materials-discovery-opens-dedicated-us-office"
      }
    ],
    "link": "https://www.compositesworld.com/news/matlantis-upgrades-universal-atomistic-simulator-for-materials-discovery-opens-dedicated-us-office"
  },
  {
    "published": "Fri, 18 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      17,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "Joby expands California and Ohio manufacturing capacity, adds new aircraft to fleet",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Joby expands California and Ohio manufacturing capacity, adds new aircraft to fleet"
    },
    "summary": "Doubled space will enable production of 24 aircraft/year in Marina, ramp-up of renovated Dayton facility to&nbsp;manufacture and test aircraft components&nbsp;and produce&nbsp;500 aircraft/year.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Doubled space will enable production of 24 aircraft/year in Marina, ramp-up of renovated Dayton facility to&nbsp;manufacture and test aircraft components&nbsp;and produce&nbsp;500 aircraft/year."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-joby-marina-facility-expanded.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Joby’s new expanded facility in Marina, California.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-joby-marina-facility-expanded.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Joby&rsquo;s new expanded facility in Marina, California. Source | Joby Aviation.</p>\n</div>\n\n<p><a href=\"https://www.jobyaviation.com/\" target=\"_blank\">Joby Aviation</a> (Santa Cruz, Calif., U.S.) is expanding its manufacturing site&nbsp;in Marina, California, which will double its electric vertical takeoff and landing (eVTOL) aircraft production capacity at that location. The total site now spans approximately 435,500 square feet and will support the scale-up of commercial operations. Joby also expanded its flight test program with the addition of a new aircraft to its growing fleet.</p>\n\n<p>&ldquo;Reimagining urban mobility takes speed, scale&nbsp;and precision manufacturing. Our expanded manufacturing footprint in both California and Ohio is preparing us to do just that,&rdquo; says&nbsp;Eric Allison, chief product officer. &ldquo;We celebrated the opening of the new facility with the flight of our sixth aircraft, which earned airworthiness certification within a week of completion.&rdquo;&nbsp;</p>\n\n<p>The opening of the new manufacturing space is a big step forward as Joby gets ready to scale production and enter the market. Achieving this comes down to three key strengths:&nbsp;</p>\n\n<ul>\n\t<li>Drawing on talent at its California and Ohio facilities, Joby designs, builds&nbsp;and tests its aircraft in the U.S. Using tools like advanced data analytics and 3D printing, Joby produces components that are light, strong&nbsp;and flexible. With its newly expanded Marina facility, the company plans to add&nbsp;hundreds of full-time jobs&nbsp;to support increased aircraft production.</li>\n\t<li>Joby handles nearly every aspect of its aircraft and air taxi service in-house, from design and manufacturing to pilot training and operations. This vertical integration helps speed development, ensure quality&nbsp;and accelerate testing and certification. It also lets Joby quickly and efficiently adapt its platform for other uses, including&nbsp;hybrid&nbsp;hydrogen-electric&nbsp;propulsion testing.</li>\n\t<li>Toyota engineers are&nbsp;deeply integrated&nbsp;with the Joby team, providing counsel to support Joby&rsquo;s work across design, manufacturing&nbsp;and quality. Toyota also helps the Joby team optimize processes, streamline assembly and offer advice related to the development of custom tooling to accelerate production.</li>\n</ul>\n\n<p>Once fully operational, the expanded Marina site is expected to be able to produce up to 24 aircraft/year, which is nearly one every other week. It will also provide key capabilities including its initial FAA production certification, conforming ground and flight testing components, pilot training simulators and aircraft maintenance.</p>\n\n<p>This site strengthens Joby&rsquo;s broader manufacturing network, which includes three additional facilities: Santa Cruz, California, the headquarters driving innovation and system architecture; San Carlos, California, focused on powertrain and electronics; and&nbsp;Dayton, Ohio, <a href=\"https://www.compositesworld.com/news/joby-acquires-facility-in-ohio-scales-up-evtol-aircraft-manufacture\" target=\"_blank\">a newly renovated facility</a> that will manufacture and test aircraft components for Joby&rsquo;s&nbsp;Pilot Production Line. The Dayton site demonstrates the capabilities required for FAA production certification and supports the company&rsquo;s plans to scale operations. Equipment installation is underway, with production ramping up to eventually build up to 500 aircraft/year at that location.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/joby-expands-california-and-ohio-manufacturing-capacity-adds-new-aircraft-to-fleet"
      }
    ],
    "link": "https://www.compositesworld.com/news/joby-expands-california-and-ohio-manufacturing-capacity-adds-new-aircraft-to-fleet"
  },
  {
    "published": "Fri, 18 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      16,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "REGENT forms REGENT Defense, unveils defense seaglider product line",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "REGENT forms REGENT Defense, unveils defense seaglider product line"
    },
    "summary": "ISR, medevac and other maritime defense missions will be supported through the new line of&nbsp;high-speed, long-range, low-signature marine craft, which build off the company&rsquo;s composites-intensive Viceroy.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ISR, medevac and other maritime defense missions will be supported through the new line of&nbsp;high-speed, long-range, low-signature marine craft, which build off the company&rsquo;s composites-intensive Viceroy."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-regent-defense-seagliders.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Viceroy and Squire vessels.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-regent-defense-seagliders.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | REGENT Craft</p>\n</div>\n\n<p><a href=\"https://www.regentcraft.com/contact\" target=\"_blank\">Regional Electric Ground Effect Nautical Transport Craft Inc.</a>&nbsp;(REGENT, North Kingstown, R.I., U.S.), composites-intensive seaglider vessel developer and manufacturer, has announced the creation of REGENT Defense&nbsp;and unveiled a new product line of maritime craft designed&nbsp;for military applications. Complementing REGENT&rsquo;s $10 billion commercial backlog, the company will manufacture REGENT Defense seaglider vessels at its headquarters in Rhode Island.</p>\n\n<p>REGENT&rsquo;s hydrofoiling wing-in-ground-effect (WIG) seaglider design offers a combination of high-speed, long-range&nbsp;and low-signature capabilities &mdash; all at significantly reduced costs compared to legacy transportations solutions, the company reports. These advantages directly address the &ldquo;tyranny of distance&rdquo; often seen in littoral operations, where resupply and transport across vast ocean stretches has&nbsp;historically been difficult.</p>\n\n<p>As a Type A WIG craft, seaglider vessels operate exclusively over water within a wingspan of the water&rsquo;s surface, benefitting from the aerodynamic efficiencies of ground effect and remaining above sonar and below radar. This highly efficient, agile&nbsp;and low-signature design enables the craft to service a wide range of maritime defense missions, including:</p>\n\n<ul>\n\t<li>Troop and supply logistics</li>\n\t<li>Medical evacuation&nbsp; (medevac) and search and rescue</li>\n\t<li>Intelligence, surveillance&nbsp;and reconnaissance (ISR)</li>\n\t<li>Launched effects, including deployment of uncrewed systems from the seaglider vessel.</li>\n</ul>\n\n<p>&ldquo;We&rsquo;re building platforms engineered for maritime defense operations in contested and logistically complex maritime environments,&rdquo; says&nbsp;Tom Huntley, general manager of REGENT Defense.&nbsp;</p>\n\n<p>In addition to a defense version of REGENT&rsquo;s commercial all-electric, crewed <em>Viceroy</em> model, REGENT Defense is creating a product line of seaglider vessels that include a fully autonomous <em>Viceroy</em> vessel as well as hybrid versions, and a quarter-scale autonomous model called <em>Squire</em>.</p>\n\n<p>The <em>Viceroy</em>&nbsp;seaglider has a payload of 3,500 pounds&nbsp;and can travel at speeds up to 160 knots (180 miles per hour) for routes up to 160 nautical miles (180 miles) in the all-electric model and up to 1,400 nautical miles (1,600 miles) in the hybrid model. The autonomous hybrid <em>Squire</em> seaglider vessel has a payload of 50 pounds&nbsp;and can travel at speeds of up to 70 knots (80 miles per hour) for routes more than 100 nautical miles (115 miles).</p>\n\n<p>REGENT is a trusted partner of the U.S. Marine Corps, which continues to advance its strategic shift toward distributed maritime operations. In March 2025, REGENT announced a $10 million expanded collaboration with the Marine Corps Warfighting Lab through the second phase of a contract agreement to validate seaglider use cases across logistics, ISR, medevac, launched effects&nbsp;and other mission-critical areas.</p>\n\n<p>In addition to its work with the Marine Corps, REGENT has formalized development relationships with U.S. Special Operations Command (USSOCOM) and the U.S. Coast Guard Research and Development Center, supporting innovation in agile, next-generation maritime mobility.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/regent-forms-regent-defense-unveils-defense-seaglider-product-line"
      }
    ],
    "link": "https://www.compositesworld.com/news/regent-forms-regent-defense-unveils-defense-seaglider-product-line"
  },
  {
    "published": "Fri, 18 Jul 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      15,
      30,
      0,
      4,
      199,
      0
    ],
    "title": "Plasmatreat Technology Days 2025 celebrates 30 years of Openair-Plasma",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Plasmatreat Technology Days 2025 celebrates 30 years of Openair-Plasma"
    },
    "summary": "More than 200 guests accepted the Steinhagen-based family business&rsquo; invitation to discuss new applications of atmospheric plasma systems in surface pretreatment.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "More than 200 guests accepted the Steinhagen-based family business&rsquo; invitation to discuss new applications of atmospheric plasma systems in surface pretreatment."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechnologyDays-25.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Technology Days attendees aerial view.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechnologyDays-25.jpg;maxWidth=720\" /> </a></div>\n\n<p>Plasmatreat Technology Days 2025. Source (All Images) | Plasmatreat GmbH</p>\n</div>\n\n<p>July 2-3, 2025,&nbsp;<a href=\"https://www.compositesworld.com/suppliers/plastmatreat-gmbh\" target=\"_blank\">Plasmatreat GmbH</a> (Germany) celebrated the 30<sup>th</sup> anniversary of the patent application for its Openair-Plasma technology&nbsp;with Technology Days 2025 at its Steinhagen headquarters.&nbsp;Three decades ago, this process for pretreating surfaces with industrially compatible atmospheric plasma began Plasmatreat&rsquo;s advance, and has since optimized numerous industrial processes worldwide thanks to its process stability, efficiency, environmental friendliness&nbsp;and ease of integration into production environments. This was the focus of the high-profile event, where 200 guests, 16 industry partners and the international sales team were present.</p>\n\n<p>&ldquo;The future of plasma technology has only just begun &mdash; as has our journey together. We are still at the beginning,&rdquo; said&nbsp;Plasmatreat founder and CEO Christian Buske in his welcome speech.&nbsp;&ldquo;Our tool is ionized gas. All of our applications use this tool to modify the structure of surfaces of a variety of materials specifically. Our plasma technology provides countless possibilities for modifying the surfaces of plastics, metals, glass, cardboard, films, fibers, composites&nbsp;and recycled materials. We use plasma technology to give these materials special properties for further processing.&rdquo; These basic tasks include ultra-fine cleaning, activation, reduction&nbsp;and coatings for a wide range of industrial applications.</p>\n\n<blockquote>\n<p>Read &ldquo;<a href=\"https://www.compositesworld.com/articles/plasma-moves-beyond-improved-bonding-to-coatings-multifunctional-composites\">Plasma moves beyond improved bonding to coatings, multifunctional composites</a>&rdquo;</p>\n</blockquote>\n\n<p>&ldquo;Think ahead, experience innovation&rdquo;&nbsp;was the Technology Days motto. The agenda included a balanced mix of technical presentations, workshops&nbsp;and discussions at the exclusive partner exhibition. During workshops, Plasmatreat experts demonstrated how the company&rsquo;s solutions are used.</p>\n\n<h3>Technical lectures, presentations</h3>\n\n<p>Hans Beckhoff, Dr. Joerg Ihde from Fraunhofer IFAM, Dr. Alexander Stoppa from Irlbacher, Peter Auerbeck from GROB-Werken&nbsp;and Gunnar Melles from tesa organized and presented technical lectures at the Plasmatreat Technology Center. During their presentations, the experts discussed the latest trends in developing new products at their companies and explained how they use Plasmatreat solutions. Beckhoff provided insights into the latest automation innovations, while Stoppa spoke about hardware designs for glass-based HMIs in harsh industrial environments. Auerbeck and Melles focused their presentations on battery production for e-mobility.</p>\n\n<p>Eagerly awaited was the presentation by Buske. He reviewed the development history of Openair-Plasma technology, using the automotive industry as an example. The technology, he explained, originated from a joint project with a regional automotive supplier, in which both companies achieved a breakthrough in bonding headlights to polypropylene housings.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechDays-demo.jpg\" target=\"_blank\"><img alt=\"Plasmatreat demonstrations.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechDays-demo.jpg;maxWidth=385\" /></a></div>\n\n<p>Plasmatreat demonstrations.</p>\n</div>\n\n<p>&ldquo;Since then, we have collaborated closely with customers for over three decades to develop a wide range of solutions, from laboratory and standalone systems to fully automated lines,&rdquo; said Buske. &ldquo;Our portfolio of nozzles and nozzle heads alone includes many different variants for static or rotating systems for a variety of applications. This means that, even for new applications, we can often meet the requirements with existing solutions and minor adjustments.&rdquo;</p>\n\n<p>Plasmatreat technology is currently used in more than 100 automotive and battery production applications. &ldquo;Since development processes in the automotive industry are particularly sensitive and data-intensive, we now comply with TISAX standards for information security,&rdquo; added&nbsp;Buske. &ldquo;This is a logical step for us and a clear signal to our automotive industry partners: Plasmatreat is reliable in more ways than one.&rdquo;</p>\n\n<div class=\"article_sidebar\">\n<p>Plasmatreat&rsquo;s Technology Days 2025 exhibit area included 16 participating industry partners in the exhibitor area: Beckhoff Automation, Bodo M&ouml;ller&nbsp;Chemie, CeraCon, DreiBond Chemische Verbindungstechnik, Delo Industrieklebstoffe, Fraunhofer Institute for Manufacturing Technology and Applied Materials Research IFAM, HAHN Automation Group, Kr&uuml;ss, Tampoprint, OptiMel Schmelzgusstechnik, Hermann Otto, RAMPF Group, Sika Group, tesa, Venjakob Maschinenbau and Volz Selbstklebetechnik. Visitors found inspiration from these partners on how to optimize production and open new possibilities.</p>\n</div>\n\n<h3><strong>Hands-on workshop sessions</strong></h3>\n\n<p>Many visitors came to the workshops with ideas for new applications or drew inspiration from the examples of applications shown to optimize their companies&rsquo;&nbsp;production processes with Plasmatreat solutions.</p>\n\n<p>To enable efficient work in the interactive workshops, Plasmatreat surveyed guests&rsquo;&nbsp;main interests before the Technology Days. This enabled guests to be divided into smaller groups, so that each guest received an individual program at the beginning of the event.</p>\n\n<p>A total of eight workshops covered the current state and future of plasma technology in various application areas.</p>\n\n<p>The workshop, &ldquo;Perfect Images: Plasma for Demanding Printing Processes,&rdquo; in the PT-Print room at Plasmatreat&rsquo;s Technology Center&nbsp;is particularly noted. In addition to applications in packaging manufacturing and other areas, many participants found the production of a digitally printed, customized sports shoe to be a highlight of this workshop. The thermoplastic used in this process is activated with Openair-Plasma, which makes it ideal for printing with UV ink. Innovative nozzle technology in the form of a new nozzle for printing applications was also a focus.</p>\n\n<p>Another workshop, &ldquo;REDOX effect: Reduction to High-Performance Coatings,&rdquo; showed how oxidized and contaminated metal surfaces are cleaned in the semiconductor industry to meet the strictest standards for manufacturing electronic components. Plasma systems and reduction were also demonstrated live.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechDays-presentations.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Workshop attendance.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Plasmatreat-TechDays-presentations.jpg;maxWidth=720\" /> </a></div>\n</div>\n\n<p>The workshop, &ldquo;Cleaning Reimagined: From Openair-Plasma to HydroPlasma,&rdquo; showcased a Plasmatreat&nbsp;innovation that involves adding distilled water to a plasma jet, which enhances the plasma treatment&rsquo;s effectiveness. Using small metal plates contaminated with fingerprints, the experts demonstrated that HydroPlasma can reliably remove even the most stubborn contaminants, such as oils, salts&nbsp;and fats, without the use of wet chemistry and in a manner that can be verified with measuring instruments.</p>\n\n<p>As the title of another workshop in the main building, &ldquo;Innovative Technology and Forward-Looking Coatings,&rdquo; suggested, this event focused on PlasmaPlus PT-Bond, a technology that enables the application of ultra-thin coatings to materials by injecting gaseous precursors into plasma jets via plasma nozzles. The plasma, enriched in this way, then hits surfaces that were previously treated with Openair-Plasma technology, coating them with ultra-thin, transparent plasma polymer layers. These layers can include bonding agents for structural bonding, as well as barrier and insulation layers for corrosion protection. The workshop featured a thermoforming application in which sheet metal was coated with an ultra-thin protective layer instead of a film to prevent scratching. This is one example of many applications in which plasma technology can replace consumables, positively impacting operating costs and process sustainability.</p>\n\n<p>As was made increasingly clear in the technical presentations, assembly bonding is becoming the preferred joining technology in an ever-growing number of industrial sectors. Lukas Buske&rsquo;s example of the complete bonding of all car body elements demonstrated how far development has progressed in this area. Further impressive examples were discussed in the workshop, &ldquo;Plasma Meets Polymer: Efficient Activation for Maximum Adhesion&rdquo; in the Application Technology Laboratory.</p>\n\n<p>Corrosion protection was also the subject of a separate workshop, &ldquo;AntiCorr as a protective shield for surfaces.&rdquo; This workshop took place in Plasmatreat&rsquo;s contract service area, and demonstrated the process of cleaning and coating a customer&rsquo;s battery housing made of aluminum die-cast and continuous cast aluminum with AntiCorr. For this purpose, a robot equipped with an Openair-Plasma nozzle and a PlasmaPlus nozzle was used. This process effectively protected the battery tray against crevice corrosion while using minimal precursors.</p>\n\n<p>Plasmatreat&rsquo;s plasma technology is now used in electronics, medical, aerospace, packaging and battery manufacturing industries, as well as numerous other sectors. A decisive factor for the company&rsquo;s global customers is that Plasmatreat has a worldwide presence and is therefore close to them, with its representatives and approximately 320 employees.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/plasmatreat-technology-days-2025-celebrates-30-years-of-openair-plasma"
      }
    ],
    "link": "https://www.compositesworld.com/news/plasmatreat-technology-days-2025-celebrates-30-years-of-openair-plasma"
  },
  {
    "published": "Fri, 18 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      15,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "Mokon becomes U.S. distributor for orcinus temperature, flow manifolds",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Mokon becomes U.S. distributor for orcinus temperature, flow manifolds"
    },
    "summary": "Mokon&nbsp;will manufacture the enesty GmbH brand&rsquo;s&nbsp;orca and smartshark touch-free temperature and flow manifold devices, for use with select water systems, at its&nbsp;facility in Buffalo, New York.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Mokon&nbsp;will manufacture the enesty GmbH brand&rsquo;s&nbsp;orca and smartshark touch-free temperature and flow manifold devices, for use with select water systems, at its&nbsp;facility in Buffalo, New York."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-mokon-orcinus1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orcinus smartshark manifolds.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-mokon-orcinus1.png;maxWidth=720\" /> </a></div>\n\n<p>Orcinus smartshark system. Source | Mokon, enesty GmbH</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/mokon\" target=\"_blank\">Mokon</a> (Buffalo, N.Y., U.S.) a manufacturer of high-quality circulating liquid temperature control systems, announces a partnership with orcinus, a brand by <a href=\"https://enesty.org/en/produkte/\" target=\"_blank\">enesty GmbH</a> (Hartha, Germany) with a strong presence in&nbsp;Europe and Asia.&nbsp;Mokon will now lead distribution and production of the orcinus orca and orcinus smartshark <a href=\"https://www.mokon.com/products/orcinus/\" target=\"_blank\">temperature control systems</a> for the U.S. at its facility in Buffalo.</p>\n\n<p>Both manifold systems continuously monitor water flow rate and temperature, resulting in high&nbsp;component quality and more process control. The orcinus orca is characterized by double ultrasonic measurement and provides noncontact, accurate flow measurements, making the use of filters superfluous. The manifolds also:</p>\n\n<ul>\n\t<li>Reduce&nbsp;pressure drop</li>\n\t<li>Enable increased flow in individual circuits</li>\n\t<li>Increase a mold&rsquo;s cooling effect and heat exchange</li>\n\t<li>Reduce cooling time and thus&nbsp;cycle time</li>\n\t<li>Bring transparency to the process</li>\n\t<li>Increase process reliability</li>\n\t<li>Reduce maintenance costs for temperature control and molds</li>\n\t<li>Lower production costs.</li>\n</ul>\n\n<p>These manifolds can be used independently or as accessories with Mokon water temperature control systems.&nbsp;</p>\n\n<p>Mokon systems are used on many different composite applications, providing process solutions for industries including aerospace, automotive, medical and so on. For more than 70 years, the company has actively developed new products, refined existing designs and created custom-engineered solutions.&nbsp;</p>\n\n<p>The company&rsquo;s product line has grown significantly since introducing its first water temperature control system in 1955 to include heat transfer oil systems, portable and central chillers, pump tanks, cooling towers, blown film coolers, cold climate coolers, engineered and pre-engineered control panels, maintenance products and custom-designed/engineered systems.</p>\n\n<p>Mokon&rsquo;s circulating liquid heating and chilling equipment is all designed and manufactured in the U.S. Mokon is an ISO9001 and ISO14001-certified company.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/mokon-becomes-us-distributor-for-orcinus-temperature-flow-manifolds"
      }
    ],
    "link": "https://www.compositesworld.com/news/mokon-becomes-us-distributor-for-orcinus-temperature-flow-manifolds"
  },
  {
    "published": "Fri, 18 Jul 2025 10:30:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      14,
      30,
      0,
      4,
      199,
      0
    ],
    "title": "Performance with purpose: Celebrating National Composites Week 2025",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Performance with purpose: Celebrating National Composites Week 2025"
    },
    "summary": "Join the composites community Aug. 25-29, 2025, as we celebrate the power of performance-driven materials. Mark your calendar and help us amplify the message by promoting #CompositesPerformanceWithPurpose.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Join the composites community Aug. 25-29, 2025, as we celebrate the power of performance-driven materials. Mark your calendar and help us amplify the message by promoting #CompositesPerformanceWithPurpose."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/071725-cw-ncwlogo.jpg;maxWidth=385\" /></div>\nSource | <em>CW</em></div>\n\n<p>Since its launch in 2019, <a href=\"https://www.nationalcompositesweek.com/\" target=\"_blank\">National Composites Week</a> (NCW) has celebrated the innovation, impact and growth of the composites industry. Now in its sixth year, NCW continues to bring together manufacturers, fabricators, suppliers and partners for a weeklong celebration designed to raise awareness of how composites shape the world around us.</p>\n\n<p>This year&rsquo;s theme, &ldquo;Composites &mdash; Performance With Purpose,&rdquo; highlights how advanced materials and manufacturing technologies drive innovation and deliver durability, resilience and real-world value in a wide range of markets from aerospace and transportation to infrastructure and energy to sports and recreation.</p>\n\n<h2><strong>How can you participate?</strong></h2>\n\n<p>There are many ways to get involved and spotlight your company&rsquo;s role in the composites industry:</p>\n\n<ul>\n\t<li><strong>Host a virtual plant tour, open house or live demo</strong> to show off your capabilities.</li>\n\t<li><strong>Share your stories</strong>&nbsp;by highlighting your company&rsquo;s work and impact through blog posts, social media, newsletters or video.</li>\n\t<li><strong>Showcase a unique part or application</strong> made using composites, including behind-the-scenes production footage or photos.</li>\n\t<li><strong>Connect with STEM students</strong> at local colleges or universities to inspire the next generation of composites professionals.</li>\n\t<li><strong>Engage your employees</strong> &mdash; create materials they can share with family and friends to help spread the word about the exciting work they do.</li>\n</ul>\n\n<p>Need ideas or resources to get started? Download our <a href=\"https://www.nationalcompositesweek.com/download-ncw-assets\" target=\"_blank\"><strong>NCW Toolkit here</strong></a>&nbsp;for promotional materials, planning tips, press release templates&nbsp;and more.</p>\n\n<h2><strong>Get the word out</strong></h2>\n\n<p>Whether big or small, every effort counts. Don&rsquo;t forget to share your posts using hashtags&nbsp;</p>\n\n<ul>\n\t<li><strong>#NationalCompositesWeek</strong>&nbsp;&nbsp;</li>\n\t<li><strong>#CompositesPerformanceWithPurpose.</strong></li>\n</ul>\n\n<p>Make sure to also tag <strong>@CompositesWorld</strong> on Twitter, Facebook, Instagram or LinkedIn &mdash; we&rsquo;ll be highlighting and resharing your content throughout the week.</p>\n\n<p>Let&rsquo;s celebrate composites together!</p>\n\n<div class=\"article_sidebar\">\n<h3>Curious to know how<em> CW</em> celebrates NWC last year?&nbsp;</h3>\n\n<ul>\n\t<li><a href=\"https://www.compositesworld.com/articles/composites-reinvent-aerospace-aam\">Composites reinvent aerospace, AAM and space</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/composites-reinvent-infrastructure\">Composites reinvent infrastructure</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/composites-reinvent-energy\">Composites reinvent energy</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/composites-reinvent-automotive\">Composites reinvent automotive</a></li>\n\t<li><a href=\"https://www.compositesworld.com/articles/composites-reinvent-transportation\">Composites reinvent transportation</a></li>\n</ul>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/performance-with-purpose-celebrating-national-composites-week-2025"
      }
    ],
    "link": "https://www.compositesworld.com/news/performance-with-purpose-celebrating-national-composites-week-2025"
  },
  {
    "published": "Fri, 18 Jul 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      18,
      14,
      0,
      0,
      4,
      199,
      0
    ],
    "title": "Horizon Aircraft, ZeroAvia announce plans to explore hydrogen eVTOL propulsion",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Horizon Aircraft, ZeroAvia announce plans to explore hydrogen eVTOL propulsion"
    },
    "summary": "Horizon considers&nbsp;operational and practical technologies for the Cavorite X7 eVTOL&nbsp;with a focus on real-world implementation while building momentum toward&nbsp;certification and commercial readiness.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Horizon considers&nbsp;operational and practical technologies for the Cavorite X7 eVTOL&nbsp;with a focus on real-world implementation while building momentum toward&nbsp;certification and commercial readiness."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Horizon-CavoriteX7.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Cavorite X7 aircraft.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Horizon-CavoriteX7.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Horizon Aircraft, ZeroAvia</p>\n</div>\n\n<p><a href=\"https://www.zeroavia.com/\" target=\"_blank\">ZeroAvia</a>&nbsp;(Hollister, Calif., U.S. and Kemble, U.K.) and&nbsp;<a href=\"https://www.horizonaircraft.com/\" target=\"_blank\">New Horizon Aircraft Ltd.</a>&nbsp;(Toronto, Canada) have announced plans to work together on developing regional hydrogen-electric vertical takeoff and landing (eVTOL)&nbsp;air travel. Together, the companies will cooperate on exploring ZeroAvia&rsquo;s ZA600 hydrogen-electric powertrain for Horizon Aircraft&rsquo;s<em> <a href=\"https://www.compositesworld.com/news/horizon-aircraft-secures-84-million-strategic-investment\" target=\"_blank\">Cavorite X7</a></em><a href=\"https://www.compositesworld.com/news/horizon-aircraft-secures-84-million-strategic-investment\" target=\"_blank\"> eVTOL</a>&nbsp;(<em>CW</em> has reported extensively on the ZA600, see &ldquo;<a href=\"https://www.compositesworld.com/articles/zeroavia-advances-to-certify-za600-in-2025-launch-za2000-with-liquid-hydrogen-in-2027\" target=\"_blank\">ZeroAvia advances to certify ZA600 in 2025</a>...&rdquo; and &ldquo;<a href=\"https://www.compositesworld.com/news/zeroavia-receives-faa-g-1-for-600-kilowatt-electric-propulsion\" target=\"_blank\">ZeroAvia&nbsp;receives FAA G-1</a>...&rdquo;)</p>\n\n<p>The <em>Cavorite X7</em>&rsquo;s fan-in-wing design incorporates 14 lift fans providing the thrust for vertical takeoff, with sliding panels which hide the fans as the aircraft transitions from hover to wingborne flight and flies like a normal plane. For landing, it can use a normal runway, or the fans can be deployed to touchdown on a helipad, or an area the size of a tennis court.</p>\n\n<p>Horizon Aircraft has already performed untethered flight tests of a large-scale prototype, including demonstrating hover modes and transition to wingborne flight. The company has received backing from the U.S. Department of Defense and approvals for flight testing from the Canadian regulator.</p>\n\n<p>As well as investigating the integration of ZeroAvia&rsquo;s powertrain, the partnership will accelerate research into the necessary infrastructure and certification guidelines to unlock a zero-emission pathway for Horizon Aircraft.</p>\n\n<p>&ldquo;More and more eVTOL companies are looking to hydrogen-electric propulsion as the breakthrough that can extend range potential and durability of electric propulsion systems,&rdquo; explains Val Miftakhov, founder and CEO of ZeroAvia. &ldquo;Horizon Aircraft has developed an exciting application and performed successful prototype testing, and they are taking another leadership step in exploring hydrogen as a potential propulsion option.&rdquo;</p>\n\n<p>Brandon Robinson, CEO and co-founder at Horizon Aircraft, says the company has been impressed with&nbsp;ZeroAvia's recent flight demonstrations of hydrogen-electric propulsion systems and the company&rsquo;s traction with regulators.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/horizon-aircraft-zeroavia-announce-plans-to-explore-hydrogen-evtol-propulsion"
      }
    ],
    "link": "https://www.compositesworld.com/news/horizon-aircraft-zeroavia-announce-plans-to-explore-hydrogen-evtol-propulsion"
  },
  {
    "published": "Thu, 17 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      17,
      16,
      0,
      0,
      3,
      198,
      0
    ],
    "title": "Teijin Carbon Europe passes NADCAP audit",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Teijin Carbon Europe passes NADCAP audit"
    },
    "summary": "Accreditation for nonmetallic materials&nbsp;manufacturing and testing builds access to new markets, customer segments like aerospace.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Accreditation for nonmetallic materials&nbsp;manufacturing and testing builds access to new markets, customer segments like aerospace."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-teijincarbon-nadcap.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Teijin Carbon personnel hold up NADCAP banner.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-teijincarbon-nadcap.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | Teijin Carbon Europe</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/teijin-carbon-europe\" target=\"_blank\">Teijin Carbon Europe</a> (Wuppertal, Germany), a subsidiary of the Teijin Group (Tokyo, Japan)&nbsp;has successfully passed the National Aerospace and Defense Contractors Accreditation Program (NADCAP)&nbsp;audit and has been awarded accreditation for nonmetallic materials&nbsp;manufacturing and testing.</p>\n\n<p>NADCAP is the leading international program for auditing and accrediting special processes in the aerospace and defense industries. Managed by the Performance Review Institute (PRI), the audit applies demanding requirements in terms of process control, quality assurance&nbsp;and documentation.</p>\n\n<p>&ldquo;This achievement marks an important milestone for our company and underscores our commitment to technical excellence and high quality standards,&rdquo; says Jana Kubitz, head of aerospace marketing, EMEA. &ldquo;For our customers, NADCAP&nbsp;accreditation is a strong signal of our reliability and precision,&nbsp;especially for safety-critical applications.&rdquo;</p>\n\n<p>Teijin Carbon says the certification strengthens its position as a trusted partner for highly demanding industries worldwide, opening&nbsp;up access to new markets and customer segments,&nbsp;particularly in the aerospace sector.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/teijin-carbon-europe-passes-nadcap-audit"
      }
    ],
    "link": "https://www.compositesworld.com/news/teijin-carbon-europe-passes-nadcap-audit"
  },
  {
    "published": "Thu, 17 Jul 2025 09:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      17,
      13,
      0,
      0,
      3,
      198,
      0
    ],
    "title": "FibreCoat develops radar-absorbing fiber-reinforced composite",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FibreCoat develops radar-absorbing fiber-reinforced composite"
    },
    "summary": "Broadband, flexible material offers protection&nbsp;against radiation, heat and electromagnetic interference, and maintains&nbsp;performance across curved surfaces and slanted angles, outperforming existing materials by up to 100 times.&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Broadband, flexible material offers protection&nbsp;against radiation, heat and electromagnetic interference, and maintains&nbsp;performance across curved surfaces and slanted angles, outperforming existing materials by up to 100 times.&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-fibrecoat-materials-process.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"FibreCoat's composite material process.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-fibrecoat-materials-process.png;maxWidth=720\" /> </a></div>\n\n<p>Source | FibreCoat</p>\n</div>\n\n<p><a href=\"https://www.fibrecoat.de/\" target=\"_blank\">FibreCoat&nbsp;GmbH</a>&nbsp;(Aachen, Germany) announces the development of a fiber-reinforced composite material capable of&nbsp;making aircraft, tanks and spacecraft invisible to radar.&nbsp;Notably, the technology can be used in all of the ways FibreCoat&rsquo;s existing materials can be used &mdash;&nbsp;not just for military stealth, but to cover batteries and protect drivers in electric vehicles,&nbsp;reduce interference and cross-talk for aircraft and spacecraft,&nbsp;for construction applications and so on&nbsp;&mdash; providing manufacturers&nbsp;more design freedom.&nbsp;</p>\n\n<p>According to the company, the composite, still at the proof-of-concept stage, goes beyond traditional radar-shielding technology. Where existing solutions rely on reflecting radar waves, FibreCoat&rsquo;s&nbsp;thin and flexible radar-absorbing material (RAM)&nbsp;absorbs them. It uses bicomponent multifilament yarn dispersed in composites and is made from carefully engineered blends of PMMA, carbon nanotubes&nbsp;and Alucoat fillers. These are tuned for precise thicknesses (ranging from 0.5-6 millimeters) and for key radar frequency bands such as the X-band (8-12 gigahertz).</p>\n\n<p>The RAM has achieved reflection losses of up to -40 decibels, equivalent to 99.99% radar absorption. In addition, unlike many RAM solutions that degrade at angle,&nbsp;FibreCoat&rsquo;s multilayer composites are reported to maintain performance across curved surfaces and slanted radar exposure. In testing, they have achieved &ge; -10 decibel&nbsp;reflection loss up to 60 degrees&nbsp;in Transverse Electric (TE) mode and up to 45 degrees&nbsp;in Transverse Magnetic (TM) mode.</p>\n\n<p>Moreover, where current technologies&nbsp;typically require&nbsp;thick plating or specialized paints, and are narrowband (targeting only a single radar frequency), FibreCoat&rsquo;s solution is lightweight, flexible and broadband: absorbing radar across a wide spectrum of frequencies and outperforming existing materials by up to 100 times.</p>\n\n<p>The fiber-reinforced composite, a type of &ldquo;meta-material,&rdquo;&nbsp;is soon to be commercially available. The company has completed successful laboratory tests and measurements, and expects field testing to be complete this year. FibreCoat may offer the fiber&nbsp;to partners for integration into final products.</p>\n\n<p>&ldquo;Absorption opens up a range of new possibilities,&rdquo; says Dr Robert Br&uuml;ll, CEO of FibreCoat.&nbsp;&ldquo;We expect this fiber-reinforced composite to give the space, defense and automotive sectors more design freedom.&rdquo;</p>\n\n<p>FibreCoat, founded in Germany in 2020 but developing its materials since 2014, is known for inventing a novel technology to coat metals and plastics onto fibers via a fiber spinning process.&nbsp;FibreCoat&rsquo;s range of products offer strength, conductivity, shielding&nbsp;and recyclability. The company now employs 42 members of staff and has three production sites: Aachen, Germany; Rustavi, Georgia; and Gorlice, Poland.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fibrecoat-develops-radar-absorbing-fiber-reinforced-composite"
      }
    ],
    "link": "https://www.compositesworld.com/news/fibrecoat-develops-radar-absorbing-fiber-reinforced-composite"
  },
  {
    "published": "Wed, 16 Jul 2025 13:54:54 -0400",
    "published_parsed": [
      2025,
      7,
      16,
      17,
      54,
      54,
      2,
      197,
      0
    ],
    "title": "University research studies potential of bladeless wind turbines",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "University research studies potential of bladeless wind turbines"
    },
    "summary": "Insights from a new study from the University of Glasgow demonstrates how smaller-scale wind power generation, with designs achieved via&nbsp;computer modeling techniques, can scale up utility-grade systems.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Insights from a new study from the University of Glasgow demonstrates how smaller-scale wind power generation, with designs achieved via&nbsp;computer modeling techniques, can scale up utility-grade systems."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-aerialview-citygrid-GettyImages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerial view of a city grid by a river.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-aerialview-citygrid-GettyImages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>Engineers from the&nbsp;<a href=\"https://www.gla.ac.uk/\" target=\"_blank\">University of Glasgow</a> (Scotland) have performed a new study on&nbsp;the use of sophisticated computer simulations for&nbsp;bladeless wind turbines (BWTs) to identify how future generations of the technology could be built for maximum efficiency.&nbsp;According to researchers, findings could help BWTs, which are still at an early stage of R&amp;D, from small-scale field experiments to practical forms of power generation for national electricity grids. This work, titled &ldquo;<a href=\"https://www.sciencedirect.com/science/article/pii/S096014812501211X?via%3Dihub\">Performance analysis and geometric optimisation of bladeless wind turbines using wake oscillator model</a>,&rdquo; has been&nbsp;published in&nbsp;<em>Renewable Energy</em>.</p>\n\n<p>According to <em><a href=\"https://acmanet.org/bladeless-wind-turbines-offer-potential-for-efficient-renewable-energy-production/?utm_campaign=11454023-Industry%20Digest%202025&amp;utm_medium=email&amp;_hsenc=p2ANqtz--C0SskB4gEgmh1IaX4VX9upjyPzilfUslNm5AlXwv1kddjiPICfcdHb1q4J4nIQnkgITbE_Mndpnnm___yxdF1neyG_Q&amp;_hsmi=371201924&amp;utm_content=371201924&amp;utm_source=hs_email\" target=\"_blank\">Composites Manufacturing</a>,</em>&nbsp;BWTs&nbsp;&ldquo;consist of a cylinder built of resin-reinforced carbon fiber or glass fiber that is anchored to the ground by a rod&rdquo; and&nbsp;sways in the wind, like lampposts in inclement weather.&nbsp;As the wind blows against them, BWTs create vortices &mdash;&nbsp;alternating swirls of air that rock the entire structure back and forth.&nbsp;When the frequency of the rocking matches the structure&rsquo;s natural tendency to vibrate, the motion is amplified significantly, and the increased motion is converted into electricity. This process is called&nbsp;vortex-induced vibration.</p>\n\n<p>In its paper, the team shows how they used computer modeling techniques to simulate the performance of thousands of variations of BWT design. The results cast new light on the interplay between mast dimensions, power output&nbsp;and structural safety in winds between 20 and 70 miles per hour.</p>\n\n<p>Key findings include an&nbsp;optimal design for BWTs which creates a &ldquo;sweet spot&rdquo; that balances power generation with structural strength. The design, a 65-centimeter-diameter, 80-centimeter-tall mast, could safely deliver a maximum of 460 watts of power, significantly outpacing the performance of even the best-performing, real-world prototypes built to date, which have delivered a maximum of 100 watts.</p>\n\n<p>The team&rsquo;s&nbsp;model also demonstrated the limits of other designs, which could potentially generate more power, but wouldn&rsquo;t hold up to real-world conditions. In the paper, the University of Glasgow team&nbsp;illustrates&nbsp;how different designs of BWTs could, in theory, generate up to 600 watts, but at the cost of structural integrity.</p>\n\n<p>Ultimately, the team believes their methodology could provide the foundation for scaling up BWTs to utility-grade systems generating 1 kilowatt and beyond, making them much more practical for use by renewable energy providers.</p>\n\n<p>&ldquo;What this study shows for the first time is that, counter intuitively, the structure with the highest efficiency for extracting energy is&nbsp;not in fact the structure which gives the highest power output,&rdquo; explains the University of Glasgow&rsquo;s James Watt School of Engineering Dr. Wrik Mallik, one of the paper&rsquo;s authors. &ldquo;Instead, we have identified the ideal midpoint between the design variables to maximize the ability of BWTs to generate power while maintaining their structural strength. In the future, BWTs could play an invaluable role in generating wind power in urban environments, where conventional wind turbines are less useful. BWTs are quieter than wind turbines, take up less space, pose less of a threat to wildlife&nbsp;and have fewer moving parts, so they should require less regular maintenance.&rdquo;</p>\n\n<p>James Watt School of Engineering&rsquo;s professor Sondipon Adhikari,&nbsp;also one of the paper&rsquo;s authors, says they hope this research will help spur industry to develop new BWT design prototypes. &ldquo;Removing some of the guesswork involved in refining prototypes could help bring BWTs closer to becoming a more useful part of the world&rsquo;s toolbox for achieving net-zero through renewables,&rdquo; says&nbsp;Adhikari. &ldquo;We plan to continue refining our understanding of BWT design and how the technology can be scaled up to provide power across a wide range of applications. We&rsquo;re also keen to explore how metamaterials &mdash;&nbsp;specially designed materials which have been finely tuned to imbue them with properties not found in nature &mdash;&nbsp;could boost BWTs&rsquo; effectiveness in the years to come.&rdquo;</p>\n\n<p>James Watt School of Engineering master&rsquo;s student Janis Breen also contributed to the paper.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/university-research-studies-potential-of-bladeless-wind-turbines"
      }
    ],
    "link": "https://www.compositesworld.com/news/university-research-studies-potential-of-bladeless-wind-turbines"
  }
]