[
  {
    "published": "Fri, 21 Nov 2025 13:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      21,
      18,
      30,
      0,
      4,
      325,
      0
    ],
    "title": "EuCIA announces launch of Carbon Fiber Europe",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "EuCIA announces launch of Carbon Fiber Europe"
    },
    "summary": "Founding members Hexcel Composites SASU, Mitsubishi Chemical Europe, Toray and Teijin will promote and foster the use and application of carbon fiber within Europe through&nbsp;four strategic pillars.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Founding members Hexcel Composites SASU, Mitsubishi Chemical Europe, Toray and Teijin will promote and foster the use and application of carbon fiber within Europe through&nbsp;four strategic pillars."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-eucia-carbonfibereurope-founding-members.jpg;maxWidth=720\" /> </div>\n\n<p>From left to right: EuCIA&rsquo;s managing director, Rapha&euml;l Pleynet, and president, Roberto Frassine, with Nicole Kambeck, head of sustainability, Mitsubishi Chemical Europe; Hinrich Hampe, head of governmental affairs, Teijin Carbon Europe; Raf Bussels, senior director EMEA R&amp;D &bull; R&amp;D, Mitsubishi Chemical Group; Claude Despierres, VP sustainability and business development, Hexcel; Kristian Seidel, managing director, Teijin Automotive Technologies Wuppertal GmbH; Axel Leuchter, head of EU sustainability group, Teijin Ltd; Ota Kenjiro, CEO EACC; and Eisuke Wadahara, president of EACC, Toray Industries. Source | Carbon Fiber Europe.</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://eucia.eu/\" target=\"_blank\">European Composites Industry Association</a>&nbsp;(EuCIA,&nbsp;Brussel, Belgium) has launched&nbsp;Carbon Fiber Europe, a new alliance dedicated to supporting the sustainable growth of Europe&rsquo;s carbon fiber industry. The founding members of the alliance include&nbsp;<a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel Composites SASU</a>&nbsp;(Dagneux, France), <a href=\"https://eu.mitsubishi-chemical.com/\" target=\"_blank\">Mitsubishi Chemical Europe</a> (Moritzburg, Germany), <a href=\"https://www.compositesworld.com/suppliers/teijin-limited\" target=\"_blank\">Teijin Ltd.</a> (Tokyo, Japan)&nbsp;and <a href=\"https://www.compositesworld.com/suppliers/toray-industries\" target=\"_blank\">Toray Industries</a> (Tokyo, Japan).</p>\n\n<p>Carbon Fiber Europe&rsquo;s mission is to promote the positive contributions and innovative power of European carbon fiber products to society and to foster their safe and sustainable use within Europe. The alliance will&nbsp;pursue these goals through activities based around four strategic pillars:</p>\n\n<ul>\n\t<li>Advocacy and&nbsp;Representation</li>\n\t<li>Sustainability and&nbsp;Circularity</li>\n\t<li>Innovation and&nbsp;Standards</li>\n\t<li>Health and&nbsp;Safety.</li>\n</ul>\n\n<p>At a recent meeting in Brussels, Belgium, alliance members elected Raf Bussels, senior director EMEA R&amp;D &bull; R&amp;D&nbsp;at Mitsubishi Chemical Group as the chair of Carbon Fiber Europe, and Axel Leuchter, head of EU sustainability group, Teijin Ltd.,&nbsp;as vice chair.</p>\n\n<p>&ldquo;Carbon fiber is an integral part of Europe&rsquo;s composites industry and it is essential for realizing the EU Clean Industrial Deal&rsquo;s objectives for decarbonization, innovation and industrial resilience,&rdquo; says Roberto Frassine, president of EuCIA. &ldquo;We are committed to assisting Carbon Fiber Europe members in their efforts to reinforce carbon fiber&rsquo;s role in Europe&rsquo;s sustainable industrial development.&rdquo;</p>\n\n<p>Carbon Fiber Europe will also advance environmentally and socially responsible production practices, promote circular economy models&nbsp;and support the reduction of carbon footprint across the carbon fiber value chain, including end-of-life management. It will promote best practices and science-based safety guidelines to ensure the protection of workers, users&nbsp;and the environment.</p>\n\n<p>The alliance is currently defining its priority actions and Working Group structure. A Carbon Fiber Europe website will be launched soon.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/eucia-announces-launch-of-carbon-fiber-europe"
      }
    ],
    "link": "https://www.compositesworld.com/news/eucia-announces-launch-of-carbon-fiber-europe"
  },
  {
    "published": "Fri, 21 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      21,
      18,
      0,
      0,
      4,
      325,
      0
    ],
    "title": "CFM International reaches milestones for LEAP engine maturity",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CFM International reaches milestones for LEAP engine maturity"
    },
    "summary": "CFM LEAP-1A engines are ramping up quickly for Airbus A320neos with over 1,200 HPT kits and 50% RBS installations, targeting similar upgrades for LEAP-1B on the Boeing 737 Max by 2026.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "CFM LEAP-1A engines are ramping up quickly for Airbus A320neos with over 1,200 HPT kits and 50% RBS installations, targeting similar upgrades for LEAP-1B on the Boeing 737 Max by 2026."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-cfm-leap-engine-closup.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"LEAP engine blade close-up.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-cfm-leap-engine-closup.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | CFM International</p>\n</div>\n\n<p><a href=\"https://www.cfmaeroengines.com/\" target=\"_blank\">CFM International</a> (Cincinnati, Ohio, U.S.) continues to make progress rolling out maturity improvements to CFM LEAP-1A engines for Airbus A320neo family aircraft. Likewise, the company continues progress toward introducing similar systems in 2026 for the CFM LEAP-1B engines that power Boeing 737 <em>Max&nbsp;</em>aircraft.&nbsp;&nbsp;</p>\n\n<p>For LEAP-1A engines, CFM has produced more than 1,200 high-pressure turbine (HPT) durability kits in less than a year since certification in December 2024. This includes new production engines and durability kits delivered to overhaul shops. CFM and its maintenance, repair and overhaul (MRO)&nbsp;partners and operators have also installed the reverse bleed system (RBS) on nearly 50% of LEAP-1A engines in service.&nbsp;&nbsp;</p>\n\n<p>For LEAP-1B engines, CFM expects the U.S. Federal Aviation Administration (FAA) to grant engine-level, part 33 certification for the RBS shortly. CFM is working closely with Boeing to introduce the RBS and HPT durability kit to 737 <em>Max</em>&nbsp;operators in 2026. &nbsp;</p>\n\n<p>With more than 4,000 aircraft delivered to date, CFM LEAP engines have experienced &ldquo;the fastest ramp in commercial aviation history.&rdquo;&nbsp;Advanced technologies like composite fan blades and ceramic matrix composites (CMC) deliver an engine that&rsquo;s 15% more fuel efficient, with 15% lower carbon emissions than prior-generation CFM56 engines. Backed by advanced health monitoring systems and an open MRO ecosystem, CFM LEAP engines offer mature reliability and enable high asset utilization for narrowbody aircraft. &nbsp;</p>\n\n<p>&ldquo;The LEAP engine family is maturing much faster than its predecessor,&rdquo; says Ga&euml;l M&eacute;heust, president and CEO of CFM International. &ldquo;With these updates, we are now refining the hardware to deliver more durability while reducing the maintenance burden for A320neo family operators. As a result, they benefit not only from the efficiency, reliability&nbsp;and utilization LEAP engines deliver, but also from more predictable operations and longer time on wing.&rdquo;&nbsp;&nbsp;</p>\n\n<p>CFM designed the HPT durability kit to increase time between shop visits, with the ability to more than double time on wing in severe environments. The improved hardware will help bring time between shop visits in line with its predecessor, the CFM56 engine, which has set industry standards for long time on wing. CFM is delivering all new and overhauled LEAP-1A engines with the kit, including engines going through both CFM and premier MRO shops.&nbsp;&nbsp;</p>\n\n<p>Similarly, CFM designed the RBS to reduce the need for on-wing fuel nozzle replacements and bring maintenance needs in line with CFM56 standards. The company is shipping RBS kits to all CFM shops, approved third-party providers and operators that have completed the required training at one of CFM&rsquo;s four technical education centers in the U.S., France, India&nbsp;and China.&nbsp;&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cfm-international-reaches-milestones-for-leap-engine-maturity"
      }
    ],
    "link": "https://www.compositesworld.com/news/cfm-international-reaches-milestones-for-leap-engine-maturity"
  },
  {
    "published": "Fri, 21 Nov 2025 11:59:00 -0500",
    "published_parsed": [
      2025,
      11,
      21,
      16,
      59,
      0,
      4,
      325,
      0
    ],
    "title": "Tidal turbine project builds double-sided, 3D printed composite tool for blade development",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Tidal turbine project builds double-sided, 3D printed composite tool for blade development"
    },
    "summary": "Collaborative project with Thermwood successfully prints 2-meter-long tidal turbine blade mold in days versus months, with the now-manufactured hybrid blade in testing and extended trials.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaborative project with Thermwood successfully prints 2-meter-long tidal turbine blade mold in days versus months, with the now-manufactured hybrid blade in testing and extended trials."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-thermwood-tidal-scaled-down-prototype-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Diagram of a scaled-down prototype tidal turbine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-thermwood-tidal-scaled-down-prototype-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Diagram of a scaled-down prototype tidal turbine. Source (All Images) | Thermwood Corp.</p>\n</div>\n\n<p dir=\"ltr\">A collaboration between <a href=\"https://www.compositesworld.com/suppliers/thermwood\" target=\"_blank\">Thermwood Corp.</a> (Dale, Ind., U.S.), the <a href=\"https://www.lsamresearchatpurdue.com/\" target=\"_blank\">LSAM Research Laboratory at Purdue University</a> (Lafayette, Ind., U.S.), the <a href=\"https://sheffield.ac.uk/\" target=\"_blank\">University of Sheffield</a> (U.K.) and the <a href=\"https://www.ox.ac.uk/\" target=\"_blank\">University of Oxford</a> (U.K.) is targeting the advancement of tidal energy manufacturing through the joint development and demonstration of a double-sided large-scale additively manufactured (LSAM) mold for producing 2-meter-long tidal turbine blades.</p>\n\n<p dir=\"ltr\">Initiated at JEC World 2025, the project is now <a href=\"https://www.youtube.com/watch?v=vP8NJLHp0VY&amp;embeds_referring_euri=https%3A%2F%2Fwww.thermwood.com%2F&amp;source_ve_path=OTY3MTQ\" target=\"_blank\">actively progressing</a> toward transforming how large-scale tooling is designed and manufactured for tidal energy.&nbsp;</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-thermwood-additive3d-physics-simulation.png\" target=\"_blank\"><img alt=\"Additive3D physics-based simulation of the tidal blade mold tool.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-thermwood-additive3d-physics-simulation.png;maxWidth=385\" /></a></div>\n\n<p>Additive3D&nbsp;physics-based simulation of the tidal blade mold.</p>\n</div>\n\n<p dir=\"ltr\">Purdue University&rsquo;s Additive3D simulation platform was used to predict and optimize the printing process for the double-sided mold, which is made of carbon fiber-reinforced polycarbonate (PC). The physics-based virtual twin models temperature evolution, postprocessing effects and mold performance &mdash; including heat treatment, material removal and anisotropic shape compensation. Additive3D&rsquo;s predictive capability ultimately provides confidence in LSAM projects, enabling precise control of tooling for high-performance composite production.&nbsp;</p>\n\n<p dir=\"ltr\">Following printing, Sheffield&rsquo;s Advanced Manufacturing Research Centre (AMRC) performed precision machining to incorporate sensor placements, blade root locator mounts and resin inlet/outlet features.&nbsp;</p>\n\n<p dir=\"ltr\">The completed two-sided mold tool supports single-shot infusion of carbon fiber reinforcement around a central blade core structure, enabling fabrication of a blade with optimal structural efficiency and reduced manufacturing time.&nbsp;</p>\n\n<blockquote>\n<p dir=\"ltr\">At JEC 2025, Thermwood&rsquo;s LSAM 510 3D printed both sides of this carbon fiber-reinforced polycarbonate (PC) mold live on-site.</p>\n</blockquote>\n\n<p dir=\"ltr\">Mold development was followed by the development of the 2-meter tidal turbine blade, which features a hybrid configuration: A stainless steel root transitioning into a polycarbonate core with a carbon fiber-reinforced polymer (CFRP) skin. This design provides mechanical integrity at the root while minimizing weight and maximizing efficiency along the blade span.&nbsp;</p>\n\n<p dir=\"ltr\">Embedded sensors &mdash; including fiber optic sensing, strain gauges, thermocouples and accelerometers &mdash; will deliver real-time structural monitoring, offering critical insight into manufacturing quality, operational performance and structural health.&nbsp;</p>\n\n<p>Next, the blade will undergo fatigue testing at the <a href=\"https://www.compositesworld.com/news/fastblade-partnership-leads-to-rapid-composite-tidal-blade-facility-testing\">University of Edinburgh&rsquo;s FastBlade facility</a>, followed by extended sea trials with a scaled turbine system. These trials will generate valuable data on durability, structural performance and environmental loading.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/tidal-turbine-project-builds-double-sided-3d-printed-composite-tool-for-tidal-blade-development"
      }
    ],
    "link": "https://www.compositesworld.com/news/tidal-turbine-project-builds-double-sided-3d-printed-composite-tool-for-tidal-blade-development"
  },
  {
    "published": "Fri, 21 Nov 2025 11:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      21,
      16,
      0,
      0,
      4,
      325,
      0
    ],
    "title": "UK CAA design organization approval progresses ZeroAvia ZA600 powertrain",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "UK CAA design organization approval progresses ZeroAvia ZA600 powertrain"
    },
    "summary": "Civil Aviation Authority accreditation confirms ability to comply with certification requirements in bid for hydrogen-electric aviation engine type certification.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Civil Aviation Authority accreditation confirms ability to comply with certification requirements in bid for hydrogen-electric aviation engine type certification."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-zeroavia.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-zeroavia.png;maxWidth=720\" /> </a></div>\n\n<p>Source | ZeroAvia</p>\n</div>\n\n<p><a href=\"https://www.zeroavia.com/\" target=\"_blank\">ZeroAvia</a>&nbsp;(Kemble, U.K. and Everett, Wash., U.S.) has been awarded design organization approval&nbsp;(DOA) by the UK Civil Aviation Authority (CAA), a critical milestone on its path to certifying a hydrogen-electric engine intended for Part 23 aircraft. The accreditation confirms that the CAA is satisfied that ZeroAvia has the technical expertise, facilities and capabilities to design safe and reliable products, and is prepared to comply with stringent requirements for certification.</p>\n\n<p>ZeroAvia reports that, through this award, it has &ldquo;become the first company globally seeking to certify a hydrogen-electric aviation powertrain to receive DOA accreditation from a national regulator.&rdquo; The award confirms that a manufacturer is qualified to design and hold a type certificate (TC) for propulsion systems developed under commercial aviation regulations. These requirements are intended to ensure safe global market entry and have been adopted by other regulatory authorities, including the EASA and the FAA.&nbsp;</p>\n\n<p>Securing DOA represents an essential enabler toward&nbsp;the company&rsquo;s goal of securing a type certificate for the ZA600 &mdash; a&nbsp;600-kilowatt&nbsp;powertrain which uses fuel cells to generate electricity from hydrogen.</p>\n\n<p>Achieving DOA status follows two other significant regulatory milestones for ZeroAvia in 2025, with the U.S. FAA&nbsp;issuing both <a href=\"https://www.compositesworld.com/news/zeroavia-receives-faa-g-1-for-600-kilowatt-electric-propulsion\" target=\"_blank\">G-1</a> and P-1 issue papers in relation to ZeroAvia&rsquo;s bid to certify its 600-kilowatt&nbsp;electric propulsion system (EPS). The 600-kilowatt EPS is made up of the company&rsquo;s motor and power electronics technology and is both an integral part of the overall ZA600 hydrogen-electric powertrain, and a power-source agnostic electric engine in its own right, with a range of applications.&nbsp;</p>\n\n<p>Earlier this year, ZeroAvia&nbsp;also confirmed that RVL Aviation, an airline in Derby,&nbsp;intends to be the first operator to fly the ZA600 engine in a Cessna <em>Caravan</em> 208b on cargo routes in the U.K. The company is also working to scale the hydrogen-electric propulsion technology for larger segments of aircraft and has secured thousands of engine pre-orders with airlines across the world.&nbsp;</p>\n\n<p>The company has established a range of test facilities at its U.K. R&amp;D and flight testing center at Cotswold Airport, enabling an efficient testing program&nbsp;to satisfy the means of compliance that it is in the process of agreeing with the CAA. After rigorous inspection of the facilities, interviews with ZeroAvia&rsquo;s team and audit of its process, the CAA was able to award the DOA.&nbsp;&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/uk-caa-design-organization-approval-progresses-zeroavia-za600-powertrain"
      }
    ],
    "link": "https://www.compositesworld.com/news/uk-caa-design-organization-approval-progresses-zeroavia-za600-powertrain"
  },
  {
    "published": "Fri, 21 Nov 2025 10:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      21,
      15,
      30,
      0,
      4,
      325,
      0
    ],
    "title": "Volocopter to launch European eVTOL sandbox program in 2026 featuring VoloCity, VoloXPro",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Volocopter to launch European eVTOL sandbox program in 2026 featuring VoloCity, VoloXPro"
    },
    "summary": "Program to accelerate certification and operational readiness for eVTOL and ultralight aircraft through real-world flight trials.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Program to accelerate certification and operational readiness for eVTOL and ultralight aircraft through real-world flight trials."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Volocopter and ADAC leaders.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-volocopter.jpg;maxWidth=720\" /> </div>\n\n<p>Left to right: David Bausek, CTO Volocopter Technologies GmbH; Aaron Erd, project lead Multicopter ADAC Luftrettung GmbH; Ulrich Amersdorffer, CEO ADAC Heliservice GmbH. Source | Volocopter GmbH</p>\n</div>\n\n<p dir=\"ltr\">On Nov. 18, <a href=\"https://www.volocopter.com/\" target=\"_blank\">Volocopter</a> (Bruschal, Germany) announced plans to launch a European sandbox program in 2026 to advance testing of its electric advanced air mobility (AAM) aircraft &mdash; the&nbsp;<em>VoloCity</em>&nbsp;and the&nbsp;<em>VoloXPro</em>&nbsp;&mdash; under near-commercial operation conditions. The initiative will feature a series of flight trials simulating real-world operations.</p>\n\n<p dir=\"ltr\">The sandbox will validate operational readiness and support type certification (TC) for both aircraft through point-to-point missions. These trials will replicate key aspects of future AAM services, including flight procedures, ground operations and passenger experience for VoloCity, as well as operational use cases for VoloXPro in urban and regional mobility.&nbsp;</p>\n\n<p dir=\"ltr\">As part of this initiative, Volocopter&rsquo;s long-standing partner&nbsp;<a href=\"https://luftrettung.adac.de/\" target=\"_blank\">ADAC Luftrettung</a> (Munich, Germany)&nbsp;will collaborate on select missions, exploring potential applications of electric vertical takeoff and landing (eVTOL) technology for emergency medical services and lays the basis for ADAC Luftrettung&rsquo;s upcoming pilot trials, which will begin in selected regions.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;This sandbox is the final stretch toward making electric air taxis and ultralight aircraft a reality in Europe,&rdquo;&nbsp;says&nbsp;David Bausek, CTO at Volocopter.&nbsp;&ldquo;Testing <em>VoloCity</em> and <em>VoloXPro</em> in real-world environments with trusted partners like ADAC Luftrettung ensures we&rsquo;re ready for commercial launch.&rdquo;&nbsp;</p>\n\n<p><em>Volocopter was acquired by Diamond Aircraft in March 2025. Read more: &ldquo;<a href=\"https://www.compositesworld.com/news/diamond-aircraft-acquires-volocopter-after-insolvency\" target=\"_blank\">Diamond Aircraft acquires Volocopter after insolvency</a>.&rdquo;</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/volocopter-to-launch-european-evtol-sandbox-program-in-2026-featuring-volocity-voloxpro-"
      }
    ],
    "link": "https://www.compositesworld.com/news/volocopter-to-launch-european-evtol-sandbox-program-in-2026-featuring-volocity-voloxpro-"
  },
  {
    "published": "Fri, 21 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      21,
      15,
      0,
      0,
      4,
      325,
      0
    ],
    "title": "Rocket Lab-built twin composites-intensive spacecraft begin Mars journey",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Rocket Lab-built twin composites-intensive spacecraft begin Mars journey"
    },
    "summary": "As part of the ESCAPADE mission to Mars, Rocket Lab worked collaboratively with NASA and&nbsp;UC Berkeley&nbsp;to meet an aggressive 3.5-year timeline from design to launch.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "As part of the ESCAPADE mission to Mars, Rocket Lab worked collaboratively with NASA and&nbsp;UC Berkeley&nbsp;to meet an aggressive 3.5-year timeline from design to launch."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-rocketlabs-explorer-spacecraft.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Explorer-class satellite vehicles.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-rocketlabs-explorer-spacecraft.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Rocket Lab Corp.</p>\n</div>\n\n<p><a href=\"https://rocketlabcorp.com/\" target=\"_blank\">Rocket Lab Corp.</a> (Long Beach, Calif., U.S.) announced the success launch of its two Explorer-class spacecraft for NASA (Washington, D.C., U.S.) and the University of California Berkeley&rsquo;s Space Sciences Laboratory (Oakland, U.S.), beginning their journey to Mars to study the red planet&rsquo;s magnetosphere. NASA&rsquo;s&nbsp;Escape and Plasma Acceleration and Dynamics Explorers (ESCAPADE) mission was launched by Blue Origin on Nov. 13, from Cape Canaveral Space Force Station at 3:55 p.m. EST.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>ESCAPADE will allow scientists to understand how the solar wind strips ions from Mars&rsquo; atmosphere, offering insight into the planet&rsquo;s atmospheric escape history and space weather environment, and informing future human exploration strategies.</p>\n</div>\n</div>\n\n<p>Rocket Lab has successfully established contact with the spacecraft, which are generating power. Now in orbit, the spacecraft will undergo commissioning by Rocket Lab&rsquo;s spacecraft operations team in the coming days, beginning with early checkouts including orientation stabilization and solar array deployment, followed by commissioning of flight computers, multiple antenna, guidance and navigation sensors and actuators, and the propulsion system leading up to the mission&rsquo;s first maneuvers.</p>\n\n<p>Rocket Lab&rsquo;s&nbsp;Explorer-class spacecraft platform&nbsp;is a high delta-V, interplanetary member of its advanced satellite family, which includes Photon, Pioneer and Lightning. According to a <a href=\"https://rocketlabcorp.com/updates/new-blog-post-16/\" target=\"_blank\">2024 blog post on the subject</a>, Rocket Lab says, &ldquo;The spacecraft share many common components and subsystems, designed and manufactured in-house by Rocket Lab, including carbon [fiber] composite structures, star trackers, reaction wheels, solar arrays, radios, separation systems, avionics, flight and ground software.&rdquo;</p>\n\n<p>From contract award to launch, ESCAPADE moved from design to spacecraft completion in just 3.5 years &mdash; an aggressive timeline for a Mars mission. This was made&nbsp;possible by the company&rsquo;s vertically integrated supply chain, which brings production entirely in-house.</p>\n\n<p>&ldquo;Mars missions have historically been measured in decades and come with price tags in the billions or hundreds of millions. With this mission we&rsquo;re bringing Mars closer, proving real interplanetary science can be done faster and more cost-effectively to unlock the solar system,&rdquo; says&nbsp;Sir Peter Beck, founder and CEO of Rocket Lab. &ldquo;ESCAPADE is a major first, not just for Rocket Lab, but for commercial interplanetary science.&rdquo;</p>\n\n<p>Now in orbit, a complex and extended journey begins for Blue and Gold, with trajectory design led by Advanced Space LLC (Westminster, Colo., U.S.). The alignment between Earth and Mars does not currently allow ESCAPADE to use a traditional direct-to-Mars transfer. Instead, ESCAPADE will launch into a &ldquo;loiter&rdquo; (or &ldquo;Earth-proximity&rdquo;) orbit that loops around Earth&rsquo;s Lagrange point 2 (about a million miles from Earth, opposite the Sun) until the next planetary alignment window. Once the planets have reached the ideal alignment in fall 2026, the ESCAPADE spacecraft will use an Earth gravity assist to begin the journey to Mars.</p>\n\n<p>Throughout the mission, Rocket Lab and UC Berkeley spacecraft operators will command the spacecraft to conduct deep-space maneuvers, known as trajectory correction maneuvers (TCMs). The TCMs will boost the spacecraft&rsquo;s energy to reach Mars and provide navigation control to target their unique orbit insertion corridors. The spacecraft are scheduled to arrive at Mars in September 2027. The spacecraft will begin to transition to their first science formation in 2028.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/rocket-lab-built-twin-composites-intensive-spacecraft-begin-mars-journey"
      }
    ],
    "link": "https://www.compositesworld.com/news/rocket-lab-built-twin-composites-intensive-spacecraft-begin-mars-journey"
  },
  {
    "published": "Wed, 19 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      18,
      0,
      0,
      2,
      323,
      0
    ],
    "title": "FACC AG increases revenue in Q3 2025, anticipates €1 billion by year-end",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FACC AG increases revenue in Q3 2025, anticipates €1 billion by year-end"
    },
    "summary": "Revenue is up 8.6% compared to the same period in 2024, and the highest FACC has seen since its founding. Cost reduction operations and efficiency enhancement programs continue to maintain the company&rsquo;s efficiency.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Revenue is up 8.6% compared to the same period in 2024, and the highest FACC has seen since its founding. Cost reduction operations and efficiency enhancement programs continue to maintain the company&rsquo;s efficiency."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-facc-quality-workmanship-general-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"FACC Academy student.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-facc-quality-workmanship-general-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Highly qualified employees perform quality work at FACC. In the FACC Academy, the company focuses on comprehensive training and further education of the crew. Source |&nbsp;FACC/Gortana</p>\n</div>\n\n<p>In the first 9 months of the 2025 financial year,&nbsp;<a href=\"https://www.facc.com/en/\" target=\"_blank\">FACC</a>&nbsp;(Ried im Innkreis, Austria) reports that it&nbsp;achieved revenue growth of 8.6%, reaching&nbsp;&euro;697.6 million. Reported earnings (EBIT) amounted to &euro;21.5 million in the reporting period (comparable period 2024: &euro;21.8 million) and continue to be impacted by disruptions in international supply chains and material cost increases.</p>\n\n<p>The aviation industry continued its long-standing and constant growth course of recent years in Q3 2025. Due to long-term contracts with all major manufacturers, FACC AG was able to benefit from this development in Q3 as well. The company&rsquo;s achieved revenue is the highest in this period since FACC was founded (1989). The goal of the entire aviation industry is to continue on this growth course and to support the demand of airlines with a continuous ramp-up of production rates.</p>\n\n<p>FACC&rsquo;s cost-cutting and efficiency-enhancing program, which has been in place since autumn 2024, is showing initial success. In FACC Academy, <a href=\"https://www.compositesworld.com/news/facc-academy-launches-begins-training-and-onboarding-operations\" target=\"_blank\">which was&nbsp;established in 2024</a>, more than 2,700 participants have taken&nbsp;part in a total of 257 courses and production training. As a result of these trainings, the number of employees at FACC was&nbsp;kept almost the same as in the same period of the previous year (+76 FTE),&nbsp;while increasing revenue.</p>\n\n<p>Targeted implementation of the cost reduction and efficiency enhancement program continues to be the top priority of FACC&rsquo;s management team, with a focus on further increasing efficiency in operations, compensating for global inflation effects and restructuring the supply chain to reduce the sharp rise in material costs, especially in Europe. In addition, despite increased revenue, there are first sustainable positive effects in the reduction of safety inventories and thus an improvement in cash flow, FACC AG reports.</p>\n\n<p>Based on current customer forecasts, FACC management expects revenue for the 2025 financial year to be around &euro;1 billion, which corresponds to a growth target of more than 10%. The operating result (EBIT) will continue to increase as planned and will be between 4-5% at group level (EBIT margin). The forecast for the financial year is based on the premise that there will be no change in the currently known global conditions.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/facc-ag-increases-revenue-in-q3-2025-anticipates-1-billion-by-year-end"
      }
    ],
    "link": "https://www.compositesworld.com/news/facc-ag-increases-revenue-in-q3-2025-anticipates-1-billion-by-year-end"
  },
  {
    "published": "Wed, 19 Nov 2025 12:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      17,
      30,
      0,
      2,
      323,
      0
    ],
    "title": "OCSiAl to develop Luxembourg graphene nanotube hub",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "OCSiAl to develop Luxembourg graphene nanotube hub"
    },
    "summary": "Aiming to make it the largest in the world, the $300 million flagship facility will serve as a scalable, energy-efficient manufacturing center for European advanced materials.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Aiming to make it the largest in the world, the $300 million flagship facility will serve as a scalable, energy-efficient manufacturing center for European advanced materials."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ocsial.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ocsial.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | OCSiAl LLC</p>\n</div>\n\n<p>Deep-tech company <a href=\"https://www.compositesworld.com/suppliers/ocsial\" target=\"_blank\">OCSiAl&nbsp;LCC</a> (Leudelange,&nbsp;Luxembourg) has signed a&nbsp;land lease launching the development of its&nbsp;flagship graphene nanotube production center in&nbsp;Differdange, Luxembourg, which will become what the company plans to be the &ldquo;world&rsquo;s largest&rdquo;&nbsp;graphene nanotube production facility.</p>\n\n<p>This official announcement&nbsp;is&nbsp;a&nbsp;culmination of a years-long effort by the company and the Luxembourg government, including an&nbsp;investment round&nbsp;raised&nbsp;from a &ldquo;club&rdquo; of&nbsp;Luxembourg-based&nbsp;investors&nbsp;and the&nbsp;signing&nbsp;with the state of Luxembourg&nbsp;of a long-term land lease for a 3.63-hectare site&nbsp;in Differdange.</p>\n\n<p>Founded in 2010, OCSiAl is a large producer of graphene nanotubes,&nbsp;ideal for enhancing the mechanical, electrical, optical&nbsp;and thermal properties of<strong>&nbsp;</strong>fiber-reinforced composites. OCSiAl&rsquo;s nanotubes, currently produced only in Serbia, where the company is increasing production capacity fourfold, are already used in more than 10% of smartphones sold today and in more than one million electric vehicles worldwide.&nbsp;</p>\n\n<p>&ldquo;Graphene nanotubes can improve over half of the materials we use every day, from safer batteries to longer-lasting tires and ultralight protective equipment,&rdquo; says&nbsp;Alain Kinsch,&nbsp;a member&nbsp;of the&nbsp;OCSiAl board of directors. &ldquo;We thank the Luxembourg government for enabling this project through the land lease and for fostering an environment where innovation and industrial ambition can thrive.&rdquo;</p>\n\n<p>With a planned investment of $300 million and creation of more than 300 new jobs, the facility, to be launched in stages from 2028-2030, will strengthen Europe&rsquo;s role in the global advanced materials value chain and serve as a development hub for engineers and scientists.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ocsial-to-develop-luxembourg-graphene-nanotube-hub"
      }
    ],
    "link": "https://www.compositesworld.com/news/ocsial-to-develop-luxembourg-graphene-nanotube-hub"
  },
  {
    "published": "Wed, 19 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      17,
      0,
      0,
      2,
      323,
      0
    ],
    "title": "Joby eVTOL moves toward final stages of certification, builds global AAM framework",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Joby eVTOL moves toward final stages of certification, builds global AAM framework"
    },
    "summary": "Propeller blade manufacturing in Dayton facility, final stages of&nbsp;FAA type certification and the creation&nbsp;of Middle Eastern air taxis services.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Propeller blade manufacturing in Dayton facility, final stages of&nbsp;FAA type certification and the creation&nbsp;of Middle Eastern air taxis services."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-joby-propeller-blade-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-joby-propeller-blade-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>A propeller blade for Joby&rsquo;s aircraft in the manufacturing process at its Dayton, Ohio facility. Layers of high strength carbon fiber are applied to achieve precise design specifications. Source | Joby Aviation</p>\n</div>\n\n<p>Since <em>CW</em>&rsquo;s last report on electric vertical takeoff and landing (eVTOL) aircraft manufacturer <a href=\"https://www.jobyaviation.com/\" target=\"_blank\">Joby Aviation</a> (Santa Cruz, Calif., U.S.) in August 2025, the company has continued to rapidly lay the groundwork for the start of commercial flights in early 2026 (specifically in Dubai). Milestones include beginning power-on testing of its first conforming S4 aircraft on Nov. 5, and new commitments with the Middle East, including plans for an&nbsp;air taxi service in Saudi Arabia and updates to Dubai&rsquo;s aircraft network development (Joby received exclusive rights <a href=\"https://www.compositesworld.com/news/joby-to-launch-evtol-aircraft-service-in-the-uae\" target=\"_blank\">to fly in Dubai</a> in 2024), joining the U.S., the U.K., Japan and South Korea.</p>\n\n<h3>Propeller manufacturing begins</h3>\n\n<p>At the end of October 2025, Joby began&nbsp;manufacturing propeller blades <a href=\"https://www.compositesworld.com/news/joby-expands-california-and-ohio-manufacturing-capacity-adds-new-aircraft-to-fleet\" target=\"_blank\">at its Dayton, Ohio facility</a>, which further supports eVTOL&nbsp;aircraft production ahead of commercial launch.&nbsp;&ldquo;Joby&rsquo;s propeller blades are a key part of what makes our aircraft special &mdash;&nbsp;central to its low acoustic profile and the result of a decade of complex engineering,&rdquo; says Eric Allison, chief production officer at Joby.&nbsp;</p>\n\n<p>Designed for quiet flight and built with extreme precision, the propeller blades require complex carbon fiber manufacturing processes and a highly skilled workforce, both available in Dayton. With five blades per propeller and 30 per aircraft, production could reach up to 15,000 blades a year as part of Joby&rsquo;s plan to scale in Ohio. Conforming blades &mdash;&nbsp;those meeting all requirements for FAA inspection and certification &mdash;&nbsp;are expected to be completed this&nbsp;month, with installation on flight test aircraft targeted for 2026.</p>\n\n<p>Over time, Joby&rsquo;s Dayton footprint is expected to be able to support production of up to 500 aircraft a year, making this facility a strategic site for the mass production of its aircraft components.</p>\n\n<h3>Path to commercialization</h3>\n\n<p>On Nov. 5, Joby began power-on testing of the first of several Federal Aviation Administration (FAA)-conforming aircraft&nbsp;to be built for type inspection authorization (TIA). This enables the company to begin conducting&nbsp;thousands of hardware and software integration tests in preparation for &ldquo;for credit&rdquo; flight testing with FAA test pilots operating the aircraft. TIA testing is part of the final stage of the FAA type certification (TC) process &mdash; with&nbsp;flight testing by Joby pilots expected to start later in 2025, ahead of FAA pilots taking the controls in 2026.</p>\n\n<p>During TIA testing, Joby will be working side-by-side with the FAA to ensure the aircraft meets all safety and performance requirements. The testing includes performance validation, control and handling, and maintenance and operations. Data collected&nbsp;during these TIA tests will be used by the FAA to make its final determination on issuing a TC&nbsp;for Joby&rsquo;s aircraft.</p>\n\n<h3>Building services in Saudi Arabia</h3>\n\n<p>On Nov. 12, Joby and the&nbsp;General Authority of Civil Aviation (GACA, Riyadh) of the Kingdom of Saudi Arabia announced a memorandum of understanding (MOU) that will use FAA&nbsp;certification standards as a foundation to create a streamlined approval process for Joby&rsquo;s aircraft in Saudi Arabia.</p>\n\n<p>To support the development of the Kingdom&rsquo;s&nbsp;air taxi regulatory framework, Joby and GACA will focus on three core initiatives based on Joby&rsquo;s FAA certification efforts:</p>\n\n<ul>\n\t<li>Provide technical expertise across type design, production&nbsp;and operational domains to inform the development of a comprehensive regulatory framework that ensures the safe, efficient&nbsp;and scalable deployment of advanced air mobility (AAM) aircraft within the Kingdom.</li>\n\t<li>Collaboration on airworthiness standards, ensuring an efficient validation process of the FAA TC.</li>\n\t<li>Development and harmonization of key regulations to enable the initial phase of operations, including pilot licensing, maintenance&nbsp;and airspace integration frameworks.</li>\n</ul>\n\n<p>Joby&rsquo;s broader commercialization strategy in Saudi Arabia includes key partnerships with&nbsp;Abdul Latif Jameel, which is exploring delivery of up to 200 Joby aircraft valued at approximately $1 billion, and&nbsp;Aloula&nbsp;Aviation (formerly&nbsp;Mukamalah Aviation), the aviation subsidiary of Saudi Aramco. The announcement also builds on the renewed economic partnership between the U.S. administration and the Saudi government.</p>\n\n<h3>Dubai air taxi network takes flight</h3>\n\n<p>On Nov. 17, the&nbsp;next three vertiports to be added to Dubai&rsquo;s&nbsp;electric air taxi network, alongside Dubai&rsquo;s Road and Transport Authority (RTA) and Skyports Infrastructure, were announced.&nbsp;The sites &mdash;&nbsp;at the American University of Dubai, Atlantis the Royal and the Dubai Mall&nbsp;&mdash;&nbsp;will enable Joby to deliver high-speed, emissions-free connections between some of Dubai&rsquo;s most high-profile destinations, as part of its 6-year exclusive agreement with the RTA to establish air taxi services in the Emirate.&nbsp;</p>\n\n<p>The news came&nbsp;as Joby successfully completed a landmark flight test in the UAE on Nov. 9. Joby landed its aircraft at Al Maktoum International Airport (DWC) following a 17-minute piloted flight from its test facility in Margham, underscoring Joby&rsquo;s commercial market readiness and ability to operate in shared airspace.</p>\n\n<p>Alongside the vertiport at Dubai International Airport, which is set to be completed in Q1 2026, these sites will make up the initial vertiport network for Joby&rsquo;s air taxi service in Dubai, which is set to launch in 2026.&nbsp;</p>\n\n<div class=\"article_sidebar\">\n<h3>Joby Q3 2025 financial highlights</h3>\n\n<p><strong>Final stage of certification.</strong>&nbsp;Joby has begun power-on testing of the first of several FAA-conforming aircraft to be built for TIA.</p>\n\n<p><strong>Maturing flight operations.</strong>&nbsp;The company&nbsp;has already conducted more than&nbsp;600 flights in 2025, along with thousands of ground-based tests.&nbsp;</p>\n\n<p><strong>U.S. administrative support for the eVTOL.&nbsp;</strong>The eVTOL Integration Pilot Program (eIPP) is designed to allow mature aircraft designs to demonstrate eVTOL use cases ahead of achieving TC. Joby is actively engaged with a wide range of state and local governments across the country who are submitting applications for eIPP projects.</p>\n\n<p><strong>Scaling production capacity.&nbsp;</strong>Joby added more than 100 manufacturing roles and has now begun production of propeller blades at its facility in Dayton, Ohio, marking the first phase of its scaled production strategy. The company has already produced 15 times more type design conforming parts than it did in all of 2024.</p>\n\n<p><strong>Commercial readiness.&nbsp;</strong>The <a href=\"https://www.compositesworld.com/news/joby-preps-conforming-aircraft-for-tia-flight-testing-acquires-blade-air-mobility\" target=\"_blank\">recently-acquired Blade passenger service</a> transported approximately 40,000 passengers during Q3. Joby also expanded its global partnership with Uber to incorporate Blade&rsquo;s services directly into the Uber app.</p>\n\n<p><strong>Future technology platform.</strong>&nbsp;Just 3 months after announcing its partnership with L3Harris, Joby began <a href=\"https://www.jobyaviation.com/news/joby-celebrates-first-flight-of-turbine-electric-demonstrator-aircraft/\" target=\"_blank\">ground testing the hybrid-electric autonomous aircraf</a>t it is developing for U.S. defense purposes. Joby also successfully demonstrated its autonomous flight technology, Superpilot, during a major defense exercise over the Pacific Ocean.&nbsp;</p>\n\n<p><strong>Strong balance sheet.&nbsp;</strong>Joby ended the quarter with $978.1 million in cash, cash equivalents&nbsp;and investments in marketable securities. Additionally, in October 2025, the company completed an underwritten equity offering. Net proceeds from the offering were approximately $576 million and are expected to be used to support certification and manufacturing efforts, prepare for commercial operations&nbsp;and provide general working capital and other corporate purposes.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/joby-evtol-moves-toward-final-stages-of-certification-builds-global-aam-framework"
      }
    ],
    "link": "https://www.compositesworld.com/news/joby-evtol-moves-toward-final-stages-of-certification-builds-global-aam-framework"
  },
  {
    "published": "Wed, 19 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      19,
      17,
      0,
      0,
      2,
      323,
      0
    ],
    "title": "ILCA, Greenboats chart environmentally responsible one-design dinghy racing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ILCA, Greenboats chart environmentally responsible one-design dinghy racing"
    },
    "summary": "Organization ILCA is pairing up with natural fiber innovators like Greenboats to reduce environmental footprint while maintaining the class&rsquo; strict one-design principles.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Organization ILCA is pairing up with natural fiber innovators like Greenboats to reduce environmental footprint while maintaining the class&rsquo; strict one-design principles."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-greenboats-icla.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-greenboats-icla.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Greenboats</p>\n</div>\n\n<p>The <a href=\"https://ilcasailing.org/\" target=\"_blank\">International Laser Class Association</a> (ILCA, Austin, Texas, U.S.), a&nbsp;World Sailing Olympic Class organization that coordinates and oversees the ILCA dinghy activities worldwide,&nbsp;and natural fiber composites company <a href=\"https://www.green-boats.com/\" target=\"_blank\">Greenboats GmbH</a> (Bremen, Germany) have announced an&nbsp;ongoing strategic partnership to explore and develop environmentally responsible innovation within ILCA dinghy&rsquo;s production. This collaboration builds on the <a href=\"https://www.compositesworld.com/articles/evolving-natural-fiber-technology-to-meet-industry-sustainability-needs\" target=\"_blank\">long- standing sustainability work</a> of both organizations and reflects a shared objective: to reduce the ILCA dinghy&rsquo;s environmental footprint while maintaining the fairness, integrity and legacy of ILCA one-design racing.</p>\n\n<p>Sailing is intrinsically connected to nature, yet the industry and equipment rely heavily on petroleum-based composites with significant carbon impacts. Builders, sailors&nbsp;and regulators are increasingly seeking sustainable solutions; yet innovation must preserve the class&rsquo;s strict one-design principles to protect fairness and performance while leveraging on the power of the long established legacy of the class.</p>\n\n<p>Together, ILCA and Greenboats are launching a two-track initiative:</p>\n\n<ul>\n\t<li>1.&nbsp;<strong>Long-term vision.</strong>&nbsp;Develop a low-emission ILCA concept that reimagines dinghy construction for the future.</li>\n\t<li>2.&nbsp;<strong>Incremental innovation.</strong>&nbsp;In the near term, trial sustainable materials on isolated areas of the boat or on smaller components of the equipment with a vision of adopting innovation in a stepped approach.</li>\n</ul>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ilca2024.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ilca2024.jpg;maxWidth=385\" /></a></div>\n\n<p>ILCA 7 Mens World Championship 2024. Source | Down Under Sail</p>\n</div>\n\n<p>Greenboats will lead technical research, supply chain&nbsp;and co-manufacture of prototypes, while ILCA will ensure rigorous life cycle assessments, compliance with&nbsp;the relevant authorities and alignment with class governance as well as ILCA-approved builders and suppliers. The key functioning pillars for this partnership are:</p>\n\n<p><strong>Collaboration.</strong>&nbsp;ILCA and Greenboats teams will work together to identify, evaluate, engineer and develop solutions and implementation roadmaps for various material replacement initiatives with the ultimate aim to reduce the net emissions of an ILCA dinghy,&nbsp;part by part. This work will expand on what has been researched and documented by masters student Lucca Günther on his Greenboats- and ILCA-supported Masters thesis project delivered earlier in 2025.</p>\n\n<p><strong>Governance alignment.</strong>&nbsp;Any proposed innovations will be reviewed to ensure compliance with the ILCA Build Manual and Class Rules and undergo the Class&rsquo; Approval Processes engaging with its Builders and World Sailing.</p>\n\n<p><strong>Stakeholder engagement:</strong>&nbsp;Builders, sailors, material suppliers&nbsp;and regulators will be included through initiatives, dedicated stakeholder forums and&nbsp;feedback protocols to gather real feedback and ensures innovation is relevant and impactful where it really matters. Both ILCA and&nbsp;Greenboats will keep stakeholders informed via newsletters and appearances at key events.</p>\n\n<p><strong>Collaboration network.</strong>&nbsp;Greenboats will leverage its supplier base and 15 years of biocomposites innovation, while ILCA ensures class-wide coordination and transparency.</p>\n\n<p>ILCA members and the global sailing community are invited to follow progress, share feedback&nbsp;and participate in upcoming sustainability webinars. Material suppliers with innovative bio-based solutions are encouraged to contact ILCA or Greenboats for potential collaboration. Initial findings will be presented at upcoming industry events and webinars.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ilca-greenboats-chart-environmentally-responsible-one-design-dinghy-racing"
      }
    ],
    "link": "https://www.compositesworld.com/news/ilca-greenboats-chart-environmentally-responsible-one-design-dinghy-racing"
  }
]