[
  {
    "published": "Fri, 23 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      23,
      17,
      0,
      0,
      4,
      143,
      0
    ],
    "title": "Tech-Fab Europe publishes LCA study on glass fiber fabrics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Tech-Fab Europe publishes LCA study on glass fiber fabrics"
    },
    "summary": "The association&rsquo;s study reveals the&nbsp;benefits of strengthening European supply chain for glass fiber fabrics to help decarbonize in line with EU net-zero targets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The association&rsquo;s study reveals the&nbsp;benefits of strengthening European supply chain for glass fiber fabrics to help decarbonize in line with EU net-zero targets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-techfab-fiberglass-lca.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"LCA report cover.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-techfab-fiberglass-lca.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Tech-Fab Europe</p>\n</div>\n\n<p><a href=\"https://tech-fab-europe.eu/\" target=\"_blank\">Tech-Fab Europe</a>&nbsp;(Frankfurt, Germany), the association for European technical textiles producers and a&nbsp;member of EuCIA (Brussels, Belgium), has published a life cycle assessment (LCA) study on glass fiber fabrics. This publication clearly highlights the environmental benefits of building a strong European supply chain for these products, citing that a robust glass fiber supply chain is&nbsp;essential to enable European manufacturers to create sustainable composites solutions for numerous markets.</p>\n\n<p>The new report, &ldquo;Life cycle assessment of glass fibre fabrics,&rdquo; was produced as part of a Tech-Fab Europe project to develop association-level LCAs of key technical textiles products. The cradle-to-gate analysis was performed by PwC. Tech-Fab&nbsp;Europe&rsquo;s members represent approximately 95% of the European production of glass fiber fabrics.</p>\n\n<p>The study revealed a few key findings:</p>\n\n<ul>\n\t<li>From raw material extraction to the factory gate, producing 1 kilogram of glass fiber&nbsp;fabric in Europe generates, on average, greenhouse gas emissions of 2.21 kilograms of CO<sub>2</sub>eq and a primary energy demand of 39 megajoules.</li>\n\t<li>The majority of the impact is driven by the production of glass fiber, which accounts for 89% of the carbon footprint of the final product.</li>\n\t<li>European composites manufacturers can significantly reduce their environmental impacts by using glass fiber&nbsp;fabrics produced in Europe.</li>\n</ul>\n\n<p>&ldquo;From wind energy, construction&nbsp;and automotive, to sports and leisure&nbsp;and more, composite products based on glass fiber&nbsp;fabrics are enabling numerous industries to decarbonize in line with EU net-zero targets,&rdquo; explains&nbsp;R&eacute;mi Bagard, glass fiber&nbsp;fabrics expert and member of the Tech-Fab Europe Sustainability Working Group. &ldquo;This LCA further demonstrates the sustainability of Europe&rsquo;s glass fabric industry and reinforces the need to support its continued growth and competitiveness. Our customers can also feed this data into their own LCA calculations as they strive to design more sustainable composite products.&rdquo;</p>\n\n<p>The report can be requested by emailing&nbsp;<a href=\"https://communication@tech-fab-europe.eu\" target=\"_blank\">communication@tech-fab-europe.eu</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/tech-fab-europe-publishes-lca-study-on-glass-fiber-fabrics"
      }
    ],
    "link": "https://www.compositesworld.com/news/tech-fab-europe-publishes-lca-study-on-glass-fiber-fabrics"
  },
  {
    "published": "Fri, 23 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      23,
      14,
      0,
      0,
      4,
      143,
      0
    ],
    "title": "Damen, CEAD explore composite 3D printing potential via HDPE Workboat project",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Damen, CEAD explore composite 3D printing potential via HDPE Workboat project"
    },
    "summary": "Dutch innovators collaborate to investigate large-format 3D printing for functional shipbuilding at the recently opened Maritime Application Center.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Dutch innovators collaborate to investigate large-format 3D printing for functional shipbuilding at the recently opened Maritime Application Center."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-damen-hdpe-workboat-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-damen-hdpe-workboat-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>HDPE Workboat. Source | CEAD, Damen Shipyards Group</p>\n</div>\n\n<p>Damen Compact Crafts (DCCr, Gorinchem, Netherlands), part of the <a href=\"https://www.damen.com/\" target=\"_blank\">Damen Shipyards Group</a>, and <a href=\"https://www.compositesworld.com/suppliers/cead-bv\" target=\"_blank\">CEAD B.V.</a> (Delft, Netherlands)&nbsp;are launching a collaboration to develop a 3D printed HDPE Workboat (HWB) using CEAD&rsquo;s HDPro fiber-reinforced composite material. The project will take place at CEAD&rsquo;s <a href=\"https://www.compositesworld.com/news/cead-launches-the-maritime-application-center-dedicated-to-industrial-3d-printing-boat-hulls\" target=\"_blank\">Maritime Application Center (MAC)</a> in Delft, which was &ldquo;founded to accelerate exactly these kinds of innovations.&rdquo; Through this initiative, the two Dutch companies are joining forces to explore the potential of large-format additive manufacturing (LFAM) for the maritime industry.</p>\n\n<p>With this project, Damen aims to investigate how 3D printing technology can contribute to the faster, more sustainable&nbsp;and more flexible production of functional vessels. The HWB is being designed as a versatile vessel, suitable for a wide range of operations, including inspection, support, patrol&nbsp;and logistical tasks. By 3D printing the hull of the boat, not only is more design freedom achieved, but it also opens the possibility of integrating recycled and renewable materials.</p>\n\n<p>For this project, CEAD contributes its expertise in large-format 3D printing and is developing print technologies capable of processing optimal HDPE blends. The project serves as a prime example of how technological innovation and market knowledge can reinforce one another.</p>\n\n<p>&ldquo;Innovation and standardization are part of our DNA at Damen,&rdquo; notes Nick Pruissen, managing director at DCCr. &ldquo;3D printing allows us to respond more quickly and flexibly to what our customers really need.&rdquo; The success of the 3D printed HWB could open the door to broader applications of additive manufacturing in shipbuilding.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/damen-cead-explore-composite-3d-printing-potential-via-hdpe-workboat-project"
      }
    ],
    "link": "https://www.compositesworld.com/news/damen-cead-explore-composite-3d-printing-potential-via-hdpe-workboat-project"
  },
  {
    "published": "Thu, 22 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      22,
      16,
      0,
      0,
      3,
      142,
      0
    ],
    "title": "SPE honors Greg McCunn for 2025 Lifetime Achievement Award",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "SPE honors Greg McCunn for 2025 Lifetime Achievement Award"
    },
    "summary": "McCunn is honored for his professional accomplishments and support of the thermoforming&nbsp;composites industry throughout his career in automotive and beyond.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "McCunn is honored for his professional accomplishments and support of the thermoforming&nbsp;composites industry throughout his career in automotive and beyond."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-spe-thermoforming-gregmccunn-lifetimeachievementaward-min.png\" target=\"_blank\"><img alt=\"Greg McCunn headshot.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-spe-thermoforming-gregmccunn-lifetimeachievementaward-min.png;maxWidth=385\" /></a></div>\n\n<p>Greg McCunn. Source | SPE Thermoforming Division</p>\n</div>\n\n<p>The <a href=\"https://thermoformingdivision.com/\" target=\"_blank\">Society of Plastics Engineers (SPE) Thermoforming Division</a>&nbsp;announces that this year&rsquo;s Lifetime Achievement Award goes to&nbsp;Greg McCunn, staff engineer for materials at John Deere (Moline, Ill., U.S.).&nbsp;The Division&rsquo;s executive committee presented the award to him May 20, 2025, during SPE&rsquo;s Thermoforming Awards Dinner at the Renaissance Atlanta Waverly Hotel in Atlanta, Georgia.</p>\n\n<p>McCunn began his career in the plastics industry in 1991 as an injection molder supplier to Jeep, which soon after became part of Chrysler. Over the next 7 years, McCunn was involved in eight Chrysler/Jeep product launches, and the molding facilities expanded from one factory with 29 presses to three factories with 53 presses.&nbsp;</p>\n\n<p>In 1997, he moved to John Deere as a quality/manufacturing engineer and joined the styling team &ldquo;re-skinning&rdquo; the combine harvester in composites. Later in the buyer role, McCunn learned about purchasing and the company&rsquo;s plastics suppliers. John Deere does not produce plastics and composite-based products, relying on suppliers. Throughout his career, four of McCunn&rsquo;s hand-selected suppliers have won John Deere&rsquo;s Achieve Excellence Annual Supplier Awards.</p>\n\n<p>In 2000, John Deere initiated strategic sourcing to unify the buying communities between John Deere units and simplify the John Deere supply base. In 2002, McCunn joined the strategic sourcing group as a supply base manager for composites. For the next 9 years, he led decision focus efforts and selected sources for composite styling projects throughout John Deere agriculture factories. The mission consisted of pairing the John Deere project engineer with the appropriate material and process for each application. Materials and processes are supplier-specific, so McCunn spent a lot of time on the road visiting potential suppliers and at trade shows learning about processes, suppliers and their capabilities.</p>\n\n<p>In 2011, he&nbsp;joined the polymer materials team with the same mission:&nbsp;to align projects with the correct materials, processes and suppliers. McCunn has presented at SPE Thermoforming Conferences and the SPE Thermoset Conference. He has been a staff engineer for materials at John Deere for the past 13 years.</p>\n\n<p>&ldquo;Greg has been instrumental in implementing plastic and composites in John Deere products,&rdquo; says&nbsp;Paul Uphaus, SPE Thermoforming Division chair. &ldquo;He has been a longtime advocate for the thermoforming industry by using the process in his designs, and for that he has our sincere appreciation.&rdquo;</p>\n\n<p>THE SPE Thermoforming Division&nbsp;is a technical division of the SPE. Its mission is to facilitate the advancement of thermoforming technologies through education, application, promotion and research.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spe-honors-greg-mccunn-for-2025-lifetime-achievement-award"
      }
    ],
    "link": "https://www.compositesworld.com/news/spe-honors-greg-mccunn-for-2025-lifetime-achievement-award"
  },
  {
    "published": "Thu, 22 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      22,
      14,
      0,
      0,
      3,
      142,
      0
    ],
    "title": "FIDAMC lays groundwork for CFA advanced manufacturing technocenter",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FIDAMC lays groundwork for CFA advanced manufacturing technocenter"
    },
    "summary": "Ahead of the CFA&rsquo;s June opening, a recent conference established the criteria for submitting project proposals, as well as the CFA&rsquo;s capabilities and equipment, citing more than 200 interested companies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Ahead of the CFA&rsquo;s June opening, a recent conference established the criteria for submitting project proposals, as well as the CFA&rsquo;s capabilities and equipment, citing more than 200 interested companies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-fidamc-cfa.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-fidamc-cfa.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | FIDAMC</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://fidamc.es/en/\" target=\"_blank\">Foundation for Research, Development and Application of Composite Materials</a> (FIDAMC, Getafe, Spain) has made new milestones toward the start of operations for its&nbsp;Center for Innovation in Advanced Manufacturing Technologies (CFA), which will&nbsp;offer paid services to companies to aid with development of innovation projects in advanced manufacturing.</p>\n\n<p>The&nbsp;territorial delegation of Economy, Finance and European Funds of the Junta de Andaluc&iacute;a in Cadiz, Spain,&nbsp;recently hosted the opening ceremony&nbsp;of explanatory sessions of the regulatory bases for the development of CFA projects, the last step prior to the center&rsquo;s start of activities.&nbsp;</p>\n\n<p>These established rules highlighted at the event&nbsp;set out&nbsp;the criteria for the presentation and evaluation of projects to be carried out at CFA. In order to access the use of the CFA&rsquo;s services, interested entities must submit an innovation project proposal that will be evaluated in compliance with the principles of publicity, competition, transparency, nondiscrimination and equal treatment among all candidates. The services to be provided will have publicly accessible rates. The presentation of the projects will be made via email to cfa@fidamc.es or directly through FIDAMC&rsquo;s website, fidamc.es/cfa.</p>\n\n<p>During the conference, CFA&rsquo;s technological capabilities were also presented, as well as details of the rules governing access to the center, the deadlines and requirements for participating in the call for projects, and a speech given by Isaac P&eacute;rez-Fafian, general director of the CFA. In addition, the CFA&rsquo;s operations manager, Javier Romalde, presented the center&rsquo;s equipment.</p>\n\n<p>The CFA&nbsp;is a FEDER-financed&nbsp;industrial environment being developed in Puerto Real.&nbsp;It is one of many new technocenter locations FIDAMC is planning to open to grow its advanced manufacturing offerings and capabilities (read &ldquo;<a href=\"https://www.compositesworld.com/articles/fidamc-expands-composites-rd-into-new-markets-and-advanced-manufacturing-centers-\" target=\"_blank\">FIDAMC expands composites R&amp;D</a>...&rdquo;). The CFA center has the necessary equipment and resources to become a national reference center that will enable companies &mdash; on their own and with the appropriate technical support services&nbsp;&mdash;&nbsp;to develop technologies that are applicable and easily transferable to their production processes. To this end, it features additive manufacturing, robotics, 3D scanning, metrology and drones technologies.</p>\n\n<p>More than 200 companies and entities so far have registered and have shown&nbsp;interest in accessing the services of the technology center, available starting in June. Thye come from&nbsp;industrial and highly technological sectors such as aerospace, naval, railway, plastics and bio-health, although companies from other sectors such as the leather cluster of Ubrique have also been interested.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fidamc-lays-groundwork-for-cfa-advanced-manufacturing-technocenter"
      }
    ],
    "link": "https://www.compositesworld.com/news/fidamc-lays-groundwork-for-cfa-advanced-manufacturing-technocenter"
  },
  {
    "published": "Thu, 22 May 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      22,
      14,
      0,
      0,
      3,
      142,
      0
    ],
    "title": "Syensqo composites demonstrate titanium replacement on Boeing MQ-25 Stingray",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Syensqo composites demonstrate titanium replacement on Boeing MQ-25 Stingray"
    },
    "summary": "Validation of integrating Cycom 5250-4HT prepreg into the UAV&rsquo;s&nbsp;exhaust nozzle structure underpins the material system&rsquo;s use in other high-temperature aerospace applications.\n\n&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Validation of integrating Cycom 5250-4HT prepreg into the UAV&rsquo;s&nbsp;exhaust nozzle structure underpins the material system&rsquo;s use in other high-temperature aerospace applications.\n\n&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-boeingt1-demonstrator.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Boeing’s T1 demonstration aircraft.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-boeingt1-demonstrator.jpg;maxWidth=720\" /> </a></div>\n\n<p>Boeing&rsquo;s T1 demonstration aircraft. Source |&nbsp;Samantha Jenkins, identified by DVIDS</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/solvay-composite-materials\" target=\"_blank\">Syensqo</a>&nbsp;(Alpharetta, Ga., U.S.), in partnership with Boeing (Arlington, Va., U.S.), has successfully demonstrated Syensqo&rsquo;s&nbsp;Cycom&nbsp;5250-4HT&nbsp;high service-temperature prepreg as a viable replacement for titanium on the&nbsp;MQ-25&nbsp;<em>Stingray</em>&nbsp;exhaust nozzle. The&nbsp;MQ-25, designed for the U.S. Navy, will be an&nbsp;operational carrier-based unmanned aerial refueling vehicle.</p>\n\n<p>The plane&rsquo;s wing and fuselage skins are composed of Syensqo&rsquo;s&nbsp;Cycom prepregs and FM adhesive materials. Incorporation of Cycom&nbsp;5250-4HT on the exhaust nozzle concept achieves additional lightweighting, enabling the aircraft to&nbsp;carry more fuel while reducing reliance on titanium, enhancing both operational efficiency and supply chain resilience.</p>\n\n<p>Cycom&nbsp;5250-4HT is a bismaleimide resin system with optimal thermal stability after thermal cycling. It is ideal for use in high-temperature areas near engines for defense, propulsion, space and launch and high-performance automotive applications. It comes in a variety of carbon, glass and quartz fiber product forms and is compatible with Syensqo&rsquo;s high-temperature adhesives and surfacing product line.</p>\n\n<p>&ldquo;The successful technology demonstration, made possible through the close collaboration between Boeing and Syensqo engineering teams, has validated the feasibility of integrating Cycom 5250-4HT into a composite exhaust nozzle structure,&rdquo; emphasizes&nbsp;Josh Dustin, senior manager with Boeing research and technology, structures technology. &ldquo;This was a critical step in pushing forward the art of the possible with high-temperature composite applications.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/syensqo-composites-demonstrate-titanium-replacement-on-boeing-mq-25-stingray"
      }
    ],
    "link": "https://www.compositesworld.com/news/syensqo-composites-demonstrate-titanium-replacement-on-boeing-mq-25-stingray"
  },
  {
    "published": "Wed, 21 May 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      21,
      18,
      0,
      0,
      2,
      141,
      0
    ],
    "title": "Fujian Fuwei selects Harper for commercial-scale carbon fiber equipment",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Fujian Fuwei selects Harper for commercial-scale carbon fiber equipment"
    },
    "summary": "Complete carbonization line will support Fujian&rsquo;s initial carbon fiber production capacity of 4,000 metric tons/year, and future&nbsp;50,000 metric ton/year capacity.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Complete carbonization line will support Fujian&rsquo;s initial carbon fiber production capacity of 4,000 metric tons/year, and future&nbsp;50,000 metric ton/year capacity."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-harperinternational-material-handling-min.jpg\" target=\"_blank\"><img alt=\"Carbon fiber material handling.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-harperinternational-material-handling-min.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Harper International</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/harper-international\" target=\"_blank\">Harper International</a> (Buffalo, N.Y., U.S.), offering thermal processing solutions for advanced materials, has been selected to provide high-temperature furnace systems for the manufacture of carbon fiber for Fujian Fuwei Advanced Material Co.&nbsp;Ltd. (Fujian, China).</p>\n\n<p>The commercial-scale Harper carbonization line, a turnkey thermal processing solution for carbon fiber manufacturing, is scheduled for shipment to Fujian Fuwei&rsquo;s site in Yong&rsquo;an City, Fujian province in February 2026. Harper&rsquo;s custom engineered carbonization line will comprise 3-meter-wide oxidation ovens, low- and high-temperature furnace systems, waste gas abatement systems, surface treatment systems and integrated additional unit operations, controls&nbsp;and services.</p>\n\n<p>For Fujian, Harper&rsquo;s technology advancements equal optimized fiber quality due to rapid&nbsp;oxidation, improved velocity uniformity, assured temperature uniformity and optimal control of the reaction. These advancements combined with Harper&rsquo;s on-site services for installation and startup support, enables&nbsp;efficient transition to commercial production rates.</p>\n\n<p>This equipment contract is a critical element in this first phase of the Fuwei high-end new material project investment valued at 2.3 billion yuan ($320 million) which aims to achieve an effective annual production capacity of 4,000 metric tons of carbon fiber per year. After this first phase, the long-term project plan is to use 1,142 acres of land with an overall planned production capacity of 50,000 metric tons per year.</p>\n\n<p>&ldquo;Harper&rsquo;s carbonization lines continue to be the preferred choice for both advanced fiber producers and new market entrants who look to minimize their risk and timeline to commercialization,&rdquo; notes Paul Elwell, vice president of Harper International Corp.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fujian-fuwei-selects-harper-for-commercial-scale-carbon-fiber-equipment"
      }
    ],
    "link": "https://www.compositesworld.com/news/fujian-fuwei-selects-harper-for-commercial-scale-carbon-fiber-equipment"
  },
  {
    "published": "Wed, 21 May 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      21,
      17,
      0,
      0,
      2,
      141,
      0
    ],
    "title": "Dymag partnership advances carbon fiber wheel market reach",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Dymag partnership advances carbon fiber wheel market reach"
    },
    "summary": "Collaboration between Dymag, Borbet and AIM Co. Ltd. aims to establish a robust,&nbsp;high-quality carbon fiber hybrid wheel supply solution for global automotive and motorcycle markets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaboration between Dymag, Borbet and AIM Co. Ltd. aims to establish a robust,&nbsp;high-quality carbon fiber hybrid wheel supply solution for global automotive and motorcycle markets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-dymag-composite-wheel.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Dymag BXF Plain Weave Lip.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-dymag-composite-wheel.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Dymag</p>\n</div>\n\n<p><a href=\"https://dymag.com/\" target=\"_blank\">Dymag&nbsp;Technologies Ltd.</a>&nbsp;(Wiltshire, U.K.), a wholly owned subsidiary of Borbet GmbH&nbsp;(Hallenberg-Hesborn, Germany), and <a href=\"https://www.adgroup.com.tw/index.aspx?lang=US\" target=\"_blank\">Advanced International Multitech Co. Ltd.</a> (AIM,&nbsp;Kaohsiung City, Taiwan), have announced a strategic partnership to&nbsp;accelerate the development and industrialization of carbon fiber hybrid and composite wheel technology for the automotive and motorcycle industries.</p>\n\n<p>This collaboration brings together Dymag&rsquo;s expertise in carbon fiber wheels, Borbet&rsquo;s position as a premium aluminum wheel producer for OEMs and aftermarket and AIM&rsquo;s&nbsp;advanced manufacturing capabilities as what is said to be Taiwan&rsquo;s largest carbon composite products company.</p>\n\n<p>Dymag says it has been developing carbon fiber wheels since the mid-90s. Its innovation, the BX-F carbon hybrid wheel design &mdash;&nbsp;combining&nbsp;carbon fiber with&nbsp;other materials like aluminum or magnesium&nbsp;&mdash; is built on more than five decades of elite motorsport and high-performance wheel engineering. Today, Dymag&rsquo;s BX-F&nbsp;wheel designs are being adopted by major OEMs, as automotive manufacturers.</p>\n\n<p>Borbet global manufactures&nbsp;light alloy wheels, supplying more than 20 car manufacturers. The company focuses on continuous R&amp;D to stay ahead of trends in the evolving automotive industry and create sustainable, future-oriented solutions.&nbsp;</p>\n\n<p>AIM supplies&nbsp;high-performance carbon sports equipment and carbon fiber composite products generally. With more than 30 years of experience in composite design, manufacturing and process innovation, AIM has built expertise in precision production and advanced materials engineering. These capabilities enable cost-effective, scalable manufacturing of Dymag&rsquo;s carbon fiber hybrid wheels.</p>\n\n<p>The collaboration also leverages Borbet&nbsp;and AIM&rsquo;s established supply networks, AIM&rsquo;s scalable production infrastructure&nbsp;and Dymag&rsquo;s technical expertise to create a robust, high-quality supply solution for global markets. Through close technical alignment and coordinated development efforts, carbon fiber hybrid wheels can be seamlessly integrated into OEM production lines.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dymag-partnership-advances-carbon-fiber-wheel-market-reach"
      }
    ],
    "link": "https://www.compositesworld.com/news/dymag-partnership-advances-carbon-fiber-wheel-market-reach"
  },
  {
    "published": "Wed, 21 May 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      21,
      16,
      0,
      0,
      2,
      141,
      0
    ],
    "title": "European natural fibers emerge in bio-based architectural projects",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "European natural fibers emerge in bio-based architectural projects"
    },
    "summary": "The Alliance for European Flax Linen and Hemp highlights several projects in which flax and hemp fibers are being used, emphasizing their increasing use as high-performance, low-impact construction methods.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Alliance for European Flax Linen and Hemp highlights several projects in which flax and hemp fibers are being used, emphasizing their increasing use as high-performance, low-impact construction methods."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-alliance-flax-fiber-innovations.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-alliance-flax-fiber-innovations.jpg;maxWidth=720\" /> </a></div>\n\n<p>Natural fibers on display in the Natural Fiber Pavilion at JEC World 2025. Source |&nbsp;<em>CW</em></p>\n</div>\n\n<p>The&nbsp;<a href=\"https://allianceflaxlinenhemp.eu/\" target=\"_blank\">Alliance for European Flax-Linen &amp; Hemp</a>&nbsp;(Paris, France) highlights a growing wave of&nbsp;innovative architectural and civil engineering applications featuring flax and hemp fibers. As the global construction industry turns toward sustainable solutions, the organization is seeing flax and hemp emerging as high-performance, low-impact alternatives for a new generation of bio-based architecture.</p>\n\n<p>For instance,&nbsp;flax is stepping beyond interior and insulation use to form key structural elements in buildings. At the forefront of this transformation is the University of Stuttgart&rsquo;s (Germany) ITECH Research Pavilion 2024 program in Germany. Two lightweight structures have been created using filament-wound flax fibers, demonstrating the material&rsquo;s strength and design flexibility.</p>\n\n<p>The main pavilion, a semi-permanent structure, features 20 flax fiber roof beams, crafted from Terre de Lin&rsquo;s (Saint-Pierre-le-Viger, France) 100 Tex rovings and industrially processed by HA-CO Carbon GmbH&nbsp;(Wallerstein, Germany). A second, smaller pavilion incorporates co-wound wood and Safilin&rsquo;s&nbsp;(Sailly-sur-la-Lys, France) 200 Tex flax fibers in its columns and roof structure. Both projects highlight coreless robotic winding technologies and deliver striking examples of sustainable construction methods.</p>\n\n<p>Flax is also proving its value in cladding and fa&ccedil;ade systems. French manufacturer Temca (Xertigny, France) recently <a href=\"https://www.compositesworld.com/products/natural-fibers-village-hosts-natural-fiber-innovations-industry-updates\" target=\"_blank\">completed 880 lightweight shading panels</a> using Bcomp&rsquo;s&nbsp;(Fribourg, Switzerland) ampliTex&nbsp;flax fiber material for the Cit&eacute; Scolaire Internationale Jacques Chirac business school in Marseille. Designed by architects Rudy Ricciotti and Roland Carta for Bouygues B&acirc;timent Sud-Est, the system uses RTM-molded ampliTex&nbsp;combined with UV-resistant gelcoat and fire-rated resin, providing a nature-inspired, energy-efficient solution with reduced weight and hardware requirements compared to traditional materials.</p>\n\n<p>Meanwhile, Dutch composite innovator NPSP&nbsp;(Delft) continues its work integrating bio-based materials in public infrastructure. In collaboration with Alliance member Procotex &nbsp;(Plouay, France) and material partner Nabasco, NPSP has delivered fa&ccedil;ades across Europe, including the vibrant green cladding of Amsterdam&rsquo;s NEMO Science Museum, designed by Renzo Piano. Nabasco&nbsp;Natural panels offer both design freedom and high fire safety standards, paving the way for bio-based fa&ccedil;ades in modern urban design.</p>\n\n<p>Recyclable molded composites company Demgy (Saint-Aubin-sur-Gaillon, France) has partnered with green roof experts Plantika&nbsp;(Vienna, Austria) to introduce Flaxcomp&nbsp;sandwich base panels for rooftop garden modules. Replacing aluminum with perforated flax composites, the solution enhances water drainage and aeration while reducing environmental impact. If successful, the trial may lead to full flax composite construction in future urban greening projects, marking a critical advance toward circular building solutions.</p>\n\n<p>&ldquo;These projects reflect the growing ambition of our industry to deliver carbon-smart, beautiful&nbsp;and high-performing structures using natural European fibers,&rdquo; says&nbsp;Bruno Pech, innovation project manager.</p>\n\n<p>The Alliance for European Flax Linen &amp;&nbsp;Hemp continues to support its members and partners in advancing bio-based innovation across architecture and civil engineering.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/european-natural-fibers-emerge-in-bio-based-architectural-projects"
      }
    ],
    "link": "https://www.compositesworld.com/news/european-natural-fibers-emerge-in-bio-based-architectural-projects"
  },
  {
    "published": "Wed, 21 May 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      21,
      15,
      0,
      0,
      2,
      141,
      0
    ],
    "title": "Delta Marine shares 110-foot custom motor yacht with novel hull",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Delta Marine shares 110-foot custom motor yacht with novel hull"
    },
    "summary": "In-progress build highlights Delta&rsquo;s first hull designed entirely using CFD, a step forward in performance innovation for the shipyard known for its custom composites construction expertise.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "In-progress build highlights Delta&rsquo;s first hull designed entirely using CFD, a step forward in performance innovation for the shipyard known for its custom composites construction expertise."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-deltamarine-110-custom-yacht.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Delta 110 under construction.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-deltamarine-110-custom-yacht.jpg;maxWidth=720\" /> </a></div>\n\n<p>Delta 110 under construction. Source (All Images) | Delta Marine</p>\n</div>\n\n<p><a href=\"https://www.deltamarine.com/\" target=\"_blank\">Delta Marine Industries Inc.</a> (Seattle, Wash., U.S.), a shipyard innovating the use of&nbsp;composite superstructures on metal-hulled yachts, announces a custom&nbsp;<span style=\"font-size: 1.1rem; letter-spacing: 0.008em;\">110-foot motor yacht currently in build and nearing completion. Developed in response to changing market dynamics, particularly in the 110- to 124-foot range, this project features a novel hull platform designed for long-range efficiency and the capability for speed.&nbsp;</span></p>\n\n<p>&ldquo;We&rsquo;ve experienced increasing demand for a fully custom option in the 110- to 124-foot size range,&rdquo; emphasizes&nbsp;Delta vice president Michelle Jones. &ldquo;As most of the yachts in this size are production builds, we were thrilled to work with experienced owners on their vision for a Pacific Northwest-focused family yacht, which they could operate with minimal crew and cruise the coastlines of the San Juan Islands, British Columbia and Alaska.&rdquo;</p>\n\n<p>The Delta 110 is a fully resin-infused structure built with vinyl ester resin, E-glass reinforcement&nbsp;and a thermoformed foam core. Vacuum infusion is used throughout every structural component, ensuring precise resin control and consistent laminate quality. The design relies primarily on E-glass to optimize the cost-to-performance ratio, while carbon fiber is strategically placed in high-load areas to deliver additional stiffness without adding unnecessary weight. The thermoformed foam core further enhances performance by minimizing resin uptake and reducing overall laminate weight. Delta&rsquo;s approach highlights an integration of materials and process that results in a high-performance, efficiently engineered yacht structure.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-deltamarine-delta110.jpg\" target=\"_blank\"><img alt=\"Delta 110 on the water.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-deltamarine-delta110.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>Within a 24-foot beam, the yacht&rsquo;s arrangement is optimized for owner operation and family adventures with a spacious interior. It&nbsp;accommodates eight guests and two crew.&nbsp;Walk-around side decks with control stations further lend to the ease of operation.&nbsp;</p>\n\n<p>According to the company, the yacht&rsquo;s new&nbsp;double chine semi-displacement hull form is a significant build in that it is the first new hull design for Delta solely tested through computational fluid dynamics (CFD) analysis. It is also Delta&rsquo;s first project that will meet full IMO III and EPA Tier 4 recognition, which facilitated the installation of the newest approved gas exhaust systems on the main engines.</p>\n\n<p>While the new hull form is designed for modest efficient cruising speeds of 12-14 knots &mdash; affording a longer range &mdash; the yacht is also capable of cruising much faster when necessary. The hull shape, coupled with twin MTU 4000s at 2,600 horsepower&nbsp;each, allows the yacht to achieve a top-end speed of 27 knots.</p>\n\n<p>&ldquo;Creating a new hull platform that accommodates custom builds in the 110- to 124-foot size range was a unique proposition for us,&rdquo; states Jones. &ldquo;But we are thrilled with this design and for the opportunity to showcase our capabilities in advanced composites construction with a full custom, full luxury, family-oriented Pacific Northwest yacht with the capability for speed.&rdquo;</p>\n\n<p>The state-of-the-art 110-footer is among six custom yacht builds in varying stages of construction at the Delta shipyard.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/delta-marine-shares-110-foot-custom-motor-yacht-with-novel-hull"
      }
    ],
    "link": "https://www.compositesworld.com/news/delta-marine-shares-110-foot-custom-motor-yacht-with-novel-hull"
  },
  {
    "published": "Tue, 20 May 2025 20:00:00 -0400",
    "published_parsed": [
      2025,
      5,
      21,
      0,
      0,
      0,
      2,
      141,
      0
    ],
    "title": "CEAD launches the Maritime Application Center dedicated to industrial 3D printing boat hulls",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CEAD launches the Maritime Application Center dedicated to industrial 3D printing boat hulls"
    },
    "summary": "The MAC is an LFAM-powered production facility equipped with&nbsp;highly automated, digitally driven manufacturing processes and built around a collaborative model to develop the boats of the future.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The MAC is an LFAM-powered production facility equipped with&nbsp;highly automated, digitally driven manufacturing processes and built around a collaborative model to develop the boats of the future."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-mac-fishing-boat-print.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-mac-fishing-boat-print.jpg;maxWidth=720\" /> </a></div>\n\n<p>Fishing boat print at the MAC. Source (All Images) | CEAD B.V.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/cead-bv\" target=\"_blank\">CEAD&nbsp;B.V.</a> (Delft, Netherlands) has launched the Maritime Application Center (MAC), an initiative focused on accelerating the adoption of automated, sustainable production in the maritime sector. The MAC is positioned as a innovation hub where advanced manufacturing, material development&nbsp;and application engineering converge to tackle the complexity of boatbuilding and related maritime components.</p>\n\n<p>The MAC is a 2,300-square-meter space right&nbsp;around the corner of CEAD&rsquo;s headquarters&nbsp;where boats are to be developed and produced through a highly automated, digitally driven manufacturing process. MAC&rsquo;s launch introduces the company&rsquo;s two-fold vision for marine.&nbsp;First, to provide production capacity supporting shipbuilders and maritime manufacturers who are not yet ready to adopt large-scale 3D printing in-house, but are eager to reap the benefits of a highly automated production process. Second, to accelerate application development and therefore adoption of large-scale 3D printing technology in the maritime industry by working closely with industry partners and existing CEAD customers &mdash;&nbsp;sharing knowledge, co-developing solutions and pushing the boundaries of what&rsquo;s possible together.</p>\n\n<p>The MAC aims to demonstrate what the boat factory of the future looks like: a high-output, compact, automated facility where just two to three operators could produce more than&nbsp;100&nbsp;boats per year, depending on the specific factory configuration. At the MAC, CEAD is currently scaling production capacity to manufacture at least 100 boats per year, to supply the market and to actively demonstrate technical feasibility, efficiency and profitability of this factory model.&nbsp;</p>\n\n<h3>Overcoming traditional shipbuilding complexities</h3>\n\n<p>Shipbuilding today requires the combined efforts of an entire shipyard ecosystem, relying heavily on skilled labor, large-scale infrastructure and complicated, interconnected value streams. Many shipyards have spent decades optimizing for cost and specialization, creating highly segmented workflows and centralized resources. However, recent growth in demand is straining shipyards already facing surge in employee retirements, aging infrastructure and day-to-day operational inefficiencies, making it difficult to scale or adapt quickly to market demands. There is also an increasing demand to lower the maritime industry&rsquo;s impact on greenhouse gas emissions, as targets set by the International Maritime Organization (IMO) requires organizations to transition toward&nbsp;more sustainable manufacturing approaches.</p>\n\n<p>CEAD believes that the current conditions within the maritime sector make it particularly well-suited for large-scale 3D printing technology, which addresses many of the bottlenecks the industry currently faces. For example, large-scale 3D printing technology enables the production of boat hulls directly from a digital file, eliminating time-consuming, waste-generating steps and reduces&nbsp;reliance on skilled manual labor. In doing so, it helps lower costs, shorten lead times and enables manufacturers to quickly adapt to changing market demands in both design and production capacity.&nbsp;</p>\n\n<p>CEAD has developed a dedicated system, based on its extrusion technology, specifically designed to 3D print boat hulls in an automated manner. With this dedicated machine, the company says it has&nbsp;created a production technology that enables boatbuilding in a manner &ldquo;not feasible with standard robotic 3D printers.&rdquo; These machines form the foundation of a production facility with the flexibility to scale output as demand grows. Unlike traditional shipyards, this boat factory also operates without the need of heavy infrastructure, zoning or labor demands, making it viable in light industrial or even urban environments like the city of Delft.</p>\n\n<div class=\"article_sidebar\">\n<h3>CEAD&rsquo;s history in composites 3D printing</h3>\n\n<p>Since its start in 2014, CEAD has placed R&amp;D, as well as customer success, at the core of its mission. The company is known for&nbsp;composite large-format 3D printing technologies that enable the automated production of large, complex composite parts. It&rsquo;s commitment to R&amp;D is evident in the portfolio that CEAD has developed, including robotic-&nbsp;and gantry-based solutions, a range of pellet extruders and additional functionalities such as ATLAM, scan-2-mill, datalogging&nbsp;and more.&nbsp;</p>\n\n<p>The MAC is a direct result of CEAD&rsquo;s vision to go beyond delivering a machine, but to offer complete, integrated systems that provide an end-to-end solution for its customers. The MAC embodies this approach, where broad-based research is aimed at enabling the successful and accelerated adoption of large-scale 3D printing within the maritime industry.</p>\n</div>\n\n<h3>Innovation through partnerships</h3>\n\n<p>Recognizing the complexity of 3D printing entire boats, the MAC is built on a collaborative model. CEAD works closely with industry partners and provides a platform to learn and grow. Together, partners can explore everything from 3D printing design for boat hulls, material development for marine environments to process optimization and software innovations.</p>\n\n<blockquote>\n<p>The MAC is <a href=\"https://ceadgroup.com/contact/?utm_source=Referral&amp;utm_medium=MAC+Article-1&amp;utm_campaign=Maritime\" target=\"_blank\">open to collaborations</a> to shape the future of maritime manufacturing.</p>\n</blockquote>\n\n<p>&ldquo;We bring deep expertise in large-scale 3D printing technology, but true innovation happens when we combine that with the knowledge our industry partners have: whether it&rsquo;s about boat design, regulatory requirements&nbsp;or real-world performance,&rdquo; emphasizes&nbsp;Charl&eacute;ne van Wingerden, chief business development officer at CEAD.&nbsp;&ldquo;It&rsquo;s that exchange of expertise that makes collaboration so powerful.&rdquo;</p>\n\n<h3>Application focus: 3D printing industrial boat hulls</h3>\n\n<p>At the heart of the MAC&rsquo;s activities is a clear focus: developing and refining the process of 3D printing hulls for the professional maritime sector. It is currently&nbsp;targeting boats up to 12 meters in length, intended for industrial or defense applications, such as workboats, for example (patrol boats, fishing boats, supply boats, etc.)&nbsp;and unmanned surface vessels (USVs). The team is engaged in hands-on experimentation, exploring every aspect of the application.</p>\n\n<p>The company recently launched CEAD HDPro, a new material engineered to outperform conventional HDPE in heavy-duty maritime applications. These efforts led to the successful production of its first&nbsp;full-scale fishing boat using CEAD HDPro, completed in just 88 hours of printing time.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-mac-fuel-tank-print.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0525-cw-news-cead-mac-fuel-tank-print.png;maxWidth=720\" /> </a></div>\n\n<p>Fuel tank print.</p>\n</div>\n\n<p>&ldquo;It&rsquo;s an exciting learning process. We&rsquo;re learning by doing: testing, tweaking and printing in real-time. We have to figure out new things, but that&rsquo;s exactly how real innovation happens,&rdquo; says Maarten Logtenberg, CTO at CEAD. &ldquo;The MAC is intended as a place to educate, while continuing to learn and evolve ourselves.&rdquo;</p>\n\n<h3>Targeting a future of local, automated&nbsp;and green manufacturing</h3>\n\n<p>In order to reach the targets set by the IMO to reduce carbon emissions in the maritime industry, collaboration and innovation are essential, CEAD says. Large-scale 3D printing technology can empower&nbsp;shipbuilders and operators to produce vessels and components where they&rsquo;re needed and when they&rsquo;re needed. Additionally, the MAC&rsquo;s setup can be readily replicated at strategic locations around the world,&nbsp;closer to the point of use in nontraditional, compact environments.</p>\n\n<p>The MAC serves as a blueprint for an approach CEAD calls a &ldquo;CEAD-powered microfactory&rdquo;&nbsp;These high-output, compact, automated production facilities are build around CEAD&rsquo;s technology where the machines are tailored to specific applications. Thanks to the modularity of the&nbsp;systems, this microfactory model is not limited to one sector, but applicable across industries. While the MAC is specifically designed for the maritime industry, other microfactories have already been realized, such as the recently launched <a href=\"https://www.compositesworld.com/news/haddy-opens-lfam-microfactory-in-florida-for-localized-agile-composite-parts-production\" target=\"_blank\">Haddy facility in Florida</a>.</p>\n\n<div class=\"article_sidebar\">\n<p>The MAC, though already operational, will officially open its doors on June 20, 2025. CEAD invites&nbsp;maritime professionals, shipbuilders, designers&nbsp;and OEMs to attend&nbsp;the launch or learn&nbsp;more about the initiative. Interested parties can request an invitation by emailing <a href=\"mailto:mac@ceadgroup.com\" target=\"_blank\">mac@ceadgroup.com</a> directly.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cead-launches-the-maritime-application-center-dedicated-to-industrial-3d-printing-boat-hulls"
      }
    ],
    "link": "https://www.compositesworld.com/news/cead-launches-the-maritime-application-center-dedicated-to-industrial-3d-printing-boat-hulls"
  }
]