[
  {
    "published": "Mon, 25 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      25,
      15,
      0,
      0,
      0,
      237,
      0
    ],
    "title": "Spirit enters definitive agreement with CTRM for Malaysia facility, businesses",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Spirit enters definitive agreement with CTRM for Malaysia facility, businesses"
    },
    "summary": "Acquisition transaction&nbsp;entered into previously announced merger agreement&nbsp;will make Composites Technology Research Malaysia (CTRM) an important asset to Boeing and&nbsp;Airbus programs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Acquisition transaction&nbsp;entered into previously announced merger agreement&nbsp;will make Composites Technology Research Malaysia (CTRM) an important asset to Boeing and&nbsp;Airbus programs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0225-cw-news-aircraft-GettyImages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0225-cw-news-aircraft-GettyImages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>In early August, <a href=\"https://www.compositesworld.com/suppliers/spirit-aerosystems\" target=\"_blank\">Spirit AeroSystems</a>&nbsp;(Wichita, Kan., U.S.) announced&nbsp;a purchase agreement to sell its facility and businesses in Subang, Malaysia, to <a href=\"https://ctrm.com.my/\" target=\"_blank\">Composites Technology Research Malaysia Sdn Bhd</a> (CTRM, Malaysia) for $95,200,000, subject to customary adjustments. This transaction was entered into following the previously announced merger agreement with Boeing and subsequent definitive agreement with Airbus. The transaction is expected to close in Q4 2025, subject to regulatory approvals and closing conditions being met.&nbsp;</p>\n\n<p>Spirit AeroSystems&rsquo; business in Subang&nbsp;is a world-class&nbsp;engineering and manufacturing business, which occupies 45 acres with 400,000 square-feet manufacturing footprint in Subang&rsquo;s Malaysian International Aerospace Centre and employs more than&nbsp;1,000 employees. The operation offers aerostructures assembly,&nbsp;services capabilities&nbsp;and an integrated supply chain with access to advantaged, in-region material sourcing, skilled labor and scalability.&nbsp;</p>\n\n<p>As a result of this transaction, CTRM will become an important supplier to Airbus for its A220, A320&nbsp;and A350 programs, and to Boeing on the 737 and 787 programs.&nbsp;</p>\n\n<p>&ldquo;Our agreement with CTRM for the acquisition of this manufacturing facility ensures&nbsp;a strong future for this business as well as the regional stakeholders in Malaysia,&rdquo; says&nbsp;Irene Esteves, Spirit AeroSystems executive vice president and chief financial officer. &ldquo;This also marks a milestone in the ongoing acquisition <a href=\"https://www.compositesworld.com/news/spirit-aerosystems-shareholders-approve-acquisition-by-boeing\" target=\"_blank\">of Spirit by Boeing</a>.&rdquo;&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spirit-enters-definitive-agreement-with-ctrm-for-malaysia-facility-businesses"
      }
    ],
    "link": "https://www.compositesworld.com/news/spirit-enters-definitive-agreement-with-ctrm-for-malaysia-facility-businesses"
  },
  {
    "published": "Mon, 25 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      25,
      14,
      0,
      0,
      0,
      237,
      0
    ],
    "title": "UniSQ, iLAuNCH Trailblazer program drive digital twin innovation for composite repairs",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "UniSQ, iLAuNCH Trailblazer program drive digital twin innovation for composite repairs"
    },
    "summary": "Working with Boeing Australia, Memko and Dassault Syst&egrave;mes, the University of Southern Queensland (UniSQ) has developed a digital twin via the 3DEXPERIENCE platform, digitizing processes that could lead&nbsp;toward more efficient and effective maintenance, repair&nbsp;and operations of future fleets.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Working with Boeing Australia, Memko and Dassault Syst&egrave;mes, the University of Southern Queensland (UniSQ) has developed a digital twin via the 3DEXPERIENCE platform, digitizing processes that could lead&nbsp;toward more efficient and effective maintenance, repair&nbsp;and operations of future fleets."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"UniSQ's Center for Future Materials.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-unisq-cfm-ilaunch.jpg;maxWidth=720\" /> </div>\n\n<p>The Centre for Future Materials (CFM) is UniSQ's&nbsp;research center in advanced composite materials and manufacturing. Source | Dassault&nbsp;Syst&egrave;mes</p>\n</div>\n\n<p>Back in November 2023, Australia&rsquo;s&nbsp;iLAuNCH Trailblazer program &mdash;&nbsp;which aims to address critical skill gaps and accelerate the development of Australia&rsquo;s space sector&nbsp;&mdash; announced its backing of a&nbsp;University of Southern Queensland (UniSQ) project, targeting faster and more efficient&nbsp;aircraft and spacecraft composite repairs. Supported by Boeing Australia and&nbsp;engineering services company&nbsp;<a href=\"https://memko.com.au/\" target=\"_blank\">Memko</a> (Melbourne), the university&rsquo;s&nbsp;Centre for Future Materials (CFM) has since innovated a digital twin using&nbsp;<a href=\"https://www.compositesworld.com/suppliers/dassault-sys\" target=\"_blank\">Dassault Syst&egrave;mes</a>&rsquo; (V&eacute;lizy-Villacoublay, France) 3DEXPERIENCE platform to&nbsp;digitize&nbsp;the composite repair process.</p>\n\n<p>&ldquo;MEMKO brings to UniSQ access to the Dassault Syst&egrave;mes virtual twin software and their engineering expertise with these tools, which enables the virtual replication of a product along its whole life cycle &mdash;&nbsp;from digital design through to manufacturing requirements or in this case, structural repair,&rdquo; says&nbsp;iLAuNCH Trailblazer executive director Darin Lovett.&nbsp;</p>\n\n<p>Dr. Tristan Shelley from the UniSQ CFM has been heading the research, with the ultimate goal of increasing the digitalization of manufacturing processes for composite materials. In addition, to complete the project, the&nbsp;UniSQ installed scholarships for three Ph.D. opportunities to work alongside engineers and scientists at Boeing Aerostructures Australia and Memko in Melbourne, Brisbane and Toowoomba in an effort to develop workforce development and upskilling programs.</p>\n\n<p>Almost two years later, the&nbsp;iLAuNCH Trailblazer project&nbsp;has seen much success, which&nbsp;Dassault Syst&egrave;mes&nbsp;has detailed in this customer story <a href=\"https://www.3ds.com/insights/customer-stories/university-southern-queensland-composite-material-repair\" target=\"_blank\">here</a>. Using the 3DEXPERIENCE platform&rsquo;s digital twin capabilities, Shelley and his team have been doing everything from damage detection and capturing real-time visual data from filament winding to&nbsp;predict and optimize the best wind path, to&nbsp;programming scarfing tool paths, all in the name of&nbsp;eliminating&nbsp;both engineering and laborious processes and creating greater precision in the composite repair process.</p>\n\n<p>&ldquo;We are refining the NDT [nondestructive testing] process to help engineers identify the repairs area faster and more precisely,&rdquo; Shelley says in the article. &ldquo;We use reverse engineering capabilities within the&nbsp;3DEXPERIENCE platform to read the processed NDT data. This enables the creation of topology (the properties that remain unchanged under continuous deformations) which in turn can be overlaid with actual CAD data. This allows us to analyze and improve the visibility of internal layers to identify the size and extent of the damage.&rdquo;</p>\n\n<p><a href=\"https://www.3ds.com/insights/customer-stories/university-southern-queensland-composite-material-repair\" target=\"_blank\">Read the original article</a> for more details about the project&rsquo;s process, successes and next steps.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/unisq-ilaunch-trailblazer-program-drive-digital-twin-innovation-for-composite-repairs"
      }
    ],
    "link": "https://www.compositesworld.com/news/unisq-ilaunch-trailblazer-program-drive-digital-twin-innovation-for-composite-repairs"
  },
  {
    "published": "Fri, 22 Aug 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      22,
      18,
      0,
      0,
      4,
      234,
      0
    ],
    "title": "FACC achieves 10.6% revenue growth in H1 2025 amid aerospace supply chain challenges",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FACC achieves 10.6% revenue growth in H1 2025 amid aerospace supply chain challenges"
    },
    "summary": "Revenue was increased to &euro;484.7 million and a positive &euro;18.4 million EBIT&nbsp;maintained, driven by strong business jet demand, global expansion of FACC&rsquo;s production network&nbsp;and early results from its efficiency program.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Revenue was increased to &euro;484.7 million and a positive &euro;18.4 million EBIT&nbsp;maintained, driven by strong business jet demand, global expansion of FACC&rsquo;s production network&nbsp;and early results from its efficiency program."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-FACC-winglet-production.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Winglet production.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-FACC-winglet-production.jpg;maxWidth=720\" /> </a></div>\n\n<p>Winglet production. Source | FACC Bartsch</p>\n</div>\n\n<p>In the first half of 2025,&nbsp;<a href=\"https://www.facc.com/en/\" target=\"_blank\">FACC</a>&nbsp;(Ried im Innkreis, Austria) reports it was able to achieve a&nbsp;10.6% increase in revenue to &euro;484.7 million (same period in 2024: &euro;438.3 million) despite a still challenging global environment.</p>\n\n<p>All divisions of FACC (Aerostructures, Cabin Interiors, and Engines and Nacelles)&nbsp;reported a positive EBIT in the first half of 2025. Group EBIT of &euro;18.4 million is in line with management's expectations and is burdened by disruptions in international supply chains as well as high material and personnel costs (same period in 2024: &euro;22.5 million). Compared to the previous year, the number of employees increased by 123 employees (FTE).</p>\n\n<p>Overall, growth of the aviation industry continued in the first half of the year. While short-term adjustments took place in the market for passenger aircraft &mdash; which were affected by supply chain problems in the engine sector&nbsp;&mdash;&nbsp;FACC was able to benefit from the sustained positive development of the business jet market in part due to the company&rsquo;s&nbsp;diverse product strategy. The long-term growth of the whole industry is illustrated by a worldwide record order backlog of more than&nbsp;17,500 passenger aircraft ordered. This is also reflected in FACC&rsquo;s order backlog, which rose to more than $6 billion in the first half of 2025 with new orders and rate increases.</p>\n\n<p>FACC&rsquo;s&nbsp;global production and sales network of 15 international locations in Europe, the U.S. and Asia provides it with a high level of resilience given the current geopolitical challenges. With the strengthening of the <a href=\"https://www.compositesworld.com/news/facc-agreements-with-rolls-royce-tata-and-kineco-expand-its-global-backlog-footprint-in-india-\" target=\"_blank\">supply chain in India</a>, relocation of production of the COMAC C919 product range (structural and interior systems) to China, and an increase in operating performance at the FACC plants in Croatia/Jakovlje and in Canada/Montreal, this location strategy could be further advanced in the first half of 2025.&nbsp;</p>\n\n<p>The company&rsquo;s cost reduction and efficiency program, which has been in place since October 2024, is already showing results. This is illustrated by FACC&rsquo;s increase in revenue with around the same&nbsp;number of employees since the end of FACC&rsquo;s&nbsp;2024 financial year. In addition, the focus in the first half of 2025 was on optimizing the supply chain and reducing material inventories. These have been significantly reduced since the end of Q3 2024, thereby contributing to an improvement in cash flow.</p>\n\n<p>When considering its outlook for the duration of 2025, FACC expects to see around&nbsp;5 billion passengers in the aerospace industry&nbsp;for the first time. Airlines&rsquo; demand for efficient and modern aircraft remains high, and despite ongoing supply chain challenges, all major aircraft manufacturers are confirming their targets for the entire 2025 financial year at the end of the first half of the year.</p>\n\n<p>Based on the current market situation for 2025, FACC management expects growth to continue and has specified its outlook at the half-year mark at around &euro;1 billion in group revenue, which corresponds to a revenue growth of more than 10% compared to the previous year. The EBIT margin will continue to improve compared to 2024 due to effects from FACC&rsquo;s efficiency improvement program currently being implemented (2024: 3.2%).</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/facc-achieves-106-revenue-growth-in-h1-2025-amid-aerospace-supply-chain-challenges"
      }
    ],
    "link": "https://www.compositesworld.com/news/facc-achieves-106-revenue-growth-in-h1-2025-amid-aerospace-supply-chain-challenges"
  },
  {
    "published": "Fri, 22 Aug 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      22,
      17,
      0,
      0,
      4,
      234,
      0
    ],
    "title": "Archer completes longest flight for piloted Midnight aircraft",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Archer completes longest flight for piloted Midnight aircraft"
    },
    "summary": "The 55-mile flight&nbsp;follows a series of key developments in Archer&rsquo;s commercialization roadmap, including the continuation of its manufacturing ramp-up throughout the U.S. and the activation of its Launch Edition program in the UAE.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The 55-mile flight&nbsp;follows a series of key developments in Archer&rsquo;s commercialization roadmap, including the continuation of its manufacturing ramp-up throughout the U.S. and the activation of its Launch Edition program in the UAE."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-archer-longest-flight-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Piloted test flight of Midnight\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-archer-longest-flight-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Archer Aviation</p>\n</div>\n\n<p><a href=\"http://archer.com/\" target=\"_blank\">Archer</a>&nbsp;(Santa Clara, Calif., U.S.) has announced the successful completion of its longest piloted flight to date using the company&rsquo;s composites-intensive <em>Midnight</em> electric vertical takeoff and landing (eVTOL) aircraft. <em>Midnight</em> flew approximately&nbsp;55 miles in 31 minutes at speeds exceeding 126 miles per hour. The flight took place at Archer&rsquo;s flight test facility in Salinas, California, in front of United Airlines&rsquo; CTO, Mike Leskinen, who led United Airlines&rsquo; early investment in Archer.</p>\n\n<p>Test flights in the preceding week reached speeds of nearly 150 miles per hour over a variety of patterns. This latest achievement marks another milestone in Archer&rsquo;s envelope expansion program as the company advances toward Federal Aviation Administration (FAA)&nbsp;certification in the U.S. and near-term commercialization in the United Arab Emirates (UAE).</p>\n\n<p>The flight was conducted as a conventional takeoff and landing mission. Four of Archer&rsquo;s test pilots are now regularly conducting test flights in <em>Midnight</em>, underscoring the program&rsquo;s continued progress and maturity.</p>\n\n<p>According to Adam Goldstein, Archer&rsquo;s founder and CEO, &ldquo;Crossing the 50-mile mark at speed is another clear step toward commercialization that shows the maturity of our program.&rdquo;</p>\n\n<p>The experimental test pilot for this flight noted that throughout the 30-minute flight, the aircraft performed consistently, with predictable handling. <em>Midnight&nbsp;</em>flight test pilots will continue to expand speed and duration, and test mission profiles that map to early commercial operations.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/archer-completes-longest-flight-for-piloted-midnight-aircraft"
      }
    ],
    "link": "https://www.compositesworld.com/news/archer-completes-longest-flight-for-piloted-midnight-aircraft"
  },
  {
    "published": "Fri, 22 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      22,
      16,
      0,
      0,
      4,
      234,
      0
    ],
    "title": "James Cropper Optiveil polyester veils pass key medical standards",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "James Cropper Optiveil polyester veils pass key medical standards"
    },
    "summary": "New opportunities in healthcare are unlocked with the surface veil technology&rsquo;s validation for use in&nbsp;sensitive medical environments.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New opportunities in healthcare are unlocked with the surface veil technology&rsquo;s validation for use in&nbsp;sensitive medical environments."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-jamescropper-polyester-veil.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Optiveil surfacing veils.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-jamescropper-polyester-veil.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | James Cropper Advanced Materials</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/technical-fibre-products\" target=\"_blank\">James Cropper Advanced Materials</a>&rsquo; (Schenectady, N.Y., U.S.) Optiveil range of lightweight&nbsp;polyester veils has successfully passed critical medical testing, confirming its safety for human contact and suitability for use in wearable medical devices.</p>\n\n<p>The company&rsquo;s surface veil technology&nbsp;finds application in a diverse range of industries and specific components &mdash; from aerospace to wind energy to marine&nbsp;&mdash; and are often used&nbsp;to achieve a high-quality, resin-rich surface finish on composite parts. Now, with this new certification, Optiveil veils are ready to be&nbsp;incorporated into next-gen&nbsp;medical products, offering manufacturers a trusted and versatile material that meets the demands of both clinical environments and patient care.</p>\n\n<p>The materials underwent an in vitro cytotoxicity study in accordance with ISO 10993-5, the international standard for biological evaluation of medical devices. Conducted under ISO/IEC 17025:2017 laboratory conditions, the study assessed the potential for cytotoxic effects from direct contact with the polyester veil. The veil passed all testing criteria, demonstrating it does not cause any adverse cellular reactions. &nbsp;</p>\n\n<p>&ldquo;This successful certification marks a significant milestone in our journey to support innovation in healthcare,&rdquo; says&nbsp;Dr Mandy Clement, innovation director at James Cropper. &ldquo;Our Optiveil&nbsp;polyester veils are now validated for use in sensitive medical environments, including wearable technologies.&rdquo;</p>\n\n<p>Optiveil&rsquo;s skin-friendly, breathable and durable properties make them ideal for long-term wear in medical devices. The veil&rsquo;s uniform thickness and flexibility aid the production of pressure-sensitive adhesives and adhesive patches, while its mechanical strength enables integration with embedded electronics, in devices such as biosensors, smart bandages and therapeutic patches. The material also demonstrates optimal breathability and chemical resistance enhancing both patient comfort and durability.</p>\n\n<p>James Cropper Advanced Materials will be exhibiting the Optiveil range and a wider&nbsp;portfolio of advanced nonwoven veils at CAMX 2025.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/james-cropper-optiveil-polyester-veils-pass-key-medical-standards"
      }
    ],
    "link": "https://www.compositesworld.com/news/james-cropper-optiveil-polyester-veils-pass-key-medical-standards"
  },
  {
    "published": "Fri, 22 Aug 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      22,
      15,
      0,
      0,
      4,
      234,
      0
    ],
    "title": "Hexagon Composites extends strategic alliance agreement with Mitsui & Co.",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Hexagon Composites extends strategic alliance agreement with Mitsui & Co."
    },
    "summary": "The partnership, first established in 2016 and now extended into 2030, has focused on advancing composite technologies and accelerating adoption of alternative fuels.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The partnership, first established in 2016 and now extended into 2030, has focused on advancing composite technologies and accelerating adoption of alternative fuels."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-strategicagreement-gettyimages1.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Strategic agreement.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-strategicagreement-gettyimages1.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/hexagon-composites-asa\" target=\"_blank\">Hexagon Composites</a>&nbsp;(&Aring;lesund, Norway) and <a href=\"https://www.mitsui.com/us/en/index.html\" target=\"_blank\">Mitsui &amp; Co.&nbsp;Ltd.</a> (Tokyo, Japan), active world-wide in a wide range of sectors including clean energy and mobility, have extended a strategic alliance agreement until March 20, 2030, the date on&nbsp;which Mitsui&rsquo;s shareholding in the company falls below a certain shareholding ratio.&nbsp;The agreement was memorialized on Aug. 15 by Philipp Schramm, CEO of Hexagon Composites and Katsuto Kawahara, general manager of Mitsui&rsquo;s Functional Materials Division and Performance Materials Business Unit.</p>\n\n<p>Mitsui and Hexagon Composites have developed a close partnership over decades centered around the drive to accelerate and develop composite technologies. The original strategic alliance agreement was signed in 2016, and Mitsui has been a major shareholder in Hexagon Composites since.</p>\n\n<p>&ldquo;Mitsui&rsquo;s support as a strategic partner and shareholder has been essential to the development of Hexagon,&rdquo;&nbsp;says Schramm. &ldquo;Over the past decade, Mitsui&rsquo;s industrial expertise and global reach, have helped us set a benchmark in the industry and accelerate the adoption of alternative fuels. We look forward to continuing to leverage our synergies to drive the energy transition forward.&rdquo;</p>\n\n<p>Currently, Mitsui holds 33,229,096 shares in Hexagon Composites, which corresponds to 15.8% of the total shares.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hexagon-composites-extends-strategic-alliance-agreement-with-mitsui-co"
      }
    ],
    "link": "https://www.compositesworld.com/news/hexagon-composites-extends-strategic-alliance-agreement-with-mitsui-co"
  },
  {
    "published": "Fri, 22 Aug 2025 10:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      22,
      14,
      0,
      0,
      4,
      234,
      0
    ],
    "title": "U.S. Air Force backs Continuous Composites in advancing FEA simulation for anisotropic CF3D structures",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "U.S. Air Force backs Continuous Composites in advancing FEA simulation for anisotropic CF3D structures"
    },
    "summary": "Development of this FEA&nbsp;tool could solve the gap in simulating&nbsp;high-performance composite parts under various conditions, with potential applications&nbsp;across aerospace, defense&nbsp;and UAV.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Development of this FEA&nbsp;tool could solve the gap in simulating&nbsp;high-performance composite parts under various conditions, with potential applications&nbsp;across aerospace, defense&nbsp;and UAV."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-continuouscomposites-fea-heat-map.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"FEA heat map of a part.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-continuouscomposites-fea-heat-map.jpg;maxWidth=720\" /> </a></div>\n\n<p>FEA heat map shows stress and strain distribution across the geometry under the applied load. Source | Coriolis Composites</p>\n</div>\n\n<p>On Aug. 15, <a href=\"https://www.compositesworld.com/suppliers/continuous-composites\" target=\"_blank\">Continuous Composites</a> (CCI, Coeur d&rsquo;Alene, Idaho, U.S.) was awarded a $1.9 million&nbsp;<a href=\"https://www.sbir.gov/awards/214571\" target=\"_blank\">Tactical Funding Increase (TACFI)</a>&nbsp;contract from the U.S. Air Force to develop a finite element analysis (FEA) tool for Continuous Fiber 3D Printing (CF3D). This contract, which started in November 2024, will run through August 2026, and represents an advancement in the simulation of anisotropic composite materials.</p>\n\n<p>Currently, commercially available FEA solutions are limited to isotropic materials, such as metals, where strength and stress responses are uniform in all directions. However,&nbsp;CF3D&nbsp;composites are anisotropic, with primary strength in the direction of the fibers. This creates a challenge for traditional FEA software, which cannot accurately predict material behavior based on fiber orientation.</p>\n\n<p>&ldquo;We&rsquo;re solving a major gap in FEA simulation tools,&rdquo; says&nbsp;Steve Starner, CEO of Continuous Composites. &ldquo;Existing software only assigns a single directional property to each layer of composite material, but CF3D&rsquo;s fiber steering requires a more dynamic approach. Our new tool will accurately simulate how our parts will behave under various conditions, which is crucial for industries like aerospace and defense.&rdquo;</p>\n\n<p>CCI is partnering with&nbsp;industry experts&nbsp;on the development of this FEA tool. It will reportedly ingest CF3D toolpath data to generate mesh representations that more accurately reflect fiber orientation, material behavior&nbsp;and structural performance of how anisotropic parts will react to real-world loads.</p>\n\n<div class=\"article_sidebar\">\n<h3>What is CF3D?</h3>\n\n<p>Continuous Composites&rsquo;&nbsp;CF3D technology&nbsp;is&nbsp;a 3D printing process that combines continuous fiber reinforcement with thermoset&nbsp;resins and robotic automation to create strong, lightweight composite parts.&nbsp;It uses a continuous dry fiber that is impregnated with a resin, and then cured with UV light, enabling the creation of complex geometries and the embedding of sensors or circuits.&nbsp;This technology aims to disrupt traditional composites manufacturing by offering a more efficient and cost-effective way to produce high-performance parts, particularly in industries like aerospace and defense.&nbsp;</p>\n\n<p>Read &ldquo;<a href=\"https://www.compositesworld.com/articles/commercializing-uv-curable-thermosets-for-continuous-fiber-3d-printing\">Commercializing UV-curable thermosets for continuous fiber 3D printing</a>&rdquo; for more info.</p>\n</div>\n\n<p>As part of this effort, CCI will integrate the new tool into&nbsp;CF3D Studio, enabling the prediction of material properties and performance before physical testing begins. This capability is expected to dramatically reduce development time and increase reliability in the design of complex composite parts used in mission-critical applications.</p>\n\n<p>This contract is a milestone for Continuous Composites, advancing CF3D technology from a manufacturing process to a comprehensive design-to-performance solution.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/us-air-force-backs-continuous-composites-in-advancing-fea-simulation-for-anisotropic-cf3d-structures"
      }
    ],
    "link": "https://www.compositesworld.com/news/us-air-force-backs-continuous-composites-in-advancing-fea-simulation-for-anisotropic-cf3d-structures"
  },
  {
    "published": "Thu, 21 Aug 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      21,
      16,
      0,
      0,
      3,
      233,
      0
    ],
    "title": "Registration opens for CW Tech Days: High-Temperature Composite Solutions",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Registration opens for CW Tech Days: High-Temperature Composite Solutions"
    },
    "summary": "CW Tech Days: High-Temperature Composite Solutions for Defense and Space Applications will take place Oct. 16, 2025.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "CW Tech Days: High-Temperature Composite Solutions for Defense and Space Applications will take place Oct. 16, 2025."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"CW Tech Days graphi\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0425-cw-falltechdays25.png;maxWidth=720\" /> </div>\n\n<p>Sources (left to right) | Pyromeral Technology, Getty Images and Arceon</p>\n</div>\n\n<p><em>CompositesWorld</em> and <a href=\"https://www.compositesworld.com/suppliers/gardner-business-media\" target=\"_blank\">Gardner Business Media</a>&nbsp;(Cincinnati, Ohio, U.S.) have announced that the agenda is now finalized&nbsp;and registration is officially open for the next installment of the popular <em>CW</em>&nbsp;Tech Days online event series. The event will be held Oct. 16, 2025, from 11:00 a.m. &ndash; 3:30 p.m. ET and will cover <a href=\"https://www.compositesworld.com/kc/cw-tech-days-high-temp\" target=\"_blank\">&ldquo;High-Temperature Composite Solutions for Defense and Space Applications.&rdquo;</a></p>\n\n<p>As defense and space programs push the limits of speed, endurance and mission capability, material performance at extreme temperatures has never been more critical. <em>CW</em>&rsquo;s latest installment of Tech Days will deliver a focused look at the latest advancements in lightweight, thermally stable composite materials engineered for the toughest aerospace and defense environments.</p>\n\n<p>The finalized agenda is as follows:</p>\n\n<ul>\n\t<li>\n\t<p><strong>11:15-11:45 a.m.: </strong>&ldquo;Carbeon C/C-SiC: A Scalable, Cost-Effective Ceramic Matrix Composite for High-Temperature Applications&rdquo; <em>&mdash; Presented by&nbsp;Rahul Shirke, founder and CEO, Arceon</em></p>\n\t</li>\n\t<li>\n\t<p><strong>11:45 a.m.-12:15 p.m.:</strong> &ldquo;Novel Slurry Infusion for CMCs&rdquo;<em> &mdash; Presented by Dr. Vito Leisner, DLR/Fox Composites</em></p>\n\t</li>\n\t<li>\n\t<p><strong>1:00-1:30 p.m.: </strong>&ldquo;High-Temperature Materials &amp; Structures for Re-Entry and Hypersonic Systems&rdquo;&nbsp;<em>&mdash; Presented by Mario De Stefano Fumo, deputy head space materials and hot structures unit space directorate, CIRA</em></p>\n\t</li>\n\t<li>\n\t<p><strong>1:30-2:00 p.m.:</strong> &ldquo;Bridging the Thermal Performance and Cost Gap Between CFRPs and CMCs&rdquo;&nbsp;&mdash; <em>Presented by Darren Friberg, VP Business Dev, Pyromeral Technology</em></p>\n\t</li>\n\t<li>\n\t<p><strong>2:30-3:00 p.m.:</strong> &ldquo;Phthalonitrile Composites for Carbon/Carbon and Ablative Thermal Protection&rdquo;<em> &mdash; Presented by Joseph Severino, principal engineer- C/C, TPS, Cambium USA</em></p>\n\t</li>\n\t<li>\n\t<p><strong>3:00-3:30 p.m.: </strong>&ldquo;Pyrolysis of Phenolic Resin and Other Organic Precursors for C-C and CMC Composites&rdquo;<em>&nbsp;&mdash; Presented by William Carty, CTO, MRF Furnaces</em></p>\n\t</li>\n</ul>\n\n<p>Don&rsquo;t miss this opportunity to learn from and engage with leading voices in the field. <a href=\"https://www.compositesworld.com/kc/cw-tech-days-high-temp\" target=\"_blank\">Registration is now open</a> &mdash; secure your spot today.&nbsp;It is $49&nbsp;to attend this&nbsp;webinar&nbsp;live or watch at your convenience on-demand! (An email with the recording will be sent to those who cannot attend the event.)</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/registration-opens-for-cw-tech-days-high-temperature-composite-solutions"
      }
    ],
    "link": "https://www.compositesworld.com/news/registration-opens-for-cw-tech-days-high-temperature-composite-solutions"
  },
  {
    "published": "Thu, 21 Aug 2025 11:04:00 -0400",
    "published_parsed": [
      2025,
      8,
      21,
      15,
      4,
      0,
      3,
      233,
      0
    ],
    "title": "Celebrate innovation during National Composites Week",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Celebrate innovation during National Composites Week"
    },
    "summary": "National Composites Week 2025 is next week! No matter your role in the industry &mdash; CEOs, researchers, engineers, educators, students &mdash; make sure to join the movement to explore, learn and celebrate the incredible role of composites.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "National Composites Week 2025 is next week! No matter your role in the industry &mdash; CEOs, researchers, engineers, educators, students &mdash; make sure to join the movement to explore, learn and celebrate the incredible role of composites."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": ""
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/celebrate-innovation-during-national-composites-week"
      }
    ],
    "link": "https://www.compositesworld.com/news/celebrate-innovation-during-national-composites-week"
  },
  {
    "published": "Wed, 20 Aug 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      8,
      20,
      18,
      0,
      0,
      2,
      232,
      0
    ],
    "title": "Cygnet Texkimp relaunches customer slitting trials at UK Innovation Centre",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Cygnet Texkimp relaunches customer slitting trials at UK Innovation Centre"
    },
    "summary": "A production-scale prepreg tape slitting system featuring SAHM winding technology is available for thermoset, thermoplastic and ceramic tape trialing following an Asia contract win.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "A production-scale prepreg tape slitting system featuring SAHM winding technology is available for thermoset, thermoplastic and ceramic tape trialing following an Asia contract win."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\"><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0825-cw-news-cygnet-prepreg-tape-slitting-machine.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </a></div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Cygnet-slit-tape-actual-machine.JPG\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"In-house tape slitting equipment. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Cygnet-slit-tape-actual-machine.JPG;maxWidth=720\" /> </a></div>\n\n<p>In-house tape slitting equipment. Source (All Images) | Cygnet Texkimp</p>\n</div>\n\n<p>Fiber&nbsp;handling and converting technology specialist <a href=\"https://www.compositesworld.com/suppliers/cygnet-texkimp\" target=\"_blank\">Cygnet Texkimp</a> (Northwich, U.K.) has unveiled its next-gen production-scale prepreg&nbsp;tape slitting machine installed at its&nbsp;UK Innovation Centre.</p>\n\n<p>The technology has been developed to support advances in automated fiber placement (AFP) and automated tape laying (ATL) applications for aerospace and other high-performance industries. Organizations can trial the slitting of continuous thermoset, thermoplastic and ceramic prepreg tapes in real-world conditions using their own materials or those produced on Cygnet Texkimp&rsquo;s in-house R&amp;D prepreg machines (those interested in trialing <a href=\"https://cygnet-texkimp.com/contact/\" target=\"_blank\">can reach out here</a>). The system can slit tapes at speeds of up to 60 meters/minute, subject to the input material.</p>\n\n<p>The move follows the sale of the company&rsquo;s original demonstrator machine to a composite material manufacturer based in East Asia. The contract was won after a successful program&nbsp;of trials using the customer&rsquo;s prepreg materials to produce tapes for AFP applications in the aerospace market. The machine was subsequently upgraded by Cygnet Texkimp to retrofit in-process monitoring and data capture and enable&nbsp;the management of key data including tape width, thickness and consistency. In this way the customer can create digital passports for the slit tapes which can then be tracked in the downstream process.</p>\n\n<p>Cygnet Texkimp&rsquo;s&nbsp;prepreg&nbsp;tape slitting technology is typically used by materials producers to develop tapes for the high-rate production of composite parts, including large-scale parts, using AFP and ATL.&nbsp;Notably, it enables manufacturers to integrate the slitting process into their own production environment rather than subcontracting. According to Cygnet Texkimp, having the resources to convert prepreg on-site gives manufacturers complete control of production quality and speed and removes the need to ship or store materials, therefore enhancing efficiency and profitability. This is particularly important in the case of thermoset prepregs, which have a limited shelf life and need to be stored in special conditions.</p>\n\n<div class=\"article-figure fl-image fl-l font-weight-light g-img m-r-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Cygnet-tapeslitting-winding-tech.jpg\" target=\"_blank\"><img alt=\"Tape slitting up close.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0825-cw-news-Cygnet-tapeslitting-winding-tech.jpg;maxWidth=385\" /></a></div>\n</div>\n\n<p>With increasing emphasis on automation in composite layup, the quality of the slit tapes is a critical enabler for part performance and manufacturing reliability. Cygnet Texkimp&rsquo;s machine is engineered to achieve very high levels of accuracy and consistency in the slitting of continuous thermoset, thermoplastic, ceramic and other materials. Its design draws on extensive understanding of material behavior to deliver accurate and uniform slit tapes&nbsp;with minimal material scrap&nbsp;or operational downtime.</p>\n\n<p>The slitting machine features fiber&nbsp;and tape spooling banks provided by winding technology specialist <a href=\"https://www.sahmwinder.com/\" target=\"_blank\">SAHM</a> (Eschwege, Germany) and is capable of processing intermediate materials including a polymer interleaf. SAHM&rsquo;s 460XE compact and modular winders feature a low-maintenance, reliable design, capable of handling various bobbin types and winding materials with efficient product changes. The technology offers the flexibility to wind packages in a variety of formats, including pineapple and cassette formations. The two companies have worked together for almost 50 years, since Cygnet Texkimp first became SAHM&rsquo;s agent and reseller in the U.K.</p>\n\n<p>Feedback from customer trials has shown that Cygnet Texkimp&rsquo;s equipment helps to improve uptime in the downstream process, reduces scrap and increases speed, efficiency and equipment ROI.</p>\n\n<p>&ldquo;We rebuilt our slitter spooler capability back into our Innovation Centre after a particularly successful trial program&nbsp;resulted in the sale of our original machine,&rdquo; says Graeme Jones, wide web product director at Cygnet Texkimp. &ldquo;The technologies we have in the Centre&nbsp;are the same designs we have out in the market, and this results in very reliable and realistic test programs that prove out processes and illustrate ROI. In this case, the machine was able to completely satisfy the customer with regards to speed and efficiency, and we were able to agree a deal for the same machine that was used in the trials and further equip it to deliver a bespoke solution.&rdquo;</p>\n\n<p>Jones adds that Cygnet Texkimp is looking forward to engaging with partners at&nbsp;early stage&nbsp;in-process development&nbsp;to test out their concepts, explore machine parameters, assess output quality and validate performance with support from Cygnet&rsquo;s team.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/cygnet-texkimp-relaunches-customer-slitting-trials-at-uk-innovation-centre"
      }
    ],
    "link": "https://www.compositesworld.com/news/cygnet-texkimp-relaunches-customer-slitting-trials-at-uk-innovation-centre"
  }
]