[
  {
    "published": "Fri, 13 Jun 2025 15:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      19,
      0,
      0,
      4,
      164,
      0
    ],
    "title": "Archer raises $850 million, accelerates U.S. eVTOL rollout",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Archer raises $850 million, accelerates U.S. eVTOL rollout"
    },
    "summary": "The additional funds&nbsp;further support Archer&rsquo;s liquidity position of approximately $2 billion in anticipation of Midnight&rsquo;s commercialization.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The additional funds&nbsp;further support Archer&rsquo;s liquidity position of approximately $2 billion in anticipation of Midnight&rsquo;s commercialization."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-archeraviation.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Midnight static image.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-archeraviation.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Source | Archer Aviation</p>\n</div>\n\n<p>On June 13, <a href=\"https://archer.com/\" target=\"_blank\">Archer Aviation Inc.</a> (Santa Clara, Calif., U.S.) raised an additional $850 million&nbsp;following the announcement by the current U.S. administration to implement&nbsp;eVTOL Integration Pilot Program<em>&nbsp;</em>focused on accelerating the deployment of eVTOL aircraft in the U.S.</p>\n\n<p>Archer intends to closely coordinate with the administration, Department of Transportation (DOT) and the Federal Aviation Administration (FAA) on how this can integrate into Archer&rsquo;s plans to ramp its operations in the U.S. ahead of the LA 28 Olympic Games at which Archer will serve as the <a href=\"https://www.compositesworld.com/news/archer-to-provide-midnight-evtol-for-2028-olympic-paralympics\" target=\"_blank\">official air taxi provider</a> of the Olympic Games and Team USA.&nbsp;</p>\n\n<p>Archer will be at the 2025 Paris Air Show showcasing its <em>Midnight</em> aircraft and hosting delegations from more than 20 countries. Archer CEO and founder Adam Goldstein is set to meet with the U.S.&nbsp;Secretary of Transportation, Sean P. Duffy, and acting FAA administrator, Chris Rocheleau, while at the show.</p>\n\n<p>The financing provided for the purchase and sale of 85,000,000 shares of Archer&rsquo;s Class A common stock at a price of $10.00 per share in a registered direct offering. The net proceeds from the offering announced will be used for general corporate purposes, with a focus on the build out of Archer&rsquo;s commercial capabilities, including infrastructure to support Archer&rsquo;s recently announced initiatives, both in the U.S. and Archer&rsquo;s &ldquo;Launch Edition&rdquo; markets, and the development of an AI-based aviation software platform.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/archer-raises-850-million-accelerates-us-evtol-rollout"
      }
    ],
    "link": "https://www.compositesworld.com/news/archer-raises-850-million-accelerates-us-evtol-rollout"
  },
  {
    "published": "Fri, 13 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      17,
      0,
      0,
      4,
      164,
      0
    ],
    "title": "Dura Composites calls for reconsideration of U.K. Building Safety Act fire regulations",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Dura Composites calls for reconsideration of U.K. Building Safety Act fire regulations"
    },
    "summary": "With incorrect enforcement hampering vital remedial work,&nbsp;Dura Composites provides checklist for specifiers seeking composite and metal products for high-rise building projects.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "With incorrect enforcement hampering vital remedial work,&nbsp;Dura Composites provides checklist for specifiers seeking composite and metal products for high-rise building projects."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-dura-composite-decking.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composite decking.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-dura-composite-decking.png;maxWidth=720\" /> </a></div>\n\n<p>An example of Dura Composites&rsquo; composite terrace decking with&nbsp;A1 fire classification. Source | Dura Composites</p>\n</div>\n\n<p>Manufacturer of composite and metal solutions for civil infrastructure <a href=\"https://www.compositesworld.com/suppliers/dura-composites\" target=\"_blank\">Dura Composites</a>&nbsp;(Clacton-on-Sea, U.K.) is&nbsp;calling for an urgent rethink of the U.K.&rsquo;s safety regulations relating to decking and cladding for high-rise buildings, and how they are implemented. The company is also putting pressure on industry regulators to enforce tighter rules about fire testing.</p>\n\n<p>According to the company, there is currently a level of confusion surrounding the exact criteria that different products need to comply with for buildings over the height of 11 meters. While cladding requires a classification of A2-s1,d0, <a href=\"https://www.gov.uk/government/publications/fire-safety-approved-document-b\" target=\"_blank\">Approved Document B</a> states that for flooring, a classification of A2fl-s1 should be achieved.</p>\n\n<p>However in practice, remedial designers are grouping these two very different products together and requesting an A2-s1d0 fire classification for all. Unless there is an imperforate substrate under it which extends to the full area of the balcony where A2fl-s1 materials are fitted, then A2fl-s1 is allowed.</p>\n\n<p>In other cases, Dura Composites has concerns that officials aren&rsquo;t upholding products to regulations stringently enough. Common issues include products not being tested by a UKAS-accredited test facility or in the right orientation, not being tested for the correct field of application, and not being tested in the right color, all of which are stated in the BS EN13501 fire classification standards and can affect the fire-resistance of decking, potentially putting occupants in danger, and leaving those in charge liable.</p>\n\n<p>Furthermore, some decking providers are circumventing the official UKAS accreditation, by having products tested in other countries with less strict requirements, before transporting them to the U.K.</p>\n\n<p>&ldquo;It&rsquo;s looking likely the government won&rsquo;t meet its target to start or complete remedial works on all buildings by July 2027,&rdquo; says Lee Cavalier, decking and cladding manager at Dura Composites. &ldquo;A big factor behind this is the rules themselves, both in terms of clarity over what is required, and actually enforcing these standards. Clearer rules and processes would prevent accidents and be fairer on suppliers, contractors and buyers. When manufacturers aren&rsquo;t clear on the ratings required for their own products, it&rsquo;s no surprise that awareness among housebuilders, developers and contractors is low.&rdquo;</p>\n\n<p>What should specifiers be asking? Dura Composites says that specifiers can protect themselves by asking the following questions about products, testing and installation for high-rise buildings:</p>\n\n<ul>\n\t<li>Is the certificate provider UKAS-accredited?</li>\n\t<li>Has every component of the product received a fire rating? Different aspects of a product may perform differently, so there should be a fire rating for each individual component.</li>\n\t<li>Do the fire rating and test certificate match the field of application?</li>\n\t<li>Does the installation guide advise on installation methods to match the field of application?</li>\n\t<li>Each product should be installed using a specific method to achieve its stated fire rating.</li>\n\t<li>Has the right orientation been tested? Different orientations may impact the fire rating of the product. Decking products should be tested horizontally, and cladding products should be tested in their intended orientation.</li>\n\t<li>Have all of the available colors been tested? Different colors of a product may impact its fire rating.</li>\n\t<li>Does the fire certificate state which colors are covered, specifically in section 4&nbsp;of the field of application? For example, only a single color is listed followed by &ldquo;no variation allowed.&rdquo;</li>\n</ul>\n\n<p>Uncertainty over regulations isn&rsquo;t the only thing holding up successful remediation work, Dura notes. It was recently announced that the Building Safety Regulator has missed its target to clear the backlog of Gateway 2 approvals by April. While&nbsp;thorough processes are important, this is yet another factor preventing remedial work that is crucial to residents&rsquo; safety.</p>\n\n<p>Dura Composites has submitted its concerns to the Building Safety Regulator and is encouraging other manufacturers to join the cause, asking for more transparency over fire safety standards for high-rise decking and cladding.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dura-composites-calls-for-reconsideration-of-uk-building-safety-act-fire-regulations"
      }
    ],
    "link": "https://www.compositesworld.com/news/dura-composites-calls-for-reconsideration-of-uk-building-safety-act-fire-regulations"
  },
  {
    "published": "Fri, 13 Jun 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      16,
      0,
      0,
      4,
      164,
      0
    ],
    "title": "GFRP Tech, FRP Institute USA establish the GFRP Institute South Africa",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "GFRP Tech, FRP Institute USA establish the GFRP Institute South Africa"
    },
    "summary": "The South African institute is dedicated to enhancing the region&rsquo;s education in GFRP composite materials for construction.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The South African institute is dedicated to enhancing the region&rsquo;s education in GFRP composite materials for construction."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-gfrp-institute.jpeg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"GFRP rebar being laid down.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-gfrp-institute.jpeg;maxWidth=720\" /> </a></div>\n\n<p>Through the GFRP Institute, professionals across the industry can adhere to the highest quality standards when working with and designing structures using glass fiber-reinforced polymer (GFRP) materials. Source | GFRP Tech</p>\n</div>\n\n<p>Allen Fiford, CEO of&nbsp;<a href=\"https://gfrptech.co.za/\" target=\"_blank\">GFRP Tech</a>&nbsp;(Johannesburg, South Africa), and Richard Krolewski, CEO of <a href=\"https://www.frp-institute.org/\" target=\"_blank\">FRP Institute USA</a>, are joining forces to enhance the education and application of glass fiber-reinforced polymer (GFRP) composite materials through the establishment of the GFRP Institute South Africa.</p>\n\n<p>The newly formed GFRP Institute is the first dedicated institute in the region aimed at promoting best practices, quality standards and compliance within the GFRP composites industry, while focusing on promoting the application of these products within the South African construction industry.</p>\n\n<p>The institute will further serve as a hub for education, training&nbsp;and research. &ldquo;Our immediate focus is to bridge the knowledge gap regarding these composite materials in the construction sector,&rdquo;&nbsp;says Fiford.</p>\n\n<p>FRP Institute USA is a trade group formed in 2022 to promote the increased use of fiber-based polymer (FRP) reinforcement in concrete infrastructure such as bridges, roadways, seawalls and related structures. The FRP Institute collaborates with federal agencies, state DOTs, AASHTO, standards-setting groups and academia to increase awareness of FRPs, certify manufacturers, standardize specifications, test FRP materials and develop technical educational programming.</p>\n\n<p>GFRP Tech&nbsp;supplies GFRP&nbsp;products for the concrete manufacturing industry and specializes in providing structural GFRP products to specific niche markets in the construction and engineering industries.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gfrp-tech-frp-institute-usa-establish-the-gfrp-institute-south-africa"
      }
    ],
    "link": "https://www.compositesworld.com/news/gfrp-tech-frp-institute-usa-establish-the-gfrp-institute-south-africa"
  },
  {
    "published": "Fri, 13 Jun 2025 11:30:00 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      15,
      30,
      0,
      4,
      164,
      0
    ],
    "title": "Embraer publishes 20-year commercial aviation market outlook",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Embraer publishes 20-year commercial aviation market outlook"
    },
    "summary": "The annual report&nbsp;presents analyses of global influences and trends in seven world regions that impact the demand for new aircraft, and how&nbsp;airlines can respond with more flexible and resilient fleet strategies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The annual report&nbsp;presents analyses of global influences and trends in seven world regions that impact the demand for new aircraft, and how&nbsp;airlines can respond with more flexible and resilient fleet strategies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-embraer-2025-marketreport.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-embraer-2025-marketreport.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Embraer <a href=\"https://www.embraercommercialaviation.com/news/embraer-forecasts-demand-for-10500-new-aircraft/\" target=\"_blank\">report</a></p>\n</div>\n\n<p><a href=\"https://embraer.com/\" target=\"_blank\">Embraer</a> (S&atilde;o Jos&eacute; dos Campos, Brazil) has published &ldquo;Market Outlook 2025,&rdquo; its annual 20-year forecast for commercial aircraft deliveries in the sub-150-seat category.</p>\n\n<p>The report estimates 10,500 orders for new jets and turboprops through 2044. It also presents analyses of global influences and trends in seven world regions that impact the demand for new aircraft. Because of its growing prominence in commercial aviation, statistics for China are detailed separately in this year&rsquo;s market outlook for the first time.</p>\n\n<p>The document also analyzes demand for cargo aircraft, including a forecast for passenger-to-freighter conversions.</p>\n\n<p>The overall forecast for the number of new sub-150-seat aircraft remains almost unchanged from Embraer&rsquo;s previous estimate. Arjan Meijer, Embraer&nbsp;president and CEO of Commercial Aviation, attributes the consistency of the estimate to the longevity of social, supply chain&nbsp;and geopolitical trends Embraer identified during the pandemic.</p>\n\n<p>&ldquo;Five years after the onset of the pandemic, many of the structural changes it triggered have proven to be quite long-lasting,&rdquo; says Meijer. &ldquo;In our first post-pandemic market outlook, we highlighted the transition from globalization to a more polarized geopolitical outlook. Today, as countries and regions pursue greater strategic autonomy, the demand for regional access will continue to grow. We believe mixed fleets that combine small and large narrowbody aircraft are essential for that long-term growth. They provide the versatility needed to better match capacity with demand, expand networks and support national and regional development goals.&rdquo;</p>\n\n<p>Embraer shares some of the highlights of its 20-year commercial market outlook below:</p>\n\n<ul>\n\t<li>World passenger traffic, measured in revenue passenger kilometers (RPK) is forecast to grow 3.9% annually through 2044. China will lead among seven global regions. The annual RPK regional growth rate is ranked as follows:&nbsp;5.7% China; 4.7% Latin America; 4.4% Africa; 4.4% Middle East; 4.1% Asia Pacific; 3.1% Europe and&nbsp;CIS; 2.4% North America.</li>\n\t<li>The&nbsp;RPK share by the end of 2044: 39% Asia Pacific; 37% Europe and&nbsp;North America.</li>\n\t<li>Global demand for new aircraft with up to 150 seats:&nbsp;10,500 units, 8,720 jets and 1,780 turboprops.</li>\n\t<li>Market value of all new aircraft: $680 billion.</li>\n\t<li>Jet deliveries &mdash;&nbsp;8,720 (% share) &mdash;&nbsp;by region: 2,680 North America (30.7%); 1,990 Europe and&nbsp;CIS (22.8%); 1,500 China (17.2%); 1,050 Asia Pacific (12.1%); 770 Latin America (8.8%); 380 Africa (4.4%); 350 Middle East (4.0%).</li>\n\t<li>Turboprop deliveries &mdash;&nbsp;1,780 (% share) &mdash;&nbsp;by region: 640 Asia Pacific (36.0%); 280 North America (15.7%); 260 Europe and&nbsp;CIS (14.6%); 220 Africa (12.4%); 200 China (11.2%); 160 Latin America (9.0%); 20 Middle East (1.1%).</li>\n</ul>\n\n<p>The complete Embraer&nbsp;&ldquo;Market Outlook 2025&rdquo;&nbsp;can be <a href=\"https://embraer.imagerelay.com/fl/678e7f8e728c4876824e5b4b18fef43a\" target=\"_blank\">downloaded here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/embraer-publishes-20-year-commercial-aviation-global-market-outlook"
      }
    ],
    "link": "https://www.compositesworld.com/news/embraer-publishes-20-year-commercial-aviation-global-market-outlook"
  },
  {
    "published": "Fri, 13 Jun 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      15,
      0,
      0,
      4,
      164,
      0
    ],
    "title": "Uavos UAV rotor blades successfully pass overload testing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Uavos UAV rotor blades successfully pass overload testing"
    },
    "summary": "Carbon fiber blades&nbsp;withstood high centrifugal loads without structural damage as part of an OEM program for third-party UAV manufacturers.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Carbon fiber blades&nbsp;withstood high centrifugal loads without structural damage as part of an OEM program for third-party UAV manufacturers."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-uavos-rotor-blade-test.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"UAV rotor blade.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-uavos-rotor-blade-test.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Uavos Inc.</p>\n</div>\n\n<p>Unmanned aerial systems developer&nbsp;<a href=\"http://www.uavos.com/\" target=\"_blank\">Uavos Inc.</a>&nbsp;(Mountain View, Calif., U.S.) has announced&nbsp;the successful completion of overload structural testing of main rotor blades designed for helicopters with a maximum takeoff weight (MTOW) of up to 50 kilograms.</p>\n\n<p>The tests were conducted by Alter Technology T&uuml;v Nord S.A.U. (Seville, Spain), a provider of testing, inspection&nbsp;and certification services, and confirmed&nbsp;the optimal structural integrity and manufacturing quality of Uavos&rsquo; composite unmanned aerial vehicle (UAV) blades,&nbsp;marking another milestone in the company&rsquo;s expanding OEM program for third-party UAV manufacturers.</p>\n\n<p>Rigorous testing confirmed the blades&rsquo; performance under high centrifugal loads, simulating real-world loads well above standard operating limits. During the tests, the rotor blade was subjected to a maximum simulated centrifugal load of 7,390 newtons&nbsp;(753.32 kilograms), a dynamometer measurement of 389 newtons&nbsp;(39.65 kilograms), and deformation was monitored at several points along the blade&rsquo;s span. All measured deformations remained within the acceptable range of &plusmn;36.3 millimeters, and no visible damage was detected either during or after the tests.</p>\n\n<p>&ldquo;Our blades are manufactured using carbon fiber prepreg under strict quality control, ensuring consistent reliability and safety in field conditions,&rdquo; says Aliaksei Stratsilatau, founder and CEO of Uavos. &ldquo;We are end users of our own products and verify their performance and safety daily during real-world UAV missions. Laboratory testing, in turn, provides our customers with confidence in the accuracy of the specifications we declare.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/uavos-uav-rotor-blades-successfully-pass-overload-testing"
      }
    ],
    "link": "https://www.compositesworld.com/news/uavos-uav-rotor-blades-successfully-pass-overload-testing"
  },
  {
    "published": "Fri, 13 Jun 2025 10:35:35 -0400",
    "published_parsed": [
      2025,
      6,
      13,
      14,
      35,
      35,
      4,
      164,
      0
    ],
    "title": "Composite Recycling, Owens Corning form recycling strategy",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composite Recycling, Owens Corning form recycling strategy"
    },
    "summary": "Collaboration will develop and refine methodologies for incorporating reclaimed composites waste into Owens Corning&rsquo;s existing glass fiber production streams.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaboration will develop and refine methodologies for incorporating reclaimed composites waste into Owens Corning&rsquo;s existing glass fiber production streams."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-compositerecycling-owenscorning.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Materials reuse.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-compositerecycling-owenscorning.jpg;maxWidth=720\" /> </a></div>\n\n<p>Owens Corning epoxy-based composite material used to produce wind turbine blades (left), after thermolysis treatment (center) and after calcination (right). Source | Composite Recycling</p>\n</div>\n\n<p>On June 11,&nbsp;<a href=\"https://composite-recycling.ch/\" target=\"_blank\">Composite Recycling</a>&nbsp;(Ecublens, Switzerland) announced a strategic collaboration with <a href=\"https://www.compositesworld.com/suppliers/owens-corning\" target=\"_blank\">Owens Corning</a>&rsquo;s (Toledo, Ohio, U.S.) glass fiber reinforcements business to&nbsp;develop sustainable solutions for composite waste and progress&nbsp;industrial-scale circular economy initiatives. The relationship will focus on incorporating the reclaimed glass fibers from Composite Recycling&rsquo;s <a href=\"https://www.compositesworld.com/news/nlcomp-composite-recycling-reveal-results-for-rcomposite-recyclability\" target=\"_blank\">recycling process</a> into Owens Corning&rsquo;s existing glass fiber production lines.</p>\n\n<p>&ldquo;Our recycling approach &mdash; using thermolysis &mdash;enables&nbsp;us to convert it [composites] into valuable secondary raw materials for industry,&rdquo; says Guillaume Perben, co-founder of Composite Recycling.&nbsp;</p>\n\n<p>The partnership is designed to achieve several key objectives, including:</p>\n\n<p><strong>Optimizing material integration.</strong>&nbsp;The parties will jointly develop and refine methodologies to incorporate recycled materials from the Composite Recycling process into Owens Corning&rsquo;s production streams of reclaimed glass fibers, which are used by industries such as boating, automotive, transportation, aerospace and construction materials, ensuring material performance and quality.</p>\n\n<p><strong>Scaling Composite Recycling&rsquo;s technologies.</strong>&nbsp;Together, the companies will drive the industrialization and scaling of Composite Recycling&rsquo;s recycling technology to make the process cost-effective and efficient at scale.</p>\n\n<p><strong>Circular solutions for composite waste.</strong>&nbsp;Owens Corning&rsquo;s glass fiber reinforcements business and Composite Recycling will work together to establish circular economy systems that handle composite waste throughout its life cycle.</p>\n\n<p>The companies will conduct technical trials, assessing the commercial<br />\nfeasibility of incorporating recycled materials into Owens Corning&rsquo;s production systems. The relationship will also focus on ensuring compliance with regulations and industry standards. Composite Recycling and Owens Corning have signed a letter of intent to align on content and next steps, and expect to finalize a formal agreement within the next 12 months to explore additional opportunities for using recycled composite materials in Owens Corning&rsquo;s diverse glass fiber products portfolio.</p>\n\n<p>Through the collaboration, Owen Corning&rsquo;s customers&nbsp;will also be able to access products containing these reclaimed glass fibers. &ldquo;The shift toward recycled content is no longer a trend &mdash; it&rsquo;s a necessity,&rdquo; says&nbsp;Dr. Chris Skinner, vice president of strategic marketing and R&amp;D for Owens Corning&rsquo;s glass fiber reinforcements business.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/composite-recycling-owens-corning-form-recycling-strategy"
      }
    ],
    "link": "https://www.compositesworld.com/news/composite-recycling-owens-corning-form-recycling-strategy"
  },
  {
    "published": "Thu, 12 Jun 2025 13:58:00 -0400",
    "published_parsed": [
      2025,
      6,
      12,
      17,
      58,
      0,
      3,
      163,
      0
    ],
    "title": "Mikrosam AFP work cell to enhance Qarbon's TPC part development",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Mikrosam AFP work cell to enhance Qarbon's TPC part development"
    },
    "summary": "Commission of a&nbsp;Libra-series robotic AFP system, paired with Toray&rsquo;s Cetex thermoplastic composite materials, will accelerate Qarbon Aerospace&rsquo;s development timelines and reduce risk in future aerospace qualification efforts.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Commission of a&nbsp;Libra-series robotic AFP system, paired with Toray&rsquo;s Cetex thermoplastic composite materials, will accelerate Qarbon Aerospace&rsquo;s development timelines and reduce risk in future aerospace qualification efforts."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Mikrosam-Qarbon-AFPsystem.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-Mikrosam-Qarbon-AFPsystem.jpg;maxWidth=720\" /> </a></div>\n\n<p>Mikrosam and Qarbon Aerospace team during FAT Mikrosam&rsquo;s facility in Macedonia. Source (All Images) | Mikrosam</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/mikrosam\" target=\"_blank\">Mikrosam</a> (Macedonia, Prilep) has successfully commissioned a robotic automated fiber placement (AFP) work cell at&nbsp;<a href=\"https://qarbonaerospace.com/\" target=\"_blank\">Qarbon Aerospace&nbsp;Inc.</a>&nbsp;(Red Oak, Texas, U.S.), which will help Qarbon meet the evolving demands of the aerospace industry for faster rates of manufacturing lightweight,&nbsp;strong parts.</p>\n\n<p>The Libra-series AFP system is specifically designed to elevate Qarbon Aerospace&rsquo;s R&amp;T capabilities, enabling the production of high-performance thermoplastic composite (TPC) parts with precision and efficiency. The work cell&rsquo;s key features include:&nbsp;</p>\n\n<ul>\n\t<li><em>Multi-material AFP head</em>. This is capable of processing thermoset, thermoplastic&nbsp;and dry fiber unidirectional (UD)&nbsp;prepreg tapes, ensuring versatility and flexibility in production.</li>\n\t<li><em>Advanced heating systems.</em>&nbsp;Integrated laser heating with multiple pyrometers and fast thermal camera for thermoplastic, and IR heating for thermoset prepregs ensure optimal material consolidation and quality.</li>\n\t<li><em>Quality control system (QCS).</em>&nbsp;Real-time monitoring and reporting of production parameters for traceability and quality assurance aligns&nbsp;with the aerospace industry&rsquo;s stringent standards.</li>\n\t<li><em>MikroPlace software.</em>&nbsp;The offline programming and simulation tools for seamless part design and production planning enhances&nbsp;efficiency and reduces&nbsp;production time.</li>\n\t<li><em>Flexible upgrades.</em>&nbsp;Options for automated head exchange, tool rotation axis&nbsp;and compatibility with wider tapes (&frac12; inch) for future scalability are available to remain adaptable.</li>\n\t<li><em>Automatic head exchange system.</em> Enables Qarbon to upgrade the AFP work cell in the future with additional AFP heads or end effectors.</li>\n</ul>\n\n<p>The AFP work cell has been&nbsp;tailored to Qarbon Aerospace&rsquo;s specific requirements. Its scope of supply includes a multi-material AFP head, equipped with laser heating and compaction during the placement of the tows while maintaining constant tow tension to ensure precise material placement. The system&rsquo;s ability to handle complex geometries, coupled with its closed-loop thermal control, ensures consistent quality and reduces material waste &mdash; critical factors for aerospace applications.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-mikrosam-afp-system-min.jpg\" target=\"_blank\"><img alt=\"Mikrosam’s AFP system.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-mikrosam-afp-system-min.jpg;maxWidth=385\" /></a></div>\n\n<p>Mikrosam&rsquo;s AFP system.</p>\n</div>\n\n<p>&ldquo;We are thrilled to support Qarbon Aerospace with this AFP solution to accommodate different manufacturing processes and materials,&rdquo; says&nbsp;Vele Samak, vice president at Mikrosam. &ldquo;Combined with Qarbon&rsquo;s know-how in producing thermoplastic parts, we believe this addition will speed up parts development and open new markets.&rdquo;</p>\n\n<p>The installation of Mikrosam&rsquo;s AFP work cell at Qarbon marks a major milestone in the company&rsquo;s effort to advance its composites manufacturing capabilities, particularly for thermoplastic technologies like induction welding and <a href=\"https://www.compositesworld.com/news/dod-awards-37-to-qarbon-aerospace-to-enhance-thermoplastics-production\" target=\"_blank\">Helios&nbsp;ice protection</a>.</p>\n\n<p>The AFP system supports active R&amp;T projects while positioning Qarbon to transition advanced TPC&nbsp;processes into future production programs.&nbsp;&ldquo;This system is a strategic investment in our future,&rdquo; adds&nbsp;John Hannappel, research and technology&nbsp;manager at Qarbon Aerospace. &ldquo;It not only advances our ability to develop and validate thermoplastic technologies, but also strengthens our position to support future defense and commercial programs with scalable, high-performance solutions.&rdquo;</p>\n\n<div style=\"text-align: center;\"></div>\n\n<p>Qarbon Aerospace has also partnered with <a href=\"https://www.compositesworld.com/suppliers/toray-advanced-composites\" target=\"_blank\">Toray&nbsp;Advanced Composites</a> (Morgan Hill, Calif., U.S.), leveraging its high-quality composite materials &mdash; and Toray Cetex&nbsp;thermoplastic prepregs and UD tapes in particular&nbsp;&mdash; to further enhance the performance and reliability of the aerospace components it produces. The Cetex brand features optimal&nbsp;resin distribution and highly consistent fiber alignment, making the material well suited for large structural components while eliminating processing steps and minimizing overall costs. It is offered in a wide range of fiber-resin combinations and meets aerospace OEM&rsquo;s strict specifications.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/mikrosam-afp-work-cell-to-enhance-qarbons-tpc-part-development"
      }
    ],
    "link": "https://www.compositesworld.com/news/mikrosam-afp-work-cell-to-enhance-qarbons-tpc-part-development"
  },
  {
    "published": "Thu, 12 Jun 2025 07:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      12,
      11,
      0,
      0,
      3,
      163,
      0
    ],
    "title": "Comau, Roboze initiative democratizes on-demand 3D printing",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Comau, Roboze initiative democratizes on-demand 3D printing"
    },
    "summary": "The Italian companies leverage expertise in robotics, 3D printing, and composite and polymer materials to enable&nbsp;innovation, agility&nbsp;and sustainability, opening new customer and market segments.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The Italian companies leverage expertise in robotics, 3D printing, and composite and polymer materials to enable&nbsp;innovation, agility&nbsp;and sustainability, opening new customer and market segments."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-comau-roboze.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </a></div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-roboze-comau-updated.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Roboze and Comau 3D printing and robotic solutions.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0625-cw-news-roboze-comau-updated.png;maxWidth=720\" /> </a></div>\n\n<p>Source | Roboze, Comau</p>\n</div>\n\n<p>Automation companies <a href=\"https://www.comau.com/en/\" target=\"_blank\">Comau S.p.A.</a> (Turin, Italy) and <a href=\"https://www.roboze.com/en/\" target=\"_blank\">Roboze</a> (Bari, Italy) have&nbsp;announced a collaboration focused on meeting the market need for affordable automation in advanced, on-demand manufacturing applications, combining&nbsp;Roboze&rsquo;s expertise in advanced manufacturing and high-performance polymers and composites with Comau&rsquo;s automation know-how.</p>\n\n<p>The cooperation targets a range of sectors, from automotive and aerospace to energy, racing&nbsp;and beyond, aiming to accelerate&nbsp;the availability of automation for advanced manufacturing everywhere. This directly supports reshoring strategies and sustainable manufacturing models, allowing companies to optimize resources, minimize waste&nbsp;and align with growing market expectations for low-impact, environmentally responsible production.</p>\n\n<p>This collaboration emphasizes the key role of robotized processes in enabling the widespread industrial adoption of needs-based advanced manufacturing. It also enables the creation of advanced geometries that are not feasible with traditional manufacturing methods, empowering companies to produce complex and customized parts on demand through a highly flexible and cost-effective system.</p>\n\n<p>&ldquo;The combined expertise and technologies allow us to offer customers solutions that integrate automation, robotics&nbsp;and additive manufacturing,&rdquo; emphasizes Giacomo Del Panta, chief customer management officer of Comau. &ldquo;We are confident this collaboration can bring tangible benefits to manufacturing processes across numerous industrial sectors.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/comau-roboze-initiative-democratizes-on-demand-3d-printing"
      }
    ],
    "link": "https://www.compositesworld.com/news/comau-roboze-initiative-democratizes-on-demand-3d-printing"
  },
  {
    "published": "Wed, 11 Jun 2025 14:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      11,
      18,
      0,
      0,
      2,
      162,
      0
    ],
    "title": "Gurit celebrates 190 years and its heritage in advanced materials",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Gurit celebrates 190 years and its heritage in advanced materials"
    },
    "summary": "Prior to the composite materials provider&nbsp;industry&nbsp;knows today, Gurit was founded as a small textile finishing business. The company looks back at its roots, people and products over the years.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Prior to the composite materials provider&nbsp;industry&nbsp;knows today, Gurit was founded as a small textile finishing business. The company looks back at its roots, people and products over the years."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-gurit-1960s.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Gurit Freienbach entrance.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-gurit-1960s.jpg;maxWidth=720\" /> </a></div>\n\n<p>Gurit&nbsp;Freienbach in the late 1960s. Source (All Images) | Gurit AG</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/gurit-uk\" target=\"_blank\">Gurit</a>&nbsp;(Zurich, Switzerland), celebrating 190 years, looks back at&nbsp;its journey from serving the textiles industry, to its current work in composite materials.</p>\n\n<p>In 1835, Georg Philipp Heberlein founded&nbsp;a small textile finishing business in Wattwil, Switzerland. What was originally a craft business grew into an industrial operation, starting with the use of synthetic dyes, then a garment dyeing plant in 1897, followed by a printing plant in 1916. Over the years, generations of the Heberlein family have pioneered advancements in synthetic fibers and textile machinery, establishing a strong reputation in a burgeoning industry in Eastern Switzerland.</p>\n\n<p>In 1929, the company expanded into rubber and synthetic foam manufacturing with the creation of Gurit, a Heberlein-owned company, in Richterswil, Switzerland. Gurit was named after &ldquo;Gummiwerk Richterswil&rdquo; (Richterswil rubber factory). This new company laid the foundation for what would become a significant transformation for the business.</p>\n\n<p>The textile and plastics divisions developed independently through the mid-1960s, both driven however by materials innovation. After World War 2, as natural fibers were in short supply, demand for artificial alternatives surged.&nbsp; Heberlein modernized and expanded its dyeing facilities, but it was the invention and patenting of Helanca &mdash; a method for adding stretch to synthetic fibers &mdash; that fueled major growth. By the late 1960s, the Wattwil plant employed more than 2,500 people,&nbsp;with the entire Heberlein Group employing over 5,000. However, a global synthetic fiber crisis in the 1970s led to the collapse of the textile division. Major restructuring followed, with the Helanca brand eventually sold to Saurer and the textile business gradually wound down.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-gurit-archived-labels.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-gurit-archived-labels.jpg;maxWidth=385\" /></a></div>\n\n<p>Gurit&nbsp;Helanca labels.</p>\n</div>\n\n<p>Gurit, the plastics division, had a slow start in the 1930s, but flourished after World War 2. By 1960, it employed some 700 people, producing plastic goods of all kinds, from raincoats to vinyl flooring. In the mid-60s, the Gurit Essex division was added (a joint venture between Gurit and Essex Chemical and then Dow Chemical), followed by the acquisition of Coltane (specializing in dental products),&nbsp;the founding of Gurit&nbsp;Schaumstoff&nbsp;and&nbsp;acquisition of&nbsp;the&nbsp;film manufacturer,&nbsp;Worbla.&nbsp;By the late 1960s,&nbsp;Gurit had outgrown its original site in Richterswil and expanded to Freienbach.</p>\n\n<p>In 1984, following the growth of the Gurit division and its future, an&nbsp;unusual step was taken to create the company Gurit-Heberlein, with the subsidiary becoming the parent company, paving the way for new investment and a new path to success.</p>\n\n<p>In partnership with Essex Chemical, Gurit helped transform the automotive industry and became, what it says was the largest European supplier of automotive adhesives, sealants and body engineered systems for the automotive OEM and aftermarket at the time. As the global car market evolved, Gurit sold its stake to Dow Chemical in 2000. This enabled the company to focus on healthcare and composite materials. The cash injection enabled the well-executed closure of the struggling textiles business, with a further 13 years needed to complete the thorough demolition, cleanup and sale of the land.</p>\n\n<p>The 2000s marked a period of strategic growth. Gurit acquired materials manufacturers specializing in aerospace, marine, wind energy&nbsp;and other high-performance sectors, bringing depth of expertise and breadth of experience in materials such as prepregs, epoxies, core materials, engineering services, tooling and kitting. These acquisitions strengthened the company&rsquo;s position in performance materials. In 2006, Gurit listed the healthcare division, Medisize, as an independent company on the SIX Swiss Exchange, with Gurit Holding AG&rsquo;s sole focus now advanced composite materials. Further, in 2024, Gurit sharpened its focus, responding to challenging market conditions by rightsizing its business and divesting selected product lines. &nbsp;</p>\n\n<p>Today, as Gurit celebrates nearly two decades of performance materials, the company says it continues to push the boundaries of innovation in advanced composites. Committed to sustainability and forward-thinking solutions, Gurit partner with clients in the wind, marine, transportation, construction and other sectors to shape a smarter, more sustainable future.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gurit-celebrates-190-years-and-its-heritage-in-advanced-materials"
      }
    ],
    "link": "https://www.compositesworld.com/news/gurit-celebrates-190-years-and-its-heritage-in-advanced-materials"
  },
  {
    "published": "Wed, 11 Jun 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      6,
      11,
      17,
      0,
      0,
      2,
      162,
      0
    ],
    "title": "Toray, Daher and Tarmac Aerosave announce End-of-Life Aircraft Recycling Program",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Toray, Daher and Tarmac Aerosave announce End-of-Life Aircraft Recycling Program"
    },
    "summary": "Collaborative initiative&nbsp;aims to reuse secondary structural TPC&nbsp;parts from EOL&nbsp;Airbus A380 aircraft and repurpose them for other aeronautical applications in order to collectively advance TPC recycling technologies.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Collaborative initiative&nbsp;aims to reuse secondary structural TPC&nbsp;parts from EOL&nbsp;Airbus A380 aircraft and repurpose them for other aeronautical applications in order to collectively advance TPC recycling technologies."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-airbus-a30-pylon-cover-toraycetexpps.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airbus A30 pylon cover.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0625-cw-news-airbus-a30-pylon-cover-toraycetexpps.jpg;maxWidth=720\" /> </a></div>\n\n<p>This Airbus A30 pylon cover is made using Toray Cetex carbon fiber-reinforced thermoplastic PPS. Source | Toray Advanced Composites B.V.</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/toray-advanced-composites-bv\" target=\"_blank\">Toray Advanced Composites B.V.</a> (Nijverdal, The Netherlands), <a href=\"https://www.daher.com/en/\" target=\"_blank\">Daher</a>&nbsp;(Paris, France) and <a href=\"https://www.tarmacaerosave.aero/\" target=\"_blank\">Tarmac Aerosave</a>&nbsp;(Azereix, France) announce the launch of a joint End-of-Life Aerospace Recycling Program for commercial aircraft production. Working with Airbus (Toulouse, France), this collaborative initiative will focus on advancing recycling technology practices in aerospace manufacturing by recovering and reusing end-of-life (EOL) secondary structural components made from continuous fiber-reinforced thermoplastic composites (TPC).</p>\n\n<p>The project aims to extend the useful life of composite materials and contribute to the aviation industry&rsquo;s net-zero goals by developing remanufacturing processes and creating a closed-loop recycling system &mdash; minimizing waste and driving recycling innovation across the aerospace industry. The initiative aims to reuse secondary structural TPC&nbsp;parts from EOL&nbsp;Airbus A380 aircraft and repurpose them for other aeronautical applications.</p>\n\n<p>Expertise from the aerospace and materials sectors is being brought together in this collaborative initiative. Airbus provides support for the advanced material reuse framework, while Tarmac Aerosave will ensure components are dismantled without damage, preserving material integrity. Daher is leading the reshaping and the quality validation (performed as serial production conditions) of repurposed parts, while Toray, as a materials supplier, is monitoring the material quality for the second-life application.</p>\n\n<p>At the core of this initiative is the EOL recycling of the A380 pylon cover, specifically the&nbsp;Toray Cetex&nbsp;TC1100 (carbon fiber/PPS) TPC&nbsp;structure. As TPC parts become more prevalent in next-generation aircraft, this pilot case sets the foundation for new methodologies in recycling, repurposing&nbsp;and reprocessing composite materials. The A380 alone contains more than&nbsp;10,000 flying parts made from continuous fiber-reinforced TPC, making it an ideal platform for testing and validating recycled material recovery practices.</p>\n\n<p>&ldquo;Through this initiative, we aim to build on that strength by exploring new opportunities for recycling technology development &mdash; where our high-performance materials are not just recycled, but meaningfully reused and reintegrated into other structural aerospace applications&rdquo; states Scott Unger, CEO of Toray Advanced Composites. &ldquo;As demand for commercial aircraft continues to increase, it is critical we make progress on recyclability of thermoplastic and thermoset composite materials, and reduce the impact of our industry on the environment.&rdquo;</p>\n\n<p>Julie Vadour, R&amp;D director at Daher, notes that for many years Daher has relied on TPC to develop&nbsp;structural parts for next-generation aircraft. &ldquo;These materials offer lightness, high production compatibility&nbsp;and &mdash;&nbsp;crucially &mdash; true sustainability,&rdquo; Vadour says.&nbsp;&ldquo;Beyond their weldability and reusability, we are actively advancing recycling processes for both EOL&nbsp;parts and manufacturing waste, particularly on our Nantes site.&rdquo;</p>\n\n<p>For Tarmac Aerospace&rsquo;s part, the company is&nbsp;constantly working to improve its recycling rate, which currently stands at 92%. &ldquo;This joint work on the reuse of TPC&nbsp;contributes to our expertise in A380 recycling and our contribution to the eco-design of the new generation of aircraft,&rdquo; concludes Alexandre Brun, president.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/toray-daher-and-tarmac-aerosave-announce-end-of-life-aircraft-recycling-program"
      }
    ],
    "link": "https://www.compositesworld.com/news/toray-daher-and-tarmac-aerosave-announce-end-of-life-aircraft-recycling-program"
  }
]