[
  {
    "published": "Tue, 25 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      25,
      17,
      0,
      0,
      1,
      329,
      0
    ],
    "title": "FIDAMC hosts Aerospace Thermoplastics International Summit in Madrid",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "FIDAMC hosts Aerospace Thermoplastics International Summit in Madrid"
    },
    "summary": "Leading representatives from aerospace industry, public institutions, technology centers and universities discussed the challenges and opportunities that will shape future airframes.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Leading representatives from aerospace industry, public institutions, technology centers and universities discussed the challenges and opportunities that will shape future airframes."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-fidamc-tpc-summit.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Aerospace International Thermoplastics Summit at FIDAMC in October 2025\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-fidamc-tpc-summit.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | FIDAMC</p>\n</div>\n\n<p>Sustainability and production rate were the two main themes that emerged from the <a href=\"https://fidamc.es/en/summit/\" target=\"_blank\">Aerospace International Thermoplastics Summit</a> hosted by <a href=\"https://www.compositesworld.com/search?q=FIDAMC\" target=\"_blank\">FIDAMC</a> (Foundation for Research, Development and Application of Composite Materials) in Madrid, Spain&nbsp;on Oct. 30, 2025. The meeting also discussed planning by FIDAMC and its partners for the Thermoplastic Composites Development Centre being constructed in Cadiz, Spain.</p>\n\n<p>The 1-day summit, conceived as a space for strategic and technical exchange, attracted more than&nbsp;100 participants, mainly from Europe. It was <a href=\"https://fidamc.es/en/ernesto-gonzalez-ceo-de-fidamc-el-siguiente-salto-tecnologico-pertenece-a-los-termoplasticos/\" target=\"_blank\">opened by Ernesto Gonz&aacute;lez Dur&aacute;n</a>, CEO of FIDAMC, who stressed that &ldquo;we are living in times of profound transformation in the aviation sector.&rdquo;&nbsp;This was followed by a <a href=\"https://fidamc.es/en/innovacion-y-sostenibilidad-ricardo-rojas-airbus-inaugura-el-aerospace-thermoplastics-international-summit/\" target=\"_blank\">keynote presentation from Ricardo Rojas</a>, president of Commercial Aircraft at Airbus Spain, and six panel discussions on specific topics (see below).</p>\n\n<h3>Airbus Spain sees&nbsp;need for new TPC</h3>\n\n<p>Riojas highlighted the strength of the aeronautical sector and Spain&rsquo;s key role in its growth. &ldquo;Airbus anticipates the need for more than 43,000 aircraft in the next 20 years,&rdquo; he said, &ldquo;which will require increased production and addressing challenges in the supply chain, talent&nbsp;and innovation.&rdquo; Riojas&nbsp;then highlighted the importance of investment in R&amp;D, digitalization and&nbsp;new thermoplastic composite (TPC) materials. He also acknowledged FIDAMC&rsquo;s role as a &ldquo;bridge between research and industry&rdquo;&nbsp;for developing the technologies that will shape the next decade.</p>\n\n<h3>Round table 1 &ndash;&nbsp;<a href=\"https://fidamc.es/en/claves-de-la-estrategia-aeroespacial-y-oportunidades-de-financiacion/\" target=\"_blank\">Aerospace strategy and funding</a></h3>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<blockquote>\n<p>&ldquo;Aerospace&nbsp;is undergoing global expansion, driven by the need for technological sovereignty and sustainability.&rdquo;</p>\n</blockquote>\n</div>\n\n<p>This panel<strong>&nbsp;</strong>included Juan Francisco Reyes (CDTI &ndash; Horizon Europe NCP), Jos&eacute; Javier Mart&iacute;n Ca&ntilde;izares (regional government of Andalusia), Jaume Marcos (president of PAE) and H&eacute;ctor Guerrero (Ministry of Science, Innovation and Universities &ndash; PERTE Aerospace).</p>\n\n<p>They agreed that aerospace is undergoing global expansion, driven by the need for technological sovereignty and sustainability.&nbsp;Spain is supporting technology developments through various initiatives:</p>\n\n<ul>\n\t<li><strong>National:</strong>&nbsp;PERTE Aerospace&rsquo;s investment of&nbsp;more than &euro;2.8 billion&nbsp;and the future Alliance for Spanish Aerospace, aimed at strengthening public-private collaboration.</li>\n\t<li><strong>Regional:</strong> Andalusia Aerospace Strategy&rsquo;s&nbsp;investment of&nbsp;&euro;574 million until 2027&nbsp;and creation of the Net Zero Jerez Aeronautical Hub for sustainable aviation in Jerez.</li>\n\t<li><strong>Europe:</strong> Clean Aviation and CESAR programs.</li>\n</ul>\n\n<h3>Round table 2 &ndash;&nbsp;<a href=\"https://fidamc.es/en/desafios-futuros-para-los-fabricantes-de-equipos-originales-oem-vision-desde-airbus-boeing-e-itp-aero/\" target=\"_blank\">Future challenges for OEMs</a></h3>\n\n<p>This&nbsp;panel&nbsp;discussed the main market drivers and included Susana Carballo (Airbus), Carlos Bello (Boeing)&nbsp;and Jos&eacute; Francisco Beltr&aacute;n Par&iacute;s (ITP Aero). The speakers highlighted sustainability and production rate as the two main needs to support the large quantity of composites-intensive commercial that will be required. The OEMs saw that TPC&nbsp;addressed these needs through recyclability, and increased production rates, via stamping, in situ consolidation&nbsp;and welded assembly. Defense and space applications also had to consider cybersecurity and cost reduction in space systems.</p>\n\n<h3><strong>Round table 3 &ndash; <a href=\"https://fidamc.es/en/el-reto-de-la-industrializacion-de-los-materiales-termoplasticos/\" target=\"_blank\">Challenges to industrialize thermoplastic composites</a></strong></h3>\n\n<p>This was led by experts from Tier 1 fabricators: Enrique S&aacute;nchez (Aernnova Composites), Ra&uacute;l Arranz (Aciturri) and Salvador Romero (GKN Fokker). They agreed that TPC offer advantages in repairability, recyclability&nbsp;and weight reduction, but still require investment in equipment and training to achieve the necessary production scale. Areas with high potential benefit, but which still need to be matured, include automated fiber placement (AFP), welding and variable-thickness parts.</p>\n\n<div class=\"article-figure fl-l m-r-2 m-t-1\">\n<div class=\"article_sidebar\">\n<h3>Watch the videos for all of the session <a href=\"https://www.youtube.com/playlist?list=PLWEZrR64Cahep8m0ushqoX7qvMJaSrP-b\" target=\"_blank\">here</a>.</h3>\n</div>\n</div>\n\n<p>The discussion highlighted the challenge that fabricators will only make investments to industrialize these technologies if OEMs make commitments to use TPC, but these commitments will only happen if production readiness is demonstrated. Collaboration between manufacturers, technology centers&nbsp;and OEMs is needed to accelerate industrial adoption.</p>\n\n<h3><strong>Round table 4&nbsp;&ndash; <a href=\"https://fidamc.es/en/innovacion-en-equipos-la-industria-del-termoplastico-da-pasos-hacia-el-futuro/\" target=\"_blank\">Innovation in equipment</a></strong></h3>\n\n<p>The discussion included&nbsp;I&ntilde;igo Idareta (Mtorres), Andr&eacute; Bertin (Coexpair Dynamics), Maarten Bach (KVE), Mael Farinas (Coriolis) and Marcus Kremers (Airborne), and was moderated by F&eacute;lix Dom&iacute;nguez (FIDAMC)&nbsp;&mdash; all companies&nbsp;focused on providing solutions for high-rate, automated and consistent manufacture.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<blockquote>\n<p>&ldquo;Definition of process standards is needed for more agile certification, including transition from approving specific parts to approving processes for more rapid adoption.&rdquo;</p>\n</blockquote>\n</div>\n\n<p>They agreed advances in automation, digitalization and in situ&nbsp;consolidation are transforming TPC&nbsp;parts production, but also stressed the need&nbsp;for&nbsp;more robust, modular and efficient equipment capable of matching the speeds of thermoset processes. Collaboration between equipment developers, OEMs and certification authorities is needed, as well as definition of process standards to enable&nbsp;more agile certification, including&nbsp;transition from approving specific parts to approving processes for&nbsp;more rapid adoption of the manufacturing methods.</p>\n\n<h3><strong>Round table 5&nbsp;&ndash;&nbsp;</strong><a href=\"https://fidamc.es/en/desafios-y-oportunidades-de-la-innovacion-en-materiales-termoplasticos/\"><strong>Innovation in materials</strong></a></h3>\n\n<p>Nathalie Schmitz (Hexcel), Mark Bouwman (Toray)&nbsp;and Johannes Treiber (Syensqo) represented material suppliers and cited standardization&nbsp;as a key area, noting&nbsp;the industry will benefit from economies of scale as TPC use increases.&nbsp;They highlighted the potential for recyclability, improved durability and reduction of overall production costs, noting the role of technology centers as agents of knowledge transfer between research and industry. They also advocated&nbsp;greater harmonization of certifications and processes in Europe in order to accelerate industrial adoption.</p>\n\n<h3>Round table 6 &ndash;&nbsp;<strong><a href=\"https://fidamc.es/en/ecosistema-global-de-investigacion-colaboracion-y-alineacion-para-el-futuro-de-los-termoplasticos/\" target=\"_blank\">Global research ecosystem</a></strong></h3>\n\n<p>The final session&nbsp;featured&nbsp;David Leach (Composite Material Solutions), Rens Pierik (TPRC)&nbsp;and Isabel Mart&iacute;n (FIDAMC), who agreed that collaborative development centers can provide benefits of sharing production scale equipment, reducing risk and enabling&nbsp;a wider range of organizations in the supply chain to participate. They also discussed the need to align European technology agendas and promote closer cooperation between centers of excellence to share infrastructure, data and methodologies. The next decade will be decisive for consolidating an international yet coordinated TPC ecosystem</p>\n\n<h2>TPC parts are reality, progress via community</h2>\n\n<p>In his concluding comments, FIDAMC CEO Dur&aacute;n said that&nbsp;TPC parts are&nbsp;no longer a promise, &ldquo;they are a reality in motion,&rdquo;&nbsp;emphasizing they&nbsp;are lighter, more efficient and more sustainable. The&nbsp;hub&nbsp;in Cadiz, he noted, will&nbsp;move TPC&nbsp;development from TRL 3 to 6, and&nbsp;will not duplicate efforts but rather complement existing capabilities in Europe and around the world.&nbsp;</p>\n\n<p>&ldquo;Progress is not measured by the speed of technology, but by the strength of the community behind it,&rdquo; he concluded, reiterating this&nbsp;is the best way to address the exponential change that can be achieved for TPC and future aviation.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/fidamc-hosts-aerospace-thermoplastics-international-summit-in-madrid"
      }
    ],
    "link": "https://www.compositesworld.com/news/fidamc-hosts-aerospace-thermoplastics-international-summit-in-madrid"
  },
  {
    "published": "Tue, 25 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      25,
      15,
      0,
      0,
      1,
      329,
      0
    ],
    "title": "HRC supports Range Aviation’s LEU100 eVTOL in advancing future low-altitude logistics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "HRC supports Range Aviation’s LEU100 eVTOL in advancing future low-altitude logistics"
    },
    "summary": "HRC completed a composite design and manufacturing project with Range Aviation, supplying materials, engineering, manufacturing support and comprehensive compliance checks.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "HRC completed a composite design and manufacturing project with Range Aviation, supplying materials, engineering, manufacturing support and comprehensive compliance checks."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-HRC-LEU100-eVTOL.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Flight testing the LEU100.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-HRC-LEU100-eVTOL.jpg;maxWidth=720\" /> </a></div>\n\n<p>Low-logistics&nbsp;LEU100 eVTOL aircraft has begun flight testing. Source | HRC</p>\n</div>\n\n<p>Low-altitude logistics is rapidly emerging as a key driver of next-gen transportation systems,&nbsp;supported by ongoing policy developments and accelerated advancements in composite materials, aviation engineering&nbsp;and autonomous flight technologies. Within this evolving&nbsp;landscape, composites companies like&nbsp;<a href=\"https://www.compositesworld.com/suppliers/hrc\" target=\"_blank\">HRC</a>&nbsp;(Jiangshu, China) are supporting the development of eVTOL aircraft applications like the&nbsp;LEU100. Developed by&nbsp;<a href=\"https://www.rangeaviation.com/\" target=\"_blank\">Range Aviation</a> (Hefei, China), the logistics&nbsp;aircraft&rsquo;s preparation for real-world deployment has been guided&nbsp;by HRC&rsquo;s&nbsp;structural design, composites engineering and manufacturing support.</p>\n\n<p>With a maximum takeoff weight of 140 kilograms, a range of 200 kilometers, cruising speed of 120 kilometers/hour&nbsp;and a 55-kilogram&nbsp;payload capacity, the LEU100 is engineered for high-demand missions including logistics transport, medical rescue, emergency response&nbsp;and remote sensing. Its performance profile positions it as a medium-sized logistics eVTOL platform&nbsp;advancing toward commercialization.</p>\n\n<p>HRC contributed across the entire composite airframe development chain &mdash; from conceptual structural layouts and material development to engineering simulation, precision composite molding, final assembly support&nbsp;and compliance verification. The fuselage uses a carbon fiber composite foam sandwich structure, delivering significant weight reduction while ensuring stiffness and in-service durability. Quick-assembly interfaces at the wing fuselage and vertical tail fuselage connections further enhance transportability and final assembly efficiency. Additional components &mdash; including the nose cone, cabin doors&nbsp;and battery access covers &mdash; were engineered for optimized accessibility and streamlined maintenance.</p>\n\n<p>As part of its engineering role, HRC conducted comprehensive manufacturing compliance checks, ensuring all composite structures and processes met stringent airworthiness and customer requirements. The aircraft&rsquo;s type certificate (TC) application was accepted by the Civil Aviation Administration of China (CAAC) in August 2024, with the first development aircraft completing system tests, ground tests, protected and unprotected flight tests, and full-process transition flights.</p>\n\n<p>The LEU100 was displayed at the 8<sup>th</sup> China International Import Expo (CIIE) in early November 2025, showcased at the HRC booth. Its engineering quality, structural innovations and potential to accelerate the low-altitude logistics ecosystem attracted strong interest from industry stakeholders and visitors.</p>\n\n<p>As the low-altitude economy accelerates globally, HRC has established itself as a partner capable of integrating R&amp;D, design and&nbsp;engineering, composite manufacturing&nbsp;and final assembly within one unified platform. The company continues to collaborate with OEMs including Xpeng, Aeroht, Aerofugia, Aeroone, Yitong&nbsp;UAV, Xi&rsquo;an Aircraft Co., Air White Whale&nbsp;and Range Aviation, contributing to multiple next-gen aircraft programs.</p>\n\n<p>Looking ahead, HRC will continue advancing its composite engineering capabilities to support the commercialization of innovative low-altitude platforms.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hrc-supports-range-aviations-leu100-evtol-in-advancing-future-low-altitude-logistics"
      }
    ],
    "link": "https://www.compositesworld.com/news/hrc-supports-range-aviations-leu100-evtol-in-advancing-future-low-altitude-logistics"
  },
  {
    "published": "Mon, 24 Nov 2025 14:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      19,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "Airborne enters project with Lockheed Martin on next-gen composites automation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airborne enters project with Lockheed Martin on next-gen composites automation"
    },
    "summary": "Building on Airborne KBL and APP systems, partners will develop an automated&nbsp;laminating and kitting system to package complicated material types and shapes with more rapid aero production in mind.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Building on Airborne KBL and APP systems, partners will develop an automated&nbsp;laminating and kitting system to package complicated material types and shapes with more rapid aero production in mind."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/lmairborne.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Airborne and Lockheed personnel posing at an event.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/lmairborne.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Airborne</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/airborne\" target=\"_blank\">Airborne</a> (The Hague, Netherlands) has been awarded a contract by&nbsp;<a href=\"https://www.lockheedmartin.com/en-us/index.html\" target=\"_blank\">Lockheed Martin</a>&nbsp;(Bethesda, Md., U.S.)&nbsp;under an Industrial Participation&nbsp;Program (IPP) on the development of enhanced composites automation systems. Under the project, titled &ldquo;Enhancing the digital thread for composites manufacturing,&rdquo; Lockheed Martin will share technical knowledge with Airborne to develop an automated laminating and kitting system to package complicated material types and shapes.</p>\n\n<p>The project, building on Airborne&rsquo;s advanced kit by light (KBL) and automated ply placement (APP) technologies, will advance smart material handling and intelligent automation in an aim to raise the benchmark for rapid aerospace production. It will also bring a new partner into the continued collaboration between Lockheed Martin and the Dutch industry.</p>\n\n<p>The project plans to enhance Airborne&rsquo;s already robust automation systems, focusing on higher production output, enhanced inspection systems, broader material compatibility&nbsp;and improved software integration. These developments will support the specific requirements of Lockheed Martin&rsquo;s business units.</p>\n\n<p>For more than 30 years, Airborne has played a leading role in the Dutch composites industry, initially as a manufacturer of composite parts and now as a developer of advanced automation systems for aerospace, defense, automotive and renewable energy markets.</p>\n\n<p>&ldquo;The Lockheed Martin‑Airborne collaboration will integrate smart material kit creation with advanced data‑driven automation for a flexible production system that enables the next-generation of aerospace fabrication,&rdquo; says&nbsp;Tara Thomasson, Lockheed Martin Technical Fellow.</p>\n\n<p>It further reinforces the importance of international collaboration and a strong IPP partnership. &ldquo;This project will be another successful win/win opportunity, giving Airborne the enhanced capabilities for their new kitting and laminating systems and Lockheed Martin will be able to procure these enhanced systems for our production lines,&rdquo; adds&nbsp;Joe Krapf, Lockheed Martin Industrial Participation country manager.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airborne-enters-project-with-lockheed-martin-on-next-gen-composites-automation"
      }
    ],
    "link": "https://www.compositesworld.com/news/airborne-enters-project-with-lockheed-martin-on-next-gen-composites-automation"
  },
  {
    "published": "Mon, 24 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      18,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "Gurit inaugurates Advanced Composites R&D Center in China",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Gurit inaugurates Advanced Composites R&D Center in China"
    },
    "summary": "To be fully operational by end of 2025, the center will drive the development of novel composite technologies including PET, complementing Gurit&rsquo;s existing global hubs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "To be fully operational by end of 2025, the center will drive the development of novel composite technologies including PET, complementing Gurit&rsquo;s existing global hubs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-gurit-compositesrdcenter-china-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-gurit-compositesrdcenter-china-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Gurit</p>\n</div>\n\n<p>On Nov. 17, <a href=\"https://www.compositesworld.com/suppliers/gurit-uk\" target=\"_blank\">Gurit</a>&nbsp;(Zurich, Switzerland)&nbsp;officially inaugurated its Advanced Composites Research &amp; Development Center in the Tianjin Economic-Technological Development Area (TEDA). The unveiling ceremony marks a significant milestone in Gurit&rsquo;s global strategy, strengthening its &ldquo;R&amp;D-to-production&rdquo; capabilities and reaffirming its long-term commitment to the Chinese market.</p>\n\n<p>Set to be fully operational by the end of 2025, the R&amp;D center will drive the development of next-generation, high-performance composite technologies. It complements Gurit&rsquo;s existing R&amp;D and composite testing hubs in the U.K., India&nbsp;and New Zealand, creating a more integrated global innovation network.</p>\n\n<p>The Tianjin center will focus primarily on the research, development, analysis&nbsp;and testing of PET materials. Its close proximity to Gurit&rsquo;s Tianjin PET manufacturing facility will streamline new product introduction, shorten development cycles&nbsp;and enable faster responses to innovation needs in the wind energy sector and beyond.</p>\n\n<p>During the inauguration, Gurit and TEDA representatives discussed opportunities to jointly build advanced industrial ecosystems and address key technological challenges, supporting the region&rsquo;s transition toward high-end, intelligent manufacturing.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gurit-inaugurates-advanced-composites-rd-center-in-china"
      }
    ],
    "link": "https://www.compositesworld.com/news/gurit-inaugurates-advanced-composites-rd-center-in-china"
  },
  {
    "published": "Mon, 24 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      18,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "ÉireComposites, ATG Europe brings composites expertise to LISA project",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ÉireComposites, ATG Europe brings composites expertise to LISA project"
    },
    "summary": "ESA-led project is developing a constellation of three satellites&nbsp;to detect gravitational waves and provide&nbsp;insight into the origins of the universe.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "ESA-led project is developing a constellation of three satellites&nbsp;to detect gravitational waves and provide&nbsp;insight into the origins of the universe."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-eirecomposites-atg-lisa-satellite.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-eirecomposites-atg-lisa-satellite.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | &Eacute;ireComposites</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/eirecomposites-teo-irish-composites\" target=\"_blank\">&Eacute;ireComposites Teo</a> (Galway, Ireland) and <a href=\"https://www.atg-europe.com\" target=\"_blank\">ATG Europe Ltd.</a> (Noordwijk, Netherlands) have announced a key role in&nbsp;Laser Interferometer Space Antenna (LISA), a mission led by the&nbsp;European Space Agency (ESA) in collaboration with NASA&nbsp;to develop the largest observatory ever built.</p>\n\n<p>LISA&nbsp;consists of three satellites in a triangular formation, each 2.5 million kilometers apart.&nbsp;Each satellite will emit a laser toward&nbsp;the other two and measure tiny changes in the distance between satellites via the detection of gravitational waves &mdash;&nbsp;formed by extreme cosmic events such as the merger of black holes that&nbsp;create ripples in the fabric of space-time.</p>\n\n<p>Despite the enormous distance between the satellites (six times the distance from the Earth to the Moon), the sophisticated optical instruments on board can pick up changes smaller than the size of a helium atom and hence detect gravitational waves. The results from the mission will shed light on what happens when black holes collide and provide insight into the origins of the universe&nbsp;immediately after the Big Bang.</p>\n\n<p>ATG will design the central tube (the chassis of the satellite) based on its patented lightweight, high-stiffness, grid-stiffened structural composite architecture, while &Eacute;ireComposites&nbsp;will manufacture and assemble the structure. This work will encompass everything from the manufacture of test components and structural assemblies to autoclave curing, bonding&nbsp;and precision machining. Detailed inspections will be carried out to make sure each part meets strict aerospace standards, using nondestructive testing and dimensional checks throughout the build. By combining advanced computational modeling, hands-on manufacturing&nbsp;and meticulous quality control, the partners will deliver reliable, high-performance composite structures that are central to the success of the LISA project.</p>\n\n<p>&ldquo;Nearly everything we know about the universe comes from telescopes,&rdquo; says Tomas Flanagan. &ldquo;LISA provides a completely different approach by focusing on gravitational waves instead of light. It&rsquo;s hard to believe that we&rsquo;ll be making structural carbon fiber&nbsp;components for the largest machine that humanity has ever built and that we will be seeking evidence to support Einstein&rsquo;s general theory of relativity.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/eirecomposites-atg-europe-brings-composites-expertise-to-lisa-project"
      }
    ],
    "link": "https://www.compositesworld.com/news/eirecomposites-atg-europe-brings-composites-expertise-to-lisa-project"
  },
  {
    "published": "Mon, 24 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      17,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "Archer Midnight is selected for Saudi Arabia eVTOL deployment",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Archer Midnight is selected for Saudi Arabia eVTOL deployment"
    },
    "summary": "Together with Saudi Arabia&rsquo;s&nbsp;The Helicopter Co.&nbsp;and Red Sea Global, Archer will help establish a&nbsp;sandbox framework to validate and accelerate AAM testing, build this mobility ecosystem.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Together with Saudi Arabia&rsquo;s&nbsp;The Helicopter Co.&nbsp;and Red Sea Global, Archer will help establish a&nbsp;sandbox framework to validate and accelerate AAM testing, build this mobility ecosystem."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Archer-SaudiArabia.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Midnight eVTOL aircraft flying across the desert.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Archer-SaudiArabia.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Archer Aviation</p>\n</div>\n\n<p><a href=\"https://www.helicopter.com.sa/\" target=\"_blank\">The Helicopter Co.</a> (THC, Riyadh, Saudi Arabia), a Public Investment Fund (PIF) company and Saudi Arabia&rsquo;s premier commercial helicopter operator, has signed an agreement with&nbsp;<a href=\"https://www.archer.com/\" target=\"_blank\">Archer Aviation</a>&nbsp;(Santa Clara, Calif., U.S.) and <a href=\"https://www.redseaglobal.com/en/\" target=\"_blank\">Red Sea Global</a>&nbsp;(RSG, Tabuk, Saudi Arabia), the developer behind regenerative tourism destinations of The Red Sea and AMAALA. The partnership will focus on the development, testing&nbsp;and potential integration of Archer&rsquo;s electric vertical takeoff and landing (eVTOL) aircraft <em>Midnight</em> into RSG&rsquo;s operations as one of the first deployments of eVTOL aircraft in the Kingdom of Saudi Arabia.</p>\n\n<p>The signing is a step toward the&nbsp;Kingdom&rsquo;s efforts to explore and integrate eVTOL aircraft into its emerging mobility ecosystem. In the agreement&rsquo;s initial phase,&nbsp;Archer Aviation will work together with THC and RSG to build the foundational framework for planned eVTOL operations in Saudi Arabia. This includes establishing a structured sandbox environment to conduct test flights with <em>Midnight</em> under real-world conditions to assess aircraft performance, operational feasibility, regulatory alignment, passenger acceptance and overall ecosystem readiness. Partners will also collaborate on testing advanced aerial technologies, exploring long-term strategic partnerships for large-scale deployment&nbsp;and supporting regional innovation to advance aviation systems.</p>\n\n<p>As the framework progresses, RSG will lead the sandbox testing with Archer&rsquo;s aircraft to evaluate the potential for integrating eVTOL aircraft into the company&rsquo;s future operations. Given RSG&rsquo;s controlled airspace, sustainable infrastructure&nbsp;and its position as a flagship developer under PIF, it offers a suitable platform to demonstrate the potential of advanced air mobility in supporting regenerative tourism and next-generation transportation options for the Kingdom.</p>\n\n<p>According to Archer Aviation&rsquo;s founder and CEO, Adam Goldstein, &ldquo;A key part of Archer&rsquo;s strategy is partnering with the leading operators in each country who share our goals and vision, and both THC and RSG are similarly committed to ensuring that Saudi Arabia is operationally prepared to launch eVTOL aircraft. We look forward to working together to demonstrate how Archer&rsquo;s <em>Midnight </em>aircraft can transform travel within the Kingdom and set a regional benchmark for the future of aviation.&rdquo;</p>\n\n<p>Following the completion of the sandbox program, all parties will review the results and consider further initiatives to support large-scale introduction of eVTOL services.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/archer-midnight-is-selected-for-saudi-arabia-evtol-deployment"
      }
    ],
    "link": "https://www.compositesworld.com/news/archer-midnight-is-selected-for-saudi-arabia-evtol-deployment"
  },
  {
    "published": "Mon, 24 Nov 2025 11:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      16,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "EuReComp team highlights ROCCA Cabin demonstrator for EOL composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "EuReComp team highlights ROCCA Cabin demonstrator for EOL composites"
    },
    "summary": "The ROCCA Cabin serves as a proof of concept for how large composite parts, often destined for disposal, can re-enter the value chain as architectural elements with both functional and aesthetic value.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The ROCCA Cabin serves as a proof of concept for how large composite parts, often destined for disposal, can re-enter the value chain as architectural elements with both functional and aesthetic value."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ROCCA Cabin rendering.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-roccacabin-rendering.png;maxWidth=720\" /> </div>\n\n<p>The ROCCA Cabin rendering &mdash; a modular, sustainable demonstrator made from repurposed composite components. Source (All Images) | EuReComp project/APM</p>\n</div>\n\n<p>As industries worldwide confront the growing challenge of managing end-of-life (EOL) composite materials, the EU-funded&nbsp;<a href=\"https://www.eurecomp.eu\" id=\"EuReComp\" name=\"EuReComp\" target=\"_blank\">EuReComp project</a>, led by R-Nano NTUA, with Dr. George Kotsikos serving as project officer,<em>&nbsp;</em>is demonstrating that circularity and high-performance design can go hand in hand. Among the project&rsquo;s most tangible results stands the ROCCA Cabin Demonstrator &mdash; a fully functional, modular structure built almost entirely from repurposed composite components originating from the wind energy and aviation sectors.</p>\n\n<p>Developed under Work Package 5 (WP5) and currently led by <a href=\"https://eurecomp.eu/index.php/our-team/APM\" target=\"_blank\">Anthony, Patrick &amp; Murta &ndash; Exporta&ccedil;&atilde;o Lda (APM)</a>&nbsp;(Lagos, Portugal),&nbsp;the ROCCA Cabin demonstrates the creative reuse of EOL composite materials across multiple structural and functional components (see slideshow below).</p>\n\n<p>Former turbine blade tips were repaired, painted&nbsp;and reused as fa&ccedil;ade elements and wind barriers surrounding the cabin entrance &mdash; a clear visual statement that sustainability can complement design elegance.</p>\n\n<p>A decommissioned pressure tank from the aviation sector was repurposed as a rooftop water reservoir, supplying the cabin with utility water &mdash; an inventive example of industrial upcycling.</p>\n\n<div class=\"inline-carousel\" id=\"dashSlideshow\">\n<h3 class=\"text-uppercase\">ROCCA PROJECT PROCESS STEPS</h3>\n**************** Slideshow will go here ****************</div>\n\n<p>Recovered glass fiber balsawood composites from wind blade shear webs were repaired, polished, varnished&nbsp;and reused across several parts of the cabin,&nbsp;including sidewalls, bathroom flooring&nbsp;and the door threshold. A custom bathroom sink was also produced using the same reclaimed composite material.</p>\n\n<p>Furthermore, the ROCCA Cabin construction used a dedicated resin infusion process that enabled the integration of recycled glass and carbon fiber (rGF, rCF)&nbsp;reinforcements into new composite components.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/picture14.png;maxWidth=385\" /></div>\n\n<p>EuReComp partners at the ROCCA Cabin site during inspection and discussion of next steps.</p>\n</div>\n\n<p>The glass fiber-reinforced polyurethane wall composite panels embed rGF&nbsp;materials, while roof components integrate reclaimed rCF patches through infusion processes, ensuring strength and circularity. The reinforcement parts also use rCF and rGF&nbsp;mats, and 3D printed naval windows &mdash; made from PA12 reinforced with chopped carbon fibers &mdash; complete the structure.</p>\n\n<p>The panels were produced in custom molds and installed onto a steel structural frame, ensuring both durability and modularity.</p>\n\n<p>ROCCA Cabin&rsquo;s construction followed a phased and traceable process, including:</p>\n\n<ul>\n\t<li>Selection and preparation of EOL parts</li>\n\t<li>Resin infusion and reinforcement of shear panels and roof elements</li>\n\t<li>Assembly on a modular steel frame</li>\n\t<li>Final installation of windows, cladding and finishing details.</li>\n</ul>\n\n<p>Final work is underway on 3D printed naval windows, final cladding&nbsp;and the as-built documentation, marking the transition from demonstrator to deployable unit. EuReComp partners see the ROCCA Cabin being applied for off-grid&nbsp;or modular housing; floating boathouses; disaster relief shelters; public micro-infrastructure; and sustainable modular workspaces.</p>\n\n<p>By enabling real-world demonstrations such as the ROCCA Cabin, EuReComp aims to bridge&nbsp;the gap between laboratory innovation and market-ready circular solutions for the composites industry.</p>\n\n<div class=\"article_sidebar\">\n<p><a href=\"#EuReComp\" target=\"_self\">EuReComp</a> is an EU-funded collaborative research project with a strong focus on circularity, set out to provide sustainable methods toward recycling&nbsp;and reuse of composite materials, coming from components used in various industries, such as aeronautics and wind energy.</p>\n\n<p>The team&rsquo;s work&nbsp;will be tested and validated through the development of five&nbsp;demonstrators&nbsp;&ldquo;using&nbsp;novel manufacturing&nbsp;methodologies and incorporating recycled materials, obtained from different&nbsp;recycling processes.&rdquo; The ROCCA Cabin is one of them.</p>\n</div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/eurecomp-team-highlights-rocca-cabin-demonstrator-for-eol-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/eurecomp-team-highlights-rocca-cabin-demonstrator-for-eol-composites"
  },
  {
    "published": "Mon, 24 Nov 2025 10:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      15,
      30,
      0,
      0,
      328,
      0
    ],
    "title": "Airbus launches Tech Hub in Korea",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus launches Tech Hub in Korea"
    },
    "summary": "Established facility is to focus&nbsp;on future energy technologies, advanced composites, and defense and space technologies to strengthen Korea&rsquo;s role as a strategic technology partner.\n\n&nbsp;",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Established facility is to focus&nbsp;on future energy technologies, advanced composites, and defense and space technologies to strengthen Korea&rsquo;s role as a strategic technology partner.\n\n&nbsp;"
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Airbus-Korea-TechHub.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Airbus-Korea-TechHub.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Airbus</p>\n</div>\n\n<p><a href=\"https://www.airbus.com/en\" target=\"_blank\">Airbus</a> (Toulouse, France) is establishing an Airbus Tech Hub in Korea. Located in Daejeon, the heart of the nation&rsquo;s R&amp;D ecosystem, the facility will serve as a dedicated center&nbsp;for collaborative research and innovation, solidifying Korea&rsquo;s role as a strategic technology partner.</p>\n\n<p>The Airbus Tech Hub will focus on three key research pillars leveraging Korea&rsquo;s industrial strengths: the development of future energy technologies, advanced lightweight composites&nbsp;as well as next-generation defense and space technologies.</p>\n\n<p>The Airbus Tech Hub in Korea is being established in close collaboration with the Ministry of Trade, Industry and Resources (MOTIR), and Daejeon Metropolitan City.</p>\n\n<p>&ldquo;After five decades of successful industrial partnership with Korea, this step to launch the Airbus Tech Hub in Daejeon is a clear signal of our deepening commitment. The Tech Hub allows Airbus to tap into advanced technologies in Korea, which will help fast-track future aircraft technologies and continue to develop Korea as our trusted, long-term partner,&rdquo; says&nbsp;Mark Bentall, head of R&amp;T program&nbsp;at Airbus. Bentall adds that Daejeon, with its concentration of R&amp;D institutes and talent, is the ideal choice, offering&nbsp;&ldquo;the perfect synergy between advanced academia and industrial ambition, making it the essential base for joint development of future technologies that will drive the industry forward.&rdquo;</p>\n\n<blockquote>\n<p>Airbus&rsquo; substantial industrial presence is anchored by long-standing partnerships with Tier 1&nbsp;suppliers like Korea Aerospace Industries (KAI) and Korean Air Aerospace Division (KAL-ASD).</p>\n</blockquote>\n\n<p>To accelerate the Tech Hub&rsquo;s mission, Airbus signed three memorandums of understanding (MOU) during the launch ceremony.&nbsp;The first MOU, signed with MOTIR, establishes a framework enabling Airbus to swiftly launch research and innovation projects within Daejeon&rsquo;s technology ecosystem.&nbsp;The second MOU, signed with Daejeon City, also outlines a commitment to support and expedite Airbus&rsquo; research and innovation initiatives across the city&rsquo;s technological landscape. The third MOU, with the Korea International Trade Association (KITA), focuses on leveraging KITA&rsquo;s open innovation platform in Korea to source and engage new partners identified based on the Airbus technology focus areas.</p>\n\n<p>Among the projects announced at the launch of the Airbus Tech Hub in Korea, Airbus is partnering with LIG Nex1 to develop space chip antenna technology used for transmitting and receiving communication signals. Separately, Airbus is engaging with EMCoretech to develop active filtering technologies needed for electrification applications to suppress electromagnetic interference.</p>\n\n<p>Airbus&rsquo; relationship with Korea spans more than 50 years, going back to 1974 when Korean Air ordered the original A300B4 widebody aircraft. Since then, the country has become a key customer base and partner across Airbus&rsquo; commercial aircraft, defense, space and helicopter product lines.</p>\n\n<p>Airbus&rsquo; substantial industrial presence is anchored by long-standing partnerships with Tier 1&nbsp;suppliers like Korea Aerospace Industries (KAI) and Korean Air Aerospace Division (KAL-ASD). These partners manufacture critical components for Airbus&rsquo; global civil aircraft programs, including wing structures, fuselage assemblies&nbsp;and composite elements for the A320, A330 and A350 families. Numerous Korean SMEs also contribute to the supply chain.&nbsp;</p>\n\n<p>The Tech Hub is complemented by the recent opening of Airbus&rsquo; wholly owned subsidiary Composite Technology Centre (CTC)&nbsp;in Busan. CTC&rsquo;s new office aims to cooperate with Busan Techno Park in the R&amp;D&nbsp;of advanced composite materials and processes for aerospace.&nbsp;</p>\n\n<p>Korea is the fourth addition to Airbus&rsquo; global network of Tech Hubs, joining existing centers in Japan, the Netherlands and Singapore, which are designed to foster collaboration among industry leaders, academia, government agencies&nbsp;and startups to push boundaries of aerospace technology.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-launches-tech-hub-in-korea"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-launches-tech-hub-in-korea"
  },
  {
    "published": "Mon, 24 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      24,
      15,
      0,
      0,
      0,
      328,
      0
    ],
    "title": "AGY expands Aiken glass fiber operations",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "AGY expands Aiken glass fiber operations"
    },
    "summary": "The $12.1 million investment is broadening AGY&rsquo;s low-dielectric constant and low-dissipation factor fiberglass capacity in the South Carolina area.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The $12.1 million investment is broadening AGY&rsquo;s low-dielectric constant and low-dissipation factor fiberglass capacity in the South Carolina area."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-AGY-materials-production-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Fiberglass production.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-AGY-materials-production-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | AGY</p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/agy-holding\" target=\"_blank\">AGY</a> (Aiken, S.C., U.S.) has announced the expansion of its operations in Aiken County. The company&rsquo;s $12.1 million investment will create 80 new jobs.</p>\n\n<p>AGY is an innovator and manufacturer of specialty glass fiber reinforcement, enabling high-performance composite solutions for aviation, defense, electronics, architecture and telecommunications applications that are integral to civilian life and critical to the national security supply chain.</p>\n\n<p>The company is expanding the manufacturing capacity of its low-dielectric constant (Low Dk) and low-dissipation factor (Low Df) glass fibers, which are used to enhance the performance, reliance&nbsp;and durability of semiconductor packaging, high-performance printed circuit boards, electronic systems and high-speed telecommunications equipment. According to AGY CEO Al Ridilla, AI is further transforming AGY&rsquo;s manufacturing capabilities.</p>\n\n<p>The Coordinating Council for Economic Development awarded a $200,000 Set-Aside grant to Aiken County to assist with the costs of building renovations. Operations&nbsp;are expected to be online in Q1 2026.&nbsp;</p>\n\n<p>&ldquo;This expansion is a win for Aiken County, our industrial workforce and for AGY,&rdquo; says Aiken County Council Chairman Gary Bunker. &ldquo;An investment of this scale reflects AGY&rsquo;s confidence in our community and affirms Aiken County&rsquo;s pro-growth, pro-manufacturing policies. AGY has long been a strong corporate neighbor and a key industrial asset for both Aiken County and our nation.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/agy-expands-aiken-glass-fiber-operations"
      }
    ],
    "link": "https://www.compositesworld.com/news/agy-expands-aiken-glass-fiber-operations"
  },
  {
    "published": "Fri, 21 Nov 2025 13:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      21,
      18,
      30,
      0,
      4,
      325,
      0
    ],
    "title": "EuCIA announces launch of Carbon Fiber Europe",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "EuCIA announces launch of Carbon Fiber Europe"
    },
    "summary": "Founding members Hexcel Composites SASU, Mitsubishi Chemical Europe, Toray and Teijin will promote and foster the use and application of carbon fiber within Europe through&nbsp;four strategic pillars.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Founding members Hexcel Composites SASU, Mitsubishi Chemical Europe, Toray and Teijin will promote and foster the use and application of carbon fiber within Europe through&nbsp;four strategic pillars."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-eucia-carbonfibereurope-founding-members.jpg;maxWidth=720\" /> </div>\n\n<p>From left to right: EuCIA&rsquo;s managing director, Rapha&euml;l Pleynet, and president, Roberto Frassine, with Nicole Kambeck, head of sustainability, Mitsubishi Chemical Europe; Hinrich Hampe, head of governmental affairs, Teijin Carbon Europe; Raf Bussels, senior director EMEA R&amp;D &bull; R&amp;D, Mitsubishi Chemical Group; Claude Despierres, VP sustainability and business development, Hexcel; Kristian Seidel, managing director, Teijin Automotive Technologies Wuppertal GmbH; Axel Leuchter, head of EU sustainability group, Teijin Ltd; Ota Kenjiro, CEO EACC; and Eisuke Wadahara, president of EACC, Toray Industries. Source | Carbon Fiber Europe.</p>\n</div>\n\n<p>The&nbsp;<a href=\"https://eucia.eu/\" target=\"_blank\">European Composites Industry Association</a>&nbsp;(EuCIA,&nbsp;Brussel, Belgium) has launched&nbsp;Carbon Fiber Europe, a new alliance dedicated to supporting the sustainable growth of Europe&rsquo;s carbon fiber industry. The founding members of the alliance include&nbsp;<a href=\"https://www.compositesworld.com/suppliers/hexcel\" target=\"_blank\">Hexcel Composites SASU</a>&nbsp;(Dagneux, France), <a href=\"https://eu.mitsubishi-chemical.com/\" target=\"_blank\">Mitsubishi Chemical Europe</a> (Moritzburg, Germany), <a href=\"https://www.compositesworld.com/suppliers/teijin-limited\" target=\"_blank\">Teijin Ltd.</a> (Tokyo, Japan)&nbsp;and <a href=\"https://www.compositesworld.com/suppliers/toray-industries\" target=\"_blank\">Toray Industries</a> (Tokyo, Japan).</p>\n\n<p>Carbon Fiber Europe&rsquo;s mission is to promote the positive contributions and innovative power of European carbon fiber products to society and to foster their safe and sustainable use within Europe. The alliance will&nbsp;pursue these goals through activities based around four strategic pillars:</p>\n\n<ul>\n\t<li>Advocacy and&nbsp;Representation</li>\n\t<li>Sustainability and&nbsp;Circularity</li>\n\t<li>Innovation and&nbsp;Standards</li>\n\t<li>Health and&nbsp;Safety.</li>\n</ul>\n\n<p>At a recent meeting in Brussels, Belgium, alliance members elected Raf Bussels, senior director EMEA R&amp;D &bull; R&amp;D&nbsp;at Mitsubishi Chemical Group as the chair of Carbon Fiber Europe, and Axel Leuchter, head of EU sustainability group, Teijin Ltd.,&nbsp;as vice chair.</p>\n\n<p>&ldquo;Carbon fiber is an integral part of Europe&rsquo;s composites industry and it is essential for realizing the EU Clean Industrial Deal&rsquo;s objectives for decarbonization, innovation and industrial resilience,&rdquo; says Roberto Frassine, president of EuCIA. &ldquo;We are committed to assisting Carbon Fiber Europe members in their efforts to reinforce carbon fiber&rsquo;s role in Europe&rsquo;s sustainable industrial development.&rdquo;</p>\n\n<p>Carbon Fiber Europe will also advance environmentally and socially responsible production practices, promote circular economy models&nbsp;and support the reduction of carbon footprint across the carbon fiber value chain, including end-of-life management. It will promote best practices and science-based safety guidelines to ensure the protection of workers, users&nbsp;and the environment.</p>\n\n<p>The alliance is currently defining its priority actions and Working Group structure. A Carbon Fiber Europe website will be launched soon.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/eucia-announces-launch-of-carbon-fiber-europe"
      }
    ],
    "link": "https://www.compositesworld.com/news/eucia-announces-launch-of-carbon-fiber-europe"
  }
]