[
  {
    "published": "Fri, 25 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      17,
      0,
      0,
      4,
      206,
      0
    ],
    "title": "DLR study considers cast PA6 molds for in situ AFP composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "DLR study considers cast PA6 molds for in situ AFP composites"
    },
    "summary": "3D printed thermoplastic mold was analyzed as alternative to expensive, time-consuming metallic molds and for suitability in&nbsp;aerospace-grade composite structure&nbsp;fabrication.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "3D printed thermoplastic mold was analyzed as alternative to expensive, time-consuming metallic molds and for suitability in&nbsp;aerospace-grade composite structure&nbsp;fabrication."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-pa6-molds-publication.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-dlr-pa6-molds-publication.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;<a href=\"https://www.linkedin.com/posts/dlr-bt_thermoplastic-dlrbt-dlr-activity-7353053768017399808-a7-G/?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAN4sCoBEnrOaN1_kOmfslSmxd1f5UfO6WM\" target=\"_blank\">&copy; DLR</a></p>\n</div>\n\n<p>In a recent research paper released by&nbsp;<a href=\"https://www.compositesworld.com/suppliers/dlr---german-aerospace-center\" target=\"_blank\">The German Aerospace Center &mdash; DLR</a>&nbsp;(Cologne), the organization explores how thermoplastic composite (TPC) molds, specifically those made&nbsp;from polyamide 6 (PA6), perform compared to conventional metal tooling in the in situ automated fiber placement (AFP) process.</p>\n\n<p>Traditional tooling is expensive and time-consuming, which is why the industry is increasingly looking to 3D printed tools as cost-effective and flexible alternatives. The DLR&nbsp;investigated the difference in mechanical and morphological characteristics of laminates produced on metallic and polymeric molds. First, carbon fiber-reinforced LMPAEK&nbsp;laminates for both mold types were produced and their&nbsp;tensile strength, interlaminar shear strength&nbsp;and morphological characteristics analyzed&nbsp;using scanning electron microscopy (SEM) and differential scanning calorimetry (DSC). Despite differences in stiffness and thermal conductivity between the materials, the DLR found no statistically significant differences in the mechanical or crystalline properties of the laminates.</p>\n\n<p>Findings indicate that&nbsp;PA6&nbsp;in its cast form is a viable, low-cost option for nonheated AFP tooling. The DLR expects to extend this research into its 3D printing activities to open up new possibilities for efficient and flexible composites manufacturing.</p>\n\n<p><a href=\"https://www.mdpi.com/2504-477X/9/7/367\" target=\"_blank\">Read the complete study here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/dlr-study-considers-cast-pa6-molds-for-in-situ-afp-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/dlr-study-considers-cast-pa6-molds-for-in-situ-afp-composites"
  },
  {
    "published": "Fri, 25 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      17,
      0,
      0,
      4,
      206,
      0
    ],
    "title": "Seoul National University VABS to design UAM, rotorcraft blades",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Seoul National University VABS to design UAM, rotorcraft blades"
    },
    "summary": "University conducts research to establish conceptual and detailed design methodologies applicable to composite UAM systems and to develop digital twin technologies that can be used in aerospace.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "University conducts research to establish conceptual and detailed design methodologies applicable to composite UAM systems and to develop digital twin technologies that can be used in aerospace."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-vabs-snu1.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-vabs-snu1.png;maxWidth=720\" /> </a></div>\n\n<p>Blade section design and fan plot examples for analyzing the vibration characteristics of UAM (blade + graph) and overall UAM design and iterative flow chart. Sources | AnalySwift, SNU</p>\n</div>\n\n<p><a href=\"https://en.snu.ac.kr/\" target=\"_blank\">Seoul National University</a> (SNU, South Korea) has been participating in <a href=\"https://www.compositesworld.com/suppliers/analyswift\" target=\"_blank\">AnalySwift</a>&nbsp;(West Lafayette, Ind., U.S.)&nbsp;Academic Partner Program (APP), using its VABS simulation software to analyze urban air mobility (UAM)&nbsp;and other rotorcraft rotor blades.</p>\n\n<p>The work is&nbsp;part of the Active Aeroelasticity and Rotorcraft Laboratory (AARL) in the Department of Aerospace Engineering at SNU&nbsp;and the SNU-UAM Center, a research center dedicated to developing the core technologies for UAM. The APP offers participating universities no-cost licenses of engineering software programs VABS and SwiftComp&nbsp;so students, researchers&nbsp;and faculty can leverage the tools in their academic research.</p>\n\n<div class=\"article-figure fl-r m-l-2 m-t-1\">\n<div class=\"article_sidebar\">\n<p>The VABS program is a general-purpose cross-sectional analysis tool for predicting structural beam properties and recovering 3D stresses, strains&nbsp;and strengths of slender composite<br />\nstructures. The tool models composite rotorcraft (helicopter, air mobility,<br />\nunmanned aerial vehicles) and wind turbine rotor blades, as well as other slender composite structures.</p>\n\n<p>VABS delivers high-fidelity results early on to help computationally resolve engineering challenges, reduce trial and errors&nbsp;and arrive at the best solution quickly.</p>\n</div>\n</div>\n\n<p>&ldquo;The SNU-UAM Center brings together 12 laboratories from seven universities,&nbsp;including SNU, with the goal of securing core technologies for UAM,&rdquo; says&nbsp;professor SangJoon Shin of the Department of Aerospace Engineering at SNU.&nbsp;&ldquo;To ensure the safe operation of UAM, it will be essential to avoid ground resonance. VABS enables us to design the rotor blade cross-section that avoids resonance within the operational frequency range. We have been using the&nbsp;VABS program to perform cross-sectional design based on the given geometries and to achieve the desired vibration characteristics for the rotor blades integrated with a gimballed hub.&rdquo;</p>\n\n<p>First, the SNU team designed the blade cross-section and used VABS to obtain the corresponding stiffness matrix. Then, this result was provided into Camrad&nbsp;II, a performance analysis program for rotorcraft, to compute the vibratory response under realistic flight conditions.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/seoul-national-university-vabs-to-design-uam-rotorcraft-blades"
      }
    ],
    "link": "https://www.compositesworld.com/news/seoul-national-university-vabs-to-design-uam-rotorcraft-blades"
  },
  {
    "published": "Fri, 25 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      16,
      0,
      0,
      4,
      206,
      0
    ],
    "title": "ORGANIC project to 3D print bio-inspired structures with bio-based materials",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ORGANIC project to 3D print bio-inspired structures with bio-based materials"
    },
    "summary": "EU-funded Horizon Europe project tackles lower production cost, enhanced sustainability and first-time-right parts fabrication&nbsp;through the fusion of&nbsp;biology, additive manufacturing and AI.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "EU-funded Horizon Europe project tackles lower production cost, enhanced sustainability and first-time-right parts fabrication&nbsp;through the fusion of&nbsp;biology, additive manufacturing and AI."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-organic-project-kickoff-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-organic-project-kickoff-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Project partners from 13 organizations and eight countries at the kick-off meeting in Vigo, Spain in June 2025. Source | ORGANIC project</p>\n</div>\n\n<p>Nature&rsquo;s solutions&nbsp;have often&nbsp;been translated to economic sectors such as<br />\narchitecture or healthcare. The&nbsp;EU-funded <a href=\"https://www.linkedin.com/company/organic-project\" target=\"_blank\">ORGANIC project</a> will go one step further: It will not only 3D print bio-inspired structures with bio-based materials, but also integrate biology, engineering and information technology to create a self-learning system. This system will evolve through technologies like AI-driven cognitive&nbsp;and and evolutionary controls.&nbsp;</p>\n\n<p>Within the project, these developments will be applied to enhancing wind turbine blades. In addition, they will have the ability to be adapted to any field in manufacturing that may benefit from bio-based materials. The 4-year project, led by the&nbsp;<a href=\"https://www.aimen.es/\" target=\"_blank\">Aimen&nbsp;Technology Centre</a>&nbsp;(O Porri&ntilde;o, Spain), started on June 1, 2025. <a href=\"https://www.iconiqinnovation.com/\" target=\"_blank\">Iconiq Innovation</a>&nbsp;(Harborough, U.K.) takes&nbsp;part in this project as the work package lead for &ldquo;WP boosting bio-intelligence adoption in AM.&rdquo;</p>\n\n<p>&ldquo;Additive manufacturing [AM] is highly promising but has its challenges,&rdquo; explains Andrea Fern&aacute;ndez Mart&iacute;nez, AI researcher&nbsp;in Aimen&nbsp;and project coordinator. &ldquo;It&rsquo;s a young technology which needs to improve before it will yield first-time-right products. The bio-intelligent approach we take in ORGANIC is based on data and will give us the opportunity to create a system that will correct itself by comparing what has been produced with the ideal state towards a first-time-right fabrication.&rdquo;</p>\n\n<p>The project consortium&nbsp;has 13 partners, consisting of a Spanish wind turbine manufacturer, 3D printing&nbsp;companies for large composite parts, universities and&nbsp;research and technology organizations, as well as hardware and software&nbsp;companies, an innovation consultancy and an innovation network. It spans eight European countries and multiple disciplines.</p>\n\n<p>&ldquo;ORGANIC&rsquo;s&nbsp;highly disciplinary is ambition: We take inspiration from nature, design&nbsp;new structures using bio-based materials, develop hardware as well as software and want the result to be adaptable across different manufacturing value chains. The use case in wind energy is our starting point.&rdquo;</p>\n\n<p>The project team will work on wind turbine blades to validate their technological developments. Expressed simply, the blades consist of a three-layer sandwich structure. Most of its middle layer is currently made of PET, PVC or balsa wood core. By 3D printing a customized core from bio-based materials, the blades&nbsp;can be more easily recycled while keeping their intended functionality&nbsp;and technical requirements. The new approach could help save cost and increase sustainability.&nbsp;</p>\n\n<p>In their&nbsp;first step, project partners will define the requirements of the sandwich structure&rsquo;s new core. These requirements will influence the choice of the bio-based material as well as the AI-driven generative design of the components. A prototype of the printing head will be&nbsp;equipped with sensing technology and a self-X control system. It will be tested on&nbsp;the Aimen Laser Applications Centre&rsquo;s AM pilot line. Analyzing the results will determine which sensors will be needed in the hardware&rsquo;s second iteration.</p>\n\n<p>In addition to this work, the software part of the project will aim to develop an AI-drive cognitive and evolutionary&nbsp;control system based on digital twins, leveraging a reinforcement learning framework. Asset Administration Shell (AAS)-based digital twins will be integrated for standardization and interoperability via an ontology-based knowledge system.</p>\n\n<p><em>One of the five projects in the scope of bio-intelligent manufacturing, this project has received funding from HORIZON-CL4-2024-TWIN-TRANSITION-01-TWO-STAGE under grant agreement number 101178127. Funded by the European Union.</em></p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/organic-project-to-3d-print-bio-inspired-structures-with-bio-based-materials"
      }
    ],
    "link": "https://www.compositesworld.com/news/organic-project-to-3d-print-bio-inspired-structures-with-bio-based-materials"
  },
  {
    "published": "Fri, 25 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      15,
      0,
      0,
      4,
      206,
      0
    ],
    "title": "Spintech grows Miamisburg footprint to advance composite airframes capabilities",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Spintech grows Miamisburg footprint to advance composite airframes capabilities"
    },
    "summary": "Additional 53,000 square footage, which could grow to&nbsp;250,000 square feet of operational space by 2027, will support&nbsp;complex airframe component delivery for DOD, UAS programs.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Additional 53,000 square footage, which could grow to&nbsp;250,000 square feet of operational space by 2027, will support&nbsp;complex airframe component delivery for DOD, UAS programs."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-Spintech-expanded-building-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> </a></div>\n</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-spintech-hawthorn-updated-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Hawthorn Composites building exterior.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-spintech-hawthorn-updated-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Spintech Holdings</p>\n</div>\n\n<p><a href=\"https://www.spintechinc.com/\" target=\"_blank\">Spintech Holdings, Inc.</a>&nbsp;(Dayton, Ohio, U.S.) recently announced a $7 million investment that is adding 53,000 square feet of&nbsp;dedicated high-volume manufacturing space to a plant in Miamisburg previously leased by Cornerston Research Group (CRG). The facility will be in addition to its current location at 1964 Byers Road in the same area, with majority of the investment going toward&nbsp;machinery and equipment that will be used to manufacture aerospace parts for&nbsp;critical defense and commercial systems.</p>\n\n<p>Over the past 5&nbsp;years, Spintech has evolved significantly, driven by customers&rsquo;&nbsp;demand for high-quality structural airframe components at lower costs and higher production rates. Historically, Spintech operated as a tooling provider through its Smart Tooling division, which offers&nbsp;solutions for aerospace composite (carbon fiber) manufacturing. Since its commercial launch in 2010, Smart Tooling has successfully been deployed on more than 50 flight-qualified aerospace systems, including high-profile platforms such as SpaceX&rsquo;s <em>Falcon 9</em>, Boeing&rsquo;s ecoDemonstrator, General Atomics&rsquo; <em>SkyGuardian</em>&nbsp;and Bell/Boeing&rsquo;s V-22. However, as Smart Tooling products are reusable for up to 100 cycles, they generate&nbsp;limited sales volume, constraining revenue growth. To seek other growth opportunities Spintech started to explore other means to apply its composite processing knowledge.</p>\n\n<p>The U.S. Department of Defense&rsquo;s (DOD&rsquo;s) pivot toward&nbsp;low-cost unmanned systems was what initially enabled Spintech to extend its work beyond tooling, resulting in <a href=\"https://www.compositesworld.com/news/spintech-opens-new-composites-manufacturing-division-hawthorn-composites\" target=\"_blank\">the launch of Hawthorn Composites in 2021</a> to meet this demand. To this day, Hawthorn Composites delivers structural composite airframes and airframe components for unmanned aircraft, with capabilities that enable it to produce tens of complex airframe components &mdash; such as fuselages, wings, tails&nbsp;and nosecones &mdash; per day, positioning Spintech as a key supplier to DOD prime contractors and the DOD itself.</p>\n\n<p>Over the last few years, Hawthorn has secured major contracts for six key unmanned aircraft system (UAS) platforms in both the defense and commercial space, progressing from engineering concepts through low-rate initial production (LRIP)&nbsp;and transitioning to high-rate production. The U.S. DOD&rsquo;s current endeavors &mdash; ordering UAS for missions like intelligence, surveillance&nbsp;and reconnaissance (ISR), counter-unmanned aircraft systems (CUAS)&nbsp;and low-cost munitions &mdash; is further fueling Hawthorn&rsquo;s growth.&nbsp;</p>\n\n<p>Spintech&rsquo;s newest leasing, bringing its total operational space to 90,000 square feet, will&nbsp;produce up to 533 airframes per month and host a Systems Integration&nbsp;Lab (SIL) in a controlled unclassified information (CUI) environment. The SIL will enable the Air Force Research Laboratory (AFRL) and third-party partners to integrate new payloads and flight controls onto Group II and Group III UAS (small- to medium-sized drones). The SIL will house vehicles that adhere to modular open systems architecture (MOSA) and weapons open systems architecture (WOSA) standards. This compliance supports rapid deployment of new capabilities, similar to an App store-like model, reducing time to field.</p>\n\n<p>Looking ahead, Spintech anticipates adding a 60,000-square-foot&nbsp;facility and a 100,000-square-foot&nbsp;facility within 2 years to support other U.S. DOD program ramp-ups. If successful in transitioning engineered platforms to production, Spintech&rsquo;s Dayton-area footprint could reach 250,000 square feet&nbsp;by the end of 2027.</p>\n\n<p>What other growth projects is Spintech considering?<strong>&nbsp;</strong>Through its Hawthorn Composites division, Spintech is exploring strategic opportunities to drive growth over the next 12 months. Its team is&nbsp;pursuing additional composite airframe manufacturing contracts with defense and commercial UAS customers to expand its&nbsp;market presence. Spintech is also&nbsp;developing value-added services, such as enhanced manufacturing processes and integration solutions, to deliver greater value to existing customers.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/spintech-grows-miamisburg-footprint-to-advance-composite-airframes-capabilities"
      }
    ],
    "link": "https://www.compositesworld.com/news/spintech-grows-miamisburg-footprint-to-advance-composite-airframes-capabilities"
  },
  {
    "published": "Fri, 25 Jul 2025 10:01:40 -0400",
    "published_parsed": [
      2025,
      7,
      25,
      14,
      1,
      40,
      4,
      206,
      0
    ],
    "title": "HydroGraph launches Compounding Partner Program to expand graphene-enhanced thermoplastics",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "HydroGraph launches Compounding Partner Program to expand graphene-enhanced thermoplastics"
    },
    "summary": "Through the establishment of a qualified network of partners,&nbsp;HydroGraph is building commercial availability of unreinforced and reinforced thermoplastic compounds that incorporate its Fractal Graphene&nbsp;material.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Through the establishment of a qualified network of partners,&nbsp;HydroGraph is building commercial availability of unreinforced and reinforced thermoplastic compounds that incorporate its Fractal Graphene&nbsp;material."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-hydrograph-tensile-testing-machines.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Tensile testing machine.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-hydrograph-tensile-testing-machines.jpg;maxWidth=720\" /> </a></div>\n\n<p>HydroGraph uses tensile testing machines (pictured) to validate the effectiveness of Fractal Graphene, certify partner performance&nbsp;and provide engineering-grade proof to OEMs and manufacturers in demanding industries. Source | HydroGraph</p>\n</div>\n\n<p><a href=\"https://hydrograph.com/\" rel=\"nofollow\" target=\"_blank\" title=\"HydroGraph Clean Power Inc.\">HydroGraph Clean Power Inc.</a>&nbsp;(Vancouver, BC, Canada), producer of high-purity graphene, has announced the&nbsp;launch of the Compounding Partner Program aimed at accelerating the adoption of its high-performance Fractal Graphene&nbsp;in unreinforced and fiber-reinforced thermoplastics.</p>\n\n<p>The initiative establishes a qualified network of plastic compounders with demonstrated expertise in processing graphene-enhanced thermoplastic materials, with early partners already piloting new formulations across automotive and packaging sectors. Participants in the program will undergo a qualification process to ensure adherence to performance, quality and consistency benchmarks defined by HydroGraph&rsquo;s technical lab.</p>\n\n<p>&ldquo;Establishing a select network of certified compounders enables HydroGraph to ensure consistent processing of Fractal Graphene&nbsp;at commercial scale,&rdquo; says&nbsp;Kjirstin Breure, president and CEO of HydroGraph. &ldquo;This initiative provides end customers with a vetted supply chain for sourcing graphene-enhanced compounds with confidence.&rdquo;</p>\n\n<p>Qualified partners will receive technical support, knowledge transfer&nbsp;and business referrals for commercial opportunities. The program is designed for compounders with advanced material capabilities, strong quality control systems&nbsp;and a track record in innovative product development.</p>\n\n<p>Fractal Graphene is a turbostratic graphene material manufactured using HydroGraph&rsquo;s patented detonation synthesis technology. Characterized by its 99.8% carbon purity and consistent morphology, the material&rsquo;s&nbsp;fractal structure enables performance at addition rates 10 to 100 times lower than conventional graphene nanoplatelets, offering potential reductions in material use, cost&nbsp;and environmental impact. Unlike traditional forms of graphene, which often require high loadings that may affect processability or material properties, Fractal Graphene&nbsp;achieves mechanical and electrical enhancements at ultra-low concentrations. HydroGraph&rsquo;s production method is designed to operate with low energy and carbon intensity compared to traditional manufacturing approaches.</p>\n\n<p>HydroGraph&rsquo;s certified compounding partners will support customers across industries seeking lighter, stronger&nbsp;and more sustainable materials, including automotive, construction, packaging, agriculture&nbsp;and textiles.</p>\n\n<p>Plastic compounders interested in joining HydroGraph&rsquo;s Compounding Partner Program can contact the company at <a href=\"mailto:partners@hydrograph.com\" target=\"_blank\">partners@hydrograph.com</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/hydrograph-launches-compounding-partner-program-to-expand-graphene-enhanced-thermoplastics"
      }
    ],
    "link": "https://www.compositesworld.com/news/hydrograph-launches-compounding-partner-program-to-expand-graphene-enhanced-thermoplastics"
  },
  {
    "published": "Wed, 23 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      23,
      17,
      0,
      0,
      2,
      204,
      0
    ],
    "title": "CompPair advances HealTech composites in real-world solutions",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "CompPair advances HealTech composites in real-world solutions"
    },
    "summary": "New projects, collaborations and sustainability efforts highlight the prospect of healable materials for automotive, AAM, space and beyond.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "New projects, collaborations and sustainability efforts highlight the prospect of healable materials for automotive, AAM, space and beyond."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-comppair-axalp-propellerblades.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Healable propeller blades.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-comppair-axalp-propellerblades.jpg;maxWidth=720\" /> </a></div>\n\n<p>Axalp Technologies healable propeller blades. Source | <a href=\"https://www.linkedin.com/posts/comppair_jecworld2025-aerospaceinnovation-healablecomposite-activity-7302621491190202368-7el4/\" target=\"_blank\">CompPair LinkedIn</a></p>\n</div>\n\n<p><a href=\"https://www.comppair.ch/\" target=\"_blank\">CompPair</a>&nbsp;(Renens, Switzerland) has shared several developments in its efforts to bring repairability and sustainability&nbsp;to composites into real-world solutions, from&nbsp;advancing space reusability to scaling regenerative tech collaborations.</p>\n\n<p>CompPair collaborated with <a href=\"https://www.compositesworld.com/suppliers/shd-composite-materials\" target=\"_blank\">SHD Group</a> (Sleaford, U.K.) and <a href=\"https://www.kscomposites.com/\" target=\"_blank\">KS Composites</a> (Melton Mowbray, U.K.) on a &ldquo;Sustainability Showcase Car,&rdquo; a Formula 1 vehicle&nbsp;that highlights 10&nbsp;individual advanced material solutions demonstrating&nbsp;how prepregs can be tailored to deliver high-performance materials with reduced environmental impact. The project highlights SHD&rsquo;s innovation in future materials alongside KS&rsquo;&nbsp;expert manufacturing capabilities, with CompPair&rsquo;s HealTech technology selected for integration in the prepregs used for the car&rsquo;s camera housing.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-comppairsustainableshowcasecar.png\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-comppairsustainableshowcasecar.png;maxWidth=385\" /></a></div>\n\n<p>Sustainability Showcase Car, highlighted at JEC World 2025. Source | CompPair</p>\n</div>\n\n<p>In Formula 1, a camera housing is a lightweight, high-performance component designed to securely mount the camera under extreme conditions, ensuring high-definition footage of the race car in action. The part was manufactured in an autoclave demonstrating CompPair&rsquo;s compatibility with typical Formula 1 manufacturing processes and quality standards and its capability to deliver healable prepregs for composite structures. This innovation not only supports motorsport applications but also extends to mobility, sport&nbsp;and aeronautical sectors.</p>\n\n<p>CompPair is also proving its capabilities in the aerospace/advanced air mobility sectors, powering <a href=\"https://axalptech.com/\" target=\"_blank\">Axalp Technologies</a>&rsquo; (Olten, Switzerland) propeller blades, which have showcasing the versatility and reliability of HealTech materials in real flight conditions. The enhanced blades offer a 30% increase in crack resistance, greater in-flight stability through improved vibration damping&nbsp;and reduced maintenance time thanks to ultra-fast autonomous repair, extending performance and lifespan in demanding aviation environments.</p>\n\n<p>Under its GENESIS&nbsp;(cryoGEnic taNks made of hEalable compoSItes: Sub-scale parts) project, secured under the ESA&rsquo;s Future Launchers Preparatory Programme (FLPP), CompPair&nbsp;proposes building repairable cryogenic composite tanks&nbsp;for reusable space launch structures using HealTech&nbsp;slit tapes, specially developed for extreme space conditions.</p>\n\n<p dir=\"auto\" id=\"viewer-p4c7t124\">The GENESIS project aims to increase the maturity&nbsp;of this technology and de-risk its implementation&nbsp;in reusable launch systems. The key validation objectives include:</p>\n\n<ul>\n\t<li>Compatibility with industrial winding processes</li>\n\t<li>Feasibility of complex geometry fabrication</li>\n\t<li>Performance under typical cryogenic operating conditions.</li>\n</ul>\n\n<p>CompPair leads this project with <a href=\"https://www.invent-gmbh.de/en/\" rel=\"noopener noreferrer\" target=\"_blank\">Invent</a>&nbsp;as the main partner, supporting manufacturing and ground testing&nbsp;of sub-scale cryogenic tank demonstrators, and&nbsp;<a href=\"https://orbex.space/\" rel=\"noopener noreferrer\" target=\"_blank\">Orbex</a>, contributing as an end user, bringing strategic input to align the solution with real-world use cases for reusable launchers.</p>\n\n<p>CompPair also continues its sustainability journey, joining the European Circular Composites Alliance (ECCA), a new initiative led by EuCIA&nbsp;in partnership with JEC. The ECCA aims to accelerate the transition toward a fully circular economy for composite materials in Europe, bringing together stakeholders across the composite value chain to coordinate action and set industry-wide targets for circularity, innovation&nbsp;and impact.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/comppair-advances-healtech-composites-in-real-world-solutions"
      }
    ],
    "link": "https://www.compositesworld.com/news/comppair-advances-healtech-composites-in-real-world-solutions"
  },
  {
    "published": "Wed, 23 Jul 2025 13:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      23,
      17,
      0,
      0,
      2,
      204,
      0
    ],
    "title": "Composite Integration presents webinar on liquid resin infusion",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composite Integration presents webinar on liquid resin infusion"
    },
    "summary": "On July 30, 2025, company experts will discuss&nbsp;the role of LRI&nbsp;in delivering scalable, OOA&nbsp;composite production for the aerospace sector.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "On July 30, 2025, company experts will discuss&nbsp;the role of LRI&nbsp;in delivering scalable, OOA&nbsp;composite production for the aerospace sector."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-compositeintegration-lri-webinar.jpg\" target=\"_blank\"><img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/0725-cw-news-compositeintegration-lri-webinar.jpg;maxWidth=385\" /></a></div>\n\n<p>Source | Composite Integration <a href=\"https://www.linkedin.com/posts/composite-integration-ltd_aerospacecomposites-liquidresin-resininfusion-activity-7353742825038962688-7YJu/?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAN4sCoBEnrOaN1_kOmfslSmxd1f5UfO6WM\" target=\"_blank\">LinkedIn</a></p>\n</div>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/composite-integration\" target=\"_blank\">Composite Integration</a> (Saltash, Cornwall, U.K.), specializing in&nbsp;RTM and resin infusion processes, is putting on free online webinar on July 30, 2025, titled &ldquo;Liquid Resin: Does This Have a Role in Future Aircraft Structures?&rdquo; Register for the&nbsp;10:00&nbsp;- 10:45 a.m. EDT (15:00 &ndash;&nbsp;15:45 p.m. BST) webinar <a href=\"https://events.teams.microsoft.com/event/eac4f19e-bccf-4bbc-a031-6da81db69942@5d41501b-fb6d-40c8-845b-efff4314bebb\" target=\"_blank\">here</a>.</p>\n\n<p>The aerospace industry has been exploring out-of-autoclave (OOA) processing for years, but why hasn&rsquo;t it become the default? Building on insight shared in Composite Integration&rsquo;s recent white paper,&nbsp;<em>&ldquo;</em><a href=\"https://info.composite-integration.co.uk/liquid-resin-the-journey-towards-future-aircraft-structures?utm_source=ci&amp;utm_medium=banner&amp;utm_campaign=liquid-resin-whitepaper&amp;utm_content=ci-web-banner\" target=\"_blank\" title=\"https://info.composite-integration.co.uk/liquid-resin-the-journey-towards-future-aircraft-structures?utm_source=ci&amp;utm_medium=banner&amp;utm_campaign=liquid-resin-whitepaper&amp;utm_content=ci-web-banner\">Liquid Resin: The Journey Towards Future Aircraft Structures</a><em>,&rdquo;</em>&nbsp;technical director Richard Blade and R&amp;D director Tim Searle Ph.D. CEng MIMechE&nbsp;will be exploring&nbsp;the key challenges in aerospace composites manufacturing, and how LRI&nbsp;processes could help meet them.</p>\n\n<p>Diving into&nbsp;three core questions &mdash; why is this necessary, what can we achieve and how can we do it?&nbsp;&mdash; the webinar will cover:</p>\n\n<ul>\n\t<li>Why legacy processes are holding aerospace composites back</li>\n\t<li>What liquid resin can actually do &mdash;&nbsp;and how</li>\n\t<li>Innovations in process control, heated tooling and more</li>\n\t<li>Real-world insights from reduced capital expenditure, to in situ heated tooling that removes the need for autoclaves altogether.</li>\n</ul>\n\n<p>There will also be a&nbsp;live Q&amp;A with company experts. Attendees are welcomed to bring questions.&nbsp;<a href=\"https://https://lnkd.in/erfuHBnv\" target=\"_blank\">Learn more or register</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/composite-integration-presents-webinar-on-liquid-resin-infusion"
      }
    ],
    "link": "https://www.compositesworld.com/news/composite-integration-presents-webinar-on-liquid-resin-infusion"
  },
  {
    "published": "Wed, 23 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      23,
      16,
      0,
      0,
      2,
      204,
      0
    ],
    "title": "Aquila introduces purpose-built 36 Molokai fishing platform",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aquila introduces purpose-built 36 Molokai fishing platform"
    },
    "summary": "The 36-foot catamaran features a composites-intensive design, pairing hardcore&nbsp;fishing capability with thoughtful comfort features.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The 36-foot catamaran features a composites-intensive design, pairing hardcore&nbsp;fishing capability with thoughtful comfort features."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-aquila36-molakai-catamaran.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"36 Molokai boat.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-aquila36-molakai-catamaran.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Aquila Power Catamarans</p>\n</div>\n\n<p><a href=\"https://www.aquilaboats.com\" target=\"_blank\">Aquila Power Catamarans</a> (Clearwater, Fla., U.S.) has announced the launch of the 36 Molokai, the newest addition to its Molokai catamaran series. Building on the success of the 47 Molokai, the&nbsp;36-foot fishing platform delivers offshore capability with comfort and versatility.</p>\n\n<p>Built with the same attention to fishing-first functionality, the 36 Molokai is said to deliver &ldquo;serious angling credentials&rdquo; with intelligent deck layout that maximizes fishing space and functionality. Its twin-hull design provides the stability and ride quality that catamaran anglers have come to expect, while advanced construction techniques ensure durability in challenging conditions.</p>\n\n<p>These fabrication techniques include an infusi-core construction.&nbsp;According to <a href=\"https://www.aquilaboats.com/vision/the-aquila-difference\" target=\"_blank\">Aquila&rsquo;s website</a>, &ldquo;vinyl ester and composite coring materials are laminated in a labor-intensive process. This uses numerous vacuum points, ensuring resin&nbsp;impregnates and saturates evenly with minimal vapor or emissions. This is combined digitally &mdash; cut fiberglass and composite to provide exact fit and strength.&rdquo; The use of robotic routers, computer-controlled table cutters and other equipment also achieves a better product, Aquila says, while reducing waste and weight. Framework supporting hull strength is even built in a separate mold to ensure proper placement of other parts during installation, and an exacting fit.</p>\n\n<p>The 36 Molokai also features a carbon fiber hardtop.&nbsp;Unlike traditional fiberglass hardtops, Aquila notes, which may flex or require extensive reinforcement, carbon fiber construction provides an inherently strong, rigid foundation that can handle the demanding loads of a tuna tower installation (outriggers, antennas and electronics) without additional structural reinforcements required.&nbsp;</p>\n\n<p>&ldquo;We didn&rsquo;t set out to build just another 36-foot boat,&rdquo; says&nbsp;Jean Raas, CEO of Aquia USA and chief product officer. &ldquo;We built a fishing weapon that happens to be 36 feet long. Every design decision was made with serious anglers in mind.&rdquo;</p>\n\n<p>The 36 Molokai&rsquo;s bow area exemplifies intelligent design, blending relaxation with fishing functionality. Bow sun loungers provide comfortable seating for three crew or guests during transit or downtime, with optional storage beneath for tackle organization and gear. This optional storage feature enables owners to customize their layout based on priorities.</p>\n\n<p>Beyond the bow seating, the 36 Molokai maximizes comfort and functionality throughout. An integrated tackle station keeps fishing gear organized and accessible, while the summer kitchen with optional BBQ transforms the boat into an entertaining platform. Pull-out coolers provide convenient storage and create additional aft-facing seating, ensuring ample room for crew and guests whether fishing or relaxing.</p>\n\n<p>While most fishing boats leave crews exposed to the elements all day, the 36 Molokai includes a sleeping cabin with private head, allowing&nbsp;anglers to extend single-day trips into overnight adventures. The cabin also provides a welcome retreat for family members, making the boat more inclusive for mixed-group outings where not everyone wants to fish all day.</p>\n\n<p>The 36 Molokai will debut at Fort Lauderdale International Boat Show in&nbsp;October 2025.</p>\n\n<p>Aquila features a catamaran portfolio that includes models ranging from 28 feet up to 70 feet</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aquila-introduces-purpose-built-36-molokai-fishing-platform"
      }
    ],
    "link": "https://www.compositesworld.com/news/aquila-introduces-purpose-built-36-molokai-fishing-platform"
  },
  {
    "published": "Wed, 23 Jul 2025 12:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      23,
      16,
      0,
      0,
      2,
      204,
      0
    ],
    "title": "Are you attending? Carbon Fiber 2025 agenda is finalized",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Are you attending? Carbon Fiber 2025 agenda is finalized"
    },
    "summary": "The lineup for this year&rsquo;s Carbon Fiber conference in Wichita, Kansas, centers around high rate, scalability and other current industry trends, all targeted through carefully curated presentations, panels, receptions&nbsp;and local tours.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The lineup for this year&rsquo;s Carbon Fiber conference in Wichita, Kansas, centers around high rate, scalability and other current industry trends, all targeted through carefully curated presentations, panels, receptions&nbsp;and local tours."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-carbonfiber24.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Carbon fiber conference room in 2024.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/0725-cw-news-carbonfiber24.jpg;maxWidth=720\" /> </a></div>\n\n<p>Carbon Fiber 2024. Source |&nbsp;<em>CW</em></p>\n</div>\n\n<p>The program has been finalized for <em>CompositesWorld</em> and <a href=\"https://www.compositesworld.com/suppliers/gardner-business-media\" target=\"_blank\">Gardner Business Media</a>&rsquo;s (Cincinnati, Ohio, U.S.) annual Carbon Fiber conference. Taking place this year in Wichita, Kansas &mdash; the &ldquo;Air Capital of the World&rdquo;&nbsp;&mdash; from Nov. 4-6, 2025, Carbon Fiber brings together carbon fiber experts, users, manufacturers, suppliers and OEMs, offering a comprehensive look at the global carbon fiber supply chain.</p>\n\n<p>Attendees can look forward to a variety of presentations, exhibits and exclusive receptions. <strong>Tuesday, Nov. 4</strong> kicks off the week with pre-conference activities, including two seminars discussing the Indian and global carbon fiber markets and their future outlook. Tuesday afternoon includes optional facility tours at the <a href=\"https://www.compositesworld.com/suppliers/national-institute-for-aviation-research\" target=\"_blank\">National Institute for Aviation Research</a> (NIAR) at Wichita State University, and concludes with the Opening Night Reception.</p>\n\n<p>A world-renowned hub for advanced aviation research, NIAR&rsquo;s facilities include the Advanced Technologies Lab for Aerospace Systems (ATLAS), a multi-disciplinary manufacturing environment featuring the leading and latest composites manufacturing technologies and processes, and the Aircraft Structural Test &amp; Evaluation Center (ASTEC), which is the third largest structural testing facility in the world. Don&rsquo;t miss your chance to get a behind-the-scenes look at NIAR&rsquo;s groundbreaking work (included with conference registration).</p>\n\n<p>A variety of insightful sessions take up the duration of <strong>Wednesday and Thursday</strong>, Nov. 5-6, from 9:00 a.m. &ndash; 5:00 p.m. Beginning with&nbsp;a keynote, each day highlights a robust lineup of presentation topics led by companies like Counterpoint Market Intelligence, the Air Force Research Lab (AFRL), Spirit AeroSystems, Cambium, Fives and many others.</p>\n\n<p><strong>Wednesday presentations include:</strong></p>\n\n<ul>\n\t<li>An outlook on challenges for airframers</li>\n\t<li>High-rate, low-cost manufacturing</li>\n\t<li>Discussion of a thermoplastic composite high-rate fuselage demonstrator</li>\n\t<li>Braided reinforcement efficiency</li>\n\t<li>Trends in automated inspection</li>\n\t<li>The acrylonitrile supply chain</li>\n\t<li>AI in composites</li>\n</ul>\n\n<p>Brought back by popular demand, there&nbsp;will also be a panel discussion from 3 &ndash;&nbsp;5 p.m. on meeting rate for aerospace and AAM, led by experts from Fiber Dynamics, ST Engineering MRAS, Mississippi State University and&nbsp;AFRL.</p>\n\n<p>A grand reception will follow for networking and exploring exhibits.</p>\n\n<p><strong>Thursday presentations include:</strong></p>\n\n<ul>\n\t<li>A wind energy update</li>\n\t<li>Composites for hydrogen&nbsp;storage</li>\n\t<li>The future of advanced materials</li>\n\t<li>Scaling composites: 50K-based fabrics</li>\n\t<li>Advancing aerospace pressure vessels</li>\n</ul>\n\n<p>The complete agenda can be viewed <a href=\"https://www.carbonfiberevent.com/agenda2025\" target=\"_blank\">here</a>.</p>\n\n<p>&ldquo;The Wichita location with its rich aviation history and the incredible facilities at NIAR make this year&rsquo;s Carbon Fiber the perfect setting for productive discussions on meeting the production rates that will be necessary for next-gen aerospace,&rdquo; says <em>CW</em> editor-in-chief Scott Francis. &ldquo;We have a great lineup of experts ready to share ideas aimed at helping the composites industry meet these challenges head-on.&rdquo;</p>\n\n<p>Carbon Fiber 2025 is a place where engineers, executives, fabricators, OEMS and plant managers in aerospace, automotive and energy come together to learn and look for strategic partners to maximize their budgets and increase their efficiencies. Learn more about the event and register <a href=\"https://www.carbonfiberevent.com/\" target=\"_blank\">here</a>.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/are-you-attending-carbon-fiber-2025-agenda-is-finalized"
      }
    ],
    "link": "https://www.compositesworld.com/news/are-you-attending-carbon-fiber-2025-agenda-is-finalized"
  },
  {
    "published": "Wed, 23 Jul 2025 11:00:00 -0400",
    "published_parsed": [
      2025,
      7,
      23,
      15,
      0,
      0,
      2,
      204,
      0
    ],
    "title": "Graphmatech secures €2.5 million EU grant for Uppsala pilot facility",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Graphmatech secures €2.5 million EU grant for Uppsala pilot facility"
    },
    "summary": "Funding will scale the Swedish startup&rsquo;s polymer-graphene hydrogen storage lining, made for Type 4 tanks and pipelines, with plans to deploy in commercial vehicles by 2027.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Funding will scale the Swedish startup&rsquo;s polymer-graphene hydrogen storage lining, made for Type 4 tanks and pipelines, with plans to deploy in commercial vehicles by 2027."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/1024-cw-product-graphmatech.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2024-CW/1024-cw-product-graphmatech.png;maxWidth=720\" /> </a></div>\n\n<p>Source |&nbsp;Graphmatech</p>\n</div>\n\n<p>As reported by the&nbsp;<a href=\"https://advancedcarbonscouncil.org/blogpost/2151389/512271/Swedish-Startup-Graphmatech-Lands-2-5M-EU-Grant-for-Advanced-Hydrogen-Storage-Solution\" target=\"_blank\">Advanced Carbons Council</a>&nbsp;and <a href=\"https://fuelcellsworks.com/2025/07/10/h2/swedish-startup-graphmatech-lands-2-5m-eu-grant-for-advanced-hydrogen-storage-solution\" target=\"_blank\">FuelCellWorks.com</a>, startup <a href=\"https://graphmatech.com/en\" target=\"_blank\">Graphmatech</a>&nbsp;(Uppsala, Sweden) has&nbsp;secured a &euro;2.5 million EU grant to develop a pilot facility in Uppsala for its polymer-graphene hydrogen storage lining technology, <a href=\"https://www.compositesworld.com/products/graphmatech-graphene-enhanced-solution-reduces-hydrogen-leaks\" target=\"_blank\">aiming to reduce hydrogen leakage</a> by 83%. The project, supported by the Swedish Energy Agency, will scale production from 5-200 tonnes annually and enable industrial testing, with plans to deploy the technology in 1,500 commercial vehicles by 2027.</p>\n\n<p>&ldquo;We&rsquo;re moving beyond R&amp;D to industrial-scale demonstration, accelerating the path to safer, more efficient hydrogen infrastructure that can be replicated across Europe and beyond,&rdquo; says Olivia Nestius, Graphmatech&rsquo;s CEO.&nbsp;</p>\n\n<p>Designed for Type 4 cylinders and pipelines, Graphmatech&rsquo;s technology leverages graphene&rsquo;s near-impermeability to gases, addressing the critical issue of hydrogen leakage, which can undermine both the economics and environmental benefits of hydrogen.</p>\n\n<p>Despite graphene&rsquo;s potential, high production costs and quality variability have historically limited its use. Graphmatech&rsquo;s system, however, is a &ldquo;drop-in&rdquo; solution, easily integrating into existing infrastructure without requiring extensive modifications.</p>\n\n<p>Graphmatech is also collaborating with&nbsp;<a href=\"https://www.levidian.com/\" target=\"_blank\">Levidian Nanosystems</a>&nbsp;(Cambridge, U.K.), a firm&nbsp;specializing in low-emission Loop&nbsp;technology that co-produces hydrogen and graphene&nbsp;(Levidian <a href=\"https://www.compositesworld.com/news/adamant-composites-levidian-partner-to-develop-graphene-enhanced-composite-materials\" target=\"_blank\">also works with</a> Adamant Composites as of 2022). This partnership aims to establish a low-carbon hydrogen supply chain, bridging laboratory innovation with practical application.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/graphmatech-secures-25-million-eu-grant-for-uppsala-pilot-facility"
      }
    ],
    "link": "https://www.compositesworld.com/news/graphmatech-secures-25-million-eu-grant-for-uppsala-pilot-facility"
  }
]