[
  {
    "published": "Mon, 17 Nov 2025 23:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      18,
      4,
      0,
      0,
      1,
      322,
      0
    ],
    "title": "Airbus ships fourth European Service Module for Artemis IV",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus ships fourth European Service Module for Artemis IV"
    },
    "summary": "Composites-intensive ESMs gives&nbsp;the Orion spacecraft&nbsp;power, propulsion and life support but also provides a vital gateway for the first lunar space station, Gateway.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Composites-intensive ESMs gives&nbsp;the Orion spacecraft&nbsp;power, propulsion and life support but also provides a vital gateway for the first lunar space station, Gateway."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airbus-esm-infographic.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"ESM and Orion infographic.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airbus-esm-infographic.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | <a href=\"https://www.airbus.com/en/products-services/space/space-exploration/moon-missions/orion-european-service-module\" target=\"_blank\">Airbus</a></p>\n</div>\n\n<p dir=\"ltr\">The fourth European Service Module (ESM-4) is ready to leave <a href=\"https://www.airbus.com/en\" target=\"_blank\">Airbus</a>&rsquo; facilities in Bremen, Germany, and be shipped to NASA&rsquo;s Kennedy Space Center in Florida. On arrival it will be tested and integrated with the <em>Orion</em> Crew Module ready for the next stage of NASA&rsquo;s Artemis program.</p>\n\n<p dir=\"ltr\">Built by Airbus under contract to the European Space Agency (ESA), ESM-4 will be a vital part of the Artemis IV mission which envisages astronauts going to live and work in humanity&rsquo;s first lunar space station, Gateway, which will enable new opportunities for science and preparation for human missions to Mars. Each ESM&rsquo;s primary structure&nbsp;<a href=\"https://www.compositesworld.com/news/airbus-delivers-second-composites-intensive-european-service-module-for-nasas-orion-spacecraft\" target=\"_blank\">is highly composites-intensive</a>.</p>\n\n<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><img alt=\"European Service Module (ESM) in the background.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airbus-esm-preview.jpg;maxWidth=385\" />European Service Module (ESM). Source | Airbus</div>\n\n<div>&nbsp;</div>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-esa-gateway-concept-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Lunar Gateway concept.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-esa-gateway-concept-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>The lunar Gateway is to be the first international space station around the Moon and will support the most distant human space missions ever attempted. Source | ESA</p>\n</div>\n</div>\n\n<p dir=\"ltr\">&ldquo;Delivering the fourth ESM takes us one step closer to a new space era with a lunar space station and increased opportunities for deep space scientific research,&rdquo; says Ralf Zimmerman, head of space exploration at Airbus. &ldquo;Europe&rsquo;s role, through ESA, is crucial in this pioneering NASA-led program.&rdquo;</p>\n\n<p dir=\"ltr\">ESM-4 will play a key role as the Artemis IV mission is due to deliver the International Habitation Module (Lunar I-Hab) of the Lunar Gateway space station. This state-of-the-art hardware is developed by Airbus Defence and Space and its subcontractors across Europe.</p>\n\n<p dir=\"ltr\">The ESM modules provide engines, power, thermal control&nbsp;and supply astronauts with water and oxygen. The ESM is installed underneath the crew module &mdash; together they form the <em>Orion</em> spacecraft. Thales Alenia Space Italia provides the&nbsp; thermal control system to keep the <em>Orion</em> crew modules between 18-24&deg;C by radiating excess heat out of the ship but also keeping the cold at bay.</p>\n\n<p dir=\"ltr\">The four solar arrays on <em>Orion</em> generate 11.2 kilowatts&nbsp;of electricity, enough to power two four-person households on Earth. Only about 10% of the power is needed for the ESM, with the remaining 90% going to the batteries and equipment in the crew module. The Artemis I mission showed the solar panels were able to produce a little more power than expected and this additional energy will be of use as the Artemis program&nbsp;evolves.</p>\n\n<p dir=\"ltr\">The energy stored in the batteries of the Crew Module is key as it ensures that the <em>Orion</em> spacecraft has power even when the Sun is obscured. The batteries also provide power for a safe return when the ESM separates from the crew module at the end of the mission. Moreover, to enable astronauts to concentrate on important tasks, the electronics onboard the ESM, controlled by the Crew Module, provide a very high level of autonomy, such as temperature regulation and solar wing rotation to track the Sun.</p>\n\n<p dir=\"ltr\">Orion has 33 engines onboard the ESM to provide thrust and maneuvering capabilities. The main engine, a repurposed Space Shuttle orbital maneuvering system engine (OMS-E) provided by NASA, generates 26.5 kilonewtons of thrust. This provides enough force to escape Earth&rsquo;s gravitational field and perform the translunar injection burn, and to get into the Moon&rsquo;s orbit. Eight auxiliary thrusters act as back-ups to the OMS-E and for orbital corrections. There are also 24 smaller engines for attitude control in space, enabling the spacecraft to rotate or change its angle during docking manoeuvres.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-ships-fourth-european-service-module-for-artemis-iv"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-ships-fourth-european-service-module-for-artemis-iv"
  },
  {
    "published": "Mon, 17 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      17,
      18,
      0,
      0,
      0,
      321,
      0
    ],
    "title": "Anemoi marks fourth VLOC rotor sail installation with NS United bulk carrier",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Anemoi marks fourth VLOC rotor sail installation with NS United bulk carrier"
    },
    "summary": "Five composite rotor sails now adorn the&nbsp;361-meter-long NSU Tubarao&nbsp;bulk carrier, which combined with NSU&rsquo;s digital approach, is considered to be amongst the most efficient retrofit project to date.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Five composite rotor sails now adorn the&nbsp;361-meter-long NSU Tubarao&nbsp;bulk carrier, which combined with NSU&rsquo;s digital approach, is considered to be amongst the most efficient retrofit project to date."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-anemoi-tubarao.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-anemoi-tubarao.jpg;maxWidth=720\" /> </a></div>\n\n<p>Anemoi&nbsp;rotor sails on NSU <em>Tubarao</em> at Zhoushan Xinya Shipyard. Source | Anemoi</p>\n</div>\n\n<p>Composite rotor sails developer&nbsp;<a href=\"https://anemoimarine.com/\" target=\"_blank\">Anemoi Marine Technologies Ltd.</a>&nbsp;(Anemoi, London, U.K.)&nbsp;has completed the retrofit of another large vessel after installing five 35-meter-tall units on the 400,000 DWT ore carrier NSU<em> Tubarao</em>.</p>\n\n<p>NSU <em>Tubarao&nbsp;</em>is a 361-meter-long, 65-meter-beam&nbsp;VLOC delivered&nbsp;in September 2020. With a deadweight tonnage of 399,717, it is amongst the largest bulk carriers in the world.&nbsp;The vessel, owned by bulk owner/operator <a href=\"https://www.nsuship.co.jp/en.html\" target=\"_blank\">NS United Kaiun Kaisha&nbsp;Ltd.</a> (NSU, Tokyo, Japan) and chartered by mining giant Vale International (Rio de Janeiro, Brazil), is expected to reduce fuel consumption by 6-12% annually using the wind-assisted propulsion system.</p>\n\n<p>This marks the fourth&nbsp;very large ore carrier (VLOC) vessel installation of Anemoi rotor&nbsp;sails on vessels chartered by Vale (read &ldquo;<a href=\"https://www.compositesworld.com/news/anemoi-rotor-sails-successfully-installed-on-taiwanese-bulk-carrier\">Anemoi rotor sails successfully installed on Taiwanese bulk carrier</a>&rdquo;). The completion of this installation means Anemoi has also surpassed 1.6 million DWT of vessel tonnage installed with its rotor sails.</p>\n\n<p>The rotor sail installation on the 5-year-old vessel, currently operating under a long-term charter to transport iron ore for Vale, was completed during scheduled drydocking in October 2025 in Zhoushan Xinya Shipyard Co. Ltd. in China. The rotor sails are deployed using a folding (tilting) mechanism for flexibility during cargo handling.</p>\n\n<p>NSU has taken a novel approach by combining Anemoi&rsquo;s rotor sails with advanced digital solutions that optimize power usage and vessel routing, enhancing fuel efficiency on NSU<em> Tubarao</em>&nbsp;while maximizing the use of wind energy. Manta&rsquo;s FuelOpt offers flexible power management of the main engine, including optimization of fuel saved by the rotor sails. Coupled with Napa&rsquo;s Voyage Optimization toolbox for voyage planning, these systems maximize the benefit of favorable&nbsp;winds without compromising departure or arrival times.</p>\n\n<p>During the scheduled survey, NSU <em>Tubarao</em> was also equipped with a new shaft generator designed to enhance the efficiency of the vessel. This upgrade not only improves the vessel&rsquo;s own energy performance but also optimizes fuel consumption when operating Anemoi&rsquo;s rotor sails. Anemoi successfully integrated its rotor sail technology with the vessel&rsquo;s shaft generator through advanced control system integration, ensuring seamless coordination between wind propulsion and onboard power supply.&nbsp;</p>\n\n<p>&ldquo;The scale of this project shows the market&rsquo;s growing confidence in wind power as a crucial enabler of lower-emission shipping,&rdquo; says Clare Urmston, CEO of Anemoi.&nbsp;&ldquo;Working with progressive partners like NSU, Vale and Class NK, we are able to advance rotor sail technology and show how optimizing propulsion integration and navigation for wind assistance can deliver even greater benefits.&rdquo;&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/anemoi-marks-fourth-vloc-rotor-sail-installation-with-ns-united-bulk-carrier"
      }
    ],
    "link": "https://www.compositesworld.com/news/anemoi-marks-fourth-vloc-rotor-sail-installation-with-ns-united-bulk-carrier"
  },
  {
    "published": "Mon, 17 Nov 2025 12:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      17,
      17,
      30,
      0,
      0,
      321,
      0
    ],
    "title": "Composites sustainability wins: EcoVadis recognition, ISCC Plus certification and transparency initiatives",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Composites sustainability wins: EcoVadis recognition, ISCC Plus certification and transparency initiatives"
    },
    "summary": "Composites One and Aerovac, Dow Chemical, Envalior and the Global Wind Energy Council are making strides in&nbsp;operations transparency, climate action and industry-wide standard development.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Composites One and Aerovac, Dow Chemical, Envalior and the Global Wind Energy Council are making strides in&nbsp;operations transparency, climate action and industry-wide standard development."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-sustainability-concept-gettyimages-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Green moss ball with sustainability icons.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-sustainability-concept-gettyimages-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Getty Images</p>\n</div>\n\n<p>Across the composites industry,&nbsp;companies continue to make&nbsp;measurable progress in aligning with global sustainability benchmarks and support their business partners&rsquo; efforts in doing the same.&nbsp;From taking EcoVadis assessments, to earning ISCC Plus certification, to strengthening industry sustainability and transparency, the following companies are ensuring sustainability remains a priority in their daily operations.</p>\n\n<p><em>Read &ldquo;<a href=\"https://www.compositesworld.com/news/composites-sustainability-wins-ecovadis-and-cdp-awards-water-stewardship-ghg-reduction\">Composites sustainability wins: EcoVadis and CDP awards, water stewardship, GHG reduction</a>.&rdquo;</em></p>\n\n<h2>EcoVadis&nbsp;awards</h2>\n\n<p>Founded in 2007,&nbsp;<a href=\"https://ecovadis.com/\" target=\"_blank\">EcoVadis</a>&nbsp;(Paris, France) assesses more than 130,000 companies across 180 countries and 220 industries, making it the largest and most trusted sustainability rating provider. It evaluates&nbsp;companies across four key themes: Environment, Labor &amp; Human Rights, Ethics&nbsp;and Sustainable Procurement.</p>\n\n<h3><strong>GLS Composites Distribution LLC earns Bronze Medal</strong></h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/composites-one\" target=\"_blank\">Composites One</a> (Shaumburg, Ill., U.S.) and <a href=\"https://www.aerovac.com/\" target=\"_blank\">Aerovac</a>&nbsp;have announced that parent company GLS Composites Distribution LLC has been awarded an EcoVadis Bronze Medal, placing the company among the top 35% of organizations worldwide for sustainability excellence. Many of the company&rsquo;s&nbsp;key customers and suppliers require EcoVadis scorecards to evaluate and benchmark their business partners&rsquo; sustainability efforts.</p>\n\n<p>This was only the company&rsquo;s&nbsp;second year participating in the EcoVadis assessment, and reflects the&nbsp;team&rsquo;s ongoing dedication to environmental stewardship, ethical practices and responsible sourcing.</p>\n\n<h3>Envalior sustainability management recognized with Gold Medal</h3>\n\n<p>Sustainable and high-performance engineering materials company <a href=\"https://www.envalior.com/\" target=\"_blank\">Envalior</a> (D&uuml;sseldorf, Germany) has made the&nbsp;successful completion of its first EcoVadis assessment, receiving a Gold Medal. The milestone comes not long after the publication of the company&rsquo;s first Sustainability Report and the launch of its Envalior CARES strategy.</p>\n\n<p>Companies with scores in the highest 5% of those assessed over the preceding 12 months receive the Gold Medal. Envalior reports that its&nbsp;EcoVadis score was in the top 3% of all companies assessed in its sector.</p>\n\n<p>&ldquo;Third-party sustainability assessments such as EcoVadis are an excellent way to provide greater clarity to our customers and value chain stakeholders on our sustainability management performance,&rdquo; notes&nbsp;G&uuml;nter Margraf, director of sustainability at Envalior.</p>\n\n<p>At Envalior, driving progress comes under the umbrella of the Envalior CARES strategy. This organization-wide sustainability framework is designed to improve transparency, accountability&nbsp;and performance across key environmental and social focus areas, built on the pillars of &ldquo;Low CArbon, Sustainable REsources&nbsp;and Social Responsibility.&rdquo;</p>\n\n<h2>ISCC Plus certification</h2>\n\n<p>International Sustainability and Carbon Certification (<a href=\"https://www.iscc-system.org/certification/iscc-certification-schemes/iscc-plus/\" target=\"_blank\">ISCC Plus</a>, Koeln, Germany) is&nbsp;a sustainability certification program for bio-based and circular (recycled) raw material feedstocks used in consumer goods, packaging&nbsp;and industrial chemicals. This wide range of materials also includes fuels and low-carbon technologies.</p>\n\n<h3><strong>Dow expands bio-circular product offering with ISCC Plus certification</strong></h3>\n\n<p><a href=\"https://www.compositesworld.com/suppliers/dow-chemical\" target=\"_blank\">Dow Chemical Co.</a> (Midland, Mich., U.S.) announced that&nbsp;isocyanates manufacturing facility in Freeport, Texas, has earned ISCC&nbsp;Plus certification. This certification reinforces Dow&rsquo;s ongoing commitment to advancing more sustainable production and product offerings to customers in the North America region with verified supply chain transparency.</p>\n\n<p>Dow&rsquo;s new certification makes all isocyanate products produced at the Freeport facility available with bio-based&nbsp;material from Dow&rsquo;s Ecolibrium portfolio through mass balance. This is made possible by using alternative feedstocks based on bio-circular materials at the beginning of its&nbsp;integrated manufacturing process. In turn, customers will see zero impact to product quality while achieving material with increased sustainability benefits and reduced carbon footprint.</p>\n\n<p>More sustainable products will be available in North America and certified by ISCC Plus&nbsp;through mass balance featuring Ecolibrium&nbsp;bio-circular material including:</p>\n\n<ul>\n\t<li>Papi&nbsp;580N REN&nbsp;Polymeric MDI for polyiso insulation boards and insulated metal panels</li>\n\t<li>Papi&nbsp;23 REN&nbsp;for furniture and mattress foams</li>\n\t<li>Specflex&nbsp;NES 1540 REN for automotive noise, vibration and harshness (NVH) solutions</li>\n\t<li>Isonate&nbsp;143L REN Modified MDI for coatings, adhesives, sealants and elastomer formulations.</li>\n</ul>\n\n<p>The recent Freeport MDI Complex certification provides Dow&nbsp;the opportunity to expand&nbsp;its offerings over time as other alternative feedstocks become available in&nbsp;North America.&nbsp;This offering in particular complements the company&rsquo;s&nbsp;polyol site certification achieved in 2024.</p>\n\n<h2><strong>SSI, GWEC to strengthen sustainability and transparency in renewables supply chains</strong></h2>\n\n<p>The <a href=\"https://gwec.net/\" target=\"_blank\">Global Wind Energy Council</a>&nbsp;(GWEC, Brussel, Belgium) and <a href=\"https://www.solarstewardshipinitiative.org/\" target=\"_blank\">Solar Stewardship Initiative</a> (SSI) have signed a memorandum of understanding (MOU) to drive sustainability, transparency&nbsp;and resilience across the solar and wind energy industries&rsquo; supply chains.</p>\n\n<p>As the world scales up the deployment of renewables to drive the energy transition and meet global climate goals, ensuring responsible sourcing and production of solar and wind components is critical. GWEC is actively working to establish a dedicated multi-stakeholder initiative for the wind sector called the Wind Sustainability Initiative (WSI), inspired by the SSI model, which will drive industry-wide ESG and traceability standards.</p>\n\n<p>This partnership will help align best practices, enable knowledge exchange and drive coordinated action to uphold these standards demonstrating each organization&rsquo;s&nbsp;collective commitment to responsible growth that supports project financing and enables developers and utilities to expand confidently, without facing future compliance or sanction risks.</p>\n\n<p>Under the terms of the agreement, the SSI and GWEC will work together to:</p>\n\n<ul>\n\t<li>Support GWEC in the development of Sustainability Standards for the wind sector, within the WSI framework.</li>\n\t<li>Promote harmonized standards for environmental, social&nbsp;and governance (ESG) practices and traceability across the solar and wind industries while recognizing sector-specific needs.</li>\n\t<li>Facilitate knowledge exchange by leveraging the SSI&rsquo;s established ESG and Traceability Standards to support the wind sector in the development of its own sustainability assurance framework.</li>\n\t<li>Strengthen multi-stakeholder governance by engaging key industry representatives, civil society organizations&nbsp;and financial institutions.</li>\n\t<li>Accelerate the adoption of responsible sourcing practices across global renewable energy supply chains.</li>\n</ul>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/composites-sustainability-wins-ecovadis-recognition-iscc-plus-certification-and-transparency-initiatives"
      }
    ],
    "link": "https://www.compositesworld.com/news/composites-sustainability-wins-ecovadis-recognition-iscc-plus-certification-and-transparency-initiatives"
  },
  {
    "published": "Mon, 17 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      17,
      17,
      0,
      0,
      0,
      321,
      0
    ],
    "title": "ILA Berlin 2026 focuses on competitiveness, technology and sovereignty",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "ILA Berlin 2026 focuses on competitiveness, technology and sovereignty"
    },
    "summary": "From June 10-14, ILA Berlin brings together international aerospace, defense and space industries, with several live stages and an extended Talent Hub.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "From June 10-14, ILA Berlin brings together international aerospace, defense and space industries, with several live stages and an extended Talent Hub."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-ilaberlin24-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Crowd at ILA Berlin 2024.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-ilaberlin24-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>ILA Berlin 2024. Source | Messe Berlin</p>\n</div>\n\n<p>From June 10-14, 2026, BER Airport will once again become the center of the international aerospace industry with the&nbsp;<a href=\"https://ila-berlin.de/en\" target=\"_blank\">ILA Berlin</a>&nbsp;trade show, bringing together&nbsp;players from industry, politics, research&nbsp;and the armed forces. Around 90%&nbsp;of the exhibition space has already been allocated, and <a href=\"https://ila-berlin.de/en/tickets\" target=\"_blank\">super early bird tickets</a> for trade visitors are now on sale in the ticket shop.</p>\n\n<p>As a political industry platform, ILA Berlin unites the entire aerospace ecosystem. On several live stages, international experts discuss key future industry issues &mdash;&nbsp;from technological innovation and digital transformation to geopolitics and security to new markets and business models.&nbsp;Of particular note is the Static and Flying Display, where the public can experience civil and military aircraft on the ground and in the air.</p>\n\n<p>In 2026, exhibitors will present their innovations in the halls, chalets&nbsp;and in outdoor areas.&nbsp;From low-emission flying and new propulsion systems to digital manufacturing processes, ILA Berlin 2026 will showcase the entire spectrum of aviation. Exhibitors &mdash;&nbsp;including Airbus, Boeing, Bombardier, the Federal Ministry of Transport (BMV), the Federal Ministry for Economic Affairs and Energy (BMWE), Clean Aviation, Dassault, Deutsche Aircraft, the German Aerospace Center (DLR), Diehl Aviation, Fraunhofer, GE Aerospace, Honeywell, Liebherr-Aerospace, Lufthansa Technik AG, MTU Aero Engines, Rolls-Royce, Saab, Safran, RTX&nbsp;and Vaeridion&nbsp;&mdash;&nbsp;will present latest developments and projects.</p>\n\n<p>At the <strong>ILA Stage Aviation</strong>, experts will discuss the industry&rsquo;s current challenges, such as the reduction of emissions and noise pollution, using sustainable fuels and hydrogen technologies, developing electric and hybrid drives&nbsp;and creating eVTOLs for urban mobility. They will also discuss additive manufacturing and lightweight construction, which significantly reduce fuel consumption and emissions.</p>\n\n<p>ILA Berlin&rsquo;s Space segment, highlighted through the Space Pavilion &mdash; organized by the BDLI together with its member companies, the European Space Agency (ESA)&nbsp;and the DLR&nbsp;&mdash; focuses on safety, sustainability&nbsp;and commercialization in space.&nbsp;At the <strong>ILA Stage&nbsp;Space </strong>in 2026, space industry players will present current missions and strategies,&nbsp;with a strong focus on economic competitiveness, security&nbsp;and defense, complemented by new players in the German and European space industry. Companies and organizations such as Airbus, ArianeGroup, CGI, DLR, Jena-Optronik, OHB, Astrofein&nbsp;and many more will demonstrate how space travel is transforming and enhancing our daily lives. During the event, ESA astronauts will discuss their experiences in space and on the International Space Station (ISS) with audiences of all ages.</p>\n\n<p>The event&rsquo;s Defense segment will focus on current and future technologies, projects&nbsp;and application fields including networked operations management, unmanned systems&nbsp;and AI-supported solutions. As a driver of innovation and a partner to industry, the German Armed Forces are the largest single exhibitor at the ILA. Exhibitors such as Airbus Defence and Space, Diehl Defence, Embraer, Elbit, Hensoldt, Leonardo, Lockheed Martin, MBDA, Rafael, Raytheon, Rheinmetall, Rohde &amp; Schwarz&nbsp;and Thales are also expected to attend.</p>\n\n<p>The <strong>Military Support Center (MSC)</strong> with its adjoining <strong>Defence Park</strong> on the outdoor grounds offers a high-caliber stage program and serves as an international meeting place for industry and the armed forces. The MSC also showcases the close cooperation between German industry and the German Armed Forces in the areas of logistics and capability development.</p>\n\n<p>During ILA Berlin 2026, the Supplier Hall offers additional access to the international supply industry. Buyers and trade visitors can reach business contacts from all over the world in just a few steps, initiate deals for tomorrow&nbsp;and find partners for new projects. B2B meeting appointments with exhibitors can be arranged in advance on the business platform.</p>\n\n<p>Moreover, the&nbsp;<strong>ILA Talent Hub</strong> continues to grow. With a new concept and additional partners, it is aimed at school pupils, students, young professionals&nbsp;and career changers. At ILA Berlin, the fascination of aerospace is brought to life. Interested parties can meet recruiters and obtain valuable information and insights from trainees and young professionals. For the first time, more interested parties than ever before can participate for free and get in direct contact with employers in the industry. This strengthens ILA&rsquo;s position as the premier talent and career platform for the aerospace industry.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/ila-berlin-2026-focuses-on-competitiveness-technology-and-sovereignty"
      }
    ],
    "link": "https://www.compositesworld.com/news/ila-berlin-2026-focuses-on-competitiveness-technology-and-sovereignty"
  },
  {
    "published": "Mon, 17 Nov 2025 10:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      17,
      15,
      0,
      0,
      0,
      321,
      0
    ],
    "title": "GMI Aero equipment supports Lufthansa Technical Training courses",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "GMI Aero equipment supports Lufthansa Technical Training courses"
    },
    "summary": "Equipment like the Anita 4.0 and Leslie machining toolkit are now being included in Lufthansa&rsquo;s aerospace-focused composites repair training courses.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Equipment like the Anita 4.0 and Leslie machining toolkit are now being included in Lufthansa&rsquo;s aerospace-focused composites repair training courses."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-lufthansa-gmiaero.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-lufthansa-gmiaero.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | Lufthansa Technical Training (LTT) video</p>\n</div>\n\n<p>Aviation maintenance and technical training provider&nbsp;<a href=\"https://www.ltt.aero/en\" target=\"_blank\">Lufthansa Technical Training</a> (LTT, Hamburg, Germany)&nbsp;and&nbsp;<a href=\"http://gmi-aero.com/fr\" target=\"_blank\">GMI Aero</a>&nbsp;(Paris, France), a composites repair equipment manufacturer,&nbsp;have been working together to apply innovative equipment and advanced methodologies within composite repair training for the aeronautical industry.</p>\n\n<p>To this end, LTT has recently introduced novel GMI Aero equipment in its composite repair training courses, as presented in LTT&rsquo;s newly released video:</p>\n\n<p>The&nbsp;<em>Anita 4.0 IoT two-zone bonding console</em>, featuring a large touch screen, 24 thermocouples, a remote terminal&nbsp;and ambient temperature/humidity sensors, together with WiFi/LAN connectivity and a suite of NetApps to support implementation, monitoring and reporting of composite repairs.</p>\n\n<p>The <em>Leslie machining toolkit</em>, enabling faster, safer, cleaner and more repeatable stepping and scarfing of composite structures. It offers a combination of&nbsp;accurately regulated cutting tool depth and custom-made templates, to be followed during machining operations.</p>\n\n<p>Thanks to those recent GMI&nbsp;Aero equipment additions, LTT&rsquo;s composite repair courses have become even more comprehensive, fully addressing composite repair challenges deriving from the introduction into service of all-composite aircraft, such as the Airbus A350 and Boeing B787.</p>\n\n<p>Learn more about LTT&rsquo;s training offering <a href=\"https://www.ltt.aero/en/basic-training\" target=\"_blank\">here</a>.</p>\n\n<div style=\"text-align: center;\"></div>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/gmi-aero-equipment-supports-lufthansa-technical-training-courses"
      }
    ],
    "link": "https://www.compositesworld.com/news/gmi-aero-equipment-supports-lufthansa-technical-training-courses"
  },
  {
    "published": "Fri, 14 Nov 2025 13:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      18,
      30,
      0,
      4,
      318,
      0
    ],
    "title": "Aria Composites Technologies subsidiary launches with focus on composites for transportation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Aria Composites Technologies subsidiary launches with focus on composites for transportation"
    },
    "summary": "Aria Group&rsquo;s more than 30 years of composites expertise builds the foundation of this standalone company and its first composite chassis program.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Aria Group&rsquo;s more than 30 years of composites expertise builds the foundation of this standalone company and its first composite chassis program."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ariagroup-exafuse.png\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-ariagroup-exafuse.png;maxWidth=720\" /> </a></div>\n\n<p>Composite chassis project using ExaFuse. Source | Aria Composite Technologies</p>\n</div>\n\n<p><a href=\"https://www.aria-group.com/\" target=\"_blank\">Aria Group Inc.</a> (Irvine, Calif., U.S.), a company with full-range design, engineering,&nbsp;prototype development and advanced manufacturing solutions for the transportation industry, announces the launch of its new subsidiary: <a href=\"https://www.aria-ct.com\" target=\"_blank\">Aria Composites Technologies</a> (ACT, Irvine, U.S.).</p>\n\n<p>ACT brings more than&nbsp;30 years of composite design, analysis, development and manufacturing expertise from Aria Group into a focused, standalone company dedicated to advancing composite technologies. The team&rsquo;s deep experience spans carbon fiber and traditional methods including prepreg, infusion, resin transfer molding (RTM) and ICS using a wide range of resin systems and reinforcements.</p>\n\n<p>This milestone coincides with the release of ACT&rsquo;s first composite chassis program, demonstrating Aria Group&rsquo;s proprietary ExaFuse process which combines&nbsp;ultra-low viscosity resins with dry fabric preforms, enabling precise shaping and assembly through highly automated, textile-based manufacturing. This approach delivers:</p>\n\n<ul>\n\t<li>Industrial-scale production</li>\n\t<li>Rapid takt times</li>\n\t<li>\n\t<p>Significant reductions in bill of materials (BOM), capital expenditure and per-part cost.</p>\n\t</li>\n</ul>\n\n<p>Engineered features are directly molded into the structure, eliminating secondary components. This streamlines production, lowers cost&nbsp;and boosts performance. Partnering with Meyers Manx (Irvine, Calif., U.S.), a company that has developed the reincarnation of the&nbsp;dune buggy, ACT demonstrated how the ExaFuse&nbsp;process enhances both the performance and profitability of the flagship Manx 2.0 electric vehicle (EV)&nbsp;chassis.</p>\n\n<p>To accelerate innovation and expand capabilities, ACT works closely with leading material suppliers, equipment manufacturers&nbsp;and research institutions. Key partners include Proxxima&nbsp;by ExxonMobil (Houston, Texas, U.S.). These collaborations ensure ACT remains at the forefront of composites innovation, delivering tailored solutions that meet demanding performance and production requirements.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/aria-composites-technologies-subsidiary-launches-with-focus-on-composites-for-transportation"
      }
    ],
    "link": "https://www.compositesworld.com/news/aria-composites-technologies-subsidiary-launches-with-focus-on-composites-for-transportation"
  },
  {
    "published": "Fri, 14 Nov 2025 13:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      18,
      30,
      0,
      4,
      318,
      0
    ],
    "title": "Twisted acquires carbon fiber specialist KS Composites",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Twisted acquires carbon fiber specialist KS Composites"
    },
    "summary": "The deal marks a major step forward in Twisted&rsquo;s long-term growth strategy, which is to strengthen its position in the premium automotive and marine sectors.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The deal marks a major step forward in Twisted&rsquo;s long-term growth strategy, which is to strengthen its position in the premium automotive and marine sectors."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-kscomposites.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Composites layup.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-kscomposites.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source | KS Composites</p>\n</div>\n\n<p><a href=\"https://twisted.co/\" target=\"_blank\">Twisted</a>&nbsp;(Thirsk, U.K.) &mdash;&nbsp;made up of Twisted Automotive and Twisted Marine &mdash; has acquired <a href=\"https://www.kscomposites.com/\" target=\"_blank\">KS Composites</a>&nbsp;(Melton Mowbray, U.K.), an&nbsp;engineering and advanced composites specialist.</p>\n\n<p>The acquisition brings world-class carbon fiber capability into the Twisted group, strengthening its engineering solutions, accelerating innovation&nbsp;and securing supply for the next generation of Twisted vehicles and marine products.</p>\n\n<p>It has been a significant 5 years for the Yorkshire company, best known for its classic Land Rover Defender restomods. Twisted has entered the premium marine sector, established a Special Projects division, expanded internationally&nbsp;and in 2025 launched the T-Bug &mdash; a modern recreation of the classic Baja Bug. The addition of KS Composites is the latest step in its&nbsp;phase of growth.</p>\n\n<p>KS Composites brings more than&nbsp;40 years of expertise as a&nbsp;manufacturer of advanced composite components. For its existing OEM and niche clients, continuity and support are assured. All 120 members of the workforce remain in post, ensuring stability, trusted relationships&nbsp;and the same uncompromising quality of service. The acquisition complements KS Composites&rsquo; existing markets and client base, allowing the business to continue operating independently while benefiting from the additional resources and strategic opportunities afforded by Twisted.</p>\n\n<p>Managing director Jamie Smith continues to lead KS Composites and has also joined the Twisted board of directors. &ldquo;As Twisted prepares for global growth, including increased activity in the U.S., it requires carbon fiber&nbsp;engineering expertise and production capability that provides a genuine competitive advantage,&rdquo; says Smith. &ldquo;KS Composites delivers that capability, and I am delighted to play a part in expanding what Twisted can design, build and deliver.&rdquo;</p>\n\n<p>Jake Cronk, Twisted&rsquo;s COO, notes that the company is strengthening its British engineering expertise while unlocking the next chapter as a global business.</p>\n\n<p>KS Composites is now part of the Twisted family. Alongside its existing operations, it will support Twisted&rsquo;s product development and manufacturing plans, contributing to new automotive builds, marine applications&nbsp;and future advanced engineering projects. Both companies have grown from humble beginnings into respected British engineering names, sharing a deep commitment to craftsmanship, innovation, quality&nbsp;and investing in talented people.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/twisted-acquires-carbon-fiber-specialist-ks-composites"
      }
    ],
    "link": "https://www.compositesworld.com/news/twisted-acquires-carbon-fiber-specialist-ks-composites"
  },
  {
    "published": "Fri, 14 Nov 2025 13:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      18,
      0,
      0,
      4,
      318,
      0
    ],
    "title": "Orbex makes part setup 900% faster for key composite parts ahead of inaugural rocket launch",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Orbex makes part setup 900% faster for key composite parts ahead of inaugural rocket launch"
    },
    "summary": "The introduction of MSP metrology products have ensured&nbsp;right-first-time machining for Orbex as it ramps up production of its carbon fiber Payload Avionic Module.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "The introduction of MSP metrology products have ensured&nbsp;right-first-time machining for Orbex as it ramps up production of its carbon fiber Payload Avionic Module."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Orbex-rocket-launch.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Orbex rocket on launch pad.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Orbex-rocket-launch.jpg;maxWidth=720\" /> </a></div>\n\n<p>Source (All Images) | MSP</p>\n</div>\n\n<p>Ahead of its inaugural rocket launch, orbital launch services company <a href=\"https://orbex.space/\" target=\"_blank\">Orbex</a> (Forres, Scotland and London, U.K.) has significantly boosted production for its carbon fiber&nbsp;Payload Avionic Module (PAM)&nbsp;using <a href=\"https://mspltd.com/\" target=\"_blank\">Metrology Software Products</a>&rsquo;&nbsp;(MSP, Northumberland, U.K.) PerfectPart&nbsp;CNC metrology solution to&nbsp;overcome challenges with part distortion and cut part setup time from 5 hours to 30 minutes, making the process 900% faster per part.&nbsp;</p>\n\n<p>The introduction of these solutions has also halved overall production time, simplified fixturing processes and given Orbex the confidence parts will be machined right-first-time. As the company looks to increase production, MSP has been critical in providing Orbex with a repeatable and scalable process which uses its existing equipment.&nbsp;</p>\n\n<p>Heavily restricted by traditional alignment methods, Orbex sought out a solution to ensure quick and accurate CNC machining of PAM.&nbsp;&ldquo;The PAM is a large, composite thin-walled part, and the layup is delicate in places,&rdquo; explains Gavin Belton, Orbex CNC operator specialist. &ldquo;The risk of distortion makes it difficult to know exactly where to machine.&rdquo;&nbsp;It was taking a minimum of 5 hours to align each part and the inability to account for distortion had caused windows and pockets to be machined to incorrect sizes, leading to issues in assembly and causing rework. &ldquo;The parts are worth tens of thousands of pounds and take around 6 weeks to produce so if we lose one it&rsquo;s time, money and material we can&rsquo;t get back,&rdquo; adds Belton.</p>\n\n<p>Due to the importance for right-first-time machining,&nbsp;MSP PerfectPart&nbsp;was deemed essential. In addition to providing Orbex with a solution for creating accurate alignments, the metrology suite would also ensure any errors &mdash;&nbsp;within probe setup and calibration and within the CNC machine &mdash; would be accounted for.&nbsp;</p>\n\n<p>The error removal routine starts with&nbsp;AutoClock&nbsp;and&nbsp;NC-Checker. Together, the products remove human error from the probe calibration process and NC-Checker then assesses the geometric performance of the CNC machine tool to confirm it is capable of machining a part to within tolerance.</p>\n\n<p>&ldquo;Immediately an issue was flagged in the C- and B-axis which could have caused holes on the outside diameter to have been misaligned,&rdquo; says Belton. &ldquo;The 30-minute check helped the machine tool vendor work out what the error was likely to be and rectify this before machining began.&rdquo;</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Orbex-mfg.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Orbex-mfg.jpg;maxWidth=720\" /> </a></div>\n\n<p>Orbex manufactures the carbon fiber&nbsp;structures for its launch vehicles using its CMS Ares machine.</p>\n</div>\n\n<p>To solve Orbex&rsquo;s part alignment challenges, MSP&rsquo;s NC-PartLocator product was&nbsp;introduced, well-suited to aligning complex, distorted or thin-walled parts. The software measures the part using five-axis probing and automatically generates a best fit alignment in six degrees of freedom. The software compensates for discrepancies between the physical part location and the nominal machining program, for example, when distortion has occurred. The updated alignment is automatically uploaded to the controller, no additional machining program edits necessary&nbsp;and any misalignment errors are automatically removed.</p>\n\n<p>&ldquo;When you press the Go button, you can see the alignment coming through and know you&rsquo;re going to get out exactly what you expect,&rdquo; Belton adds. &ldquo;And the speed with which everything is set up &mdash;&nbsp;it has&nbsp;made life easier.&rdquo;</p>\n\n<p>The results are evident of this. Orbex has cut its variable 5-hour part setup time to a stable 30 minutes, making setup 900% faster. In addition, overall production time has been halved from 2 days to 1 day.&nbsp;</p>\n\n<p>Orbex&rsquo;s fixturing routine has also been improved. Belton says,&nbsp;&ldquo;Rather than having to dowel everything down and constrain the part, we&rsquo;ve been able to produce a simpler fixture. We don&rsquo;t have to skim the fixture each time, we can use it as it is, and the MSP Best Fit alignment will come in and work out what it should be. The whole package is a no brainer. The risk reduction when machining such a high-value part cannot be understated.&rdquo;</p>\n\n<p>As Orbex&rsquo;s launch date looms, MSP PerfectPart&nbsp;will play a big part in the ramping up of production. &ldquo;We currently only have one CMS [Ares] machine, so because we&rsquo;ve essentially increased its capacity, it&rsquo;ll ease any bottlenecks,&rdquo; says Belton. &ldquo;When we do decide to buy more, the simplicity of the MSP package means we&rsquo;ll be able to drag and drop that process onto another machine so we can transition into production easily, keep quality high&nbsp;and hit the ground running.&rdquo;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/orbex-makes-part-setup-900-faster-for-key-composite-parts-ahead-of-inaugural-rocket-launch"
      }
    ],
    "link": "https://www.compositesworld.com/news/orbex-makes-part-setup-900-faster-for-key-composite-parts-ahead-of-inaugural-rocket-launch"
  },
  {
    "published": "Fri, 14 Nov 2025 12:00:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      17,
      0,
      0,
      4,
      318,
      0
    ],
    "title": "Airbus Helicopters France adopts Airborne composites automation",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Airbus Helicopters France adopts Airborne composites automation"
    },
    "summary": "Automated ply placement (APP) and Kit by Light (KBL) will be applied to ramp up&nbsp;productivity of the factory&rsquo;s composite helicopter blades and hub structures for Airbus helicopter models.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Automated ply placement (APP) and Kit by Light (KBL) will be applied to ramp up&nbsp;productivity of the factory&rsquo;s composite helicopter blades and hub structures for Airbus helicopter models."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airborne-airbus-app.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Automated ply placement.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-airborne-airbus-app.jpg;maxWidth=720\" /> </a></div>\n\n<p>Automated ply placement (APP). Source (All Images) | Airborne</p>\n</div>\n\n<p>At Airbus headquarters in Toulouse, France, and in the presence of King Willem-Alexander and Queen M&aacute;xima of the Netherlands, <a href=\"https://www.airbus.com/en/products-services/helicopters\" target=\"_blank\">Airbus Helicopters</a> has signed a letter of intent (LOI)&nbsp;to adopt <a href=\"https://www.compositesworld.com/suppliers/airborne\" target=\"_blank\">Airborne</a>&rsquo;s (The Hague, Netherlands) digital automation technologies for its&nbsp;factory in Le Bourget, France. The goal is to optimize manufacturing efficiency and output of composite rotor hubs and helicopter blades through implementation of both Airborne&rsquo;s main software and automation systems, automated ply placement (APP) and Kit&nbsp;by Light (KBL),&nbsp;respectively.</p>\n\n<p>The focus will be on new automation and software to boost productivity and efficiency.&nbsp;Airbus&rsquo;&nbsp;Le Bourget factory makes all composite helicopter blades and hub structures for all Airbus helicopter models, both military and civil. &ldquo;It's a high-mix production environment, ramping up to meet increasing demand, and Airborne&rsquo;s industrialization technologies are an excellent fit,&rdquo; says Marcus Kremers, CTO of Airborne.&nbsp;</p>\n\n<p>APP is already used by Airbus Commercial for the A350 program. It automates the layup process from cutter to laminate and can be used for prepreg and dry fiber, both of which are processed in Le Bourget (read &ldquo;<a href=\"https://www.compositesworld.com/articles/modular-robotic-cells-enable-high-rate-rtm-using-any-material-format\">Modular, robotic cells enable high-rate RTM using any material format</a>&rdquo;). In this project, new features regarding part size, layup and quality inspection are planned to be added.</p>\n\n<div class=\"centered g-img\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Airborne-Airbus-KBL-min.jpg\" target=\"_blank\"><!--[if IE 9]><video style='display: none;'><![endif]--> <source media=\"(min - width: 1000px)\" /> <source media=\"(min - width: 401px) and (max-width: 1000px)\" /> <source media=\"(max-width: 400px)\" /> <!--[if IE 9]></video><![endif]--> <img alt=\"Kit by Light (KBL) in action.\" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/CW/2025-CW/1125-cw-news-Airborne-Airbus-KBL-min.jpg;maxWidth=720\" /> </a></div>\n\n<p>Kit by Light (KBL).</p>\n</div>\n\n<p>KBL is already in use at Airbus Helicopters&rsquo;&nbsp;sister plant in Donauw&ouml;rth, Germany, where it supports operators in the cutting room with software that significantly accelerates kitting. Building on that experience, plans are to implement the system in the Le Bourget factory to reduce material waste and increase output.</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/airbus-helicopters-france-adopts-airborne-composites-automation"
      }
    ],
    "link": "https://www.compositesworld.com/news/airbus-helicopters-france-adopts-airborne-composites-automation"
  },
  {
    "published": "Fri, 14 Nov 2025 11:30:00 -0500",
    "published_parsed": [
      2025,
      11,
      14,
      16,
      30,
      0,
      4,
      318,
      0
    ],
    "title": "Exel Composites adopts bio-based UPR resin at commercial scale",
    "title_detail": {
      "type": "text/plain",
      "language": null,
      "base": "",
      "value": "Exel Composites adopts bio-based UPR resin at commercial scale"
    },
    "summary": "Purchase of Polynt&nbsp;bio-based resin delivers 20% cut in CO2 footprint for composites manufacturers,&nbsp;builds Exel&rsquo;s efforts to give customers more sustainable options.",
    "summary_detail": {
      "type": "text/html",
      "language": null,
      "base": "",
      "value": "Purchase of Polynt&nbsp;bio-based resin delivers 20% cut in CO2 footprint for composites manufacturers,&nbsp;builds Exel&rsquo;s efforts to give customers more sustainable options."
    },
    "content": [
      {
        "type": "text/html",
        "language": null,
        "base": "",
        "value": "<div class=\"article-figure fl-image fl-r font-weight-light g-img m-l-2 m-t-1 text-muted text-sm\">\n<div><a class=\"js-lightbox\" href=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-exel-ravenna-mfg-plant.jpg\" target=\"_blank\"><img alt=\"Ravenna manufacturing plant. \" src=\"https://d2n4wb9orp1vta.cloudfront.net/cms/brand/cw/2025-cw/1125-cw-news-exel-ravenna-mfg-plant.jpg;maxWidth=385\" /></a></div>\n\n<p>Ravenna manufacturing plant. Source | Exel Composites</p>\n</div>\n\n<p>Pultruded and pull-wound composites manufacturing company <a href=\"https://www.compositesworld.com/suppliers/exel-composites-plc\" target=\"_blank\">Exel Composites</a> (Vantaa, Finland) has&nbsp;entered into a new purchasing agreement with global resin specialist&nbsp;<a href=\"https://www.compositesworld.com/suppliers/polynt-composites\" target=\"_blank\">Polynt</a>&nbsp;<br />\n(Scanzorosciate, Italy) to purchase hundreds of tonnes of its bio-based unsaturated polyester resin (UPR). The collaboration represents another step in Exel Composites&rsquo;&nbsp;transition toward lower-carbon composites manufacturing, with the resin now available for European customers&nbsp;orders.</p>\n\n<p>With the introduction of a renewable monomer, the&nbsp;UPR resin, developed by Polynt, contains about 20%&nbsp;bio-based content. The Italian producer sources this monomer from second- and third-generation biomass &mdash;&nbsp;feedstocks that do not compete with food crops. This sustainable material offers a drop-in replacement for traditional fossil-based resins, ensuring full compatibility with Exel&rsquo;s existing pultrusion processes.</p>\n\n<p>Compared with conventional UPR, independent life cycle analyses (LCAs) show that the bio-based formulation delivers a 20% reduction in carbon footprint according to Ecoinvent v3.11. Polynt sources the monomer in Europe and produces most of the raw materials in its Italian plants. The resin is produced in Polynt&rsquo;s production facilities in Poland and France, and Exel plans to use it in its European plants. This ensures minimal transportation-related emissions throughout the entire supply chain.</p>\n\n<p>&ldquo;Our internal testing shows no measurable difference in performance between this bio-based resin and the fossil-based equivalent,&rdquo; says&nbsp;Kim Sj&ouml;dahl, SVP of technology and sustainability at Exel Composites. &ldquo;Mechanical properties, processing characteristics and durability are all identical. This means our customers can choose a more sustainable option without compromising quality or reliability.&rdquo;</p>\n\n<p>Exel and Polynt share a similar global footprint, with multiple production sites across the world. This regionalized structure enables both companies to supply customers locally, reducing delivery times and logistics-related emissions.</p>\n\n<p>&ldquo;This partnership builds on more than 30 years of collaboration between our companies,&rdquo; adds&nbsp;Lorenzo Grazia, EU technical service manager UPR/GC at Polynt Group. &ldquo;Polynt is committed to helping customers like Exel reduce their environmental impact through practical, scalable solutions. Introducing bio-based building blocks into high-volume resin systems is one of the most effective ways to move our industry toward lower emissions.&rdquo;</p>\n\n<p>Exel&rsquo;s customers will have the choice of adopting this resin as part of their product specification.&nbsp;</p>"
      }
    ],
    "links": [
      {
        "rel": "alternate",
        "type": "text/html",
        "href": "https://www.compositesworld.com/news/exel-composites-adopts-bio-based-upr-resin-at-commercial-scale-"
      }
    ],
    "link": "https://www.compositesworld.com/news/exel-composites-adopts-bio-based-upr-resin-at-commercial-scale-"
  }
]